[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
                    "name": "Apple Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213569/grandmas-iron-skillet-apple-pie/",
        "name": "Grandma's Iron Skillet Apple Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4573341.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2020-06-19T03:41:44.000Z",
        "description": "This three-layer apple pie is a Southern favorite!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 apple pie",
        "recipeIngredient": [
            "½ cup butter",
            "1 cup brown sugar",
            "5 Granny Smith apples -- peeled, cored, quartered, and thinly sliced",
            "3 (9 inch) refrigerated prerolled pie crusts",
            "1 cup white sugar, divided",
            "2 teaspoons ground cinnamon, divided",
            "¼ cup white sugar",
            "1 tablespoon butter, cut into small chunks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 1/2 cup butter into a heavy cast iron skillet, and melt butter in the oven. Remove skillet and sprinkle with brown sugar; return to oven to heat while you prepare the apples.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove skillet, and place 1 refrigerated pie crust on top of the brown sugar. Top the pie crust with half the sliced apples. Sprinkle apples with 1/2 cup of sugar and 1 teaspoon of cinnamon; place a second pie crust over the apples; top the second crust with the remaining apples, and sprinkle with 1/2 cup sugar and 1 teaspoon cinnamon. Top with the third crust; sprinkle the top crust with 1/4 cup sugar, and dot with 1 tablespoon of butter. Cut 4 slits into the top crust for steam.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the apples are tender and the crust is golden brown, about 45 minutes. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Apple Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "T L Dixon"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.860236220472441,
            "ratingCount": 508,
            "itemReviewed": "Grandma's Iron Skillet Apple Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "734.3 calories",
            "carbohydrateContent": "107.8 g",
            "cholesterolContent": "49.1 mg",
            "fatContent": "33.7 g",
            "fiberContent": "1.9 g",
            "proteinContent": "3.4 g",
            "saturatedFatContent": "17.1 g",
            "servingSize": null,
            "sodiumContent": "396.4 mg",
            "sugarContent": "69.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-04-05T18:36:10.577Z",
                "reviewBody": "This is such an outstanding recipe, thanks so much to the cook who shared it. Over the past 45 years I have probably made hundreds of apple pies but this one is just a treat! I made it as written. The process and the iron Skillet is the key to the finished product being so good. I like cooking with Iron cookware so I was delighted to find this recipe.  You may want to adjust the amount of white sugar you put on the apples between the layers. I cut it in half because I just know how we like things. It is super sweet no matter how much you put between the layers because of the butter and brown sugar on the bottom. Just adjust to your own families taste but do make it. It is a wonderful pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Grandma Lizzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2537790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-28T18:23:04.863Z",
                "reviewBody": "For the life of me I cant understand why someone would rate a recipe and go on to say they havent made it yet. That defeats the entire purpose of the system. However, I DID actually make this apple pie exactly as written and it was fabulous! I wouldnt change a thing. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "neo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429918/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-15T19:29:18.587Z",
                "reviewBody": "OMG...didn't think this would be good since there is no flour to thicken but it's totally awesome.  Might spray the skillet with nonstick spray before melting butter.  bottom crust sticks really bad unless you serve it hot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2978075/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-03T20:02:08.13Z",
                "reviewBody": "Awesome pie!  I took it to a construction day out at my cousin's place and the guys just gobbled it up!  I cut the sugar back (3/4 c. brown sugar on the bottom, and a scant 1/2 c. for the filling).  I also tossed my filling together rather than just sprinkling the sugar on top.  In the filling I added 2 T. flour and a sprinkle of nutmeg.  I was unable to serve this right away since I was taking out to the guys, so my pan was one sticky caked-on rock-hard mess!  To clean the cast iron, fill 3/4 with water, add a couple of squirts of DISHWASHER soap (not dish soap), and boil on the stove for 10-20 min.  Turn off and let sit overnight.  The gunk will slide right off the pan in the morning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peas with Honey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/peaswithhoney/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-12T20:31:40.36Z",
                "reviewBody": "Super Easy to make and the taste is just Heaven.  I have a really good Apple Pie recipe and I really did not want to try this because my other recipe is so good I did not feel the need to change it.  Curiousty got the best of me after reading all the reviews and I figured why not?!?!  Well needless to say my son claims this apple pie is 10 times better than my usual apple pie...I did not even think it was possible to top my old recipe.  My husband was speechless after he tried it and later admitted it was the best pie he had ever tasted.  I finally gave in and tasted it myself and only one word can describe this....WOW!!!!  I will definetly be making this again.  Thanks for posting.  Word to the wise.  DON'T CHANGE A THING!  It's PERFECT as is :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonib",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2906376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T17:34:57.957Z",
                "reviewBody": "I had problems with this recipe.  For starters, the bottom crust on mine welded itself to the bottom of the cast iron (all of my cast iron is seasoned VERY well!).  Also, the middle layer of crust did not cook all the way through and turned out mushy.  Lastly, this recipe could have used more apples easily.  In all fairness, I will say that the flavor of the apple filling was incredible!  To those considering this recipe, I would make the following changes just based upon my experience:  when melting the butter and topping with the brown sugar, do this cooktop and not in the oven.  When you lay down the bottom crust, push down well.   Otherwise, just omit the brown sugar.  Lastly, I would prepare the filling with the seasonings and refrigerate overnight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DodgerFanRedding",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4313794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-27T21:15:38.77Z",
                "reviewBody": "I have made this twice since finding it a month ago!! To it makes it easier…  mix the sugar spice(they make an “apple pie” spice that is excellent)and add ½ cup flour. Coat the apple slices in this before starting to layer your pie.  The first time I made this I used the recommended amount of spice and brown sugar, the second time I cut the brown sugar in half and doubled the spice, it was much better not syrupy, which my family prefers. I also doubled the recipe using 4 crusts and turned this into a cobbler, of course you have to double the baking time as well! EASY and is the best apple pie ever! Thanks TL Dixon, I love it! I took photos if you want to see the process on my facebook page.   http://www.facebook.com/KatrinaRadia?v=photos&sb=4#!/photo.php?pid=30715263&id=1120429019",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katrina Kintzinger Thomas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4318344/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-13T04:51:04.817Z",
                "reviewBody": "I used this recipe more as a guide. I did, for the first time, use a cast iron skillet. I put a stuck of butter in it and let it melt in the oven. Then added a cup of brown sugar and continue to let it sit in the oven no longer than 15 mins. \nI made my own butter crust and after putting the first crust over the butter and brown sugar, I poked it with a fork and put it back into the oven for 10 mins. I then added the apples that I gently mixed with sugar and cinnamon. I left out the center crust and topped it off with my own butter crust. Cut some slits, dotted with butter and sprinkled with sugar. After about 50-55 mins in the oven it was golden beautiful and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12636558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-22T11:52:51.693Z",
                "reviewBody": "2017 edit: This is still my go-to apple pie! It's demanded every Thanksgiving. I actually didn't bring it one year and there were some bummed relatives. Oops. Currently I use the double pie crust from King Arthur as that's my go-to baking site and I triple the recipe to make two pies. The French Pastry Pie Crust I mentioned and have used many times is very tasty but difficult to roll out. Original 2011 review: Oh wow this was amazing...best apple pie I have ever had! But how could it not be with melted butter and brown sugar at the bottom! Also since no one says it anywhere but I guess it's obvious use a 9 inch skillet. I think I used almost six apples too. Make sure you REALLY fill it as apples cook down quite a bit. I used the French Pastry Pie Crust from this site for the crust (that is the BEST crust!!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARTOONRCKR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874206/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Grandma's Iron Skillet Apple Pie",
            "description": "Three layers of apple pie goodness in cast iron!",
            "uploadDate": "2017-09-08T17:38:31.450Z",
            "duration": "PT48S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb8ca282c-6141-49d5-b08b-d3248b433ff3%2F5d38352c-06e0-4c84-b8cb-7c61eb452787%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5569399015001"
        }
    }
]