[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213673/moist-passover-apple-cake/",
        "name": "Moist Passover Apple Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9117022.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:41:47.000Z",
        "description": "Unbelievably moist cake. Most Passover desserts are very dry but this cake is incredibly moist.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 9-inch cake",
        "recipeIngredient": [
            "2 tablespoons vegetable shortening, room temperature",
            "3 eggs, separated",
            "½ cup vegetable oil",
            "¼ cup orange juice",
            "1 cup white sugar",
            "1 cup matzo cake meal",
            "½ teaspoon salt",
            "¾ cup white sugar",
            "½ teaspoon ground cinnamon",
            "4 Granny Smith apples - peeled, cored, and quartered"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish with vegetable shortening.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg whites in a metal, glass, or ceramic bowl with an electric mixer until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the egg yolks, oil, and orange juice into a mixing bowl; beat with an electric mixer until creamy and thick, about 5 minutes. Stir in 1 cup of sugar, mixing well, then lightly stir in the matzo cake meal and salt. Use a rubber spatula or wire whisk to fold about 1/3 of the beaten egg whites into the matzo meal mixture. Gently run the spatula through the center of the mixture, then around the sides of the bowl, repeating until fully incorporated. Add the remaining egg whites, folding until just incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together 3/4 cup of sugar with cinnamon in a bowl. Spread half the batter into the prepared baking pan; distribute the apple quarters evenly over the batter. Sprinkle the apple pieces with about 1/2 cup of the sugar-cinnamon mixture, spread the remaining batter over the apples; sprinkle the remaining sugar-cinnamon mixture over the top of the cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cake is golden brown, about 45 minutes. Cut into squares while still warm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rhonda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.444444444444445,
            "ratingCount": 9,
            "itemReviewed": "Moist Passover Apple Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "370.7 calories",
            "carbohydrateContent": "54.9 g",
            "cholesterolContent": "62 mg",
            "fatContent": "16.7 g",
            "fiberContent": "1.6 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "153.5 mg",
            "sugarContent": "46.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-31T18:48:03.94Z",
                "reviewBody": "This is a very good dessert. I did as most others and made 1.5 times the dough and used 3- 4 very large apples. I baked it in an 8x8 disposable pan for 50 minutes. I actually made 3 of these to give away but couldn't get enough matzah cake meal so ended up grinding matzah meal in the blender until it was very fine. The cakes came out absolutely beautiful and tasted great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Patrice Cyril",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1468122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-18T16:49:16.277Z",
                "reviewBody": "This cake was very good. It actually may have been too gooey from the apples inside which is why next time I make this cake I will definitely use 2-3 apples and 1.5 times the batter. I didn't want to stick such big chunks of apples in the middle of my cake so I sliced them about 1/4 inch thick. Instead of sprinkling all of the cinn. sugar on top of them I laid down a layer and then sprinkled some and then laid down another layer of apples and then more cinn. sugar on top of that (dividing the 1/2 cup of the mixture btwn the 2 layers). I will also use less than what remained of the mixture on top of my cake as I felt it was too much and didn't brown but rather came out of the oven as a pile of dry sand on top of my cake (although you can easily wipe some off). I also made this the day before my sedar and I cut it into squares while warm as directed but very much regret doing so. It looks crumbly and not nice and I would rather have re-warmed it right before serving and put it on the table as whole cake for presentation purposes (and then cut it into squares). Since I did already cut it into squares I will put the pieces in pretty cupcake holders and serve them on a tray to make them look nicer. All in all great flavor but I recommend less apples more batter and thinner sliced apples layered with the cinn. sugar mixture...This recipe is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lalal512",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6913520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-20T13:31:24.933Z",
                "reviewBody": "Great recipe! I made 1.5 times the batter and added 1 tsp. vanilla to it. For the apples I cut them in smaller pieces. I also did not use 3/4 cup of sugar on them just about a tablespoon. Finally I sprinkled extra cinnamon in between layers and on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2844533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-11T00:47:31.043Z",
                "reviewBody": "This recipe is incredible. I've made it for 3 seders already and it is even rabbi-approved.:) I used 3 apples and 3/4 of the egg white mixture otherwise it gets too fluffy. I also sliced the apples much thinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "melsbells",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11865145/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-05T04:41:33.097Z",
                "reviewBody": "A friend made this and brought it to a seder. It was the hit of all the desserts! Incredi8bly moist light sweet and delicious! I want to try making it myself. So she said to come here to get the recipe and so I did! Thanks.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MaryAnne Biele",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15607434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-03-28T07:25:23.803Z",
                "reviewBody": "So I changed this quite a bit from an apple cake to a tiered Passover cake with apple butter filling. Increased the recipe servings to 15 to get an even number of eggs and then instead of all that vegetable oil, used apple sauce. Probably used maybe quarter cup oil and the rest just apple sauce. Came out super moist! Divided into two cake pans and baked for 35 minutes since it was thick. Then once cooled, put apple butter between the layers. Dusted confectioners sugar on top. Something to keep in mind: while most cake batter is rather liquid, this one was very thick. At first it made me concerned but I just added a bit more orange juice and left it on the thicker side. Overall, great Passover cake! Definitely a winner!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janna Rapoport",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27593748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-03-29T17:23:44.057Z",
                "reviewBody": "The batter was very thick and difficult  to work with. I  cut the apples into thinner slices and only 2 apples went into the cake. Good thing too as the batter would not have covered the huge apple slices called for.  Tried to use at least one of the other apples, since they were already peeled, by placing some apples on top. The sugar cinnamon topping remained raw, had to brush if off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolyn Cass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25375533/"
                }
            }
        ]
    }
]