[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213832/grandma-mcandrews-irish-soda-bread/",
        "name": "Grandma McAndrews' Irish Soda Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2155666.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2020-06-19T03:41:52.000Z",
        "description": "This is not the dark bread you see in every restaurant in Dublin or Galway these days but I promise, it's authentic Irish Soda Bread, exactly how my late Irish grandma made it. Serve warm or cold with butter. This freezes great. I've made several loaves before St. Patrick's Day, or family parties. I freeze them, take them out the morning they're needed and warm up in a hot oven for 5 -7 minutes before serving.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "1 round loaf",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "¼ cup white sugar",
            "1 teaspoon baking soda",
            "2 teaspoons baking powder",
            "1 teaspoon salt",
            "2 eggs",
            "1 ¼ cups buttermilk",
            "¼ cup corn oil",
            "1 cup raisins"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet, or line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, sugar, baking soda, baking powder, and salt. In another bowl, whisk together eggs, buttermilk, and corn oil. Make a well in the center of the flour mixture, and pour in the buttermilk mixture. Add the raisins, and stir a few times, just until the ingredients come together into a soft dough. Turn the dough out onto a floured surface, and with floured hands shape dough into a ball. Place the dough on the prepared baking sheet, and cut a large cross in the top with a sharp knife.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bread on a middle rack of the preheated oven, and bake until golden brown, 30 to 40 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sheila T"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7368421052631575,
            "ratingCount": 95,
            "itemReviewed": "Grandma McAndrews' Irish Soda Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "272 calories",
            "carbohydrateContent": "48.3 g",
            "cholesterolContent": "32 mg",
            "fatContent": "6.1 g",
            "fiberContent": "1.6 g",
            "proteinContent": "6.6 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "420.7 mg",
            "sugarContent": "13.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-18T23:01:40.45Z",
                "reviewBody": "Hubs doesn't like quick breads of any kind, Mom and I were unsure of the raisins. Didn't look like this bread was going to make any kind of statement at tonight's St. Patrick's Day meal. I had low expectations, frankly.   Wrong! Everyone loved it!  (me too!) Other than using vegetable oil rather than corn oil, I prepared it as directed, then dusted the loaf with a little flour before it went it into the oven.   I find it incredible that something so impressive both in appearance and taste comes together so easily and quickly and with such humble ingredients. It's really a foolproof recipe.  I baked it on parchment paper, and in my oven at least, 35 minutes was just right. It's just a beautiful bread that is moist (because of the buttermilk I have no doubt!), tender and flavorful.  Don't be tempted to leave out the raisins as I almost did  - they really do add something in a positive way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-19T15:44:28.793Z",
                "reviewBody": "Grandma McAndrew sure had it right - I just had a slice of this soda bread and its absolutely perfect!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4698228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-18T22:31:35.42Z",
                "reviewBody": "I used softened butter instead of the oil and plumped the raisins in a sauce pan with butter before adding them to the flour mixture.  I did this \"before adding the liquid mix\".  I find mixing the raisins in the dry ingredients easier than in the dough.  I needed to add 10 minutes to the time to complete cooking, but the bread came out very well.  It went well with the Corned Beef and Potatoes for St. Patrick's Day evening meal.  Have Fun!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hal Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6717593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-19T16:17:25.647Z",
                "reviewBody": "I have never made Irish Soda Bread before but this recipe is definitely not going to wait for the next St Patrick's Day! It's an excellent recipe! I didn't have any buttermilk so I made my own by adding a couple of tablespoons of lemon juice to the milk and letting it sit for 5 mins. before using it. Thanks for posting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3349192/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-24T22:55:08.913Z",
                "reviewBody": "This is easy to make and tastes good--my first time making Irish soda bread. I chose this recipe because it fits my idea of authentic Irish soda bread including raisins & buttermilk but not sour cream. I rate it a 4 (rather than 5) only because it's the first soda bread recipe I've tried so I don't have a lot to which I can compare it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jenicrob",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4506267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-16T21:47:33.493Z",
                "reviewBody": "Although I didn't have raisins, I stuck to the recipe exactly (well, substituting veggie oil instead of corn oil) and it came out AMAZING! I combined the wet and dry ingredients as directed, gooshing them together by hand until it made a nice, sticky ball that I slapped into a lightly oiled, square little glass pan. I baked it at 350 degrees for about 45 minutes and it was perfect! Hot, steaming, moist and delightfully sweet...I almost reminded me of the taste of sweet cornbread. I made it with some Irish Lamb Stew from this site, and it was too good for words. Nothing less than perfection. I can't thank you enough for this awesome recipe!! :D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TendoQueen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3194950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-14T18:03:29.947Z",
                "reviewBody": "Oh My Gosh this Irish Soda Bread recipe is one of the best I've tasted! And so easy to boot! Thank you Grandma McAndrew and to Sheila for having the patience to figure it out! I made mine without raisins (my family is raisin-phobic) so I increased the sugar by a quarter cup to make up for the missing sweetness. Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amboyle7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5407852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-21T18:54:21.077Z",
                "reviewBody": "Excellent recipe. I made this quickly on St. Patrick's Day with a houseful of guests when I discovered that the soda bread I had bought at the store had caraway seeds in it. (I've found a lot of recipes that call for it but just not my thing.) This recipe was a huge hit! I needed to cook it for about 10 minutes longer than it calls for because the middle was still soft but once it was done it was amazing. I'm making another loaf as I type this!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6760755/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-03-18T05:02:26.193Z",
                "reviewBody": "Delicious!!!  I just made 2 loaves after making a quick to disappear loaf a few weeks ago.  My husband called it the giant scone!  I love the simplicity, taste and tenderness of the bread.  I have made other loaves of soda bread which I love but this is the most straight forward.  Just finished a warm piece with a bowl of spicy chili-sounds odd but, really, a perfect match!!  Update:  I wanted to add that I made some last night to give in holiday gift bags.  I divided the dough to make 2 smaller loaves...perfect size for gifts.  The dough is very sticky and I just kind of mounded it  and use a butter knife to kind of smooth it a bit.  They baked up very well at 30 minutes, nice and golden.  Awesome bread and great for toasting. Another update.  This is my go to Irish bread and I have made it many times with great success,  Today I substituted 1 cup of the AP flour with 1 cup of Bobs whole wheat flour-yum!  Next ti,e I will go half and half and see how that is!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3338545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-29T22:04:22.593Z",
                "reviewBody": "Good recipe but hubby gives it only three stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "HAUSER49",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/428560/"
                }
            }
        ]
    }
]