[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214091/flan-mexicano-mexican-flan/",
        "name": "Flan Mexicano (Mexican Flan)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4485442.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-06-19T03:42:00.000Z",
        "description": "This recipe was given to me by my mother-in-law, who is from Durango, Mexico. I had to beg her for years to give this recipe to me. Finally, she gave it to me for Christmas. I added orange zest, but the original recipe calls for just pure vanilla. You can use almond extract as well.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT6H5M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup white sugar",
            "1 cup whole milk",
            "1 (14 ounce) can sweetened condensed milk",
            "3 eggs",
            "3 egg yolks",
            "¼ cup freshly squeezed orange juice",
            "1 tablespoon grated orange peel",
            "1 tablespoon vanilla extract",
            "1 tablespoon cornstarch",
            "1 cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place sugar in a heavy saucepan over medium-high heat, and cook, stirring constantly, until the sugar melts and turns a golden amber color, about 10 minutes. Watch carefully once syrup begins to change color, because it burns easily. Carefully pour the melted sugar syrup into a flan mold. Let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour whole milk, sweetened condensed milk, eggs, egg yolks, orange juice, orange peel, vanilla extract, and cornstarch into a blender, and blend for a minute or so, until the mixture is smooth. Pour in the cream, and pulse several times to incorporate the cream. Pour the mixture over the cooled caramel syrup in the flan mold.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a roasting pan with a damp kitchen towel.  Place the flan mold on the towel, inside roasting pan, and place roasting pan on oven rack.  Fill roasting pan with boiling water to reach halfway up the sides of the baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the center of the flan is set but still slightly jiggly when moved, 45 minutes to 1 hour. Let the flan cool, then refrigerate for at least 4 hours. To serve, run a sharp paring knife around the inside of the mold to release the flan. Invert a plate on the mold, flip the mold over, and gently remove the mold to unmold the flan and reveal the syrupy caramel topping.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Amy Shurts"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.76,
            "ratingCount": 175,
            "itemReviewed": "Flan Mexicano (Mexican Flan)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "434.2 calories",
            "carbohydrateContent": "56.3 g",
            "cholesterolContent": "207 mg",
            "fatContent": "19.8 g",
            "fiberContent": "0.1 g",
            "proteinContent": "8.9 g",
            "saturatedFatContent": "11.3 g",
            "servingSize": null,
            "sodiumContent": "115.3 mg",
            "sugarContent": "54.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-23T16:15:00.93Z",
                "reviewBody": "To me the density and consistency of this flan was perfect.  I've since modified it to use only 2/3c. sugar for the caramel since not all the caramel liquified in baking using the full cup.  I also use whole evaporated milk and leave out the cornstarch.  If I'm choosing not to use the orange juice, I sub in milk.  This has become my husband's most requested dessert.  Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelsey K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3083130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-21T04:40:30.36Z",
                "reviewBody": "Several folks have had trouble getting all the sugar to caramelize - an easy fix is to use Baker's Sugar... it's a superfine granulated sugar (not powdered sugar) that is made for just such an application.  C&H makes it; I don't know if it's available all over the country, but look for it in the sugar section of the supermarket.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "azdon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8681183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-17T17:05:45.32Z",
                "reviewBody": "I made this today and it turned out perfectly! Instead of one flan pan I used a decorative muffin pan that has six muffins and this made individual flans. (I had a bit leftover and out it in a small pie pan.) I omitted the orange juice and orange peel (don't care for orange flavor) and also omitted the whole milk and instead used 1 whole can of evaporated milk. Everything else I followed exactly as the recipe stated and the taste is amazing! It was a huge hit for my family, also. My husband said it is better than the flan in the local Mexican restaurant. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2458486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-31T20:30:45.19Z",
                "reviewBody": "I swapped a few things, but will stick to my new recipe from now on: subbed whole milk for evaporated milk and reduced it to 3/4 C, then omitted all orange stuff, and added 1/2 C coconut milk. Also toasted my own coconut and put it on the syrup before putting flan in dish. Followed same blending instructions, and it is SOO creamy and delicious with a touch of coconut flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SherBear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3674427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-11T03:32:21.783Z",
                "reviewBody": "This was my first attempt at Flan, it was also my first time eating flan. Whenever I have seen it at a restaurant I was never tempted to try it. But the other day my son was asking about flan and if it  was good or not so I figured the best way to find out was to make it. I had to make this 2x. The first time I tried to make these in mini spring-form pans. Really bad idea they leaked all into the water bath and just made a big yucky mess. So I tried it again the next day. I used 6 6oz ramekins and baked for 40 minutes. This was fun to make. And surprisingly easy. I expected it to be more complicated. The texture was silky and smooth. Lovely flavor with just a hint of orange to it. Really fantastic and now I know that Flan is fabulous. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-06T00:57:11.14Z",
                "reviewBody": "I had tried the Spanish Flan on this site, and while I thought that was lovely, it was NOTHING compared to the texture of this one! I omitted the orange stuff and left it traditional vanilla way. Instead of the whole milk, cornstarch, and heavy cream, I just used a can of evaporated milk. Obviously, it is the 3 eggs and two egg yolks that makes this one have a divine texture! I definitely recommend it, even the simple way with just a can of evaporated milk, one can of condensed milk, vanilla, and the eggs blended and cooked just as directed here! Excellent! This is my flan recipe from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "invierno_eterno",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4428416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-12T23:03:08.667Z",
                "reviewBody": "This was a phenomenal recipe!  It was easy to fix and it came out looking picture perfect.  It is important to allow the time (4 hours) for it to sit, though.  My husband wasn't sure he liked the orange flavor, but I loved it and all the people at the dinner we served it at raved about it...they are still raving!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "777irish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4868420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-07T21:49:17.003Z",
                "reviewBody": "For those having trouble with the sugar/carmel, What you can do instead is use the pan that your going to pour the mixture in make your carmel in the oven at 350 degrees for about 30 to 35 minutes.  This works great and it's easy.  No stirring just when it starts to liquify get on the oven gloves and roll it around and it works amazing.  It's ready to go as soon as it cools in your flan or baking dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kevin Greene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3520339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-13T21:34:34.53Z",
                "reviewBody": "Wow!  Thanks Tigerlily402!  This was delicious!  The orange flavor was pretty distinct and we enjoyed it.  But next time, we might just try it plain.  I followed the recipe as best I could: I did not have a flan mold, so I used a deep-dish pie pan.  And I didn't have a roasting pan, so I improvised with a deep skillet.  Not ideal, but it worked!  Mmm...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2041465/"
                }
            }
        ]
    }
]