[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214121/turkey-lasagna-with-butternut-squash-zucchini-and-spinach/",
        "name": "Turkey Lasagna with Butternut Squash, Zucchini, and Spinach",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6833777.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2020-06-19T03:42:02.000Z",
        "description": "I was craving lasagna, but not all the calories it usually comes with. After researching several recipes for inspiration, I ended up cooking up this delicious creation. I hope you enjoy it, too!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "1 onion, diced",
            "4 cloves garlic, chopped",
            "1 (20 ounce) package ground turkey",
            "1 (28 ounce) can crushed tomatoes",
            "3 (6 ounce) cans tomato paste",
            "1 ½ cups water",
            "1 ½ teaspoons dried basil",
            "1 teaspoon fennel seeds",
            "1 teaspoon Italian seasoning",
            "¼ teaspoon ground black pepper",
            "¼ cup chopped fresh parsley",
            "3 ½ cups peeled and cubed butternut squash",
            "1 (10 ounce) package fresh spinach",
            "1 (15 ounce) container fat-free ricotta cheese",
            "1 egg",
            "2 tablespoons chopped fresh parsley",
            "¼ teaspoon ground black pepper",
            "1 (6 ounce) package shredded part-skim mozzarella cheese, divided",
            "9 no-boil lasagna noodles",
            "2 zucchini, sliced lengthwise"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a large skillet over medium heat; cook the onion and garlic in the hot oil until fragrant, 5 to 7 minutes. Break the turkey into small pieces into the skillet; cook and stir until completely browned, 7 to 10 minutes. Stir the crushed tomatoes, tomato paste, water, basil, fennel seeds, Italian seasoning, 1/4 teaspoon black pepper, and 1/4 cup parsley into the turkey mixture. Reduce heat to medium-low and simmer, stirring occasionally, until the sauce reaches a desired consistency, 60 to 90 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the sauce simmers, place the butternut squash in a large, microwave-safe bowl; cover with plastic wrap and cook in microwave on High until tender, about 5 minutes. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook and stir the spinach in a large skillet over medium heat until wilted, about 5 minutes. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the ricotta cheese, egg, 2 tablespoons parsley, 1/4 teaspoon black pepper, and about 2/3 of the mozzarella cheese together in a bowl. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1 1/2 cups of the sauce into the bottom of a 9x13-inch baking dish. Arrange 3 of the lasagna noodles in a layer over the sauce. Spread 1 cup of the ricotta cheese mixture over the noodles. Sprinkle about half of the butternut squash over the ricotta cheese mixture. Layer about half the wilted spinach over the butternut squash. Lay about half the zucchini slices over the spinach in a layer. Repeat the layering. Top with the 3 remaining lasagna noodles. Spread any remaining ricotta cheese mixture over the top of the lasagna. Finish by topping with any remaining sauce mixture. Cover with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 30 minutes. Remove the aluminum foil and sprinkle the remaining mozzarella over the top of the lasagna. Return to oven and bake uncovered until the top is golden brown, about 30 minutes more. Remove and allow the lasagna to rest 15 minutes before cutting to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "carren1105"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.559322033898305,
            "ratingCount": 59,
            "itemReviewed": "Turkey Lasagna with Butternut Squash, Zucchini, and Spinach",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "476.9 calories",
            "carbohydrateContent": "56.9 g",
            "cholesterolContent": "97.5 mg",
            "fatContent": "14.3 g",
            "fiberContent": "8.6 g",
            "proteinContent": "34.7 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "906.5 mg",
            "sugarContent": "13.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-01T16:09:50.277Z",
                "reviewBody": "I have never made lasagna before so I was worried about how this would turn out. To my amazement it not only turned out delicious but it actually looked good too! I followed the recipe exactly. I don't have lasagna experience so I'm sure other reviewers will have different ways of making this but I can't think of any changes that should be made. Also I recommend taking the time to make your own sauce rather than using a jar. The sauce was wonderful and really made the dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adrienne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1503009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T17:32:11.853Z",
                "reviewBody": "Made this for Thanksgiving and it was great though needed a little more seasoning than the recipe called for especially salt and pepper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BRG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4745280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T22:43:33.45Z",
                "reviewBody": "I mistakingly bought a butternut squash instead of a spaghetti squash so I came here looking for a way to use it. Came across this recipe and absolutely loved it! I am a full time working mom with two young kids so I did the speedy version. I did not make my own sauce I used Newman's Own Sockaroni sauce. I microwaved the butternut squash whole and then peeled and sliced it into thin slices once it cooled. Next time I will buy frozen spinach and thaw it to speed things up even more. Also I did not use all of the cheese mixture the lasagna was plenty big without using all of it and I figured it would cut down on the calories as well. Still turned out wonderfully and I love that this is a much healthier version of traditional lasagna. Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HealthyMe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3115584/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-15T16:20:52.763Z",
                "reviewBody": "LOVED LOVED LOVED all this garden goodness! The sauce turned out a little thick for me but this may have been because I used fresh tomatoes; I will just add more water next time. I crushed the butternut squash and this helped it to not be so chunky. I loved the sweetness of the squash but my hubby and kids did not so I would probably leave it out next time. Otherwise it was wonderful wholesome and delicious! It is lots of layers so make sure you have a deep dish to cook this one! Thanks for a great keeper!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2bake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4645499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-02T11:20:08.867Z",
                "reviewBody": "This a really good lasagna- And the first time I made one myself! I would omit the zucchini next time. Many said this was somewhat bland or needed more seasoning so I seasoned to taste. The sauce I used a few more cloves of garlic increased the spices (added marjoram thyme chili flakes bay leaf & rosemary) used ground pork (worked well enough since it's a white meat- I would drain off the fat a little more next time though) and since the recipe called for 7.5 cups of liquid total I divided it as such: 1 can diced spicy tomatoes (with onions & seasoning) 1 cup tomato gravy (made with fresh tomatoes & bacon grease- had leftover from another recipe/meal) 1 cup spicy tomato sauce 2 cups tomato paste & 2 cups water beef bouillon cube. I forgot to mention that along with the meat portion I had added the remains of a pack of cremini mushrooms. I only cooked it for roughly 45 minutes as the sauce had reached a consistency that I liked. I opted to boil my butternut squash after peeling and dicing for roughly half an hour then mashed with a little butter and seasoned with sage salt garlic powder & pepper. Instead of simply wilted the spinach we opted to crisp them a bit and used 2 bags of fresh spinach. Opted for low-fat cottage cheese instead if ricotta and used low-fat mozzarella. Baked as directed but you need deeper than a 9x13 and there will be leftover sauce (little bit). I seasoned the mixture with S&P. We served it with \"Herb Spread for French Bread\" from AR.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-24T18:12:51.147Z",
                "reviewBody": "My family couldn't get enough. I made my own ricotta but other than that I made it exactly as listed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jerilyn Hassell Pool",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4219122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-09T02:33:57.487Z",
                "reviewBody": "I wish I had added salt. And it definitely needed bigger than a 9x13. It was already at the top of the pan when I had only done 2 layers. So I flipped it over into a 10x15.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "lisaxmarie19",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3168909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T20:46:33.753Z",
                "reviewBody": "It was delicious! I added mushrooms on my recipe and just used regular lasagna.I only added 1/2 a cup of water and it was fine.I just tossed all the veggies with the sauce and it works.Thin slices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Naning",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6288827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-21T16:10:16.913Z",
                "reviewBody": "This was great and took a lot of work but could be even better pretty easily. I used bottled sauce. I cooked onions and garlic in a little evoo then added the turkey drained a little added the sauce. Then made the ricotta layer and sliced the veggies. Also used frozen spinach well drained. And I used whole milk ricotta which made it better. Next time I'd use a peeler to get thin slices of zucchini and season each layer (add s&P and maybe something else). I also mashed the squash which worked nicely. I used regular lasagna noodles and didn't add any water. It was pretty dry but I like it that way. Will be making this again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FOODIE19",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677976/"
                }
            }
        ]
    }
]