[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/230/world-cuisine/latin-american/caribbean/",
                    "name": "Caribbean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214465/coconut-lime-cheesecake-with-mango-coulis/",
        "name": "Coconut-Lime Cheesecake with Mango Coulis",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F397436.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:42:24.000Z",
        "description": "This tropical-inspired cheesecake features a ginger-coconut crust and two divine layers topped off with a fresh mango coulis. I like to make a coconut cream by adding coconut extract to whipped cream for topping the cheesecake. Top with a dollop of whipped cream and a sprinkle of toasted coconut, for even more flavor.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT9H30M",
        "recipeYield": "1 9-inch cheesecake",
        "recipeIngredient": [
            "¾ cup sweetened flaked coconut",
            "¾ cup crushed gingersnap cookies",
            "3 tablespoons melted butter",
            "2 (8 ounce) packages cream cheese, softened",
            "1 (10 ounce) can sweetened condensed milk",
            "2 eggs",
            "1 tablespoon lime zest",
            "2 tablespoons lime juice",
            "1 tablespoon coconut extract",
            "2 cups cubed fresh mango",
            "1 teaspoon white sugar, or more to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 9-inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the coconut, gingersnap cookies, and melted butter in a bowl; mix until evenly moistened. Press the cookie mixture into the bottom and slightly up the sides of the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the crust in the preheated oven until browned and set, about 10 minutes. Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce oven heat to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the softened cream cheese in mixer bowl until smooth. With beater set to medium-low, slowly pour the condensed milk into the bowl, mixing only until just blended, stopping to scrape the sides of the bowl as necessary. Add the eggs, individually, allowing the first to blend into the mixture before adding the second; again, scrape the sides of the bowl as necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour about half of the cream cheese batter into a separate bowl. Stir the lime juice and lime zest into the portion in the new bowl; pour the batter over the crust in the springform pan, smoothing into an even layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the coconut extract through the remaining cream cheese batter; pour over the lime-flavored batter in the springfom pan, smoothing into an even layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the top of the cheesecake springs back when gently pressed, about 45 minutes. Turn oven heat off, but leave cheesecake inside with oven door slightly ajar until the oven cools completely. Refrigerate until completely chilled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare mango coulis by pureeing the mango with sugar until smooth. If too thick, add a teaspoon of water at a time, using just enough to make pourable. Drizzle over cheesecake when plated.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Caribbean"
        ],
        "recipeCuisine": [
            "Latin American",
            "Caribbean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Alberta Rose"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.423076923076923,
            "ratingCount": 104,
            "itemReviewed": "Coconut-Lime Cheesecake with Mango Coulis",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "468.1 calories",
            "carbohydrateContent": "38.4 g",
            "cholesterolContent": "131.4 mg",
            "fatContent": "31.6 g",
            "fiberContent": "1.6 g",
            "proteinContent": "9.4 g",
            "saturatedFatContent": "19.6 g",
            "servingSize": null,
            "sodiumContent": "310.6 mg",
            "sugarContent": "31.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-16T16:49:11.993Z",
                "reviewBody": "OMG CC this is ADP! (Absolute Dessert Perfection) And, I must admit I was a bit skeptical since this is the first time I've made a cheesecake without a water bath. But even without that there were no cracks at all! I am a skeptic no more. Now onto the crust - I didn't use gingersnap cookies as I'm not a fan of them and I had some leftover \"Guyanese Lime Cookies\" from this site. I crushed those up and next time I might put the coconut in the food processor or leave it out altogether. The crust is wonderful. The cheesecake itself is fabulous! It's divine and having two layers is GENIOUS! The flavors compliment each other vs. compete with each other. Some people thought it was thin or there wasn't enough filling - well if you have experience making cheesecakes you can tell by the ingredients that this isn't a NY style cheesecake that would contain at least (4) 8 oz. blocks of cream cheese. Double it if you must, but I do think that will take away from this dessert.  The mango coulis is delish and I wish I had made this while mango was in season as I had to add a bit more sugar to get the desired sweetness. I did follow CC's suggestion and topped this with some toasted cococut, lime zest, and some coconut flavored whipped cream (8 oz. heavy whipping cream, 2 Tbsp. white sugar, 1 1/4 tsp. coconut extract) which put an already incredible dessert over the top to ADP! Thanks CC for a great recipe! (As I write this review I'm actually enjoying a slice....)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-02T16:27:37.07Z",
                "reviewBody": "I needed a show stopper dessert for a BBQ over the Memorial Day weekend and this was just the one. I loved how this came together and was one of the easiest cheesecakes I've ever made. I confess I didn't have the gingersnaps and didn't feel like making a trip to the store, so I used cinnamon graham crackers that I had on hand and added 1 tsp of ground ginger to the crumbs for that ginger taste that was such a nice compliment to the other flavors. In the coconut layer of the cheesecake, I also added 1/4 C of coconut to carry that flavor through. This is the first cheesecake I've ever made that I didn't do in a water bath. I followed the baking instructions exactly and it came out perfect. No cracks and very little settling. A wonderful dessert that just screams summer and one I'll make several more times before the summer ends for sure. Thanks CC, really, really delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-11T16:50:15.687Z",
                "reviewBody": "Fantastic!  I made this for a small dinner party and everyone loved it!  Very refresing and tropical.  You can taste each flavor, but not one overpowers the other.  I only have a 10\" spring form pan, but it still came out fine.  I used my food processor to crush the ginger snaps.  I've found that the finer the crumb, the better the crust sticks together.  For the coulis, I doubled the sugar and added about 5 tsp. water so that I could drizzle it (I just put it in a plastic baggie, snipped the corner off, then squeezed out decoratively).  Topped it off with homeade whipped cream and toasted coconut.  My guests thought they were dining at a five-star restaurant.  Well done, CC!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T20:49:50.197Z",
                "reviewBody": "WOW the crust for this cheesecake is ingenious!  I think that the coconut lime flavor is so great on its own that you dont actually need the mango coulis- but if you like a saucy cheesecake than its an excellent way to go. super easy too!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mandy Guerino",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2896974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-06T18:16:53.443Z",
                "reviewBody": "This was really good! I like the mango puree over the cheesecake. I did change the crust only because we done like gingersnaps. I used vanilla wafers instead, I followed the rest of the recipe as stated. Thanks for sharing!! Everyone loved it :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherbear1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sher_bear1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-02T15:11:16.477Z",
                "reviewBody": "I've found that I can use simple soup crackers (saltines or the like) to make the crust- much cheaper than buying gingersnaps! And it works just fine; just replace cookie crumbs with cracker crumbs adding a tablespoon or so of sugar. For a \"ginger\" crust just add some ginger (and other spices if preferred). Another thing to do: You can buy frozen mango cubes at some grocery stores. Very handy. And I think I'll try using some coconut cream concentrate (a product from Tropical Traditions) instead of the coconut flavoring. No I'm not in sales for the company! I just love the product. It's concentrated coconut milk concentrated flavor but doesn't have the additives (and artificial ingredients?) that many flavorings have.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer_Cote",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4867384/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T17:29:44.597Z",
                "reviewBody": "This is absolutely delicious! We loved it. Each flavor stands on it's own, none of which are overpowering. The combination of flavors, the smooth texture, the sweet/tart mix, everthing is perfect. Husband said \"It tastes like summer!\" This dessert would be perfect for very special occassions, a BBQ, Sunday dinner, anytime. We will definately make this again. Thank you for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T17:24:49.1Z",
                "reviewBody": "One word for this Cheesecake.... FANTASTIC!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AVI1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-11T19:01:10.78Z",
                "reviewBody": "Awesome!  It was so easy!  I almost always tweek recipes, but not this one!  Not too sweet, not too rich... a wonderful, smooth result that was actually done when the recipe said!  FYI, I could only find 14 oz. cans of condensed milk, but it converted to 10 dry oz.  You want 396 grams.  Thanks for posting this... it's going in the family book!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curious Baking Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4853167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-05T19:07:59.437Z",
                "reviewBody": "I was very disappointed in this crust. The ginger flavor was overpowering and the texture was chewy. I was embarassed serving this at a friend's house especially because the silence said it all. I think using half gingersnap cookies and half graham crackers would help the flavor. And because the moist/sticky coconut flakes seemed to overtake the texture of everything by creating a chewiness it would have been better to use unsweetened coconut (its a fine grated type that is dry) and added a tablespoon of sugar. There also seemed to be too much butter...I'd try using just 2 tablepsoons. I wish this had worked out better for me as I was very interested in making a different type of crust. I will try testing it out again with the above changes but make sure I do so before serving it to friends.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2121870/"
                }
            }
        ]
    }
]