[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214554/soft-n-fluffy-hamburger-buns/",
        "name": "Soft-N-Fluffy Hamburger Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1098755.jpg",
            "width": 5002,
            "height": 3335
        },
        "datePublished": "2020-06-19T03:42:29.000Z",
        "description": "Soft and light with a moist crumb.  Simple and perfect every time.  You can vary the size to accommodate larger burgers or make little sliders - make hot dog buns too!  I worked on this recipe until I got it perfect! I hope you enjoy it too!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H45M",
        "recipeYield": "12 buns",
        "recipeIngredient": [
            "1 cup warm water",
            "2 tablespoons canola oil",
            "3 cups bread flour",
            "1 tablespoon white sugar",
            "¾ teaspoon salt",
            "1 teaspoon vital wheat gluten",
            "2 ¼ teaspoons active dry yeast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the water, canola oil, flour, sugar, salt, vital wheat gluten, and yeast into the pan of a bread machine in the order recommended by the manufacturer, select the Dough cycle, and turn on the machine. Line baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the cycle is finished, remove the dough to a lightly oiled work surface, and knead for 2 to 3 minutes. Cut the dough into 12 equal-size pieces, and roll the dough into balls by cupping your hand, with open fingers, over each piece of dough. Roll gently, with just a little pressure, to form a dough ball with a silky surface. Place the dough balls onto the parchment-lined baking sheets, and flatten each dough ball gently into a bun. Cover with a cloth and let rise until doubled, 30 to 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the rolls in the preheated oven until the tops are golden brown, about 12 minutes. Let cool on racks before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "What's for dinner, mom?"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.467153284671533,
            "ratingCount": 137,
            "itemReviewed": "Soft-N-Fluffy Hamburger Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "151.4 calories",
            "carbohydrateContent": "26.2 g",
            "cholesterolContent": null,
            "fatContent": "2.9 g",
            "fiberContent": "1 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "147 mg",
            "sugarContent": "1.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-21T17:17:17.45Z",
                "reviewBody": "I have made these twice - the first time following the recipe exactly as written and directed and the second time making a few changes.  If you're looking for a very soft hamburger bun, closer to the kind you get at the store, these are good but as was reviewed by others, it will have a tough time holding together something juicy - as did mine the first time I baked and used for burgers.  They would make a great bun for a sandwich and the especially the kids would love this recipe as it's alot like store buns - which is one reason I didn't rate higher above average.  The reason I bake is because I don't want store bought taste, but if you like that, then these buns are great.  These would make an excellent dinner roll too.  The other reason for the average rating is the ingredient Vital Wheat Gluten.  This ingredient is not at all necessary in this recipe and is mainly used to lighten texture in whole grains or heavy wheat breads, so I left it out the second time around.  Instead, I added a beaten egg white (use a wire wisk, beat until foamy). It added a great texture.  I also used butter instead of the oil and slightly warmed milk instead of the water.  Made the buns richer in flavor.  Also, I used instant yeast and didn't have to pre activate the yeast, I just tossed it all in my kitchen aid, gave it a rise, shape and rise.. then baked at 400 degrees for 12 minutes in order to achieve better color.  BTW, using instant yeast gives a much nicer rise.  Posted a couple pics.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LemonLush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bellesaz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-27T18:54:35.38Z",
                "reviewBody": "Editor's Note:  The sugar ingredient in this recipe was edited and now correctly reads 1 tablespoon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the allrecipes staff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-17T21:27:07.59Z",
                "reviewBody": "Wonderful!!! I made these yesterday to serve hamburgers on. I did not need twelve of them so I made a half recipe. I only got 4 out of it. While making the half recipe in the bread machine the dough sucked the paddle of the bottom, so I took the dough and and let it finish rising. I thought the dough seemed a little stiff. So I got scared and started another batch. I decided to try a full recipe but had to use mostly wheat flour.( I did add more gluten) The full recipe made about 7 rolls. I think you would only get 12 if you made dinner rolls/sliders. The funny thing is that both attempts came out fantastic!!! I thought I was going to have to freeze some... but nope.My 4 yr old ate 2 yesterday. I also made a sandwich for lunch yesterday with one and plan on doing that again today.I will be making these again and soon because they are almost gone!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tanya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2387144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-16T17:18:55.42Z",
                "reviewBody": "Sorry the crumb on these buns was not substantial and they fell apart under a juicy burger with toppings. Might be ok for a slider or a hot dog but not if you want a burger with all the fixings. The juiciness kind of melted the bun.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefSuzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4909298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T16:13:34.777Z",
                "reviewBody": "I have never used wheat gluten with white flour before this made for a very light texture. I used 2 1/2 cups of flour and made 8 hamburger size buns. But they were too sweet to eat with burgers. I will toast them with plain cinnamon or use them to make bread pudding.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "recipes need gluten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3990518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-20T16:31:10.287Z",
                "reviewBody": "I made these using my stand mixer by proofing the yeast in the warm water with just 1 tbs. of sugar then adding the oil. I added the flour (1/2 AP 1/2 WW) mixed with the vital wheat gluten and salt 1 cup at a time and used about 3 1/4 cups to get a lovely soft dough. I got 10 nice size rolls. This is a keeper thanks WFDM!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-27T20:22:23.303Z",
                "reviewBody": "These Buns are the best. I make them year round, but LOTS in the summer. I make them into hotdog buns and for burgers. Why buy at the store what you can make so much better Thanks to What's for dinner, Mom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Toni Jo Fire Eating Pro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5387816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-21T17:50:13.217Z",
                "reviewBody": "Great recipe the only change I would make is to cut down the amount of sugar. Rolls had a sweet taste which I don't really want on my hamburger.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Welch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3089825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-11T18:40:21.243Z",
                "reviewBody": "I have now made these buns 3 or 4 times and have to say that they are the best buns ever.  I don't understand the comments that these will not stand up to a hamburger.  Every time that I have made them I used them for hamburgers and they were perfectly fine.  They did not fall/break apart and held up until the last bite.  I should say though that when I make them I do not use the Vital Wheat Gluten.  I have always made them using white AP or Bread flour so do not find the VWG necessary.  Would certainly use it if replacing part of the white flour with whole wheat.  Thanks WFDM for posting this recipe, it will remain my go to recipe for burger buns.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pelicangal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pelicangal/"
                }
            }
        ]
    }
]