[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/838/desserts/cookies/brownies/",
                    "name": "Brownie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/78528/golden-yam-brownies/",
        "name": "Golden Yam Brownies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1059053.jpg",
            "width": 1477,
            "height": 960
        },
        "datePublished": "2020-06-19T03:11:39.000Z",
        "description": "Better have several copies of this recipe on hand when you serve them!  These moist, flavorful, delicious brownies are simply out of this world, possibly heaven.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "1 cup butter",
            "1 cup packed brown sugar",
            "1 cup white sugar",
            "4 eggs",
            "2 teaspoons vanilla extract",
            "1 ½ cups all-purpose flour",
            "1 teaspoon baking powder",
            "½ teaspoon salt",
            "2 cups peeled and finely shredded yam",
            "1 cup confectioners' sugar",
            "2 tablespoons butter or margarine",
            "2 tablespoons milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking powder, and salt; stir into the batter just until blended. Fold in the shredded yam. Spread the batter evenly in the greased baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 minutes in the preheated oven, until a toothpick inserted into the center, comes out clean. Mix together the confectioners' sugar, butter and milk until smooth. Spread over the brownies while they are still warm. They will absorb some of the glaze. Serve hot or warm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Brownie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "STARFLOWER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.540160642570281,
            "ratingCount": 498,
            "itemReviewed": "Golden Yam Brownies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "220.6 calories",
            "carbohydrateContent": "32.2 g",
            "cholesterolContent": "54 mg",
            "fatContent": "9.6 g",
            "fiberContent": "0.7 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "5.8 g",
            "servingSize": null,
            "sodiumContent": "140.8 mg",
            "sugarContent": "22.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-23T22:41:21.157Z",
                "reviewBody": "Wonderful recipe and although hardly a health food a yummy way to get beta carotine and antioxidants into your family. I've made twice now once exactly as written and once with some additions. They are extremely sweet as written and I've found that reducing both the white and brown sugars to 3/4 cup each produces a still appropriately sweet (but not cloyingly so) bar. The second time I made these I added 1-1/2 tsp cinnamon and 1 tsp ginger plus 1 cup of raisins. That made them over-the-moon delicious and they were inhaled in record time. Don't get me wrong - without the spices and raisins their flavor is simple and uncomplicated but some may interpret this as bland. Both times I shredded the peeled sweet potatoes using the shredding disc on my Cuisinart and it was plenty fine enough. The shreds of sweet potato melded into the brownie and were not discernible. Moist and appealing with a sunny orange-gold color they are also excellent keepers if you can manage to hide a couple for later on. They may be frozen and thaw beautifully with no discernible difference between frozen and fresh provided you wrap carefully airtight and don't freeze for too long (say around 3 months max.) Thank you for a real gem!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-27T02:54:04.73Z",
                "reviewBody": "THIS IS AMAZING! God so good. The yams don't need to be cooked. Just peel them and grate them on the smallest holes on your cheese grater! It takes less than 2 minutes and it's healthy and natural. I 1/2ed the recipe and baked this in a muffin tin for 12 individual cakes. I completely omitted the white sugar as I decided they were probably sweet enough! I was right and the glaze is just delicious. I'd hate to have to leave that out. I used non-hydrogenated margerine instead of butter and I used all purpose wheat free flour. I also used just 1 egg and 1 egg white instead of two eggs. I added 1/2 a teaspoon of cinnamon. All in all they came out SUPER moist (they key is getting a fresh and firm yam because they are full of water). They are so tasty especially with the cinnamon. The grated yam melts away into the texture of the cake much like grated carrot in carrot cake. I implore people to make these and NOT use canned yams!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cherry Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2011766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-24T03:47:03.72Z",
                "reviewBody": "WOW!! Just... wow. These were super awesome. I had my doubts when I was measuring insane amounts of sugar and saw the weird brown and orange batter but these are something special. I wasn't sure if the recipe writer meant yams or sweet potatoes which are not the same but I used sweet potatoes knowing that what most of us from the US call \"yams\" are really sweet potatoes. That was fine. I didn't cook the potatoes before hand I just peeled and shredded them like the recipe says. I'm not really sure why everyone is cooking them you really don't need to. And I certainly don't know why you would used canned which have so many preservatives and tons of sugar and salt. They cook plenty in the oven with the batter there is no need to use pre-cooked. I think next time I will double the frosting though. I really liked the way the frosting complimented the brownies. I think more would be excellent. However I let the brownies cool before putting on the frosting in order to preserve the sort of crusty top that brownies get. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2551346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-24T15:00:27.687Z",
                "reviewBody": "This was an incredibly easy and yummy recipe. Instead of going through the hassle of cooking peeling and shredding yams I just used 1 medium sized drained can of \"Bruce's Yams\" which I smashed. I think these actually add more flavor and made the recipe very moist. This probably saved me 30 minutes of work!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinginFL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2181101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-24T22:34:57.387Z",
                "reviewBody": "This was amazing! Being me.. I used 2 eggs verses 4 and canned yams drained verses 'fresh'. This made the brownies hold together in a super moist way. I was afraid 4 eggs would be too brownie like. Excellent decision! The only thing I will do differently the next time I make this is to double the batch. My MIL said \"This was better then any chocolate brownie I have ever tasted.\" I have to agree!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tibia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2175044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-16T20:10:53.793Z",
                "reviewBody": "This smelled wonderful while cooking. I was looking for a way to get some Vitamin A and beta carotene as well as potassium in my 4 kiddos and yams/sweet potatoes seemed like they could do the trick. I started with 3 smallish fresh \"yams\". Scrubbed them clean poked them on each side with a fork a few times & placed them on a couple of paper towels in the microwave. I then nuked them for 3 1/2 minutes turned them over then nuked them all for another 3 1/2 minutes. Let them cool a bit before removing the skin (came off easily) and throwing them in my food processor to get them all nice and creamy. (It was so thick I needed to use 2 of the 4 eggs in the processor to help make it liquidy enough to process.) Followed the rest of the recipe exactly. Perhaps by using fresh yams and using 2 eggs to puree or whip them smooth is what made me need 10 additional minutes on my cooking time. I have to say- all of us from age 4 to my hubby LOVE these and they are delicious! I did not do the last step and add even more sugar and butter and milk on the top when it was warm. They were absolutely sweet enough and moist enough w/o adding even more sugar and saturated fat so I do not regret leaving it off. This recipe is a keeper for us but we renamed it. Brownies are drier and crumbly. These are moist and awesome!! Plus I can not help but think of chocolate from the word \"brownie\". So thank you thank you for giving us the recipe for the \"Golden Yam Cake\".:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEDDY66",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/798257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-01T15:47:34.2Z",
                "reviewBody": "Excellent recipe I read most reviews before baking as they are always helpful. I made the following changes and they turned out great instead of 1 cup butter I used 3/4 c and a 1/4 c more yams which I mashed. I used 1/2 c Splenda and 1/2c white sugar 1 1/4 c white flour and 1/4 wheat bran. I also added a 1/4tsp of cinnamon and a little extra vanilla;) they would be great with raisins and maybe a little more bran to soak up some of the moisture. I also had to bake them an additional 10 minutes on top of the 30 minutes and I didn't bother icing them they were great without the extra calories. Next time I would add a little more bran and start my cooking time at 40 minutes. I baked my own yams and mashed them they came out perfect from the microwave as others had suggested. Oh I also only put 3 large eggs in instead of 4. Not sure how they would be if I had left the recipe as it was written but everyone that tried them thought they were fabulous the way I made them. Thank you Starflower for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUPPERLINDA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1249594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-21T23:27:20.913Z",
                "reviewBody": "I read alot of the reviews before making this and I made alot of changes. Usually I try to make the recipe as it calls for so I can give it an accurate rating but it needed some changes. I used 1 stick of butter 1/2c brown sugar 1/2c white sugar( I think anything more would have been too much) I cut it down to 2 eggs but used egg replacer I added a little over 1 tsp ground cinnamon (which I am glad I did because it gave it a great flavor) and 3c shredded sweet potato. I did not glaze them. They came out really yummy and had a hard time stopping myself from eating the whole pan at once. My 2 year old loved it too she has had one everyday for 3 days now. I will definitely make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "momofthreekids",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3425889/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-24T16:16:14.297Z",
                "reviewBody": "WHEN I ASKE MY BOYFRIEND WHAT DID HE WANT FOR THANKSGIVING ONE OF HIS REQUESTS WAS YAMS. SINCE I NEVER MADE YAMS BEFORE I DECIDED TO CHECK OUT \"MY ALL RECIPES\". WHEN I NOTICED THIS RECIPE WAS RATED 5 STARS I KNEW I HAD TO TRY IT. NEEDLESS TO STAY THAT I FOLLOWED THE RECIPE EXACTLY WHAT IT CALLED FOR AND MY YAMS CAME OUT PERFECT. MY BOYFRIEND AS WELL AS THE REST OF MY GUESTS LOVED IT!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1879225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-08T23:18:11.293Z",
                "reviewBody": "I've never even seen a yam for sale in the U.S. so I was forced to substitute with sweet potato. The result was just ok.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHAEL JACKSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/635129/"
                }
            }
        ]
    }
]