[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
                    "name": "Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214651/donut-muffins/",
        "name": "Donut Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F654776.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2020-06-19T03:42:33.000Z",
        "description": "Mini muffins that taste just like cinnamon sugar doughnut holes!  The secret ingredient is nutmeg.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "24 muffins",
        "recipeIngredient": [
            "½ cup white sugar",
            "¼ cup margarine, melted",
            "¾ teaspoon ground nutmeg",
            "½ cup milk",
            "1 teaspoon baking powder",
            "1 cup all-purpose flour",
            "¼ cup margarine, melted",
            "½ cup white sugar",
            "1 teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease 24 mini-muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 1/2 cup sugar, 1/4 cup margarine, and nutmeg in a large bowl. Stir in the milk, then mix in the baking powder and flour until just combined. Fill the prepared mini muffin cups about half full.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the tops are lightly golden, 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While muffins are baking, place 1/4 cup of melted margarine in a bowl. In a separate bowl, mix together 1/2 cup of sugar with the cinnamon. Remove muffins from their cups, dip each muffin in the melted margarine, and roll in the sugar-cinnamon mixture. Let cool and serve.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dianne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.490793201133145,
            "ratingCount": 2824,
            "itemReviewed": "Donut Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "88 calories",
            "carbohydrateContent": "12.8 g",
            "cholesterolContent": "0.4 mg",
            "fatContent": "3.9 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "66.3 mg",
            "sugarContent": "8.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-24T22:12:02.807Z",
                "reviewBody": "I'm curious about a couple of things about this recipe.  First, why did I end up with 24, not 12, of these mini muffins as the recipe indicates?  Could it be an AR misprint?  Mine is a standard, mini-muffin tin.  Second, I really don't like nutmeg much. So WHY do I LOVE these muffins?! And why can't I stop popping them in my mouth?  Don't kid yourself by thinking that because they're  small you won't eat as much.  You'll just eat more of them.  And making them in the mini muffin tins was GENIUS, Dianne! That way you get more of that buttery, cinnamony sweetness in every bite!  I did make a couple of modifications, but nothing that would significantly alter the recipe.  I used butter instead of margarine and, because I have an entire quart of buttermilk to use, I subbed buttermilk for the milk. This worked beautifully, but please note that if you do that you MUST add 1/2 tsp. baking soda and eliminate the baking powder to adjust the acidity and make them rise properly! Plus they're so darned pretty I could just eat them up!  (And I already did, with five of them) Your recipe is a beauty, Dianne! ~A hopefully helpful update: because of my curiosity I did some shopping around  to learn that the sizes of mini-muffin tins varies, sometimes significantly! This explains the variance in yield with this recipe, to anywhere from 12 to 24 of these little muffins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-25T17:26:54.603Z",
                "reviewBody": "I'm the submitter of this recipe and I'd like to add a few notes!  First, the recipe should read \"butter or margarine.\"  Either one works great.  Second, I finally found out from my mom, who got the recipe from my grandma, that this recipe makes 24 mini muffins.  You fill the muffins cups 1/2 full with batter, and they should rise to just above top of the muffin tin.  You can certainly also make 12 larger mini muffins if you wish, but \"officially\" this recipe makes 24.  I think 12 has worked for me because my muffin tin is on the bigger side.  Sorry about the confusion!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T20:35:32.417Z",
                "reviewBody": "Wonderful recipe that's a cross between a mini muffin and a donut hole!  Simple, delicious, sweet little treats that are kinda like a potato chip - I dare you to eat just one.....  With that in mind the only thing I would do differently next time is to double or triple the recipe because these don't last long. I sprayed a little Pam for baking in the bottom of my mini-muffin cups so they'd pop right out. I can't wait to make these with my niece as this is definitely a kid friendly recipe. Thanks Dianne! Update: Like others, I did get a little more than twelve out of one batch but I was so busy popping these little goodies in my mouth I didn't notice the discrepancy. And at any rate, you just can't get enough of these!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-05T00:29:24.12Z",
                "reviewBody": "I just made these this morning! They were very good! I put in a little less than 1/2 tsp of nutmeg. I also coated mine in powdered sugar, vanilla glaze and a chocolate glaze. We all like the vanilla glaze best! Here is the recipe I used for my vanilla glaze\n\n2 cups confectioners' sugar\n1 tsp vanilla extract\n1 TBS milk\n1 TBS butter, softened\nPut that into a bowl and mix together. I added more milk, but I didn't measure. I just got it to the consistancy I liked. Once I mixed it, I poured have of the glaze into another bowl and added 1 TBS cocoa powder and mixed. Then I dipped the muffins in the glazes and let dry. I double dipped them. Then on the vanilla glaze ones, I dipped some of the tops in the chocolate glaze. Also, glaze them once they have cooled. If you don't wait, they will fall apart.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISSALU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1183976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-20T21:12:34.09Z",
                "reviewBody": "Great recipe.  Easy and delicious.  I noticed the accusation of plagiarism; sour grapes.  This forum is for sharing recipes.  I don't think a single recipe on this site is totally original by the person that shares them.  Who cares except rivercity.  I don't care who created the recipe just keep sharing.  Thanks!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sam Porterfield",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8569830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-25T00:43:49.447Z",
                "reviewBody": "okay, my two cents.  i can see where everyone thought these to be a 5 star rating, but i think the nutmeg to be a little over-powering and i am a *bigtime* spice lover!!!  in fact, i am usually heavy-handed in that dept., but followed this recipe to a 'T' and i personally thought it over the edge where the nutmeg was concerned.  also, the batter made 14 of these puppies for me, no matter how hard i pressed on the original twelve trying to duplicate the recipe as written.  it wasn't going to happen unless i was willing to accept huge, sweet, sugar-coated 'shroom-looking muffins.  lastly, the sugar/cinnamon ingredients are way over-kill.  i would easily cut the amount(s) by one third.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "tunatwist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1715914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-17T02:24:34.73Z",
                "reviewBody": "Oh my word are these amazing! I would give ten stars if I could. They taste just like little sugared donuts, but without all the guilt. I made these as written, but chose just to coat the tops with the margarine and sugar mixture, so I reduced the cinnamon and sugar topping by half. There was still some left over, so I'll just save it to use on the next batch, which I think I'll just make right now. Make sure you spray the pans well and they will pop out very easily. Dianne, this recipe is outstanding!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-23T18:49:23.077Z",
                "reviewBody": "Nice recipe when you don't have eggs. I didn't have nutmeg so I used pumpkin pie spice and used 1/4 tsp. I halved the butter and sugar and added a tsp of vanilla. For the topping I skipped the melted margarine and tossed them with 1 tsp cinnamon and 1/8 cup of sugar in a paper bag to coat, made 18 mini muffins baked in 18 minutes. *** I have tried it with an egg as well and we noticed no difference with taste or texture. ***",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the4taals",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1554570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-13T23:46:20.057Z",
                "reviewBody": "Delicious! I had been craving donuts and this satisfied my sweet tooth perfectly - and presumably at least a little healthier since they're baked (not fried like actual donuts). I made the muffin recipe exactly as listed (I did sub butter instead of margarine), but baked them in regular size muffin tin using cupcake liners. The recipe as listed gave me 8 \"regular\" muffins. Then, instead of rolling them in the butter & cinnamon-sugar mixture I simply drizzled melted butter on the tops of the muffins & sprinkled the cinnamon sugar over the butter while they were still warm & fresh out of the oven. They were fantastic - great taste and texture - I'll definitely make these again! P.S. Since I made these in a regular size muffin tin I baked them for about 21 mins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SnapDragon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5460651/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Donut Muffins",
            "description": "See how to make Donut Muffins.",
            "uploadDate": "2013-01-03T18:01:47.493Z",
            "duration": "PT3M25.58S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F49864dc3-8bab-4d62-933f-023375023fa3%2F40036654-ef10-493b-afdf-797d53a85884%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2071072203001"
        }
    }
]