[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/149/breakfast-and-brunch/french-toast/",
                    "name": "French Toast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214699/patriotic-french-toast/",
        "name": "Patriotic French Toast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F463847.jpg",
            "width": 5184,
            "height": 3456
        },
        "datePublished": "2020-06-19T03:42:35.000Z",
        "description": "French toast with a cream cheese topping and fresh fruit!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (10 ounce) package frozen strawberries, thawed",
            "1 cup fresh blueberries",
            "1 (8 ounce) package cream cheese, softened",
            "2 cups confectioners' sugar",
            "2 cups milk",
            "2 eggs, beaten",
            "1 teaspoon vanilla extract",
            "½ teaspoon ground cinnamon",
            "2 tablespoons butter",
            "8 thick slices bread"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 250 degrees F (120 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the thawed strawberries with their juice and the blueberries in a bowl; set aside. Beat together the softened cream cheese and confectioner's sugar until smooth; set aside. Whisk the milk, eggs, vanilla, and cinnamon in a shallow bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter over medium heat in a large skillet or griddle. Dip bread into egg mixture, coating thoroughly. Cook until well-browned on both sides, about 5 minutes. Place cooked slices on baking sheet and place in oven to keep warm until ready to serve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the cream cheese mixture over each slice of french toast, then top with 2 tablespoons of the fruit. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "French Toast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DOJAGRAM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.090909090909091,
            "ratingCount": 11,
            "itemReviewed": "Patriotic French Toast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "397.8 calories",
            "carbohydrateContent": "56.1 g",
            "cholesterolContent": "89.8 mg",
            "fatContent": "16.2 g",
            "fiberContent": "2 g",
            "proteinContent": "8.3 g",
            "saturatedFatContent": "9.4 g",
            "servingSize": null,
            "sodiumContent": "351.4 mg",
            "sugarContent": "38.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-05T19:32:42.237Z",
                "reviewBody": "Great idea! I made these for breakfast on the 4th of July and they were a hit! I did add a little bit of nutmeg to the egg mixture as we like that flavor in our french toast and used cinnamon bread. I do think the servings and measurements are off. As written this recipe makes WAY more than 8 slices of french toast. As I was putting together the egg mixture I thought 2 eggs and 2 cups of milk sounded like a lot for just 8 slices so I cut it in half. Boy am I glad I did! I had just enough for 8 slices! Had I followed the recipe exactly I'd have needed to use 16 slices just to use up the egg mixture. With only two adults and a toddler to feed I didn't need that much. I wish I'd thought to cut back on the cream cheese mixture too. A whole package of cream cheese and 2 cups of sugar made a lot. I now have a lot of leftover icing to use up... but I also have a lot of fresh strawberries and blueberries to use up so I may just buy another loaf of bread and make this again tomorrow! So if you need only 8 servings halve everything but the berries and bread. If you need 16 servings use the recipe as is but double the amount of berries and bread. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4204995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-07T17:34:43.837Z",
                "reviewBody": "This was awesome! I hate to say that I changed the recipe a tad but I did. I'm pregnant and wanted more protein so I used 6 eggs and approximately 1 cup of milk. Also not a huge sweet tooth so I halved the cream cheese & sugar part. Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stepperanddaniel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2347518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-07T17:23:01.057Z",
                "reviewBody": "While my family loved this recipe....but it needs some big time changes. Because they had the finished product of me revamping the recipe. I used fresh strawberries and blueberries in this recipe so I actually had to add 2 tbsp of brown sugar to have juice with the fruit. Not really a big deal. The cream cheese mixture tasted wonderful but was too thick to spread on to the french toast when it was done I would recommend thinning it a bit with milk or totally adding the fruit mixture to it. Because my family actually went and grabbed syrup to add to their plate to make it just a bit more spreadable to every bite. But my biggest issue and frustrating part of the dish over all was the liquid mixture for the french toast. There was way to much milk in the mixture. The recipe calls for thick bread meaning to me Texas Toast size bread. I followed the instructions and when I placed each piece on to the griddle even after melting butter the bread became very goopy sticky and wouldn't come up off the pan. I even tasted it and it just tasted like soggy milk bread. The vanilla and cinnamon flavor was totally lost in the french toast and it was quite bland. And after dipping the 8 slices in it still had loads of liquid that remained. So I added more vanilla and cinnamon and 2 additional eggs which totally helped save the rest of my liquid and remake the french toast I tossed 10 pieces of Texas Toast. The concept was good but the execution lacked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-08T17:28:26.007Z",
                "reviewBody": "I used Texas toast size bread when I made this which pretty much used up all the egg mixture as well as the cream cheese mixture; I appreciate the reviewers clarifying the ingredient amounts. This is a very rich recipe but delish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOJAGRAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1444309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-22T17:39:28.807Z",
                "reviewBody": "I made this for dinner and we loved it! I didn't change a thing. I can't wait to make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "twintoddlers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1592998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-30T17:41:35.387Z",
                "reviewBody": "Very good but added 1/4 tesp nutmeg and used Splenda instead of confectioners sugar. And low fat cream cheese. Did use canned milk instead of reglar so that added calories back in that I tried to take out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Audrey Edwards",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5120948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-24T20:21:54.137Z",
                "reviewBody": "There was too much milk. My french toast was soggy and wet even though though the outer crust was cooked. The taste was plain and bland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15330923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-04T20:58:07.17Z",
                "reviewBody": "This recipe was way too sweet. I used 1 1/3 cups confectioners's sugar instead of 2 cups and it was still too sweet. I also used fresh strawberries and blueberries and mixed them into the cream cheese mixture. With the liquid from the berries the consistency is perfect for spreading. The french toast part was better but there was too much milk. I used 1 cup instead of 2 cups and it tasted amazing. But instead of making 8 pieces of french toast it only made 6! Goes to show what a little milk can do huh?;) For the kid test: I'm 14 and though it was too sweet. My sister is 5 and also thought it was too sweet. My 7 year old brother liked it though. Overall I think if you reduced the powdered sugar to about 1/2 cup to start then add more if needed it would taste a whole lot better. I'm not sure what to do about the milk though... I think if you doubled the other ingredients for the egg wash but still used the same 2 cups of milk it would turn out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17369210/"
                }
            }
        ]
    }
]