[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/215/salad/pasta-salad/",
                    "name": "Pasta Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16188/salad/pasta-salad/vegetarian-pasta-salad/",
                    "name": "Vegetarian Pasta Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214921/sesame-noodle-salad/",
        "name": "Sesame Noodle Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F699335.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "2020-06-19T03:42:45.000Z",
        "description": "This amazing salad recipe was given to me by a friend who used to know someone at the now closed Larry's Markets in the Seattle area.  I've added to the recipe a little -- so it's not exactly the same... but better! I take this to every picnic and everyone loves it! May also add diced chicken for a variation.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (16 ounce) package angel hair pasta",
            "½ cup sesame oil",
            "½ cup soy sauce",
            "¼ cup balsamic vinegar",
            "1 tablespoon hot chili oil",
            "¼ cup white sugar",
            "1 teaspoon sesame seeds, or more if desired",
            "1 green onion, chopped",
            "1 red bell pepper, diced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the angel hair pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk together the sesame oil, soy sauce, balsamic vinegar, chili oil, and sugar in a large bowl. Toss the pasta in the dressing, then sprinkle with sesame seeds, green onion, and bell pepper. Serve warm, or cover and refrigerate for a cold salad.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Pasta Salad",
            "Vegetarian Pasta Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "jkmom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.526515151515151,
            "ratingCount": 264,
            "itemReviewed": "Sesame Noodle Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "337.8 calories",
            "carbohydrateContent": "40.8 g",
            "cholesterolContent": null,
            "fatContent": "16.8 g",
            "fiberContent": "2.5 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "1020 mg",
            "sugarContent": "9.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-03T23:57:57.403Z",
                "reviewBody": "Delicious! I cut the recipe in half as well as the amount of sesame oil and used low sodium soy sauce. I toasted my sesame seeds as well and added them at the end - they give a nice presentation. I would have never thought of adding balsamic vinegar! It was a really nice addition. And, this is great warm or cold - but I prefer it cold as it really does get better the next day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-07T02:07:33.013Z",
                "reviewBody": "I bought a bottle of hot chili oil at the Asian market a couple of weeks ago, and had no idea what to do with it...then I stumbled upon this recipe and thought I'd give it a try. I'm glad I did! This was very good! I have to admit, though I LOVE sesame oil, 1/2 cup seemed a bit much, so I started off with 1/4 cup and thought I would just add more if I needed to. I didn't. I thought that that was the perfect amount for us. Also, I used thin spaghetti because hubby doesn't like angel hair and I added more green onions than called for. I served this warm, but can't wait to try the leftovers cold tomorrow. We really enjoyed the spiciness from the chili oil as well. I will be using this recipe again, for sure! Thanks for sharing. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-22T21:35:19.65Z",
                "reviewBody": "People raved about this at a party I went to this weekend. I substituted julienned carrots and peapods for the green onion, added 2 additional Tbs of sugar (per another reviewer) and toasted 1 Tb of sesame seeds. Inexpensive, easy & very tasty...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gebah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3581750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-09T02:15:13.96Z",
                "reviewBody": "Love the flavors in the salad! I scaled this recipe back a bit since I am only serving two people. I left out the hot chili oil because family members don't tolerate spiciness well. I used the angel hair pasta, boiled for 4 minutes then drained it and set it aside. I added 3T sesame oil, 4T soysauce, 2T balsamic vinegar but keeping almost the 1/4 cup of the white sugar called for in the recipe. I tased the sauce until it was the right balance with sweetness. I added the warm noodles into the sauce along with the chopped green onions and red bell peppers. I added more chopped green onions and a little yellow and orange bell peppers for color, texture and nutrition. At first the sauce will seem like a lot, however the warm noodles will soak it all up. I highly suggest chilling the noodles to allow the flavors to meld and come alive. Right before serving I sprinkled sesame seeds over the noodles for added presentation (see my picture in the photo gallery). A very colorful dish with peppers, green onions and sesame seeds. This salad is simply easy to prepare and flavorful. The balsamic vinegar is an interesting twist but it was not strong with all other ingredients. I always like the combination of the sesame oil with soy sauce and sugar. The sauce can easily be adjusted to fit your tastes. I served these noodles along with, \"Hoisin-Ginger Beef Skewers,\" from this website and another tasty dish! The sesame noodle is best served chilled especially on a hot, humid day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-12T18:26:26.14Z",
                "reviewBody": "I have made this recipe several times now for potlucks and BBQs and it is always a huge hit! People continually ask me for the recipe! The fundamental revision I make to the recipe is to sub 1/2 of the sesame oil with vegetable or canola oil - so 1/4 cup each sesame and vegetable oil - otherwise the sesame flavor is too overpowering for my taste.  From there I like to add crushed peanuts, shredded carrots, lots of fresh cilantro and a little fresh lime juice to make it more Thai inspired....it's all up to you and your tastes!  I've even added ground chicken and pork to make this a main dish and it's delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12378513/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T18:49:25.34Z",
                "reviewBody": "I have been searching for a good sesame noodle recipe, and I think I have found it. I was skeptical about the balsamic vinegar, as most Asian pasta recipes call for rice vinegar. I'm going to try this recipe with rice vinegar next time I make it solely for comparison purposes, but just know that it is delicious as is. The hot chili oil gives it just the right amount of kick. I usually order a spiciness of \"3\" out of a range of 1-5 in Thai restaurants. So if you like mild or extra spicy, you might want to adjust the hot chili oil accordingly. Also, I used linguine noodles, just because that is our preference. Finally, make sure you read the label when purchasing sesame oil. I grabbed a sesame oil \"blend,\" only to discover after reading the label that it had other oils mixed in with it. I put it back on the shelf and grabbed the bottle labeled \"pure\" sesame oil, and reading the label confirmed for me that the oil was indeed 100% sesame oil, and not a blend. This is very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LucyLoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1199515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-19T18:12:16.92Z",
                "reviewBody": "This is a great pasta salad for a picnic or cookout.  I used whole grain pasta and doubled the recipe for a large party.  I followed the sauce recipe exactly as written with no substitutions. It is very good cold so it can be made a day ahead, this lets the flavors blend as well.  I'd recommend adding the sesame seeds just before serving, it adds a little crunch to the texture. We also increased the amount of sesame seeds after we tasted it. One tip - buy the toasted sesame seeds in an Asian market or the Asian section of the grocery store.  Much cheaper than in the spice section. The response? - Three people at the party requested the recipe - so go for it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BostonCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5073484/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-11-26T08:01:44.203Z",
                "reviewBody": "Outrageously delicious!   A new go-to for pot lucks and picnics.  My gourmet grocery store sells this exact salad for $8.99/lb, forget that!  By the way, they use black sesame seeds.  I prepared this very closely as written with just a couple of tweaks:  I used a little less (about 1/3 cup) sesame oil,  a little more sugar (about 1/4 cup + 2-3 tablespoons, just kept tasting), added more green onions, a yellow pepper, thinly sliced peapods, and shredded carrot to the mix.  Served cold.  My hubby raved.  Definitely make this the night before if you can and toss every so often while it refridgerates.  Thanks, jkmom, this is a sure-fire winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Saveur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-14T22:10:25.577Z",
                "reviewBody": "I brought this dish to a family barbecue and it went over really well.  I followed the recipe except I reduced the sesame oil to 1/4 cup, and that was still too much.  When I make this again, which I will, I intend to only use 2-3 tablespoons of sesame oil.  Otherwise, it was fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole Lalonde Lyske",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3747648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-02T22:00:09.597Z",
                "reviewBody": "I made this recipe as written and felt it was too sweet and that you did not need so much sauce. I also missed the flavors of ginger and garlic which some other sesame noodle recipes I like have in them. Sure you can play with the recipe and try to improve it but as it is written I found it too sweet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Leigh Cotter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1272394/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Sesame Noodle Salad",
            "description": "Mayonnaise-free pasta salad ideal for picnics and potlucks.",
            "uploadDate": "2014-11-10T20:40:24.304Z",
            "duration": "PT1M48.875S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd2799eb9-ca98-40c4-9b0d-2bca6a883deb%2Fe02a579c-1576-4852-ac6c-699fa7be2b29%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3884754505001"
        }
    }
]