[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
                    "name": "Raspberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214974/buttermilk-mango-berry-crumb-cake/",
        "name": "Buttermilk Mango-Berry Crumb Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1025057.jpg",
            "width": 3283,
            "height": 3283
        },
        "datePublished": "2020-06-19T03:42:47.000Z",
        "description": "I came up with this recipe as I was trying to find a way to use up some buttermilk, mango and raspberries I didn't want to go to waste! Feel free to substitute other fruits such as blueberries, peaches, apples or strawberries.  No fruit on hand? This is just as delicious without!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 9-inch cake",
        "recipeIngredient": [
            "½ cup flour",
            "½ cup brown sugar",
            "¼ cup butter, softened",
            "½ teaspoon ground cinnamon",
            "½ cup butter, softened",
            "1 cup white sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "¼ teaspoon salt",
            "½ teaspoon ground nutmeg",
            "1 cup buttermilk",
            "1 mango - peeled, seeded and diced",
            "1 cup raspberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9-inch square baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 1/2 cup flour, brown sugar, 1/4 cup butter, and cinnamon together in a bowl until the mixture is the consistency of wet sand. Set the topping aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat 1/2 cup butter and sugar with an electric mixer in a large mixing bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the egg and mix well. Stir in the vanilla extract. In a separate bowl, combine  2 cups flour, baking powder, baking soda, salt, and nutmeg.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the flour mixture into the creamed butter mixture alternately with the buttermilk, stirring just to combine. After the last of the flour mixture is incorporated, gently fold in the diced mango and raspberries.  Spread the batter into the prepared pan (the batter will be thick). Sprinkle with crumb topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 50 minutes. Cool on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Raspberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "naples34102"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.090909090909091,
            "ratingCount": 121,
            "itemReviewed": "Buttermilk Mango-Berry Crumb Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "324.5 calories",
            "carbohydrateContent": "50.1 g",
            "cholesterolContent": "45 mg",
            "fatContent": "12.4 g",
            "fiberContent": "1.7 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "305.7 mg",
            "sugarContent": "29.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-08-02T22:59:48.503Z",
                "reviewBody": "I am the submitter of this recipe and I thought I'd add a note now that it's been published! It took making lots of coffee cakes and muffins over many years to know what I like in a recipe for them - namely butter buttermilk (or sour cream) a little cinnamon and a perfect crumb topping. Tossing in a little fruit that you want to use before it goes to waste doesn't hurt either! If you don't like nutmeg leave it out. Or substitute with cinnamon or lemon zest. Don't want a coffee cake? This is easily converted to muffins. Today I sprinkled some powdered sugar over the cooled cake (still using the crumb topping) but just a simple glaze of powdered sugar and a little milk drizzled over the crumb topping after it's cooled is pretty too and adds just a little more sweetness. Also fresh or frozen berries may be used!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T23:35:03.333Z",
                "reviewBody": "Delicious crumb cake! I was eyeing up this recipe for a while and since I had some buttermilk on hand that I wanted to use up it was time to give it a try. I didn't add any of the fruit as I wanted a classic crumb cake and boy did I find one! Just as the submitter states, it's just as delicous without the fruit. The crumb topping is wonderful and next time I'll double it, because it was so good.  The cake itself was moist, slightly sweet, and nicely spiced. I topped it with a nice dose of powdered sugar and it was perfect with a cup of tea or coffee. I can't wait to try this again with a variety of fruits such as apple or blueberry and maybe throw in some nuts like walnuts or pecans....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-06T00:46:27.603Z",
                "reviewBody": "This is THE perfect crumb cake. Some can be dry or have a topping that just isn't right. This is moist, buttery delicious and the crumb topping is excellent. The buttermilk makes this especially moist and tasty, I think, and the slight hint of nutmeg adds another dimension of flavor. While I can see making this with lots of different fruits as possibilities, or even plain for that matter, I liked the combination of raspberries and mango. Thanks for the great recipe Naples34102",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MarielJD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4963058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-02T18:39:10.467Z",
                "reviewBody": "This recipe is a delightful change from the normal sugary, super sweet cakes, cookies, etc...not that I don't appreciate those as well! I personally did not care for the fresh mango chunks as they got watered down and lost, well, all of their flavor, but I could tell from the blueberries that more substantial fruits are key and will use blueberries, strawberries, raspberries, etc, in the future. I took the finished product to a meeting a few nights ago and everyone raved and are *still* talking about it--esp. the men (go figure...*smile*). The most over-the-top, decadent goodness in this recipe is the crumb topping. It's so divine that I decided to make \"Banana Chip Muffins I\" from this site today and and while several reviewers stated they added cinnamon to the batter, I just couldn't see that in my mind's eye with everything already going on ingredient-wise. Then, I had an \"ah-ha\" moment--incorporate some cinnamon by adding THIS crumb topping! The topping completely salvaged an otherwise ho-hum recipe. I have a little left over that I think will even be good on vanilla ice cream. Kudos to the submitter for a most definite make again recipe many times over!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tunatwist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1715914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-16T19:03:06.35Z",
                "reviewBody": "AWESOME! So moist and delicious. I love the fact that different fruits can be used. I used a fresh peach and a cup of frozen raspberries. I can't wait to try others. The topping was incredible! It made the whole cake just perfect. Thank you Naples for sharing such an AWESOME recipe! UPDATE: I just made this recipe again but this time as muffins. I divided the batter into four bowls. One bowl had the addition of blueberries another had raspberries another I added cranberries and apples were added to the last. I now have a variety of muffins not to mention that some muffins will be a surprise combination. The only problem I see is I want to try them all! They took a little less time to bake so just keep your eye on them until a toothpick comes out clean. Also no need to double the topping. I did and it wasn't necessary. Thanks again Naples!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-21T15:11:09.683Z",
                "reviewBody": "This is definitely a five-star recipe! I hesitated because I am not totally enamored of mango but my Recipe Exchange friends told me this would be a good way to give it a second chance. I followed the recipe exactly christening my new springform pan! By the way a cup of raspberries is about a 6-oz container. I wish you could have seen my seven-year-old granddaughter bite into this yummy cake! She closed her eyes rolled her bite around as if she had tasted a little bite of heaven and begged for more. Need I ever say anything more?? UPDATE 8/21/10 This freezes very well. I just took out the half I saved wrapped in foil and then freezer-bagged and when I heated it in the microwave my hubby kept saying \"Mmmmm!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-07T21:16:00.493Z",
                "reviewBody": "FABULOUS! As quoted by my boyfriend: this is probably the best coffee cake I've made yet. And I bake A LOT. I am SO pleased with how this turned out. I loved the texture and flavors...mango and blueberries go together very nicely in this recipe. I used the optional nutmeg (freshly grated which makes a difference!). I added a little drizzle of cream cheese frosting to the top (it didn't stay on very well because it's a crumb-y topping but whatev) and it was a nice addition. Can't wait to make again with all sorts of flavor variations!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FNChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fnchef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-30T14:58:23.783Z",
                "reviewBody": "This was a wonderful cake! I only had blueberries so I went with those and the mango of course but can't wait to try it with other fruits too. I love a nice thick crumb topping and this was just perfect! I thought I had an 9\" square pan but it was only an 8\" so I used my 9\" round pan and that worked out just fine. I will most definately be making this often! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-02T22:17:37.67Z",
                "reviewBody": "I tried these as muffins using powdered buttermilk a peach and blueberries in place of mango and raspberries. Submitter suggests all but the powder buttermilk as possible variations. I look forward to doing these sometime when I have the pans and all the listed ingredients but even with my substitutions they were tasty. I do wonder if a hotter oven (400 F. perhaps) for 20 to 25 minutes would work if doing muffins. I made two dozen small muffins and cooked at 350 for about thirty minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hezzy_tant_Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/155625/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-15T23:43:19.107Z",
                "reviewBody": "I wish I could say I loved this but it was just wrong for me in so many ways. I found out I hate baked mango- the taste texture and color were all unappetizing. As others have mentioned the cake around the fruit was gummy as well. I also did not care for the grit of raspberry seeds in the cake. The cake was fairly bland and too fluffy- every piece served fell to the side. I prefer a coffee cake with more \"body\" to it. And lastly- I really missed the traditional buttery streusel. This was tasteless and the dry sand texture was not what I want in a crumb cake. I would try it with different fruit, some more vanilla or rum extract and a traditional crumb topping but then I guess it would be a whole different recipe. No one cared for this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Lilly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6845599/"
                }
            }
        ]
    }
]