[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/79100/swedish-saffron-buns/",
        "name": "Swedish Saffron Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F535460.jpg",
            "width": 2288,
            "height": 1712
        },
        "datePublished": "2020-06-19T03:11:41.000Z",
        "description": "These traditional Swedish-style saffron buns are frequently baked around Christmas time. They are a very tasty and lovely tradition!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "35 saffron buns",
        "recipeIngredient": [
            "2 ⅛ cups milk",
            "½ cup butter",
            "3 (0.6 ounce) cakes compressed fresh yeast",
            "8 ounces quark or sour cream",
            "2 (.5 gram) packets powdered saffron",
            "⅔ cup sugar",
            "½ teaspoon salt",
            "7 ½ cups all-purpose flour",
            "1 cup raisins",
            "1 eggs, beaten"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the milk and butter in a small saucepan until the butter has melted and the temperature has reached 100 degrees F (38 degrees C).  Crumble the yeast into a bowl, then pour in the warm milk.  Stir well until the yeast dissolves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the quark, saffron, sugar, salt, and 7 cups of the flour.  Mix the dough in the bowl until it becomes shiny and silky, adding more flour as needed until it begins to come away from the sides of the bowl.  Cover, and let rise for 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare 2 or 3 baking sheets by covering each with a sheet of parchment paper.  Lightly flour a work surface, punch down the dough, then divide into 35 pieces.  Roll each piece into a rope, 5 to 6 inches long.  With the rope lying flat on the work surface, roll each end towards the center, in opposite directions, creating a curled S-shape.  Place the buns on the prepared baking sheets, and garnish with raisins if desired.  Cover with a towel, and allow to rise for an additional 30 minutes while you preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently brush each bun with beaten egg, then bake in the oven until puffed and golden, 5 to 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CAMILLAAA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.705882352941177,
            "ratingCount": 17,
            "itemReviewed": "Swedish Saffron Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "169.4 calories",
            "carbohydrateContent": "29.1 g",
            "cholesterolContent": "15.5 mg",
            "fatContent": "4 g",
            "fiberContent": "1 g",
            "proteinContent": "4.4 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "67.9 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-19T16:36:22.517Z",
                "reviewBody": "A historical comment! These buns are traditionally eaten not for Christmas but for Saint Lucia's day (December 13). She is the patron saint of Sweden so her day is celebrated widely there. A girl of the family will dress up as St. Lucia wearing a long white gown with a red sash and a crown of holly with candles (nowadays mostly just electric candles) and will serve the \"Santa Lucia Buns\" to the rest of the family. They can also be made with two overlapping \"S\" shapes to make a cross with curled ends. I often prefer to make my Santa Lucia buns with just a bit of large crystal sugar or Scandinavian pearl sugar (which is a bit harder to find). I also like the look of longer strands of Saffron they really do add lovely color and taste to the buns.:) Happy Scandinavian Baking!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emilia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4592774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T15:43:12.593Z",
                "reviewBody": "Excellent old-fashioned recipe although a bit bland for the seasoned pallet. For the second batch I added sugar to the top before they went into the oven. A little dip into some butter and they are such a delight. My parents want me to show them how to make them and they're very picky- so that's saying something!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Galinda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1944473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-19T22:05:37.973Z",
                "reviewBody": "A wonderful recipe that makes the lightest most delicate breakfast bread! The saffron gives it a golden hue and the dough is manageable enough to shape into just about any shape you can imagine! We made these to celebrate St Lucia Day but I know we will be eating this bread many times throughout the year now. I may add candied lemon/orange peel next time I bake these to make them into a slightly more sweet breakfast bread...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kat G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1821605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T20:16:58.61Z",
                "reviewBody": "Excellent recipe for moist saffron buns. I did add a tad more salt and also some cardamom. Either way this recipe results in moist fluffy buns. I made mine with quark. Also added pearl sugar on top for the additional bit of sweet crunchiness. Mine definitely had to bake longer than the time in the recipe to get a nice golden color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jgd0339",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6163973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-12T16:06:07.23Z",
                "reviewBody": "Excellent recipe that gives tasty traditional Swedish saffron buns. I did only use 6 cups of flour and they turned out very moist and nice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "eva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5473876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-14T16:36:45.06Z",
                "reviewBody": "This was an AWESOME recipe. Here are some things that I learned making them the first time:\n*I wanted to make these for our family's St. Lucia Day breakfast, and so I made the dough the night before, let it rise, formed the rolls, and then put them on the pan in the fridge to finish rising overnight. This worked like a charm and we had hot rolls first thing in the morning.\n*I didn't have access to fresh yeast cakes, so I substituted 2 1/4 tsp instant yeast for each cake. This worked well.\n*I added 1/4 tsp cardamom and sprinkled the dough with pearl sugar, like other reviewers suggested.\n*I was using saffron stamens from Palestine, which are different than Spanish saffron (slightly less intense). I crushed them myself and ended up with 1/2 tsp.\n*I didn't divide the dough up beforehand, and just did it as I went. This means that my rolls ended up bigger than they would've if I'd divided them beforehand.  (I got one big pan full). I will pre-divide next time.\nTruly, these ended up delicious and moist and just *perfect* for our St. Lucia Day celebration. I think I will use it as my go-to sweet roll dough from now on. Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BeccaBee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2030738/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-15T19:54:15.35Z",
                "reviewBody": "These are really tasty fluffy buns with a delicate Saffron flavor. I am not Scandinavian I made these for my Kindergarten class when we studied Norway and the author Jan Brett. I used 3 packs of yeast instead of the cake yeast and 1/4 teaspoon crushed Saffron threads because that is what I had.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vangie1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8851618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-06T04:28:42.893Z",
                "reviewBody": "Yes a good recipe but lay the saffron “steep” in the milk for at least 30 minutes to get all the flavor from this expensive spice. (I actually use 1/4cup boiling water and steep in that and sub for 1/4 cup milk. This will make a huge difference in flavor and color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "iowonian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22888951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-18T04:48:26.497Z",
                "reviewBody": "Used dry yeast instead of cake. Otherwise we followed the directions as written including the quark which we had to order online. The buns were moist and delicious. My Swedish husband has been eating saffron buns all his life and making them for 40 years. These were the best we've ever had. Additional comment. 11/17/19 - We have purchased quark from a local specialty cheese store for the last couple years and I hope that if you look or call around you may find it near you also. It's worth the time spent as it really makes a difference in the texture of the buns.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jojo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13697829/"
                }
            }
        ]
    }
]