[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/496/side-dish/sauces-and-condiments/sauces/pasta-sauces/",
                    "name": "Pasta Sauces",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215320/cheesy-butternut-squash-pasta-sauce/",
        "name": "Cheesy Butternut Squash Pasta Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F710152.jpg",
            "width": 2156,
            "height": 1617
        },
        "datePublished": "2020-06-19T03:43:04.000Z",
        "description": "I had some leftover cooked butternut squash and and made this savory pasta sauce.  It is tasty over ravioli or any whole grain pasta.  Your squash should be very soft to begin with.  I generally steam my squash in a slow cooker for 4-5 hours.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 cups",
        "recipeIngredient": [
            "2 ½ cups butternut squash, peeled and cut into 1/2-inch cubes",
            "1 tablespoon olive oil",
            "1 tablespoon butter",
            "⅓ cup onion, finely chopped",
            "3 cloves garlic, minced",
            "⅓ apple, peeled and chopped",
            "1 cup chicken broth",
            "⅓ cup milk",
            "⅓ cup  Italian cheese blend (Parmesan, Asiago, and Romano)",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the squash into a saucepan, cover with water, and bring to a boil. Simmer the squash until very tender, 15 to 20 minutes. Drain excess water. Cooked squash should equal 2 cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil and butter in a skillet over medium-low heat, and cook the onion, garlic, and apple, stirring frequently, until softened and brown, about 15 minutes. Add butternut squash and chicken broth, and bring to a boil over medium heat. Reduce heat just to a simmer, and stir in the milk and cheese blend. Stir until the cheese has melted and the sauce has reached desired thickness, 5 to 10 minutes. Season to taste with salt and black pepper.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces",
            "Pasta Sauces"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SPEARL20"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.489130434782608,
            "ratingCount": 92,
            "itemReviewed": "Cheesy Butternut Squash Pasta Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "101.9 calories",
            "carbohydrateContent": "10.1 g",
            "cholesterolContent": "11.1 mg",
            "fatContent": "6.3 g",
            "fiberContent": "1.5 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "76.6 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-02T22:51:58.587Z",
                "reviewBody": "I was looking for an idea of what to do with butternut squash so I tried this out. I like that all of the ingredients are things that are normally in the kitchen. The sauce was sweet and savory and cheesy and delicious. Next time I think I will puree it when done so that it covers the pasta better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carolyn0219",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2377109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-31T22:17:19.48Z",
                "reviewBody": "I made this vegan by using some almond milk in place of regular milk, using double the olive oil and omitting the butter, using vegetable broth in place of chicken broth, and shredded soy mozzarella in place of the italian cheeses. it still turned out delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gracewright90",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3788144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T20:24:38.363Z",
                "reviewBody": "I thought the taste was wonderful. I did make a couple changes based on what I had though. I didn't have milk (doh!) so I substituted light sour cream instead. As the other reviewer suggested I added mushrooms. I used about 3/4 of a cup of fresh shitake and button mushrooms but next time I think I'll double the mushrooms. I also added about 1/4 cup of blown sugar. I thought the dish was a little bland and the sugar allowed the flavors to blend wonderfully. I think next time I will also use more apple and cut the pieces a little bigger. I had cut then into 1/4 inch pieces but next time I will do 1/2-3/4 inch pieces so you can taste the apple more. Well my husband liked it so it's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy1724",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3456794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-23T14:30:15.473Z",
                "reviewBody": "Another way to prepare this is to use the frozen pureed butternut squash. It's in a box type of container that you microwave. Make a rue with butter and flour and a little milk. When thick add in butternut squash and parm cheese. Loosen with more milk if needed. I then stir in grated nutmeg and a little chopped fresh or dried sage salt pepper. Incorporate mixture with cooked pasta I use shells put into butterd dish sprinkle with a mixture of panko seasoned breadcrumbs a little more parm and melted butter. Sprinkle on to and bake 35 to 45 minutes or till bubbly and browned. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Debi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6541320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-08T17:58:14.557Z",
                "reviewBody": "I made this recipes (almost) as directed and was unhappy with the final look of the sauce. The cheese did not melt into the sauce; it just kind of \"glommed\" onto the other vegetables. It also did not thicken much. This may have been due to the fact that I could only get a Mexican cheese blend and perhaps the Italian cheese blend would have melted appropriately. It may also have been that the temperature was too hight I don't know BUT.....I added a 1/4 brown sugar and puree'd the whole thing until it looked a bit like a very thick squash soup. I served it over pasta with a sprinkling of fresh parsley and some parmesan cheese and my husband LOVED it! He said it was one of the most orginal and tasty pasta dishes I have ever made. He even asked for more sauce to put on his pasta half way through his serving. I will try making this again with an Italian cheese blend as I would like a more chunky look for the sauce but it's great to know that the fall back position (if it does not work) will still be a big hit with my family. Thanks for a winner!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Slacster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5257294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-19T23:11:05.3Z",
                "reviewBody": "Other than roasting my squash (cut lengthwise drizzled with oil made a tiny pool of oil in the cavity where I placed a clove of garlic and baked at 375 until squash was soft and cooked through) I followed the ingredients in this recipe exactly. When I was done I sampled and it was pretty bland. I added more salt and pepper to taste more cheese and a hint of ground sage (not a big sage fan but it's quite tasty with butternut squash). I thought the sweetness was enough but I think it also depends on what kind of apple you use. I used a honeycrisp apple because they are awesome (sweet and tart) and I don't think I would have enjoyed this recipe as much if it were any sweeter. I also put the mixture in the food processor but left it a little chunky. Even the hubby liked it and he's a fussy pain in the you-know-what to cook for. Anyways after those modifications I would give this recipe 5 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Valasca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2944422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-09T23:35:07.82Z",
                "reviewBody": "TO DIE FOR! Rich buttery and a delicious mix of sweet and savoury. I am in love (shhh don't tell my husband...). I followed this recipe almost to a T the only changes I made were to use a slightly different blend of cheeses (parmesan asiago smoked provolone and mozzarella as this was the only Italian blend my grocery store had to offer) and also once I had simmered the sauce to my desired consistency I found it a bit too chunky for my/my husband's liking so I pureed it in the blender. It came out so creamy and rich and wonderful my husband and I both loved it and we will definitely be making this again. SOON! I think I will try it with heavy cream in place of the milk as well just for a change as that would make it even creamier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8475576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-19T17:48:51.903Z",
                "reviewBody": "This was great. Sweet and savory. I only had parmasan on hand so I used that and also had to add more liquid to get it thinned out for my noodles. Next time I'd like to puree it. Tastes great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "darthotto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3467844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-07T19:37:39.387Z",
                "reviewBody": "I made a few changes though... I used medium-ish sized butternut squash- didn't measure it (cut in half scooped out seeds & strings baked cut side up at 400F for 45 minutes then cut side down for another 15-10 minutes & it was ready) I chopped up the 1/3 cup of onion/whole apple/4 cloves of garlic in a food processor then sauteed in EVOO/butter. No stock so used 3/4 cup water chicken bouillon cube 1/2 cup soy milk 1/3 cup 5% cooking cream then mashed the sauce to make more smooth (the sauce has texture unless you were to strain it before the addition of cheese) and then added a cheddar garlic-herb cheese blend. I forgot to mention how I seasoned the sauce... Dash each of onion salt/pepper/ginger/cinnamon good pinch of nutmeg and about 2 TBsps. brown sugar. Savoury but with a little sweetness. It's not perfect so but definitely something you can tweak to your liking... Some reviewers mention adding mushrooms I think that would add a nice meat-y taste to the sauce and will try that next time if i have any on hand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-07T02:07:37.267Z",
                "reviewBody": "Despite following the directors this turned out nothing like the picture. The squash didn't really mash up into the sauce (and it never even tells you to mash) and the cheese didn't spread very well so it was just clumped here and there throughout. Overall it's also not a very flavorful sauce either.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "PhysChic7685",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3923288/"
                }
            }
        ]
    }
]