[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/720/world-cuisine/european/dutch/",
                    "name": "Dutch",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215594/lahmacun-turkish-pizza/",
        "name": "Lahmacun Turkish Pizza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1033809.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2020-06-19T03:43:14.000Z",
        "description": "This Turkish-style pizza is a Turkish flat bread layered with a fresh sauce composed of tomatoes, sweet bell peppers, and minced lamb cooked with a flavorful selection of Mediterranean spices. It is normally garnished with fresh salad and a creamy garlic sauce and or a tangy zesty hot red pepper sauce. It is a really light meal, but filling and flavorful. I find it worth the time to make if I can't get it from my favorite Turkish bakery in my old neighborhood in Amsterdam. For the best flavor, make the topping the night before you make the pizza.",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P1DT3H20M",
        "recipeYield": "10 individual pizzas",
        "recipeIngredient": [
            "1 teaspoon chopped garlic",
            "1 yellow onion, chopped",
            "3 tablespoons chopped fresh basil",
            "½ cup chopped fresh parsley",
            "2 tablespoons chopped fresh mint",
            "½ teaspoon paprika",
            "½ teaspoon ground cumin",
            "½ teaspoon ground coriander seed",
            "½ cup green bell pepper, diced",
            "½ cup red bell pepper, diced",
            "½ lemon, juiced",
            "4 teaspoons olive oil",
            "4 roma (plum) tomatoes, halved",
            "1 pound lean ground lamb",
            "6 tablespoons double concentrated tomato paste",
            "cayenne pepper to taste",
            "salt to taste",
            "3 ¼ teaspoons active dry yeast",
            "½ teaspoon white sugar",
            "1 cup warm water (110 degrees F/45 degrees C)",
            "5 cups all-purpose flour",
            "2 teaspoons salt",
            "¼ cup vegetable oil",
            "½ cup water",
            "1 cup plain yogurt",
            "½ teaspoon chopped fresh parsley",
            "¼ teaspoon crushed garlic",
            "salt and ground black pepper to taste",
            "1 cup shredded green cabbage",
            "1 cup shredded red cabbage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat. Combine the garlic, onion, basil, parsley, mint, paprika, cumin, coriander, diced bell peppers, lemon juice, and olive oil in a food processor. Pulse the vegetables until finely chopped. Add the halved tomatoes and process until the mixture is a thick puree.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the lamb in the preheated skillet and reduce the heat to medium. Add the puree and the tomato paste and mix well. Cook and stir until the lamb is cooked through, 10 to 15 minutes. Stir in cayenne pepper and salt to taste. Transfer the mixture to a shallow baking dish to cool to room temperature. Cover with plastic wrap and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve the yeast and sugar in 1 cup warm water. Combine the flour and salt in a mixing bowl and stir well. Add the vegetable oil and 1/2 cup water to the yeast mixture and pour it over the flour. Use your hands to mix the dough. Turn the dough out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape the dough into a ball and transfer to an oiled bowl. Cover with a wet towel and let rise in a warm place until doubled in bulk, about 1 hour. Remove the lamb sauce from the refrigerator and allow it to come up to room temperature. Prepare the garlic sauce: combine the yogurt, parsley, crushed garlic, and salt and pepper to taste. Stir well and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch the dough down, transfer it to a floured work surface, and cut the dough into 10 portions. Shape each portion into a round. Flatten each round with your hand; use a rolling pin to roll each piece into a 10-inch circle. The dough should be thin, like a crepe. Place the rounds on parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 500 degrees F (260 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the lamb sauce and then spoon it onto a dough round. Spread it thinly to the edges and press down lightly so it sticks to the dough. Bake pizzas on parchment paper-lined baking sheets on the lowest oven rack until the edges are a light tan color, 8 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place on a wire rack to cool. The pizzas can be stored in an airtight container in the refrigerator for three days or in the freezer for three months. To reheat, place the pizzas in a 350 degree F oven (175 degrees C) for 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble the lahmacun, drizzle with garlic sauce, top with shredded cabbage, and roll up to eat. See the Cook's Notes for other garnish ideas.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Dutch"
        ],
        "recipeCuisine": [
            "European",
            "Dutch"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "lysis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.571428571428571,
            "ratingCount": 21,
            "itemReviewed": "Lahmacun Turkish Pizza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "479.8 calories",
            "carbohydrateContent": "57.6 g",
            "cholesterolContent": "34.6 mg",
            "fatContent": "20.1 g",
            "fiberContent": "3.8 g",
            "proteinContent": "17.2 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "571.5 mg",
            "sugarContent": "6.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-14T18:48:10.613Z",
                "reviewBody": "LOVED this. It's a real project, that's for sure, but I was expecting it to be. I made the sauce ahead of time, browning the lamb first and draining the fat before adding the other ingredients. The dough was very tight; I think next time I'll add more water. To shape the rounds, I divided the dough in 10 pieces and shaped them into balls. I covered them with plastic wrap and let the balls sit for 10 minutes to relax. Then, I started the round-robin process of flattening them into rounds. At first roll, the dough rounds were about the size of pita bread. It took three or four sessions with the rolling pin, resting in between each workout, to get the dough into a nice thin round like a flour tortilla. I baked them as directed, about two at a time on parchment-lined baking sheets; it took 8 minutes in my oven. (Meanwhile, I kept rolling out other dough rounds.) The breads were a little brittle the first night, but I stacked the rest in between the parchment I baked them on, put them in a zipper bag, and refrigerated them. The leftovers softened up and can be topped and rolled up nicely to bring for lunches. We topped them with shredded red and green cabbage, the yogurt sauce, chopped parsley, tomatoes, onions, and harissa. I gave a miserly bite to two of my coworkers, who promptly had to leave the building and go to the nearest gyro place for something similar—it's that good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-31T16:08:55.72Z",
                "reviewBody": "As one who grew up in Istanbul and lived there for 14 years, I must say that this is an excellent recipe.\n\nTwo extraneous comments on the recipe:\n\n1) Be wary of how much tomato / tomato paste is used in the recipe as the tomato can easily overwhelm some of the more delicate tastes in sauce.\n2) The garlic sauce and cabbage is more of a European addition to the lahmacun (a similar addition is made to Western European renditions of the Doner Kebap). In my experience, lahmacuns are best served with white onions (topped with sumac) and fresh parsley as garnish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Istanbulboy60",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7978125/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-23T23:36:54.88Z",
                "reviewBody": "I love lahmacun and usually never put basil but found it to be great. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tonton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3144895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-16T22:26:30.26Z",
                "reviewBody": "Just think of this as the middle eastern version of (American) Indian tacos...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ncalgal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3902235/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-14T19:44:05.18Z",
                "reviewBody": "Sounds fabulous Lysis - thanks for sharing! I had the pleasure of going to Antalya Turkey for a conference almost 2 years ago and after the conference we did a tour throughout a large portion of this beautiful country! Our tour group had something similar to this at a lakeside cafe and I could not for the life of me figure out how to recreate it at home! Thank you thank you!! I'm rating it 5 stars because now I know where I went wrong on my first attempt - I didn't add enough mint! My only recommendation would be to add more fresh parsley to the garlic sauce! (And more garlic but that's just me I love garlic!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KadyKat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6278161/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-13T02:31:01.327Z",
                "reviewBody": "Simply fantastic! Made it for Iftar (meal to break the fast in Ramadan) and my entire family loved it (from the 6-year-old to my picky husband). Leftovers also delish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathleen Doyle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5181021/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-13T20:22:54.283Z",
                "reviewBody": "LOVE LOVE LOVE!!! We didn't change a thing! The dough is awesome - just make sure you roll it out really thin! The Turkish we know used to spread out the sauce and meat separate... i might do it that way next time! Thanks for sharing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mel81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6647578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-17T04:26:23.367Z",
                "reviewBody": "Excellent dish! The only down side is the large amount time it takes to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelltrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kelltrick/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-11T18:28:16.527Z",
                "reviewBody": "i made it for my husband who was stationed in Turkey and he loved it thank you for sharing this",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jasmine Scott-Cochran",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3901398/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-21T22:54:21.647Z",
                "reviewBody": "If this had taken less time I would have given it 4 stars but in the end it just wasn't worth it to me. The main complication with this recipe is that if you have a large family you are stuck cooking the entire time while they are eating (because at least in my oven I could only bake 2 at a time) and are left by yourself to eat - after all those hours that you spent preparing this! The bread was delicious and the meat filling was good. My kids all loved it even the garlic yogurt sauce; my husband and I thought it was better than ok but not excellent. Just my two cents!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "suerte126",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7840274/"
                }
            }
        ]
    }
]