[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1254/desserts/fruit-desserts/apple-desserts/",
                    "name": "Apple Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216021/apple-crisp-cups/",
        "name": "Apple Crisp Cups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F490285.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:43:37.000Z",
        "description": "A yummy one-biter! Whenever I ask 'what can I bring?' these top the list!  Sweet cinnamon-scented apples held in a buttery crispy oatmeal cup and  crunchy sweet topping. I like to make sweet treats to share with friends. I came up with this recipe so that I could bake and take apple crisp to share easily with everyone.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 dozen apple crisp cups",
        "recipeIngredient": [
            "3 large McIntosh apples - peeled, cored, and chopped",
            "¼ cup water",
            "2 tablespoons white sugar",
            "½ teaspoon ground cinnamon, or to taste",
            "2 cups all-purpose flour",
            "2 cups rolled oats",
            "1 ½ cups brown sugar",
            "1 teaspoon ground cinnamon",
            "½ teaspoon ground nutmeg",
            "1 ½ cups butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease 4 12-cup mini-muffin tins.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix apples, water, white sugar, and 1/2 teaspoon of cinnamon together in a saucepan, and bring to a simmer over medium-low heat, stirring occasionally. Simmer until apples are partially cooked, about 5 minutes; remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine flour, oats, brown sugar, 1 teaspoon of cinnamon, and nutmeg in a large bowl; cut the butter into the flour mixture with a pastry cutter until the mixture looks like coarse crumbs. Place a heaping tablespoon of the crust mixture into a mini muffin cup, and press it into the cup so that it covers the bottom and pushes up the sides of the cup. Make the crust go all the way to the top of the little muffin cup, and patch any holes with more crust mixture. There will be crust mixture left over. Place about 2 teaspoons of apple filling in the crust. Sprinkle about 1 teaspoon of the remaining crust mixture on the filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown, 15 to 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Apple Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "debbie eckstein"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.376984126984127,
            "ratingCount": 252,
            "itemReviewed": "Apple Crisp Cups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "109.1 calories",
            "carbohydrateContent": "13.1 g",
            "cholesterolContent": "15.3 mg",
            "fatContent": "6.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "42.6 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-11T19:08:37.077Z",
                "reviewBody": "hello. i'm the submitter of this recipe. i forgot to add an important side note to this recipe. if i have apple juice on hand, i'll use it in place of the water. i find that it adds another layer of flavour and sweetness to the apples.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "debbie eckstein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2175240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-20T17:34:02.367Z",
                "reviewBody": "REALLY awesome! I only had honeycrisp apples on hand and those worked beautifully. It IS a bit labor intensive, pressing the crust into all those little tins, but so worth it in the end.   Tip on making the crust easier - cube your cold butter up and put it in the freezer. Put all of the crust mixture except the oats into your food processor, then add the frozen butter. Pulse until resembles coarse crumbs. Transfer to a big bowl and then mix in the oats. MUCH faster than cutting it in and distributes beautifully.   I made these exactly as described but did add a little vanilla to the apples. Very delicious. Took longer than stated to cook, about 30 minutes. Ultimately I put the broiler on to brown the tops better. I will make these often in the fall. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheri Sellars",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5020175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-25T16:37:54.41Z",
                "reviewBody": "These are delicious! I have become a HUGE fan of these little treats. They are the perfect little dessert! I have made these many times since I discovered this recipe. The thing that makes it so perfect is that you can make the crisp part and the filling part ahead of time and refrigerate it.  Put together the cups and filling just before you need them. Bake them as directed. However, the *best* thing is that you can actually make them, bake them and then freeze them. They are actually *perfect* this way and taste exactly the same as freshly baked and cooled.  Pop them out on the counter just a little while before a party or guests coming. I keep them in the freezer now because you can actually defrost them in the microwave, too, in just a few seconds. They are great to have on hand. I do cut down on the butter by about 1/3, but other than that these are the absolutely perfect little treat.  Thanks, Weeble!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MomTo6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/momto6/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T16:55:58.11Z",
                "reviewBody": "Excellent, Weeble; thanks!  Used apple cider in place of water.  Sliced butter and put in freezer for 20 minutes; placed all dough ingredients in food processor, zapped twice to distribute evenly, then added frozen butter and used one-minute pulses until pea sized.  Quartered dough, left 3 portions in fridge while working first batch.  GOOD IDEA:  I used pestle (from mortar and pestle set) to press dough neatly to fit mini tin muffin pan.  Am using leftover crust for toppings on any baked apples, pears, or other fruit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Poppajohn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2018213/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T21:38:38.543Z",
                "reviewBody": "This is a wonderful crisp recipe and a clever idea!  The recipe, followed as written, did give me some trouble though. I just could not get the crust to the proper consistency for pressing in the pans by hand, so I put it through my food processor and pulsed until it started to clump. If you don't have a processor, then I would recommend softening your butter to at least room temperature before cutting in. I might even try that next time, as it was a fiddle trying to get that much volume of crust through my processor (I did it in two batches ~ I also might reduce the crust mixture next time as I had one cup left over after the final topping). I ended up short of apple filling by one whole pan, so it might be helpful to know how many cups are needed for the recipe instead of number of apples. Chopped pecans would be a wonderful addition to the topping. Thank you for sharing the recipe with us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T21:26:42.033Z",
                "reviewBody": "I made these before they got published so I thought I would transfer my review over: These are awesome Weeble! Let me start by saying I didn't quite follow the recipe. I halved it thinking I don't have that many pans. Not realizing it was mini muffins. So I made big ones! I am trying to use apples out of the freezer so I had already cooked them in the microwave. I just add butter sugar brown sugar apple pie spice and cinnamon after draining some of the water off. That was when I remembered your recipe so I used the crust part. I realized they were supposed to be mini's when I tried to take them out of the pan LOL! That would work much better holding together but I got them cooled enough put a cookie sheet over the pan flipped them out and they held together. Tastes so good!I'll do the mini crisps next time I still have more apples! Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-22T20:59:57.287Z",
                "reviewBody": "Sorry the entire time I'm following the recipe I did't agree with two things. 1. the amount of butter is waaay to much. I didn't like the greasy feeling when eating them. 2. Cooking the apples prior to putting them in the oven only makes the apples mushy. Even thought I disagreed with these steps I made it as directed and disliked the outcome. If I remake these I will cut the butter in half and not cook the apples prior to putting them in the oven. Not my favorite",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefReigns",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5321214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-20T17:34:02.423Z",
                "reviewBody": "TASTY! I used a mix of granny smith honey crisp and Jonathan apples. Just because I had them on hand. I found cutting in the butter was easier using two butter knives. I think I'll try a food processor next time to save time. I ran out of the apple mix after filling about 40. I filled the rest with some canned peaches and they were also very tasty. My 13yo daughter liked the ones filled with peaches better then the apple. So if you run out of the apple mix try the peaches or what ever else you might have in the cabinets. The cooking time was right on for me about 18 min.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3265336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-15T22:13:54.05Z",
                "reviewBody": "These are just the cutest, tastiest little things!  Keeping a mental note about having extra crust, I reduced the flour and oats to 1 1/2 cups, brown sugar to 1 cup and butter to 1 cup.  As it turned out, I only had enough apple mixture from 3 apples to fill 2 dozen mini-muffin tins and still had crust leftover (no worries - I'll keep it in the fridge and use to fill baked apples at some point).  These are adorable and delicious and easy - I was afraid they would stick to the pan, but no! No trouble at all removing them! They're wonderful - thanks weeble!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            }
        ]
    }
]