[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216059/kelsandras-pumpkin-cinnamon-rolls/",
        "name": "Kelsandra's Pumpkin Cinnamon Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F724534.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2020-06-19T03:43:38.000Z",
        "description": "I made these up for a friend who loves pumpkin. I looked at a few pumpkin pie recipes and tried to include some of the same ingredients. Here is the delicious result.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "12 pumpkin rolls",
        "recipeIngredient": [
            "¼ cup warm water (100 degrees F/38 degrees C)",
            "1 (.25 ounce) package active dry yeast",
            "1 (5 ounce) can evaporated milk",
            "¾ cup white sugar",
            "1 (15 ounce) can pumpkin",
            "3 tablespoons olive oil",
            "1 egg, beaten",
            "2 teaspoons pumpkin pie spice",
            "5 cups all-purpose flour, or more if needed",
            "¼ cup melted butter",
            "1 ¼ cups brown sugar, packed",
            "2 tablespoons pumpkin pie spice",
            "½ teaspoon vanilla extract",
            "1 (3 ounce) package cream cheese, softened",
            "2 tablespoons butter, melted",
            "1 cup confectioners' sugar",
            "¼ cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the warm water into a large mixing bowl, and sprinkle yeast over the water. Allow to stand until the yeast begins to form a creamy foam, 5 to 10 minutes. Stir in evaporated milk, white sugar, pumpkin, olive oil, and egg. Mix until thoroughly combined. Mix in 2 teaspoons of pumpkin pie spice, then add about 5 cups of flour, or as needed to make a stiff dough. Turn the dough out onto a floured work surface, and knead until smooth and elastic, about 8 minutes. Dough will be slightly sticky. Form the dough into a ball, place into an oiled bowl, cover with a cloth, and let rise in a warm place for about 45 minutes. (The dough will rise, but it won't double.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, and roll it out to a rectangle shape on a floured work surface until it measures about 18 inches wide and 26 inches long. Brush the dough with 1/4 cup melted butter. Mix the brown sugar with 2 tablespoons of pumpkin pie spice in a small bowl, and sprinkle the mixture evenly over the dough. Roll up the dough the long way, and pinch the seam closed, then cut the dough into 12 equal-sized pieces with a sharp knife. Lay the rolls into the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until lightly golden brown, 30 to 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the rolls are baking, mix vanilla extract, cream cheese, 2 tablespoons of melted butter, confectioners' sugar, and milk together to make a glaze. Spread the glaze over the rolls as soon as they come out of the oven.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "dpht3"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.051546391752577,
            "ratingCount": 97,
            "itemReviewed": "Kelsandra's Pumpkin Cinnamon Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "513.7 calories",
            "carbohydrateContent": "90.7 g",
            "cholesterolContent": "42.3 mg",
            "fatContent": "13.8 g",
            "fiberContent": "2.7 g",
            "proteinContent": "8.2 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "176.4 mg",
            "sugarContent": "47.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-15T00:00:19.82Z",
                "reviewBody": "This is an outstanding cinnamon roll recipe. I highly recommend this one. I followed the recipe just as it's written with the exception of two minor additions and one omission: I added raisins to the filling and a teaspoon of orange zest to the icing. I left the milk out of the glaze as we preferred to keep it thick like a typical cream cheese icing but don't omit it if you are looking for more of a glaze than an 'icing'. The rolls were tender and chewy with wonderful flavor. Well done on this spectacular recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T22:43:28.297Z",
                "reviewBody": "After looking over this recipe and reading it's reviews I decided I was feeling adventurous enough to take it on. This is certainly not a typical cinnamon roll recipe from the ingredients right down to the rising pattern so I knew that deferring specifically to how it's written would be my first step. I made sure not to use fat free evaporated milk and I used olive oil not vegetable oil. Olive oil in baking often produces wonderful results I have found. I did not find the need to add extra flour. 5 cups was perfect. I've no doubt adding extra flour would have affected my results. Note that I missed the 'cook's note' at the bottom of the recipe upon first review so popped the buns straight into the oven. I must say we enjoyed the results finding the rolls moist and delightfully flavored. The most remarkable thing about this recipe is how moist and delicious the buns were still a few days later (only two of us in the household). A typical cinnamon roll will only last a day before becoming stale. What a delightful surprise this recipe was.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Happybaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4816517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-14T19:17:21.223Z",
                "reviewBody": "We enjoyed these, but I did feel they were missing something. I think chopped pecans would be a wonderful addition to the filling. I expected more pumpkin flavor with this recipe, but enjoyed the flavor as made. The dough was extremely soft and sticky, requiring an additional cup or so of flour to make a workable dough. I used my Kitchen Aid mixer to make the dough. I did make 16 rolls rather than 12, and baked the extra four in a small casserole dish. My coworkers loved this recipe. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-22T21:38:47.11Z",
                "reviewBody": "These were good cinnamon rolls although I felt I tasted more of the spices rather than the pumpkin (ginger and cloves especially). I prefer 'regular' cinnamon rolls - but these ARE fun for the season. One note - only in the footnotes does it say anything about letting the form rolls raise in the pan. I highly suggest you do thisa as it makes the rolls lighter and fluffier and that's how they should be. Allowing a yeast dough to rise in a pan once formed is a given. Because this recipe stated to bake them right after forming I DID try that and the taste was fine but the rolls were heavy and dense. I then made a second batch allowing them to rise in the pan for 30 mins before baking and the not only was the texture much better and lighter but they were much prettier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "minnersmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4270173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T16:59:59.43Z",
                "reviewBody": "Holy cow these were so yummy! I used half whole wheat flour just because that's what I had on hand and they were still moist and light. The dough WAS very sticky and required more flour than the recipe called for (at least an extra 1/2 c) but made for a very soft dough. Glad I added the raisins and walnuts as they definitely made these rolls amazing. I also halved the liquid in the frosting which turned out more like frosting and not like glaze. Will definitely make these again. Oh and the super picky kids gobbled these faster than I did!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara Thomas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1153592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T17:41:53.747Z",
                "reviewBody": "Very good Recipe the dough is moist. I added my own Spice Cinnamon Allspice Cloves & nutmeg. I made texas Pumpkin Cinnamon Rolls",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "frankaff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3965716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T21:51:18.293Z",
                "reviewBody": "I did not care for this recipe as written. I had to add an extra 2 cups of flour which is almost 50% more than the recipe calls for. (Looks like other reviews have had the same problem.) That s a lot of flour to pack into 12 rolls and it makes for a dense heavy roll. I let the rolls raise a second time in the pan before baking in hopes of getting a lighter roll. They were good fresh out of the oven but once they cooled we did not care for the texture at all. I made extra frosting by using an 8oz pkg of cream cheese and adjusted accordingly. We used every bit of the frosting and also topped some with pecans which was a great added improvement. Given the fact that this recipe ends up using 7c. of flour I think they would be a lot better if you used 2 pkgs of yeast and divided them into 24 rolls (2 13x9 pans).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DIZ&#9829;",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/diz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-25T18:09:34.63Z",
                "reviewBody": "This recipe has left much to be desired. The cinnamon rolls texture wise were good but the flavor was a big miss. For some reason pumpkin mixed with yeast has a very odd flavor that just isn't very good. I was hoping for something a little closer to pumpkin bread but it just wasn't so. Bye the way the recipe doesn't mention to let the cinnamon rolls raise again after you shape and cut them. This is a very general step in most recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "M4PERKINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-01T15:58:26.777Z",
                "reviewBody": "Not for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1500466/"
                }
            }
        ]
    }
]