[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/818/desserts/pies/pie-crusts/",
                    "name": "Pie Crusts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17716/desserts/pies/pie-crusts/pastry-crusts/",
                    "name": "Pastry Crusts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216143/gluten-free-pastry/",
        "name": "Gluten Free Pastry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5838626.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2020-06-19T03:43:40.000Z",
        "description": "A friend of mine is celiac, so I had to find a recipe that would work for beef Wellingtons... BINGO!!! This is perfect, and soooooo easy to make!",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT0H10M",
        "recipeYield": "1 pie crust",
        "recipeIngredient": [
            "1 cup rice flour",
            "1 tablespoon white sugar",
            "½ teaspoon salt",
            "¼ teaspoon baking powder",
            "⅓ cup vegetable shortening",
            "3 tablespoons cold water",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk the rice flour, sugar, salt, and baking powder together in a bowl. Work in the shortening until the mixture resembles sand. Stir in the water and vanilla extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake as directed in your recipe, or at 375 degrees F (190 degrees C) for 5 minutes until golden.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Pie Crusts",
            "Pastry Crusts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BriannaH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.166666666666667,
            "ratingCount": 36,
            "itemReviewed": "Gluten Free Pastry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "154.7 calories",
            "carbohydrateContent": "17.5 g",
            "cholesterolContent": null,
            "fatContent": "8.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "160.8 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-10-25T03:04:23.56Z",
                "reviewBody": "A couple things: If you plan to make a full pie with this recipe you will need to triple it for a 9 inch pie pan in order to have enough for the top and bottom of the pie.  Also, once you make the dough put it in the freezer for a bit to make it easier to roll out.  Roll it onto parchment paper then freeze it again.  Otherwise it is impossible to keep it together enough to make a pie.  Great recipe though besides those notes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sherberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6758188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-09T19:25:22.28Z",
                "reviewBody": "I used this recipe but added one part rice flour to one part \"Bob's Red Mill, Gluten free all purpose flour.\" It turned out perfect! Thank you for sharing. I doubled it for a nine inch pecan/chocolate pie. I will use it again and again most definately.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2386684/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-03T04:05:38.22Z",
                "reviewBody": "I've been experimenting with gluten-free recipes to be able to make meals for some of my gluten-free friends. Because I was using this recipe as a pie crust for a chicken pot pie, I omitted the vanilla extract and subbed butter for the shortening since it was what I had on hand. It had trouble rolling it out and transferring it to my pie tin- the bottom crust was easily remedied as I just pressed it into the pan with my fingers... the top crust not so much. It worked well enough for my purposes though- even my non-gluten-free family liked it! I plan on using it as a base for additional recipes. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "EBOOKOUT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ebookout/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-28T00:51:54.507Z",
                "reviewBody": "My daughter did not like this. Using only rice flour made it grainy. Next time I'll use a mixture of tapioca flour and maybe sorghum. I'll have to tweak it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather L Muehleisen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3360999/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-28T22:21:07.713Z",
                "reviewBody": "Best pie crust I've ever made out of gluten free ingredients! This is one recipe where you can really benefit from reading all the reviews because many were quite helpful. I tripled the recipe for a double-crust pie. Knowing in advance that the crust was hard to keep together (thanks to the reviews), I pat the bottom into place, and tried (successfully) to roll out the top crust between 2 sheets of wax paper, keeping the outer side \"papered\" until after I positioned the crust. I also supplemented the rice flour with some tapioca flour to help smooth out some of the \"grainy\" texture. I also omitted the vanilla so I could use the crust to make a Chicken Pot Pie from this site. I'll be going to this pastry recipe all the time now!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Creative Chris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3768725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-12T06:56:27.463Z",
                "reviewBody": "For baking I mix 4 cups white rice flour, 1 cup each brown rice and sweet rice flour, 3 cups potato starch with 2tsp guar gum per 3 cups of flour mix.  I used a cup of that mix for this recipe and it worked great!  My kids have only eaten pies twice in their lives and loved this.  I cooked one apple pie with top and bottom pastry and sugar on the top crust, and one French style tart with a layer of apple puree, thinly sliced apples and warmed apricot jam brushed on top. Both were good.  I think I would add more vanilla and maybe some cinnamon to this for a sweet crust because I have to bake dairy free, and the olive oil margarine was a little strong.  Lovely short crust texture though, best GF pastry I have made. I chilled the pastry for 1/2 hour before rolling, and rolled it out between two layers of baking paper so it didn't stick. I didn't time them but I think it it took about 20-25 minutes to cook the pies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kiwicat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9757513/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-29T02:15:30.617Z",
                "reviewBody": "Best GF crust--and by far the easiest one--I've ever tried! I used a home made mix of brown rice flour tapioca starch and potato flour for the 1c rice flour and I used Spectrum palm oil shortening. As per other reviews I made a triple batch to make a two-crust pie but it was too much I put a third of it in the freezer for another time. Must roll between waxed or parchment paper and fridge or freeze it for a while to prevent tearing when putting in the pie pan. Also added cinnamon to the crust as I was making an apple pie and when I put the top crust on I sealed it and brushed the top with melted coconut oil and sprinkled cinnamon & sugar on it. Would've loved to add nutmeg but didn't have it. Next time I will add nutmeg to the crust and a little extra vanilla. But it's a nice flaky crust and my husband really liked it! And I've tried several pies that he said were \"fine\" but he's told me 3 times tonight that it was really good:) Thanks for the recipe! Can't wait to try a pot pie or wellington!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa O'Keefe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4499262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-03T15:49:34.75Z",
                "reviewBody": "I took the advice of using 1 part Bob's Red Mill All Purpose Baking Mix and 1 Part Rice flour. I also did 1 1/2 times the recipe to make sure I'd have enough for a bottom crust (I did and only a little extra to spare for a 9\" plate). I did not chill it but did roll it out between two pieces of waxed paper and then transferred it to the pie dish. It reminded me of a graham cracker crust and was a bit crumbly after baking but had a good taste. I wouldn't hesitate to use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenelle D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/513916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-29T01:27:37.38Z",
                "reviewBody": "I found this recipe in a pinch last night as I was making my Thanksgiving pies and realized I underestimated my gluten free dough quantity and didn't get enough of the premade dough from the store. This recipe was very easy to make. I did substitute the rice flour with an all purpose flour that I mix myself using brown rice flour, sweet sorgum flour, tapioca flour and xanthum gum. This flour mixture makes a very good all purpose gluten free flour that I can use for both sweet and savory dishes and is cost effective enough I can always have plenty on hand. With this recipe I did have double it to have enough dough for a bigger crust for a large pie pan. I also needed to add a little more flour than called for as it was too sticky when mixed. I did read all the reviews first, noting that it seemed to be easier to work with if refrigerated first. Because it was late and I didn't have the extra time to refrigerate it, I simply rolled it out between two pieces of wax paper. It rolled very nicely and I was able to turn it into my pie pan by setting the pie pan upside down on it after taking off the top layer of wax paper and, using the bottom piece of wax paper, carefully turn the whole thing over. Doing it this way prevented the dough from breaking apart while turning into the pan. I then finished making my pumpkin pie according to the recipe. This pie came out perfectly and was definitely a favorite today. I will use this recipe from now on as my staple GF pie dough recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julsanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12507397/"
                }
            }
        ]
    }
]