[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/377/desserts/cakes/cupcakes/",
                    "name": "Cupcake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16373/desserts/cakes/cupcakes/holiday/",
                    "name": "Holiday",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216230/bloody-broken-glass-cupcakes/",
        "name": "Bloody Broken Glass Cupcakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1060174.jpg",
            "width": 2400,
            "height": 3000
        },
        "datePublished": "2020-06-19T03:43:43.000Z",
        "description": "I made made these cupcakes for my nephew's birthday and they turned out so creepy that I thought I would share them here for Halloween.  I tried out a few different methods for sugar glass and included the method which produced the clearest glass for me.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "24 cupcakes",
        "recipeIngredient": [
            "1 (18.25 ounce) package white cake mix",
            "1 cup water",
            "⅓ cup vegetable oil",
            "3 eggs",
            "1 (16 ounce) can white frosting",
            "2 cups water",
            "1 cup light corn syrup",
            "3 ½ cups white sugar",
            "¼ teaspoon cream of tartar",
            "½ cup light corn syrup",
            "1 tablespoon cornstarch",
            "¼ cup water, or more as needed",
            "15 drops red food coloring",
            "3 drops blue food coloring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Line 2, 12-cupcake tins with paper cupcake liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend cake mix, 1 cup water, vegetable oil, and eggs in a large bowl.  Beat with a mixer on low speed for 2 minutes.  Divide cake batter between lined cupcake tins.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cupcakes in preheated oven until a toothpick inserted in the center comes out clean, 18 to 22 minutes. Cool completely.  Frost cupcakes with white frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make the sugar glass.  Mix 2 cups water, 1 cup corn syrup, white sugar, and cream of tartar in a large saucepan; bring to a boil.  Use a candy thermometer and boil sugar syrup until temperature reaches 300 degrees (hard ball), stirring constantly. The mixture will thicken as water evaporates.  When sugar reaches 300 degrees, quickly pour onto a metal baking pan. Cool until completely hardened.  Break into \"shards\" using a meat mallet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make the edible blood.  Mix together 1/2 cup corn syrup and cornstarch in a large bowl. Slowly stir in the 1/4 cup of water, adding more if necessary, until the corn syrup mixture has thickened to the consistency of blood. Stir in the red and blue food coloring.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stab each frosted cupcake with a few shards of broken sugar glass. Drizzle on drops of \"blood\" to complete the effect.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cupcake Recipes",
            "Holiday"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jai"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.402061855670103,
            "ratingCount": 97,
            "itemReviewed": "Bloody Broken Glass Cupcakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "376.7 calories",
            "carbohydrateContent": "74.6 g",
            "cholesterolContent": "23.3 mg",
            "fatContent": "9 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "198.2 mg",
            "sugarContent": "58.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-10-31T22:19:26.327Z",
                "reviewBody": "For people who are having problems with the glass, it's very important you have a candy thermometer.  The sugar should be cooked on low, cooking it too fast or too hot will cause it to carmelize.  I start on low and ramp it up to nearly medium over the course of an hour and my glass comes out nice and clear.  It's a time commitment, but there's really no way to rush sugar.  This a fun recipe that will get you kudos every time though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6423769/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T18:04:39.523Z",
                "reviewBody": "I made these cupcakes for a bad Horror movie party I went to with friends. I thought this just fit the theme of bloody and ridiculous! I varied the cupcakes however:  after I baked them, I cut cone shaped holes and filled them with cherry pie filling. I placed the little topper back on and iced the top of the cupcake. This made it so when you bit into the cupcake, it was also \"bleeding\" and blood filled. The cherry and dark chocolate flavor goes together well!\n\nThe hardest part is making the \"glass\", which I had nooo experience with that type of cooking. After spending a long time at the stove (I also didn't have a candy thermometer) I was able to get the sugar mixture the right consistency. The glass effect is really creative!\n\nAlso I had a hard time making the \"blood\" sauce the right consistency, so I just used red gel icing.\n\nI loved this recipe and enjoy the odd side of cupcake making ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Maureen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6453810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-01T11:19:01.137Z",
                "reviewBody": "Five stars for presentation!  Excellent for Halloween!  I made Devil's food cupcakes from a mix and topped them with vanilla frosting.  Only used this recipe for the glass and blood.  The glass recipe is fantastic - don't change a thing!  Boiled the mixture to 300* and poured it in a parchment lined jelly roll pan which ended up making the glass the perfect thickness.  Let it cool, removed from the pan, covered with another piece of parchment and hit it with a hammer.  It shattered like real glass!!  As for the blood, I did not add any water at all and I'm glad I didn't as I think it would have been way too watery.  The consistency is perfect without water.  Also, only used one drop of blue color.  For 12 cupcakes, I'll cut the glass and blood recipes in half next year as I have alot leftover.  Update:  Store in refrigerator. Otherwise, glass melts overnight and no longer looks good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alwayshungrygirl/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-06T18:55:20.987Z",
                "reviewBody": "These were really neat. I admit I used a homemade yellow cake and white icing. However I did follow the instructions for the glass and blood. The fake blood was very quick and super easy to make. I liked how it had a realistic blood color. Make sure to have a red food coloring with a topper that will allow drops of the color. Mine was a large bottle and I had to guess. Luckily I got it right. For the glass I would seriously make it the day before and just leave the pieces separted on the sheet pan on the counter. It takes a long time to try to make the same day. The fake blood also thickens up nicely if it is put in the fridge overnight anyhow. To make the glass candy a very reliable thermometer is neccessary. I also highly suggest a large sheet pan with a silpat that fits. The liquid glass will not stick to the silpat sheet and will peel off. It took I would guess 30-45 minutes to reach 300 deg. I didn't time it but it seemed about that long. I started it on medium and slowly moved it up to a temperature of 8. Splattering sugar is very hot so I did it more slowly. It will take a couple of hours at least to fully harden too. It broke real easy with a hammer. If I made them again I might divide the sugar liquid. It is real thick about 1/4\" at least. It has to be sucked on like a lollipop it can't be bitten at that thickness. Either way I thought the affect looked rather real. TY",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-12T14:08:49.753Z",
                "reviewBody": "This is an awesome idea and so much easier than it looks. I halved the sugar glass recipe and added 1/2 tsp of almond extract before pouring it in the cake pan. Also if you dont have a meat mallet a can of veggies works just as well. Just put the can in a plastic bag and hit the candy with the rim.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nesrien O'Dowd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3820922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-10T15:05:13.947Z",
                "reviewBody": "Great recipe! Only wish I had read the reviews to go low and slow when making the glass instead of high and fast. My glass came out a little amber in color but still worked. I filled the cupcakes with cherry pie filling and used the filling syrup for blood instead of the corn syrup mixture. They were a huge hit for our Halloween party and will defintely make again they are delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MammaBrown317",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7153589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-03T02:41:32.847Z",
                "reviewBody": "I am just begining to learn to cook and I bought a candy thermometer just for this recipe. When I made the glass it turned out perfect but I had way too much left over. So I cut the recipe in half and poured it in the center of the pan in an oval shape. It gave me more presentable \"shards\". And I tried making the blood 5 or 6 times and it never came out to the right color or consistency. It just wouldnt stick to the glass as it ran down and it did turn out too dark or even purple. I found the best thing was to just drop the red food coloring right on the glass it it comes out perfect! Instead of cupcakes I used frosten brownies and everyone liked them so much more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ducky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7993727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-21T18:07:47.473Z",
                "reviewBody": "5 stars for presentation. But it was a giant pain in the butt. I made the chocolate surprise cupcakes from this site (which are 5 stars) and used canned vanilla frosting to frost them. The glass took over an hour and a half and I ended up having to speed it up because I was running out of time (resulting in slightly brown tinted glass which is my fault not the recipes. Will not go through the effort again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "HISTORYGIRL04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/973112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T23:56:17.35Z",
                "reviewBody": "my 9 yr old can't wait for halloween to come around again so she can take these to school:) I only wish I had found them a few months ago! Thanks so much for the inspiration and recipe. I've tried out the glass already and it turned out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lmh1632",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5024806/"
                }
            }
        ]
    }
]