[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15510/bread/yeast-bread/egg/",
                    "name": "Egg",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216890/cheese-babka/",
        "name": "Cheese Babka",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3288738.jpg",
            "width": 5312,
            "height": 2988
        },
        "datePublished": "2020-06-19T03:44:10.000Z",
        "description": "Polish cheese babka like my grandmother served every Easter.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT6H40M",
        "recipeYield": "1 Bundt-shaped loaf",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "1 pinch white sugar",
            "¼ cup warm water (110 degrees F/45 degrees C)",
            "½ cup butter, melted",
            "¼ cup white sugar",
            "1 ½ teaspoons salt",
            "2 teaspoons vanilla extract",
            "¾ cup lukewarm milk",
            "3 eggs",
            "4 cups all-purpose flour, divided",
            "1 ½ cups farmers cheese",
            "⅓ cup white sugar",
            "1 ½ tablespoons sour cream",
            "1 egg",
            "1 teaspoon vanilla extract",
            "½ teaspoon dried lemon peel",
            "2 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle the yeast and the pinch of sugar over the warm water; stir to dissolve. Let stand until foamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the 1/2 cup butter, 1/4 cup sugar, salt, 2 teaspoons of vanilla, milk, and 3 eggs in a bowl with 1 cup of flour and mix well. Add the yeast mixture and beat for 1 minute. Gradually add the remaining flour to form a soft dough. Turn the dough onto a lightly floured surface and knead until smooth and elastic, adding small amounts of flour as necessary to prevent sticking. Shape the dough into a round, and place it in a greased bowl, turning to coat. Cover with plastic wrap and let the dough rise at room temperature until doubled in size, about 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat together the farmers' cheese, 1/3 cup sugar, sour cream, 1 egg, 1 teaspoon vanilla extract, and dried lemon peel in a bowl until smooth. Set the filling aside. Lightly oil a 10-inch fluted tube pan (such as a Bundt&reg;).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough onto a lightly floured surface and pat into a 10-inch by 12-inch rectangle. Brush the dough with the 2 tablespoons of melted butter. Spread the cheese filling evenly over the dough. Roll the dough up like a jelly roll, starting from the long end; twist the dough 6 to 8 times to form a rope. Pinch the seams and ends closed and arrange the rope of dough in the greased pan. Cover loosely and let rise 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the babka until deep golden brown, 40 to 45 minutes. Remove from oven and let stand for 5 minutes; invert the babka onto a wire rack and remove the pan. Allow the babka to cool for at least 2 hours before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Egg"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KRISTINALANGER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.811320754716981,
            "ratingCount": 53,
            "itemReviewed": "Cheese Babka",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "512.7 calories",
            "carbohydrateContent": "44 g",
            "cholesterolContent": "133.9 mg",
            "fatContent": "28.2 g",
            "fiberContent": "1.3 g",
            "proteinContent": "19.1 g",
            "saturatedFatContent": "19 g",
            "servingSize": null,
            "sodiumContent": "768.6 mg",
            "sugarContent": "10.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-11T17:38:58.04Z",
                "reviewBody": "The smell of this baking is enough to drive you crazy.  So delicious.   I will say - be patient with the rising times - mine took much longer than stated - but that might have been that it was pretty chilly here.  I also used the zest of one fresh lemon - I had no dried.  I am not Polish and I had never made a Babka before - this will be the start of a whole new tradition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-16T16:18:43.43Z",
                "reviewBody": "I reviewed this recipe on March 30, but decided to update the review after making it several times and each time it gets better than the last.  Doubt it is as authentic, but it is sure scrumptious.  We have now become Cheese Bapka addicts, thanks to this wonderful recipe, and no longer have to order it from New York.  \n\nWe incorporated the following changes to the recipe and it is right on the mark for us and is picture perfect, like Kristina’s photograph. \nAs others have indicated, dough is a bit sticky and we added about ¾ cup of flour.  We added additional vanilla to the dough and also the filling.  We rolled the dough out on a huge cutting board covered with parchment paper which made the dough much easier to roll.   We used cream cheese, instead of Farmer’s Cheese (as suggested by one reviewer), and it was just as good or better.  We also did not spread the cheese mixture all the way to the other end and the mixture stayed contained in the dough and spread throughout to the end when rolling it.  Next, we did not twist the dough and none of the cheese leaked out to the side of the pan during cooking time.   We baked for 30 minutes perfect; moist and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATHEFLIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-06T03:04:01.933Z",
                "reviewBody": "After searching for a cheese babka for Easter and finding that all the stores and bakeries were out of them, we decided to make this on Easter Eve!  My husband put all of the dough ingredients into the bread machine and ran it on the dough cycle while I was at work.  When I got home, I removed the dough and got started.  The dough was very sticky, so I would probably add some additional flour next time.  For the filling, I subbed cream cheese for the farmers cheese and I also didn't need the whole 2 tbl. of melted butter, but otherwise I followed the recipe and it came out fabulous.  On Easter, my family all said they hoped I would make it every year and never buy one again.  This definitely was equal or better than any babka we've purchased...even from the Polish bakery.  It wasn't too difficult to make and was so worth it.  Thanks for sharing the recipe.  It will now be a family Easter tradition for us. (Mine came out a little dark.  My oven runs low, so I upped the temp to 375.  Next time, I'll leave it at 350 and I think it'll be perfect.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Monahan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/107905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-24T19:20:36.447Z",
                "reviewBody": "I love this Babka.. I am Ukrainian and it is a staple at holidays.  I even made my own farmers cheese (also a recipe I found on this site...thanks!) and it turned out delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ukiemomma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1346645/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T00:43:57.2Z",
                "reviewBody": "My dear 91 year old mother in law from Slovakia used to make this but never wanted to share her recipe.  I recognized the ingredients and made it.  It was easy to do and tasted absolutely delicious, just like she used to make.  So good on Easter Sunday with ham and easter eggs. Thanks for sharing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marilyn Pilip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6962510/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-11T18:43:00.777Z",
                "reviewBody": "This was a beautiful bread. The top side was even more gorgeous than the bundt side. The dough was very sticky - I had to add another cup of flour before and at least one cup during the kneading process (almost 2 more cups than recipe called for). I also had to sub cream cheese for farmer's cheese - my store just didn't have it. The dough was tender and soft and sweet and wonderful. And the house smelled fabulous as well. Great recipe. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandy W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2280046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-02T19:08:54.383Z",
                "reviewBody": "Amazing recipe!  My parents are Polish & Ukranian and both raved that this recipe reminded them of their grandparent's babka.  The bread was extremely moist & flavorful!  I added some raisin as well.  My only problem is that my dough did not rise (double in size as directed) - even after over 2 hours. It still tasted great, but I'd like to see dough rise as it should.  Thanks for posting this awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pma66",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340143/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-25T05:04:55.91Z",
                "reviewBody": "So Moist!! My first time making babka, a little tricky but worth the time and effort...everyone loved it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovinlife!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5659685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-28T22:13:08.583Z",
                "reviewBody": "Being of Polish descent I've made or had a few babkas and this was very good. Earlier I attempted to make my own Farmer's cheese for this from this site but it didn't turn out well at all. So I followed other's advice here and sub'd cream cheese. It worked very well. I just thought that there was TOO MUCH cheese. It's very rich. I would have liked a little more bread. Next time I would halve the filling and I think I would like it better. My oven runs hot and it was ready at 30 min. I know it's a cheese babka but I can see this plain with raisins added or even changing out the filling i.e. prune. Thanks KRISTINALANGER for the great recipe! Smacznego! UPDATE 12/14: I tried this recipe using canned prune filling instead of the cheese and it came out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms Jean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12541024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-02-24T06:02:52.697Z",
                "reviewBody": "I will make this again with ricotta cheese the farmer cheese gave it a funky taste. The dough part was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "venusjones",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17022084/"
                }
            }
        ]
    }
]