[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/706/world-cuisine/european/uk-and-ireland/irish/",
                    "name": "Irish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216924/irish-cream-chocolate-mousse/",
        "name": "Irish Cream Chocolate Mousse",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9063196.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:44:11.000Z",
        "description": "A wonderful light (if slightly alcoholic) mousse that will be sure to end your dinner on the perfect note!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 eggs, separated",
            "½ cup white sugar",
            "1 cup chilled heavy cream",
            "3 ½ tablespoons Irish cream liqueur",
            "8 ounces chocolate, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, beat the egg yolks and sugar with an electric mixer set on medium speed until pale, creamy, and starting to thicken, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With clean beaters, whip the cream in a non-plastic bowl on medium speed until fluffy and the cream forms stiff peaks. Use a rubber spatula or wire whisk to fold 1/3 of the yolk mixture into the whipped cream. Gently run the spatula through the center of the bowl, then around the sides of the bowl, repeating until fully incorporated. Add the remaining yolk mixture and then the Irish cream liqueur, folding just until incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a microwave-safe bowl, heat the chocolate very gently on low power just until melted; stir to dissolve any lumps. Very gently fold the chocolate into the Irish cream mixture as before, keeping as much fluffy volume as possible. With clean beaters, beat the egg whites on medium-high speed in a non-plastic bowl to stiff peaks; gently fold the egg whites into the chocolate mixture until evenly incorporated. Spoon the mousse into individual dessert cups or glasses, and chill for 4 to 6 hours.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "James Innes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2727272727272725,
            "ratingCount": 11,
            "itemReviewed": "Irish Cream Chocolate Mousse",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "486 calories",
            "carbohydrateContent": "46 g",
            "cholesterolContent": "240.3 mg",
            "fatContent": "30.9 g",
            "fiberContent": "2.2 g",
            "proteinContent": "8.7 g",
            "saturatedFatContent": "17.3 g",
            "servingSize": null,
            "sodiumContent": "89.8 mg",
            "sugarContent": "42.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-18T23:00:24.29Z",
                "reviewBody": "No explanation for why this was a total failure for me especially considering the reviewer preceding me had such success. The problem was particularly in the 2nd step - the egg yolk/Irish Cream mixture did not like being folded into the whipped cream - at this point I already knew this had failed. It was soupy and there was no way folding in the chocolate (which didn't EVEN want to incorporate leaving chocolate flecks throughout) or the egg whites was going to remedy that. Unfortunately it was not salvageable. In light of the previous review maybe it was just an \"off\" baking day for me (except that I've made mousse countless times...and \"beat to stiff peaks\"...and \"folded\" one thing into another...etc.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-17T17:29:47.347Z",
                "reviewBody": "This was delicious! I followed the recipe exactly with a few minor changes. (1) I used Nestle's semi-sweet mini chocolate chips and reduced the amount of white sugar to about 1/3 cup. It still very rich and plenty sweet. And (2) I heated the chocolate chips in a double boiler to avoid burning the chocolate (a glass heat-safe bowl holding the chocolate chips set on top of a saucepan with a small amount of simmering water). The mousse was set firmly within 4 hours although it may have set in less time than that since I didn't check on it. Using 6 oz. glass custard cups this recipe makes 8-9 servings. I will absolutely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rachelk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4605802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T18:30:46.663Z",
                "reviewBody": "I found this to be a labor intensive recipe based on the number of items you had to blend separately and then carefully fold together. The hardest was trying to get the chocolate to blend with the yolk/cream mixture. I tried to smooth the chocolate by mixing in some of the cream mixture but it was so thick I felt like it could have used some additional cream in the chocolate to allow it to blend better. While labor intensive the finished product tasted quite Irish Cream wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LizT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4088578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-17T15:06:52.84Z",
                "reviewBody": "My guests raved at an all ladies party! I've never made mousse before and was worried. It was a light mousse with great flavor. Followed the steps exactly but used good quality chocolate chips because that is what I had on hand. I don't often if ever write reviews even though I use the recipes alot but I wanted to let people know this was great and easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1767110/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-02-16T05:27:37.467Z",
                "reviewBody": "I halved the recipe since it was just for my husband and I, and we still ended up with two night's worth of dessert.\n\nWhile the flavor of the mousse was good, I didn't love the consistency. I usually make my chocolate mousse with just egg whites and no cream, so I was excited to see what would happen with richer ingredients.\n\nUnfortunately, the chocolate seized a bit upon adding it to the mix, resulting in a slightly grainy consistency with tiny pockets of chocolate that I didn't really love. Funnily enough, though, my husband thought the consistency was intentional and loved it LOL.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Grocery Addict",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/groceryaddict/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-01T05:06:42.36Z",
                "reviewBody": "This was delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alyson Jay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15756619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-02-28T12:02:29.373Z",
                "reviewBody": "This recipe makes for a tasty mousse but it’s definitely not a beginners recipe. You need to be able to successfully separate egg yolks from whites. Whip whipping cream to stiff peaks because soft peaks won’t work in this. Whip whites until still. Melt chocolate. Be able to fold in the ingredients without losing the fluff. I used a kitchen aid stand mixer for this recipe. I recommend following this recipe in the exact order. The only change I would suggest is to add a tsp of cornstarch to the whipping cream. This will make the whipping cream hold its shape which will end with a fluffier mousse. I melted my chocolate in the microwave at 30 second intervals and stirred in-between. I use a 1000 watt microwave which took 1:30 in total to fully melt. It was likely the brand of semi-sweet chocolate I used but the chocolate would not fully incorporate into my mousse so it had a chip like texture but we liked that. If you make this recipe and can’t get it right, remember there’s a lot that can go wrong and consider this recipe again if it doesn’t turn out. The final result was nice and I would make it again but I would cut the recipe in half and add a tsp of cornstarch to the whipping cream before whipping it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Love2CookMommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/love2cookmommy/"
                }
            }
        ]
    }
]