[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
                    "name": "Fruit Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12954/desserts/pies/fruit-pies/strawberry-pie/",
                    "name": "Strawberry Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216995/buffalochefs-strawberry-rhubarb-pie/",
        "name": "Buffalochef's Strawberry Rhubarb Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1406676.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-06-19T03:44:15.000Z",
        "description": "I make this wonderful pie every Mother's Day when the fresh fruits are coming out.  Don't miss the ginger in this.  It is the 'Secret Ingredient.' I've gotten to where I need to surprise people who don't think they like rhubarb, by not telling them until they are eating it. I've converted several non-rhubarbers into believers.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "½ cup white sugar",
            "½ cup all-purpose flour",
            "1 teaspoon ground cinnamon",
            "¼ cup chilled butter",
            "1 recipe pastry for a 9-inch double crust pie",
            "1 pint fresh strawberries, sliced",
            "¾ pound rhubarb, chopped",
            "1 ⅓ cups white sugar",
            "3 tablespoons minced crystallized ginger",
            "¼ cup all-purpose flour",
            "½ teaspoon freshly grated nutmeg",
            "¼ teaspoon ground cinnamon",
            "⅛ teaspoon salt",
            "3 eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Roll out half the pie crust pastry to a circle about 11 inches in diameter, and fit the crust into a 9-inch pie dish. Place the pie dish onto a rimmed baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk together 1/2 cup of sugar, 1/2 cup of flour, and 1 teaspoon of cinnamon in a bowl. With a pastry cutter, chop in the butter until the topping resembles crumbs; set the topping aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another bowl, stir together the strawberries, rhubarb, 1 1/3 cup of sugar, crystallized ginger, 1/4 cup of flour, nutmeg, 1/4 teaspoon of cinnamon, and salt until thoroughly combined; beat in the eggs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the rest of the pastry out into an 11-inch circle, and cut the crust into 1/2-inch wide strips. Spoon the strawberry-rhubarb filling into the bottom crust, and sprinkle the crumb topping evenly all over the filling. Moisten the rim of the filled bottom crust with a bit of water, and lay the two longest strips in a cross in the middle of the pie. Working from the next longest down to the shortest strips, alternate horizontal and vertical strips, weaving the strips as you go. Press the lattice strips down onto the bottom crust edge to seal, and trim the top crust strips neatly. Press the crust edges with a fork dipped in a little flour to make a crimped edge.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 10 minutes, then reduce heat to 350 degrees C (175 degrees C) until the pie is bubbling, and the crust and crumb topping are lightly browned, 45 to 50 more minutes. Cool pie at least 1 hour before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Fruit Pies",
            "Strawberry Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "buffalochef"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.694444444444445,
            "ratingCount": 36,
            "itemReviewed": "Buffalochef's Strawberry Rhubarb Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "557.4 calories",
            "carbohydrateContent": "83 g",
            "cholesterolContent": "85 mg",
            "fatContent": "23 g",
            "fiberContent": "3.9 g",
            "proteinContent": "7.1 g",
            "saturatedFatContent": "8 g",
            "servingSize": null,
            "sodiumContent": "340.9 mg",
            "sugarContent": "49.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-05-13T05:56:30.563Z",
                "reviewBody": "This was a very delicious pie! I had to make a substitution to accommodate a person who is allergic to strawberries. Instead I used frozen raspberries and was very pleased with that result! Boysenberries would also work nicely with this lovely recipe! I have a funny story to add to this: I had just finished placing the lattice top and fluted the edges of the crust then pondered if I should brush the top with an egg wash. Suddenly it occurred to me that I had forgotten to add the eggs to the fruit mixture! I literally hollered in frustration as I realized the eggs were absolutely necessary and considered the mess of pulling everything apart in order to mix them in! I mentally cast about for a remedy and then remembered my marinade injector syringe! I quickly beat the eggs and then sucked them into the injector! I injected them between the lattice-work and saw the yellow stuff squishing back up...Fortunately it all worked out fine! The pie looked beautiful and no one was the wiser! The moral to the story is: Even when faced with a potential culinary disaster there may be a simple solution right at hand!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Dusky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3353339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-24T13:53:21.437Z",
                "reviewBody": "This was my first attempt at a lattice top pie as well as my first attempt at a strawberry rhubarb pie. The flavors were wonderful but I did run into a few problems. 1) The crust cooks quickly and should have been completely covered with aluminum to prevent it from over cooking. I took the pie out early to prevent burning but then not all of the rhubarb was thoroughly cooked. 2) This is a very runny filling. I will probably add tapioca flour and reduce the number of eggs to 2. Also I think it would be worth letting the fruit sit in the sugar in the fridge overnight and then straining out the excess juice. I will also be adding more fruit as I like my pies bulging with fruity goodness! Thanks for the great inspiration though. The crystalized ginger really makes this pie!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Colie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7236181/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-12T17:00:52.007Z",
                "reviewBody": "Wonderful, wonderful pie!  I love rhubarb (and who doesn't love strawberries?) but have never liked rhubarb/strawberry pie because it always seemed to be made with jello.  So my rhubarb pie is a custard-based pie.  I was excited to find this recipe and half expecting to be disappointed because I WAS so excited to find it, but this did not disappoint in the smallest way.  This is now one of my favorites.  Buffalochef, I have never met you but you are my friend.  Thank you so much for sharing something wonderful with me.  I will look for other recipes you have posted.  Later, GF!  Judith",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GiGi Estrada",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6667085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-24T17:16:45.607Z",
                "reviewBody": "This is my first time to rate a recipe and this one definitely deserves 5 stars all the way! The ginger really adds great flavor so don't skip it I will definitely make this again and again! The only advice is to make sure you put the baking sheet underneath while the pie is baking I put tin foil over a sheet and drippings still overflowed into the bottom of my oven... The pie was so good that the mess was worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6020099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-26T14:40:10.573Z",
                "reviewBody": "This is a beautiful pie - the flavours work really well together. I followed the recipe exactly as written and it turned out perfect. One of my guests a friend for over 40 years said this is the best pie you ever made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Sweetie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7074336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-13T02:17:25.42Z",
                "reviewBody": "Awesome recipe! Ginger adds a great flavor and the pie turned out great. Normally I have trouble with rhubarb pies being runny but this one was perfect! My new go-to receipe for my favorite strawberry-rhubarb pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Morosko Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1165516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-25T01:33:42.24Z",
                "reviewBody": "We thought this was just ok. It didn't have the tartness that we like from rhubarb pie. I did use frozen rhubarb and strawberries so that might be why. Or it could be from the spices egg and lots of sugar. I did a latice top I didn't cover it while baking and it didn't burn. For those that had burning issues it could be your oven is hot. Mine is about 25 degrees hotter than what the dial says. Or it could be the crust I used.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "food friend",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2985575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-16T00:51:59.153Z",
                "reviewBody": "Everyone loved this pie. I recommend lightly beating the eggs before adding them to the mixture. And I'm not sure if it's because I'm in a low elevation or my oven temp is off but it took about 60 min to cook the pie when I turned the heat down to 350 degrees. I used \"Alan's Pie Crust\" recipe for the crust and added rolled oats to the topping just because. Serve it warm with vanilla bean ice cream on the side-delicious!! I needed a recipe that didn't have gelatin as an ingredient and this worked out perfectly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Raine07",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/raine07/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-11T16:49:20.173Z",
                "reviewBody": "I had never heard of a struesel topping being baked beneath a lattice crust. I tried it. Decent.... Now for me here was the kicker. I only allow myself 45 grams of carbohydrates per meal. I had a slice of this pie and had to give up 2 full meals as one slice contained almost 90 grams of carbs. Never again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SoCalguy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bradshaw/"
                }
            }
        ]
    }
]