[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217046/cookie-tulips/",
        "name": "Cookie Tulips",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F667628.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:44:22.000Z",
        "description": "These cookies not only look fancy but they taste amazing too! Super easy to make and will impress the whole family!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 dozen desserts",
        "recipeIngredient": [
            "¼ cup butter, softened",
            "½ cup white sugar",
            "7 tablespoons all-purpose flour",
            "1 teaspoon vanilla extract",
            "2 egg whites, beaten",
            "1 (4 ounce) package cream cheese at room temperature",
            "1 cup confectioners' sugar",
            "1 teaspoon vanilla extract",
            "½ (8 ounce) container frozen whipped topping, thawed",
            "17 large fresh strawberries, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper or a silicone sheet liner. Grease the outsides of 12 2-inch diameter baking glasses or small bowls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mash the butter and white sugar together in a bowl until smooth, and mix in the flour, 1 teaspoon of vanilla extract, and the egg whites to make a smooth batter. Drop about 2 1/2 tablespoons of the mixture onto the prepared baking sheet, and use a spoon or spatula to spread the dough out into a very thin circle about 7 inches in diameter. Repeat with the remaining batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cookies are very lightly browned at the edges and the centers are set, 7 to 9 minutes. Watch them carefully so they don't overbake. Pull the sheet from the oven, and immediately slip a spatula underneath each flat cookie; center and drape them over the greased glasses to harden into small wavy bowls. Allow to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the cookies cool over their molds, beat the cream cheese and confectioners' sugar in a bowl until smooth; mix in 1 teaspoon of vanilla extract.  Remove green tops and cores from 5 strawberries; place them into a small bowl, and mash to a juicy, slightly lumpy texture; mix the strawberries into the cream cheese mixture. Gently fold the whipped topping into the strawberry cream until thoroughly combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon about 3 tablespoons of the strawberry cream into each cookie bowl, then top with a pretty fresh strawberry with green top. Store leftover cookies in an airtight container, and leftover cream in refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CookBakeandDecorate"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6666666666666665,
            "ratingCount": 9,
            "itemReviewed": "Cookie Tulips",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "198.9 calories",
            "carbohydrateContent": "26.7 g",
            "cholesterolContent": "20.5 mg",
            "fatContent": "9.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "67.2 mg",
            "sugarContent": "22.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-04T17:12:44.593Z",
                "reviewBody": "I agree with the former review - I doubled the amount for the \"tulip\" cookie. I like them a little thicker than they would be with the recommended amount. Otherwise the presentation is great and the taste is wonderful. This could be used for any fruit that is preferred. To make the \"tulip\" I used ramekins and I had a very small pyrex dish that worked as well - in fact it did the best. I had one of those and 4 ramekins... it's most effective to use those. Also cook 2-3 at a time. It takes some time to get them off the cookie tray and into the mold for an optimal shape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "R.Zuniga12",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4399588/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T00:02:04.53Z",
                "reviewBody": "I rated this a 4 because of some concerns with the recipe. I wasn't sure how much to beat the eggs. I actually beat them just as I would for an omelet. Also the only cookie I had that held it's shape was one I \"over cooked\" just a bit - not burned but a little brown all over. I only got about 7 \"tulips\" but they were delicious. We just slapped on some of the filling and dug in. The taste was fabulous and the presentation was beautiful for the one cookie that worked for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "maliforte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/maliforte/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-08T01:02:15.2Z",
                "reviewBody": "The flavor was excellent kind of had the texture of a fortune cookie. I got the shapes to stick and it was easier to form them than I thought when making 2-3 at a time. However they were pretty chewy so I'm trying to figure out where I went wrong - since the photos look rather crispy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TAHITI_BREEZE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802079/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-05T12:14:05.02Z",
                "reviewBody": "These unfortunately were a miss for me. They were too chewy and if you live in a humid climate (FL May-Oct) then they will not set. Mine were sticky and pliable. I had to toss them out as they were completely unusable. I did break a piece off prior to tossing and wasn't a big fan of the flavor. The butter was a bit too bold for my liking. The recipe says it yields a dozen but I was only able to make seven after measuring the batter exactly as it's called for. I opted to make the cups without the filling as I was going to fill with homemade ice-cream so I can't comment on how the strawberry concoction turned out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DLD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4514586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-22T21:24:29.9Z",
                "reviewBody": "I made this at our Church for a Strawberry Dessert Contest and won 1st place!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6323273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-04T01:58:49.777Z",
                "reviewBody": "Very easy and got rave reviews from the guests. Cookie stays just soft enough that it doesn't crumble. I used only 1 tbsp of batter and made about a 4 inch circle. I baked about 6 at a time and molded them over mini muffin tins. By the time the next batch was cooked I was able to remove them. This made a nice hand held dessert. I made two batches. For the second I omitted vanilla and added 1 tbsp Kahlua. These I topped with with a drizzle of chocolate syrup yum! Also I used real whipping cream-1 1/2 cups whipped is the correct substitute for the cool whip. Update: I have made these 3 times now. Love them. Once I use blueberries and pushed the plup through a seive. They were great as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pamjlee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/42276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-01T00:18:29.79Z",
                "reviewBody": "I tried 3 times to make the tulips. They look nothing like the picture. The texture was not right too soft need to be lighter crispier. I think maybe there is a misprint in the ingredient ratios. Plus how beaten should the egg whites be and there is no way you would get 12 servings with these measurements. I LOVE THE IDEA.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ekb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8905082/"
                }
            }
        ]
    }
]