[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/400/desserts/cakes/yellow-cake/",
                    "name": "Yellow Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217088/yellow-clooney-cake/",
        "name": "Yellow Clooney Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3417048.jpg",
            "width": 2446,
            "height": 2045
        },
        "datePublished": "2020-06-19T03:44:22.000Z",
        "description": "I call it the Clooney cake because it is oh so super moist.  It is the best yellow cake recipe since the dawn of time. I really hope you like it!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "2 9-inch round pans",
        "recipeIngredient": [
            "4 cups cake flour, plus",
            "2 tablespoons cake flour",
            "2 teaspoons baking powder",
            "1 ½ teaspoons baking soda",
            "1 teaspoon salt",
            "1 cup butter",
            "2 cups white sugar",
            "4 large eggs, at room temperature",
            "2 teaspoons pure vanilla extract",
            "2 cups buttermilk, well-shaken"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Grease two 9-inch round cake pans with butter. Line the bottoms with parchment paper, then grease the parchment paper. Sift together the cake flour, baking powder, baking soda, and salt in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg.  Pour in the flour mixture alternately with the buttermilk, mixing until just incorporated. Pour the batter into the prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the pans for 10 minutes, then run a paring knife between the cake and the edge of the pan. Hold the cake pan on its side and gently tap the sides of the pan against the counter to loosen it. Cover the cake pan with a plate or cooling rack, and invert it to tip the cake out of the pan and onto the plate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Yellow Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "alicia101584"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.125,
            "ratingCount": 56,
            "itemReviewed": "Yellow Clooney Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "485.1 calories",
            "carbohydrateContent": "74.1 g",
            "cholesterolContent": "104.3 mg",
            "fatContent": "17.8 g",
            "fiberContent": "0.8 g",
            "proteinContent": "7.6 g",
            "saturatedFatContent": "10.5 g",
            "servingSize": null,
            "sodiumContent": "608.6 mg",
            "sugarContent": "35.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2019-07-26T23:57:49.827Z",
                "reviewBody": "OK. Confession. When I was younger and I'd make a cake, I'd always filch batter. By the spoonful. Couldn't help myself! As a result, my cakes were never very tall. Fast forward a few decades. I'm diabetic. No more tastes when baking for me! Even so, nothing prepared me for how much batter this recipe made. I got three very full 9\" layers and 8 cupcakes. Couldn't believe how I just kept filling cupcake papers. How could anyone possibly fit this into \"2- 9\" pans\"??? Anyway, I tasted one of the cupcakes, and was absolutely blown away by the texture - so moist with a fine, light crumb. It's everything you love about a mix cake, minus that obnoxious, artificial flavor. Those who say it was dense, there are a couple of possible causes. You could have beaten too much after the flour was added, encouraging formation of gluten, the protein in flour that gives structure to breads. Simply incorporate the flour gently and stop, which will obviate that problem. Or perhaps you opted for all purpose flour instead.  Big mistake. If you don't have cake flour, measure out 3-1/2 cups all purpose and add 1/2 cup cornstarch. Sift 3 times. If you used cake flour, did you sift? Sifting aerates your flour. If your product was dry, that indicates packing your flour when measuring (be sure to spoon the sifted flour lightly into your cup  and sweep the back of a knife to level,) overbaking, or a temp that was too high. Calibrate your oven using an oven thermometer every 3 months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-05T00:02:22.39Z",
                "reviewBody": "I'm a sucker for yellow cake. No frills no fancy technique just simple lovely cake. Very moist very very delicious. Will be my go to yellow cake recipe (sorry grandma...) Also love that buttermilk was used. It makes this cake all the more rich and delightful",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "samclark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6586265/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-11T23:04:27.71Z",
                "reviewBody": "Overall this produced a good cake, but I have a few points for others. 1. This makes more batter than 2-9inch cake pans worth. More like 3-9inch cake pans. FYI. 2. This cake is a slow cooker - I made it in a 9x13 and it took over an hour to test done (it had browned a bit on top but that's normal in butter cakes, if that's going to bother you, find a shortening or oil cake recipe). This is because of the amount of batter -- reduce if you don't need 3 cakes or a 3-4 inch thick sheet cake. 3. I stored my cake in the fridge due to how I frosted it, so I can't speak to the moistness (the fridge sucks the moisture out of cakes and breads, so never bash a baked good that you stuck in the fridge without pre-tasting) but I can say that it came out with a much denser crumb than cakes made with all-purpose flour, however it was tender to the mouth and fork. This cake would hold up well for cutting into layers, etc., much like pound cake (but tasting different). Overall I was pleased with this recipe but as one of the early reviewers I wanted to go ahead and point out a few things about this cake before people make it expecting Betty Crocker boxed mix and then downrate it. Thank you Alicia, we enjoyed your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JARRIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jarrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-21T19:52:55.307Z",
                "reviewBody": "I am the poster of this recipe.  I shouldve noted that my pans are 2 inches deeper than regular pans you guys are probabaly using.  So I can see how it may be a bit much for the regular pans that you all are using.  Sorry guys ;-(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alicia101584",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/slapyamamagood/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-04T16:39:22.82Z",
                "reviewBody": "I thought I was making this recipe and had mistakenly taken another off of the site. BAD mistake. It came out like a dense rock... like the one Patrick lives under in Spongebob. Anyway this one rocked and thanks for educating me about the essentialness of using cake flour vs all purpose!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3850856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-16T21:32:08.857Z",
                "reviewBody": "This is the best yellow cake I've ever made. Really light, airy, perfect flavor. Almost like a mix cake but better. I cut the recipe in half and baked in a 13x9, came out perfect, 1-1/2 inches thick in the middle. baked for 33 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "asparaggus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4575713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-26T17:26:40.57Z",
                "reviewBody": "We made cupcakes out of this recipe. They were light moist and fluffy. The perfect texture! The only change I made was to add extra vanilla. We'll be using this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crikkitt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/crikkitt/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-09-04T02:49:09.97Z",
                "reviewBody": "4.13.11... https://www.allrecipes.com/recipe/217088/yellow-clooney-cake/... I liked this cake. Searching for the perfect yellow cake. This isn't \"it \" but it is good. Nice buttery flavor very moist medium texture quite dense (almost like a quick bread dense) - ahhh butter.:) More buttery tasting than \"Mary Oppenheimer's Butter Cake.\" 'Made just one layer. I increased the sugar to a cup & a half. It wasn't too much. 'Don't spank me but I didn't use cake flour. Used a cup & two-thirds regular flour. Maybe another egg would help with the denseness issue - to make it more cakelike. Maybe.:) PS What's a \"clooney\"?!?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BOOKMARKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bookmarker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-22T22:27:57.407Z",
                "reviewBody": "Made this exactly as written however would recommend 3 round pans instead of 2. I really liked how tall the layers were however it was hard to slice and fell apart easily. Will likely try it again using less batter per pan and reducing the baking time so the edges don't over bake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gummy2008",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3069626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-11T22:26:56.927Z",
                "reviewBody": "This was good but I thought a bit dry. Not the yellow cake I was looking for. I did not edit the recipe at all. I really expected a moist yellow cake.So this for me is not a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SMc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2214927/"
                }
            }
        ]
    }
]