[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217178/pull-apart-easter-blossom-bread/",
        "name": "Pull-Apart Easter Blossom Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F629896.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2020-06-19T03:44:26.000Z",
        "description": "A rich eggy dough is twisted into pretty flowers, then filled with jam in this decadent Easter bread. Be sure to look at the pictures for how it is formed. Lemon curd is an option to replace the jam.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT3H50M",
        "recipeYield": "2 10-serving loaves",
        "recipeIngredient": [
            "6 cups all-purpose flour, or more if needed (divided)",
            "1 tablespoon rapid rise yeast",
            "½ cup white sugar",
            "¼ teaspoon salt",
            "½ cup unsalted butter",
            "1 ¾ cups milk",
            "3 eggs, beaten",
            "1 lemon, zested and juiced",
            "1 egg yolk",
            "1 tablespoon water",
            "½ cup seedless raspberry jam",
            "1 cup confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whisk together 4 cups of flour, the yeast, white sugar, and salt. In a saucepan over low heat, melt the unsalted butter with the milk until the mixture is warm, about 110 degrees F (43 degrees C). Gradually whisk about 1/3 of the butter-milk mixture into the beaten eggs, then return the egg mixture back into the remaining milk mixture. Stir the lemon zest into the liquid ingredients (set aside lemon juice for later). Pour the liquid ingredients into the flour mixture, and stir until thoroughly combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add enough flour to make a soft dough; turn the dough out onto a floured surface, and knead until smooth and elastic, 8 to 10 minutes. Place dough into an oiled bowl, and turn the dough around to cover surface lightly with oil. Cover the bowl with plastic wrap, and allow to rise in a warm place until doubled, about 1 hour. Punch down the dough, and allow to rest for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough in half, and roll each half into a round ball. On a floured surface, roll out a ball into a 12-inch circle. Place a drinking glass, face down, into the center of the circle to prevent cutting the dough too far into the center. Cut the dough with a knife, from the edge of the dough circle to the rim of the glass, into quarters. Cut each quarter into 5 narrow wedge-shaped strips. (Center of the dough is uncut.) Remove the drinking glass. There are 20 narrow wedge-shaped strips surrounding the uncut center of the dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pick up two adjacent strips, and twist them together about 4 times; pinch the ends of the two pieces together at the top. Gently coil to form a rough flower shape. Arrange the round into the middle of the circle, where the drinking glass was.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pick up two more adjacent strips, and twist and pinch them as before; coil them into a rough round, and arrange the new petal next to the center rosette. Repeat with remaining 16 strips, twisting and pinching them in twos, coiling and arranging them into 8 more petals around the center rosette. Finished bread has 9 petals surrounding the center round. Repeat steps with the second ball of dough to make two breads.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease a baking sheet, or line with parchment paper. Place the shaped breads onto the prepared baking sheet, reshaping them into rounds if needed; cover with a clean kitchen towel, and place into a warm spot to rise until almost doubled, 30 to 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Beat the egg yolk with water in a small bowl, and brush the mixture over both the breads.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the breads have turned golden brown, about 25 minutes. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use your fingers to gently deepen the indentations in the center of each petal, and fill each with about 1/2 to 1 teaspoon of raspberry jam. Mix the reserved lemon juice and confectioners' sugar in a bowl to form a glaze; drizzle the glaze in thin lines all over both the breads. Allow glaze to set. To serve, pull the petals apart.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sarah-May"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 72,
            "itemReviewed": "Pull-Apart Easter Blossom Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "269 calories",
            "carbohydrateContent": "47.3 g",
            "cholesterolContent": "52.1 mg",
            "fatContent": "6.4 g",
            "fiberContent": "1.4 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "50.6 mg",
            "sugarContent": "17.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-19T03:33:00.167Z",
                "reviewBody": "BEAUTIFUL!  This has to be one of the best looking coffee breads around!  It was a fun thing to make and has so many possible ways to flavor it.  I used the \"Cheese Filling\" recipe from this site and spread it over the dough prior to cutting the strips.  I was looking for a cheese danish flavor and it went so well with the raspberry.  I used a pizza wheel to cut the strips and also used a pizza pan for baking it.  To apply the raspberry preserves, I used a pastry bag so I could squeeze a nice amount into the blossoms.  So YUMMY!  Love that raspberry flavor!  Thank you Sarah-May for sharing such a BEAUTIFUL YUMMY recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-24T05:32:41.013Z",
                "reviewBody": "Awesome! Blossom!  The texture of this bread is spot on; light and fluffy center crumb and perfect crust.  Instructions for the blossom is superb!  Used regular active dry yeast and 6 cups of flour and the dough was somewhat tacky, but not to worry, flour your hands to handle the dough and after the first rise, the dough will be perfect.  My dough rolled out two 15\" discs.  I cut 6 wedges per quarter and the first disc came out perfect.  I baked it for 30 minutes and then quickly brushed on soften butter all over the blossom and filled it with apricot/pineapple preserve.  For the second disc, I made one of my favorites~Cinnamon Roll Blossom~Deliciously stupendous!   Spectacular presentation for various combinations of fillings!  Definitely a Treasure!  Thanks  Sarah-May!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "marljong",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1716355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-11T02:50:16.56Z",
                "reviewBody": "Sarah, you most certainly have a winner here. This was fabulous and like the others have said, the dough was incredibly easy to work with. I did end up using a total of about 7 cups of flour before it was over with though. I don't know if the humidity here just required more or what but it was wonderful. They turned out HUGE. Since I had two to serve to my guests for Easter brunch, I did one with raspberry jam and flavored the glaze for that one with almond extract. The other one and probably my favorite was filled with a lemon-pear marmalade and topped with almonds. The glaze on this one was the one you recommend and I mean to tell you that this was a very nice and a really unexpected treat for everyone here. There really are so many things  you can do with this and I intend to try some other combos soon. My daughter and I put these together and I think that for her to see that yeast is not as intimidating as she thought, she may give it a shot herself. UPDATE; I made this again for Mother's Day and took the advice of WFDM, using almond paste for one, and the lemon -pear marmalade for the other. I also spread each filling on the dough prior to being cut so that some of it would be intertwined in the bun. Great idea and one I'll be doing from now on. The almond paste was a bit too stiff to spread, so after breaking off pieces of it, I used my rolling pin to press it into the dough. Worked like a charm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-23T17:09:37.227Z",
                "reviewBody": "We loved this bread, it had wonderful flavor.  However, I took the advice of SHORECOOK and made the cheese filling from this site.  I have NO idea how she got the cream cheese not to ooze everywhere while twisting the strips.  My first \"blossom\" I did as she did - spread the filling before cutting the strips.  This resulting in ooey gooey mess all over my counter, hands, the pan, everywhere, and not much filling in the rosettes.  My second blossom I formed first and the added a big dollop of cheese filling in the wells before baking. While this worked way better, this shape does not lend itself to holding much filling at all, and a lot of it oozed out onto the pan.  None of this was the fault of the recipe, though, so can't rightly take any stars off.  Either way, we loved the taste, but I would probably not repeat the shape next time, as we like more than a teaspoon of filling per serving.  Also, one last note - the instructions say to roll to a 12-in circle, mine were MUCH bigger than this.  If I did repeat this shape, I would make 3 smaller blossoms, not 2 huge ones.  All in all, I WILL make this bread again, just tinker it to suit our tastes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peas with Honey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/peaswithhoney/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T23:26:45.113Z",
                "reviewBody": "Amazing. I'm Ukrainian and grew up with my baba's Easter bread so can attest that this bread's texture is spot on. It is also NOT bland and is the way it is supposed to be. My only comment is that with the raspberry and glaze it was too sweet for us and more like a danish. I would cut the jam and glaze in half next time. The \"flower\" thing did take some practice but the second one was much prettier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/601565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T05:28:55.927Z",
                "reviewBody": "Really fun pretty and super rich bread. All in all just delicious! I absolutely loved the lemon flavor in the dough. I thought the glaze was a nice touch and went well with the raspberry jam although I went quite light when drizzling it on. It's nice that this recipe can be halved easily. I wasn't serving a large crowd so I halved it but used two whole eggs. On the other hand if making the whole recipe the great thing is it's versatility in that you can vary the jam glaze and other add-ons to give variety when making two loaves. I really look forward to making this again and trying on some different flavors. Thanks for bringing this recipe together Sarah-May!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T22:00:08.627Z",
                "reviewBody": "All I can say is thank you so verry much. The family was tired of the same ol hot cross buns for Easter breakfast. Your blog made this so easy to do. Thank you again Sarah-May you are the bomb.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robograndma Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/robograndma/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-06T17:21:35.68Z",
                "reviewBody": "Fantastic recipe and much easier to make than it looks! I've made this 3 times and I've come up with some steps that make it even easier: 1) I cut the recipe in half and make the dough in my bread machine; 2) I place the dough on the parchment-lined pizza pan after I roll it into a circle and cut and form it right on the pan; 3) I use kitchen scissors instead of a knife to cut the dough into strips; 4) After I form the center petal I twist all the remaining strips first then form them into petals one after another. Also I didn't care for the lemon glaze so I use a simple vanilla glaze recipe. If you're confused on how to cut and form the petals check out the photos of the recipe. They're very helpful. I LOVE THIS RECIPE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZZANNA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/suzzanna/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-20T03:44:51.097Z",
                "reviewBody": "This is DELISH! Great job Sarah-May. Your instructions were easy to follow and it made a beautiful tasty bread. I will definitely be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Garnier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mangel/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-29T20:21:07.563Z",
                "reviewBody": "When I looked at this bread I was expecting to eat a pastry but when I ate it it was more like a dinner roll with the drizle of sugar and jam. I would use the dough recipe again because it is very tasty for a roll. The shape is wonderfull! it came out just like in the picture or even better!!! I am going to use this shape again for sure. Thank you so much for this beautiful presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Milenka Stocking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3967258/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Pull-Apart Easter Blossom Bread",
            "description": "An eggy yeast bread full of raspberry jam!",
            "uploadDate": "2017-06-22T22:26:26.196Z",
            "duration": "PT1M37.429S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa1df42eb-443e-409b-b7ba-6349ebcb7867%2Fdbc3afde-a4fd-42be-b3bc-53f5b077b1bb%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5480593612001"
        }
    }
]