[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
                    "name": "Jams and Jellies Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217783/ginger-marmalade/",
        "name": "Ginger Marmalade",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6442446.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-06-19T03:44:35.000Z",
        "description": "This is the best ginger marmalade that I have ever tasted. Recently disappointed with the texture and aftertaste of another ginger marmalade, I searched for a homemade ginger marmalade and found only one very inadequate recipe. I created my own based on an orange marmalade recipe, and it turned out great.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT8H35M",
        "recipeYield": "5 1/2-pint jars",
        "recipeIngredient": [
            "3 ½ cups peeled fresh ginger",
            "4 cups water",
            "5 cups white sugar",
            "1 (3 ounce) pouch liquid pectin",
            "5 half pint canning jars with lids and rings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Divide the ginger in half, and chop half into cubes; shred the other half with a box grater or in a food processor using the shredding blade. Total ginger should equal 3 cups. Place the ginger into a large saucepan with water over medium heat, bring to a boil, and reduce heat to a simmer. Cover the pot, and simmer the ginger until tender, about 1 hour and 15 minutes. Add more water if needed to keep mixture from drying out. Pour the cooked ginger into a fine-mesh strainer, drain, and retain 1/2 cup of the ginger-flavored water. Place the cooked ginger in a bowl with the retained liquid, and cool at least 4 hours or overnight in refrigerator.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When ginger is thoroughly cooled, place into a large, heavy-bottomed pot, and stir in the sugar; bring to a boil over medium-high heat, and boil hard for 1 minute, stirring constantly. Stir in the pouch of liquid pectin, reduce heat to a simmer, and cook for 7 more minutes, skimming foam from top of marmalade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize the canning jars and lids in boiling water for at least 5 minutes. Pack the marmalade into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes",
            "Jams and Jellies Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "*"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 18,
            "itemReviewed": "Ginger Marmalade",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "137.7 calories",
            "carbohydrateContent": "35.3 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.2 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "2.6 mg",
            "sugarContent": "33.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-25T14:35:02.613Z",
                "reviewBody": "I made this on the weekend and it is the most flavourful ginger marmalade that I have ever tasted. I made one minor change to the directions on this marmalade because  I have been making jam for years and years so after I added the pectin, I removed the pot from the heat and stirred and skimmed for 7 minutes instead of turning the pot to a simmer and cooking an additional 7 minutes with the pectin added to the pot.This is what I do with the other jams and marmalades that I have made. I also didn't use the hot water bath in the recipe. I sterilized my jars by washing them in hot soapy water and rinsing in clean water, then I placed them in a pre heated 225 degree oven for 10 minutes. I washed the lids the same way and boiled them for 1 minute to sterilize. I poured the hot marmalade into the warm jars and immediately put the lid on and tightened. I have used this sterilization method for years and found that it is so quick and easy. This recipe made 2 1/2 500ml jam jars for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cupcake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6963994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-18T23:26:38.72Z",
                "reviewBody": "This recipe does not work as it is written. The ginger in little 'cubes' becomes floating fibrous chunks. We boiled it for 3 hrs in hopes the pieces would disintegrate but they didn't. We added copious amounts of extra water for the long boil. Adding more water to create a reasonable consistency on the second day still left crunchy bits. In order to salvage the batch we fished out the floating cubed bits and added 1/2 cup lemon juice and 1/2 cup orange juice. We also used powdered pectin when we added the sugar rather than liquid pectin. It is delicious. I would like to give zero stars because you should find a different recipe but the smallest number allowed is 1",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7892738/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-07T02:43:11.123Z",
                "reviewBody": "This recipe makes absolutely amazing ginger marmalade. It is not very labor intensive and you get a phenomenal product. I like to eat it plain on toast or whisked with some garlic and soy sauce to make a teriyaki glaze. And don't be afraid of the \"chunks\" of ginger, they become almost candied in the final product and give it a really nice texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aniquerenee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5546389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-27T18:43:18.737Z",
                "reviewBody": "It was the first time I made ginger marmalade and this recipes worked out very well. The taste is amazing! I made 2 changes: I used 1 cup instead of 1/2 cup of the ginger-flavored water and I reduced the amount of sugar to 4 cups which I think is plenty. Other than that I stuck to the recipe and we love the result!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "roelschi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2310530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-12T19:30:55.463Z",
                "reviewBody": "The recipe worked out well but it had a learning curve for me as I had never cooked ginger before. Some of the little cubes didn't soften. I think it must depend a lot on the age of the ginger root. Also one must be aware that the fiberous stringy parts of old ginger root don't soften much with cooking either. Don't include them in your mix. That said after I fished out the hard parts and the fiber I made some great jam from the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Abigail Kreiss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7650333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-31T04:47:51.923Z",
                "reviewBody": "I really liked this recipe but it didn't set up terribly firm in my jars -- maybe my liquid pectin pouches are smaller than the ones used? I didn't think they would be I just used a pouch of Certo liquid pectin and I find I tend to have this problem with liquid pectin in general... I'm debating whether or not to open all my jars and re-boil to get a more jelly marmalade. I did open one and try some on bread and it was so delicious the way it is! I followed the recipe pretty much exactly but I was very careful when shredding the ginger to stop when my piece was too fibrous to properly grate any more... I think this contributes to a possibly stringy/crunchy marmalade people experienced. I also think using a food processor for the grating might let some of those fibrous pieces sneak in. I didn't cut very much of it into cubes as I was paranoid of a woody piece of ginger making it into the pot. The only change to the recipe I made was I added a few thinly sliced rings of a small orange for a bit of variation. It's nice to see little flecks of orange in the jars. I also added a bit of green dye to make some jars into festive gifts for the holidays and those are very pretty -- otherwise the marmalade turned out a lovely bright yellow. It's a bit of a labour-intensive project but it is so tasty! I'd make this again but I might use powdered pectin to see the difference. ETA: This recipe as-is has grown on me! Just know it's not as firm as a \"jelly\" but not at all bad very tasty",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3221989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-28T03:06:49.92Z",
                "reviewBody": "Your recipe is a lot like mine except I grate all my ginger & make larger batches also your recipe is great Thank you for sharing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ArtishaTatianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5104219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-08T02:12:56.987Z",
                "reviewBody": "I made a bitter orange/ginger/cardamom version with an extra cup of brown sugar. It turned out golden and rustic. The whole house smells amazing! Good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lday",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17457521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-14T01:30:28.083Z",
                "reviewBody": "The flavor is incredible - my whole extended family loves it spread on toast.  I've made it a few times and once when toying around with the sugar content it came out quite liquid-y.  No problem!  A couple tablespoons of the syrupy version stirred into hot water tastes amazing (especially when you have a cold!).  I also added it to carbonated water once to make ginger ale when my husband felt sick and we didn't have ginger ale at home.  The original recipe is awesome, though!  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "itsverymary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/itsverymary/"
                }
            }
        ]
    }
]