[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218004/petras-strawberry-shortcake/",
        "name": "Petra's Strawberry Shortcake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F813675.jpg",
            "width": 968,
            "height": 1296
        },
        "datePublished": "2020-06-19T03:44:54.000Z",
        "description": "As a teenager (born and raised in Germany) I made what we call Biskuitteig weekly, which is similar to sponge cake. I never really liked Bisquick for shortcake and remembered the spongy, tender texture of the Biskuitteig. I altered an old German recipe and came up with this delicious version. Also good with other fruit toppings!",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 9x13-inch pan",
        "recipeIngredient": [
            "2 pounds fresh strawberries, sliced",
            "1 cup white sugar",
            "1 cup all-purpose flour",
            "2 tablespoons cornstarch",
            "1 ½ teaspoons baking powder",
            "5 eggs, separated",
            "1 teaspoon vanilla extract",
            "1 ¼ cups white sugar",
            "1 cup heavy cream",
            "2 tablespoons confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the sliced strawberries into a mixing bowl and stir in 1 cup of sugar. Cover, and refrigerate 2 hours to overnight. Stir the strawberries occasionally. The longer they sit in the syrup, the more syrup you will have.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Grease and flour a 9x13-inch baking dish. Whisk the flour together with cornstarch, and baking powder in a mixing bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the egg yolks in a small bowl with the vanilla extract until smooth; set aside. Whip the egg whites with an electric mixer until very stiff. Slowly add the 1 1/4 cup sugar to the egg whites, a few tablespoons at a time, until the sugar is incorporated and the whites are stiff. Fold in the yolk mixture until almost fully blended into the whites. Fold in the flour mixture until just combined. A few small lumps of flour should remain. Scrape the batter into the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 22 to 25 minutes. Cool in the pan for 5 minutes, then invert the cake onto a sheet of waxed paper, and cut into 8 equal pieces. While the cake is cooling, whip the heavy cream with the confectioners' sugar to soft peaks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble the strawberry shortcakes: cut each cake square in half horizontally, and put the bottom halves onto dessert plates. Spoon on the strawberries and syrup, then top with the cake tops. Spoon on whipped cream to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Petra"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.82051282051282,
            "ratingCount": 39,
            "itemReviewed": "Petra's Strawberry Shortcake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "475 calories",
            "carbohydrateContent": "81.9 g",
            "cholesterolContent": "157 mg",
            "fatContent": "14.6 g",
            "fiberContent": "2.7 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "148.2 mg",
            "sugarContent": "63.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-07-11T23:45:27.957Z",
                "reviewBody": "This was a wonderful shortcake recipe! I scaled to two and made mine in a large ramekin - perfect (and gorgeous) for two! The shortcake is soft, fluffy, lightly sweet and a little sticky - like a really good angel foodcake, but a little denser, I \"cheated\" and used whipped topping I already have but the real stuff would have been a wonderful compliment to top this one off with. So, so good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebekah Rose Hills",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sandra_92083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-10T03:56:50.81Z",
                "reviewBody": "Awesome!  I halved the cake height-wise and put it back in the pan, layering with strawberries, juice/syrup, and then the cream.  Final product was AWESOME, and was better the second day..the layers soaked up the juices and cream beautifully - I would definitely not substitute storebought whipped cream for the homemade stuff in this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2911276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-27T19:03:46.09Z",
                "reviewBody": "This was my first time making strawberry shortcake, and this turned out great! As Allison did, I halved the cake and put it back into the pan, layered it with strawberries and syrup (from frozen) in the middle, and then topped the cake with whipped cream and fresh strawberries. It received rave reviews at my party!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanessa F.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2273929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-13T22:45:38.2Z",
                "reviewBody": "Oh My Goodness! This recipe is FANTASTIC! I will never look for another Strawberry Shortcake recipe again. My husband requested strawberry shortcake for his birthday and the silly goose thought I would BUY one! I went looking and found this recipe and even though it was my very first time making one it came out amazing.:) (I am a much better cook than a baker so I was very pleased this turned out so well.) Mom and Dad loved it (Dad's exclamations upon seeing his piece involved the word \"Shazaam!\" LOL) and my hubby was bragging on me at work the next day even showing a photo. I followed the recipe exactly changing nothing and making good use of our Kitchen Aid mixer. I used a foil pan because I didn't have the right size pan. The cake came out sweet and firm but wonderfully textured and Mom said she would have been happy to eat it plain! Beginning to end this recipe was easy and tasty even for the rare baker like me. We used too many strawberries the first night so next time I might use three pounds.;) I just can't wait to make it with in season berries! Finally it tasted every bit as awesome the second day.:D Thank you for sharing Petra and for helping make my hubby's birthday a success!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "'Lil T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1786620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-05T22:24:06.223Z",
                "reviewBody": "This cake was absolutely amazing. i have so far made it twice and both times it was an absolute success. I am a beginner baker and i have had my share of absolute baking disasters but this cake turns out perfect every time. I like to halve the recipe and then bake it in 2 6 inch round pans for 15-18 minutes. It's a great dessert for a dinner or a small birthday get-together. definitely a great great cake and two thumbs up!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mincemeat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3918783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-19T19:53:46.543Z",
                "reviewBody": "This cake has a rubbery texture and very eggy flavor. I was quite disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Strange",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wackerstrange/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-01T21:28:19.65Z",
                "reviewBody": "Baked it in 2 round dark nonstick pans for about 18 mins at 350. Did the toothpick test and they were perfectly cooked and nice and spongy on top. An VERY important step is to spray the pans with Pam Baking Spray (or use melted butter and flour) line with parchment paper and then spray it with Pam again. This will ensure that the cake slips right out after baked and looks PERFECT. I thought it'd be ok to just spray the pan when making another similar cake and it ended up a total mess! Another tip is to make sure the beater and bowl are completely clean before you start whipping the egg whites. My insertion blender stick did an amazing job of whipping them up fast. Anyway I made the recipe exactly as listed except I added vanilla extract and extra sugar to the whipped cream. I wanted a recipe with simple ingredients for a birthday cake for my MIL and this one fit the bill. She LOVED it and was duly impressed;) and everyone else thought it was delicious too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-17T16:43:54.74Z",
                "reviewBody": "Turned out great! Only had half the strawberries and it was still enough. Delicious and light cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristy Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2750174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-23T22:08:02.847Z",
                "reviewBody": "This is a very nice recipe. I did what another reviewer did...split the cake in half and put it back in the pan (with the strawberries in the middle). My sweetie has a bit of a sweet tooth so I used cream cheese frosting on top. Thanks for sharing Petra. I will make this again in the future.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Blackledge Corroo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7285301/"
                }
            }
        ]
    }
]