[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
                    "name": "Lemon Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218156/super-lemon-ice-cream/",
        "name": "Super Lemon Ice Cream",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1586127.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2020-06-19T03:45:02.000Z",
        "description": "Tart and tangy ice cream that is very refreshing in the summer!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT12H45M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "2 cups heavy whipping cream",
            "1 cup half-and-half cream",
            "1 ⅛ cups white sugar",
            "3 tablespoons grated lemon zest",
            "5 egg yolks",
            "¾ cup fresh lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine heavy cream, half and half, sugar, and lemon zest in a saucepan; bring to a simmer over low heat. Cook and stir until sugar is dissolved, about 5 minutes. Remove from heat. Cover saucepan and allow the mixture to steep for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Uncover pan and bring back to a simmer over low heat. Beat the egg yolks in a bowl. Gradually stir one cup of the hot cream mixture into the eggs, several tablespoons at a time. This will help to bring the eggs up to temperature without scrambling them. Stir the egg mixture back into the cream mixture in the saucepan. Cook and stir over low heat until the mixture just coats the back of a spoon, 5 to 10 minutes. Transfer to a large bowl; cover. Refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the lemon juice into the cold ice cream mixture. Freeze in a 4 to 5 quart ice cream maker according to manufacturer's directions. Transfer ice cream to a lidded freezer container, and freeze for 4 hours to ripen flavors before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Lemon Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AOSWALT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.822033898305085,
            "ratingCount": 118,
            "itemReviewed": "Super Lemon Ice Cream",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "314.5 calories",
            "carbohydrateContent": "27 g",
            "cholesterolContent": "176.6 mg",
            "fatContent": "22.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "13.5 g",
            "servingSize": null,
            "sodiumContent": "32.3 mg",
            "sugarContent": "23.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-18T17:54:52.117Z",
                "reviewBody": "I'm not really sure why none of the 900-some people who have saved this recipe haven't reviewed it because it is amazing! I've never made ice cream before and my mom wanted lemon ice cream for her birthday, so I researched a ton of recipes and decided this is the one I would attempt. What a great decision that was! This recipe was easy to make and tastes absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KaitCDubs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3695728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-22T14:54:10.97Z",
                "reviewBody": "OMG! Yum!!! I got an ice cream maker for Mother's Day and have used it to make sorbet so far. This was my first ice cream recipe. Lemon is one of my favorite flavors, so I was super excited to try this one! It is ridiculously good! Even though I had to substitute 1/2 cup of Splenda for the sugar because I managed to run out with all the baking I've been doing, it came out with a nice balance of tart and sweet. Creamy, delicious, a winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ilkaisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ilkaisha/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-25T22:28:37.897Z",
                "reviewBody": "My grandmother would always make homemade lemon ice cream when she was alive.  Sadly, since she passed away no one has made lemon ice cream at gatherings.  To fix the lemon ice cream craving, I searched Allrecipes for a recipe that would give a strong lemon essence and...I found it!  I was momentarily hesitant to try it because of the low number of reviews, but with the high number of saves and the use of natural lemon zest/juice, I decided to try it.\n\nThis ice cream is AMAZING. It is so delicious and is better than anything bought in the store.  I only had 1/2 cup of the lemon juice, it was still very present in the ice cream!  My daughter, who loves lemons on their own, this is awesome ice cream.  She's eating a scoop right now trying to make it last.  I wonder how even more delicious this would have been with the actual amount of juice it called for in the recipe.\n\nThe only negative for her, but not for me, is one that is easily remedied.  She would have preferred less zest.  The zest is needed to give a strong lemon flavor but you can always strain it out after cooking if you don't want it in your ice cream.  (Think of it as lemon flavored coconut.)\n\nThis recipe is the only recipe I will use for lemon ice cream.  No artificial flavors or ingredients, just pure lemon deliciousness!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3374831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-18T13:34:34.647Z",
                "reviewBody": "My mom bought me an ice cream maker, so I told her I'd bring ice cream for Easter. I made three kinds: marshmallow, blueberry, and this lemon recipe. This was BY FAR everyone's favorite. The tartness and creaminess are so delicious! I did strain the zest out, but I would definitely let it steep for awhile, as most of the flavor comes from the zest. Also, it would not thicken in the ice cream maker, which made me really nervous, but after 25 minutes, I took it out and put it in the freezer. After three hours it had set up so nice. It was almost like a gelato. I've already had requests to bring this one again for future birthday parties. Definitely a keeper! Thanks for the recipe!!\nUPDATE: I tried it again, and this time whipped the heavy whipping cream until the soft peak stage before adding, and that did the trick! It set up a lot nicer. YUM YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alp1357",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9118938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-24T16:22:05.99Z",
                "reviewBody": "Mmmmm, refreshingly tart, but not too tart.  Just right sweet.  A GREAT after dinner dessert because of it.  But...I made a couple of (minor) deviations. I made a lemon-lime version, using half of each.  Also, after juicing enough lemons and limes to get that 3/4 cup of juice I found I only had about half the zest required.  I wasn't about to have \"naked\" limes and lemons laying around, so I used the 1-1/2 T. of zest and called it a day.  It was perfect!  In fact, I'm not so sure I would have enjoyed this any more using twice as much zest and may even have enjoyed it less.  I loved that the recipe called for my preferred ratio of 2:1 heavy cream to half-and-half and, while I was a little concerned about how the added large amount of lemon juice would affect the mouth feel, I needn't have worried.  In spite of adding essentially 3/4 cup of \"water\" to the mix, the resulting ice cream was still creamy and rich, with no unpleasant iciness.  This tasted darn close to a Key Lime or lemon pie and I'm thinking some coarsely chopped graham crackers folded in at the end would be awesome good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-01T20:09:59.76Z",
                "reviewBody": "Fan flippin TASTIC! I have made this several different ways, beside just as written. It's great like it is, but we prefer to reverse the proportions of heavy cream and half-and-half, meaning one cup heavy cream and two cups of half-and-half. It's a bit less unctuous that way, with less cholesterol and fewer calories, allowing that fresh, clean taste to shine. It's still wonderfully creamy this way, and quite rich enough. I especially like to use Meyer lemons from our back yard, harvested just before making the base. Subbing 1/4 cup limoncello for 1/4 cup of the lemon juice keeps it scoopable right from the freezer. I have also steeped 1 cup of roughly torn basil leaves in the heated cream/sugar mix for an hour, straining the leaves out before proceeding with the custard. SPECTACULAR, as well as quite chic. We love it topped with fresh strawberries, raspberries, or blueberries. Any which way you make this, however, you're going to love it even more than you think you will. It's the type of thing that sneaks up on you. After it's all gone, you'll be pining for more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-25T20:07:14.117Z",
                "reviewBody": "This is the second summer I've used this recipe and I can't get enough! I use a vegetable peeler to remove the zest and steep for more like 30 mins before adding the eggs. I refrigerate everything overnight, then strain the lemon zest before adding the juice and freezing. I also use a whole cup of fresh lemon juice. If you are a lemon fan, this is the best ice cream you'll ever taste!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovnlife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5004598/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-22T16:32:08.72Z",
                "reviewBody": "Didn't change a thing! If you don't like it lemony you can reduce the amount of lemon juice. Tastes like a lemon meringue pie filling but in ice cream form. Will try using it to make a lemon ice cream pie in graham cracker crust with sweetened whipped cream topping for a frozen dessert!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13007466/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-03T07:06:00.233Z",
                "reviewBody": "Truly haven't made this yet, but wanted to share a trick to wring the best flavor from the zest. Place the zest in a small bowl and sprinkle with the granulated sugar and let it sit for about an hour before adding it to the liquids to heat. The oils will be extracted and give a very intense lemon flavor.  I can't wait to try this recipe. Lemon is my absolutely favorite flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Reiter-Van Berkum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8389719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-11T23:12:48.193Z",
                "reviewBody": "I am a 100% lemon fan but I have to say this ice cream was just ok. I followed directions to the tee, and even strained the lemon zest like others suggested. It was good. I'm glad others enjoyed it but I will not be making it again. It did not taste like ice cream but reminded me of lemon sherbet type thing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Samantha Heetderks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2999597/"
                }
            }
        ]
    }
]