[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/399/desserts/cakes/white-cake/",
                    "name": "White Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218425/cupcake-princess-vanilla-cupcakes/",
        "name": "Cupcake Princess' Vanilla Cupcakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F973861.jpg",
            "width": 2592,
            "height": 2592
        },
        "datePublished": "2010-11-08T03:36:48.000Z",
        "description": "This is my very own recipe for the best vanilla cupcakes that you will ever have. You can frost these cupcakes with any flavor of frosting you wish like vanilla, chocolate, lemon, strawberry, and lots more.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "12 cupcakes",
        "recipeIngredient": [
            "1 ¼ cups all-purpose flour",
            "¾ teaspoon baking soda",
            "1 pinch salt",
            "5 tablespoons butter, cut into pieces",
            "⅔ cup milk",
            "1 cup white sugar",
            "2 eggs",
            "1 egg yolk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Line a standard muffin tin with 12 paper cupcake liners. Combine flour, baking soda, and salt in a bowl; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the butter and milk in a small saucepan over low heat until the butter has melted. Beat the sugar, eggs, egg yolk, and vanilla with an electric mixer in a large bowl until it has thickened slightly and is lighter in color.  Gradually beat in the flour mixture on low speed until just incorporated. Slowly pour in the hot milk, beating until just combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide batter evenly between cupcake liners. Bake until toothpick inserted into center comes out clean, about 20 minutes. Cool cupcakes in pan for 10 minutes. Transfer cupcakes to a cooling rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "White Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cupcake Princess"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.697986577181208,
            "ratingCount": 298,
            "itemReviewed": "Cupcake Princess' Vanilla Cupcakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "178.4 calories",
            "carbohydrateContent": "27.4 g",
            "cholesterolContent": "61.9 mg",
            "fatContent": "6.4 g",
            "fiberContent": "0.4 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "130.9 mg",
            "sugarContent": "17.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-10-15T21:47:14.853Z",
                "reviewBody": "I’m not a food science whiz but I’ve been baking a long time and I recognized some things in this recipe of concern.  So I made some changes and ended up with a darn good vanilla cupcake.  First, the baking soda - and no baking powder.  Baking soda typically is used when there’s something acidic in the batter like chocolate or buttermilk but there is none here.  Also, baking soda is 4 times as powerful as baking powder so why so much?  If some reviewers complained of an off taste or if their cupcakes were crumbly and coarse too much baking soda could be the problem.  I eliminated it entirely, substituting  1-1/2 tsp. of baking powder instead.  Others reported these were dry – they might have over baked them, but I’m thinking 5 T. of butter wasn’t enough – I increased it to 1/2 cup.  As for technique, I didn’t trust the instructions to heat the milk and butter.  I used a traditional creaming method instead – cream the butter and sugar together till light and fluffy, add the eggs one at a time, blending well after each; add the vanilla.  Add the dry ingredients, in thirds, alternately with the milk, beginning and ending with the flour.  Finally, still others mentioned a flat taste – I added 1/4 tsp. of salt rather than just a pinch, and 1-1/2 tsp. of vanilla. As I mixed up the batter I found it needed another 1/4 c. of flour.  The cupcakes rose nicely, had great flavor, and were moist with a light and tender crumb.  So, some problems as written, perfect with some tweaks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-30T19:22:43.557Z",
                "reviewBody": "I really liked these cupcakes. I doubled the recipe and got about 30 cupcakes (the cupcake cups were only filled halfway). I also put a piece of chocolate in the middle of each cupcake right before baking because we are not very much into plain cupcakes:-) When I tasted a cupcake right from the oven it did taste a little eggy (but perhaps I was just looking for this taste...) but once the cupcakes have cooled they are perfect - moist and sort of fluffy at the same time. I think this is a perfect recipe for a basic cupcake batter and I can imagine all the variations for the creative folks - citrus flavour cocoa/chocolate coffee...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Thilwen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2002015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-24T21:13:49.53Z",
                "reviewBody": "I made these and I wasn't thrilled.  I thought they were chewy and not as flavorful as I expected I guess.  Sorry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4003865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-29T19:43:03.17Z",
                "reviewBody": "Very tasty moist and highly adaptable. This recipe will produce a very loose dough perhaps more loose then some bakers are used to. Don't be tempted to reduce the liquids though or you will end up with a chewy sponge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Robillard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1916900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-21T17:43:33.807Z",
                "reviewBody": "I am not a cupcake fan and I never really make cupcakes so I thought for sure these would be flop. But I was totally wrong. These were great. Yes they are a little more dense so if you are looking for a light treat this is not it. But these were not only delicious they came out looking so professional! I even used tub margarine instead of butter and was not really exact with my TBSP and they still turned out amazing. Also just like what the other posters said don't be nervous about the consistency of the batter. It is suppose to be thin. These are by far the best cupcakes I have made and I think they rate right up there with some professional varieties. These are also great for bake sales because they look so pretty and are great with any icing. Yuuummmmy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Moazhome",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mo/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-18T17:52:50.05Z",
                "reviewBody": "So i saw that sum of yall said it taste to much like egg. So what i did was Add 2 1/4 tsp of vanilla taste just like a vanilla cupcake should.Yummy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lilgirl21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6437931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-11T18:55:25.367Z",
                "reviewBody": "These were really really disappointing. I followed the recipe exactly. They had a funny almost bitter aftertaste and the texture was not good. The only edible parts were those covered in frosting (I used Caroline's chocolate fudge frosting from this site). No one finished theirs not even my kids (who are usually licking up the last cupcake crumbs). They did look pretty and domed nicely but that is the only compliment I have for them.:( ETA: for some reason these tasted significantly better when they were 2 and 3 days old than on the first day. They still didn't compare favorably to some other cupcake recipes we have tried recently but I'm upgrading them to 3 stars now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ScottFamily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2019509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-06T00:02:59.173Z",
                "reviewBody": "I have made these several times using the exact recipe given and every time they turn out perfect. I too was skeptical of the thin batter but pleasently suprised how they turned out and they are not bland at all I even ate some with no frosting! They are perfect to whip up for a real quick home-made dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*silverstar*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3956337/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-17T17:37:13.64Z",
                "reviewBody": "Very different mixture- I was afraid the cupcakes would be flat because the batter was very thin- but they were springy and moist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FrackFamily5 CA—>CT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/frackfamily5/"
                }
            }
        ]
    }
]