[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/359/bread/quick-bread/fruit-bread/",
                    "name": "Fruit Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/343/bread/quick-bread/fruit-bread/banana-bread/",
                    "name": "Banana Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218541/caramel-macchiato-banana-bread/",
        "name": "Caramel Macchiato Banana Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F676783.jpg",
            "width": 5184,
            "height": 3456
        },
        "datePublished": "2020-06-19T03:45:22.000Z",
        "description": "Baking banana bread is one of my favorites, and I love nothing more than enjoying a slice with a nice cup of coffee. This was the inspiration for my recipe, which features a coffee infused loaf and a rich caramel glaze.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H5M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 9x5-inch loaf",
        "recipeIngredient": [
            "cooking spray",
            "2 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon ground cinnamon",
            "⅛ teaspoon salt",
            "2 large very ripe bananas",
            "½ cup caramel macchiato flavored liquid coffee creamer (such as International Delight®)",
            "½ cup vegetable oil",
            "2 eggs",
            "⅔ cup white sugar",
            "2 tablespoons instant coffee granules",
            "6 tablespoons unsalted butter",
            "6 tablespoons packed brown sugar",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x5-inch loaf pan with cooking spray. In a bowl, whisk together flour, baking soda, baking powder, cinnamon, and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, mash the bananas with a fork until almost smooth, and stir in the coffee creamer, vegetable oil, eggs, sugar, and instant coffee granules until the coffee granules have dissolved. Gradually stir in the flour mixture, about 1/2 cup at a time, until batter is almost smooth, and pour batter into the prepared loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until a toothpick inserted into the center of the banana bread comes out clean, about 1 hour. Allow to cool before removing from pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the unsalted butter in a saucepan over medium heat, and mix in the brown sugar and vanilla extract. Bring the mixture to a boil, stirring to dissolve sugar, and reduce heat to a simmer. Simmer the syrup for 3 minutes, allow to cool to a warm but liquid temperature, and pour the glaze over the banana bread. Serve when glaze has set.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Fruit Bread Recipes",
            "Banana Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dianne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.331658291457287,
            "ratingCount": 199,
            "itemReviewed": "Caramel Macchiato Banana Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "333.9 calories",
            "carbohydrateContent": "43.3 g",
            "cholesterolContent": "46.3 mg",
            "fatContent": "17 g",
            "fiberContent": "1.2 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "184.9 mg",
            "sugarContent": "20.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-22T11:26:55.797Z",
                "reviewBody": "I'm the submitter of this recipe, and I thought I'd give a few tips and pointers! First, this recipe is very versatile. I tried many different measures of the coffee and sugar and they all worked just fine, I settled on the final measurements just as a personal preference. If you like strong coffee flavor, you can easily add more coffee granules. If you like it more or less sweet, you can add more or less sugar. It's up to you! Also, I always use really ripe bananas. The blacker the better! As for the glaze, I've never had a problem with it, it always comes out just fine. So here's my advice. Make sure you PACK the brown sugar. If you are having problems with the glaze separating, then you might not have enough brown sugar, you can try adding a touch more. Make sure you bring it up to a full boil and simmer for at least 2 minutes (that's usually what I do). I let it cool only long enough for it to stop bubbling, then pour it over the loaf. I just tried tonight adding the vanilla after boiling, and that works great too. Good luck! And I hope you enjoy this bread as much as my family and friends do!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-20T12:28:49.063Z",
                "reviewBody": "I used CoffeeMate's White Chocolate Caramel creamer, melted butter instead of vegetable oil and half/half AP flour and whole wheat flour. I made muffins out of this recipe so baking time was 20 minutes at 350*. I was up early enough so I could bake the muffins and let them set a bit before I glazed my muffins. I set the muffins on cookie cooling sheets that I set inside baking sheets, then I used a spoon to drizzle the glaze over the top. This way, any excess glaze would be caught on the cookie sheet. This banana bread is one of the best we've ever had. I've had two muffins myself this morning but my oldest had four and my youngest ate three. We love it. The flavors are just wonderful and I love the hint of coffee combined with the banana, white chocolate and caramel. Really fantastic muffin recipe--thanks for the new twist! We'll make this again soon. EDITED: All gone. My boys finished off the rest of the muffins by lunchtime. Huge hit, Dianne. Guess I'll be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-09T20:41:39.187Z",
                "reviewBody": "I had heard others rave about this and couldn't wait to try it. It turned out wonderful! I had three bananas that needed to be used so I used all three. I also have instant espresso so I used that. It is moist and delicious. I read on the Buzz that others had the glaze turn out crunchy. Make sure that you lower the temperature and just simmer for three minutes. Otherwise, you'll make penuche. I was taught to always add vanilla at the end off the heat to preserve maximum flavor so I did that in the glaze. I want to try this recipe again using pumpkin puree in place of the bananas. I bet that will be great, too. I will update my review and let you know!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "janet7th",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3202695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-18T17:41:03.797Z",
                "reviewBody": "I was in a hurry so I used Self-rising flour, omitted the salt and baking soda but did use the baking powder.  I used one big bowl and put everything, all ingredients in at the same time, including the glaze ingredients and mixed with my hand mixer.  I did not melt the butter, just cut up in pieces so it would mix easily and sliced the bananas and mixed them with mixer too. I then made muffins instead of bread, baked 350 for 15-20 minutes.  They are the tenderest, moistest, banana bread muffins I have ever had, a definite keeper.  Easy too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jalexander",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1995645/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-07T16:18:32.203Z",
                "reviewBody": "The caramel macchiato is my husband's favorite drink at the coffee stand.  He also happens to love banana bread, so when I saw what Dianne had created, I knew I had to try it.  The bread is so moist and flavorful, with all of the flavors being subtle and not overpowering.  My only minor issue with the bread was the glaze.  After boiling the ingredients together, mine was very watery and without constant stirring, the butter kept separating.  To make it into a spreadable consistency, I added in some powdered sugar.  Not sure how much, I just dumped some in and mixed it to a light brown frosting.  It was perfect, and we were licking the pan clean after the bread was glazed.  I am sure this will be a repeat in this house!  Thanks for another wonderful recipe, Dianne:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mominml",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mominml/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-26T23:57:58.42Z",
                "reviewBody": "Very tasty indeed! I used a caramel vanilla creamer and otherwise followed the recipe for the ingredients. I made muffins of them because they are easy for me to share that way. I got 12 regular-sized and 6 mini-sized muffins from the recipe---perfectly domed in 20 minutes for the regular size and 15 minutes for the minis. One note regarding the glaze---do not let it cook and/or cool too long! I found THAT out! Very nice recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-24T23:17:04.413Z",
                "reviewBody": "The only word to describe this banana bread is PERFECT! I stink at making banana bread but had to try this one because of all the good reviews...boy am I glad I did. It came out absolutely moist and delicious. It had the perfect blend of coffee banana and caramel. The icing just put them over the top. I made them into muffins after reading Sarah Jo's review just because I know my family would eat the muffins over the bread. I baked them at 350 for about 18 minutes and they were perfect. I will make sure I have the ingredients for this at all times because I know it's going be made quite often here (already my second batch in 2 days). Thanks Dianne for sharing this awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kori Lavertue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/korilynne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-19T01:59:16.483Z",
                "reviewBody": "Super moist! The caramel flavor needs intensified. Next time I will add Hershey caramel sauce to the batter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curly Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/curlysue/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-24T01:16:06.75Z",
                "reviewBody": "We never got to the glaze....OMG!!! the bread was fabulous. I'll have to make the glaze the next because there be a next time. My hubby said right off the bat...this is da bomb! And I had already tasted the batter and had to keep my spoon out of it. Then the dreaded wait. It just looked smelled and tasted fabulous. I totally am amazed on how all the flavors worked together in this recipe. Amen!! TY Dianne. It's wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-20T01:33:09.29Z",
                "reviewBody": "Just made this without the topping. It was OK. I used 3 bananas because I wanted a strong banana flavor. Unfortunately even with 3 still not a strong banana flavor. My bananas were ripe but not very ripe. Does that make a difference. I have 3 bananas left maybe I'll wait another few days and make another loaf to see if that makes a difference. Wish someone could tell me if using very ripe bananas is the trick. Don't get me wrong bread was moist. I only had to bake for 50 min. I also think it could use a little more salt and even sugar especially if you are not using the topping. We don't like sweet sweet but this just felt like it needed more. Again maybe if the bananas were riper they would be sweeter and then you wouldn't need more sugar. Hmmmm??? Guess will have to try again..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetsuzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4477695/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Caramel Macchiato Banana Bread",
            "description": "Your favorite coffee shop drink is a sweet bread!",
            "uploadDate": "2017-10-27T20:39:08.236Z",
            "duration": "PT1M9.57S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd5a3087f-949f-431a-9991-5214b96b1dc4%2Fe22006dc-418e-48ac-b777-0febde9cefe6%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5627293983001"
        }
    }
]