[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218659/dans-old-fashioned-white-bread/",
        "name": "Dan's Old Fashioned White Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4476061.jpg",
            "width": 1304,
            "height": 1304
        },
        "datePublished": "2020-06-19T03:45:25.000Z",
        "description": "This is a rich, old-fashioned white bread I've improved on from my grandmother. It is a must to make several batches because this bread just disappears around people.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT3H35M",
        "recipeYield": "2 9x5-inch loaves",
        "recipeIngredient": [
            "2 cups milk",
            "⅓ cup white sugar",
            "⅓ cup honey",
            "2 teaspoons active dry yeast",
            "6 cups bread flour, or as needed - divided",
            "1 teaspoon salt",
            "¼ cup butter, softened"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour milk in a heatproof bowl, and gently warm in a microwave oven set on Low until milk is about 100 degrees F (38 degrees C), about 15 seconds. Mix in the sugar and honey, and stir to dissolve. Mix in the yeast, and let stand until the yeast activates and forms a creamy layer on the milk, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 4 cups of bread flour and the salt into the mixing bowl of a stand mixer; pour in the yeast mixture, and mix on slow speed with a mixing paddle until thoroughly combined, about 1 minute; dough will be very wet. Add the butter, and mix in the remaining 2 cups of bread flour, or as needed, until the dough begins to gather itself into a ball. Change the fitting from the mixing paddle to a dough hook, and machine-knead the dough until smooth and springy, about 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the dough onto a well-floured work surface, and knead until you see the surface of the dough begin to break during folding and kneading. Roll dough into a ball, and place into a lightly floured large bowl. Cover the bowl  with a kitchen towel, and set into a warm place to rise until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spray 2 9x5-inch loaf pans with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, remove to the floured surface, and knead for 2 more minutes; cut the dough in half with a sharp knife. Form the dough into logs, adding more flour if necessary, and place the loaves into the sprayed pans. Cover the pans with a kitchen towel, and place into a warm place to rise until doubled, about 1 more hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bread loaves into the preheated oven, and turn the heat down to 350 degrees F (175 degrees C). Bake until the tops are golden brown and the loaves make a hollow sound when thumped, about 25 minutes. Cool the pans on baking racks for about 5 minutes before turning the bread loaves out to finish cooling on racks. Cover the loaves with a kitchen towel as they cool.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dano_77"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 32,
            "itemReviewed": "Dan's Old Fashioned White Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "79.8 calories",
            "carbohydrateContent": "11.6 g",
            "cholesterolContent": "10.1 mg",
            "fatContent": "3.5 g",
            "fiberContent": "0.1 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "178.8 mg",
            "sugarContent": "11.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-06-13T20:33:21.173Z",
                "reviewBody": "I proofed the yeast in the bowl of my Kitchen Aid with the warm milk and sugar for ten minutes then added the honey the melted butter and the dry ingredients. I did use part whole wheat flour. I did need almost 1/4 of a cup more flour than the recipe called for to get it to form into a ball and jump on the hook. I kneaded the dough with the dough hook for five minutes. Once it was done kneading I set it to rise in a covered greased bowl on a warm heating pad until it doubled. I then used my 1/2 cup dry measuring cup to measure out balls rolled them tight and plopped them into 12 greased muffin tins. I let it sit on the warm heating pad covered with saran wrap for a half hour then baked it at 400 degrees for 12 minutes. Out of the oven I brushed each roll with vegetable oil to make a soft top. I got twelve GINORMOUS rolls out of this recipe (I made them bigger so that I would not have to use two muffin tins) instead of two loaves. This bread recipe is quite good. I was worried that the amount of yeast might not be enough but it rose perfectly and still made one of the biggest rolls I've ever seen. This bread IS a little on the sweet side if you're looking for a more savory-yeasty roll this may not be for you. My whole family loved it it paired nicely with Potato Soup. I'll make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-02T21:55:57.127Z",
                "reviewBody": "This was my first time making bread. The recipe worked well and the bread was very good. Be careful with the baking time. I needed about five additional minutes. I will do it again by the way my wife loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kenneth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2866868/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-21T15:08:19.753Z",
                "reviewBody": "Somewhat too sweet and white for me. I lost the sugar and replaced 1 cup of bread flour with 1 cup whole wheat flour. To the poster who had to increase the time I use a dial type meat thermometer and look for 200F. Also oven temperature accuracy is quite varied get a 3 thermometer that hangs from your rack soon you'll just know how much you need to increase or decrease the dial.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "augie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2774280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-21T03:11:04.237Z",
                "reviewBody": "I cut this recipe in half to only make one loaf. The entire family loved it. It is a nice hearty bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "freespiritsoldier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7537267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-21T15:22:49.157Z",
                "reviewBody": "This is a nice slightly sweet basic white bread recipe which is exactly what I was looking for. I did make a change using dry milk and water in place of the milk. I'm just not a huge fan of the heating/cooling thing with the milk and prefer to just get the water at the right temp from the get go. It's a laziness thing (or just efficiency) I'm sure. I did this in my KA mixer. Tossed in the water yeast and a little of the sugar let it foam (maybe 10 mins) and then added everything else except the final cup of flour. Put the dough hook on and let the KA do all the work. When it comes together I add the final flour a little at a time until the dough pulls away from the side of the bowl. Once its good I let it knead for me on speed 2 for about 7 minutes. Then you can pick up in about the middle of step 3 here.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookin Up A Storm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jansrecipes/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-24T17:56:46.15Z",
                "reviewBody": "It is really good and it definitely disappears fast. So maybe I need a bigger mixer to do two batches..hahhahaha",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Taminara Marjadi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2155460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-12T18:34:07.787Z",
                "reviewBody": "Great bread for a baking beginner like me! I forgot the sugar but with the honey it turned out to be plenty sweet. The only problems I had while making this bread were due to my own mess ups. A great bread recipe for those just starting out baking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "navis09",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7553057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-30T23:11:36.843Z",
                "reviewBody": "Excellent bread. A bit of work kneading and worth it. Mine rose slowly (It's cod here today) but they filled out nicely just like his photo. This is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PatAllen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7909898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-15T16:42:29.653Z",
                "reviewBody": "This bread is awesome! The first 2 times I made this bread the dough did not rise double when punched down. When I tired it again I mixed the dough up and kneaded it maybe a min or 2 divided it put it into the loaf pans and let it rise to double and baked it....turned out perfect! This one is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Riesgo.ginger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8653124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-07T18:56:02.360Z",
                "reviewBody": "I was doubtful that this bread would turn out ok as I baked it and I was right. The teaspoon of yeast, I thought was not enough. However, I made the recipe as written assuming that sugar/honey would help the yeast to work better. It didn't. After 90 minutes into the second rise, the bread barely rose. At 2 hours, the bread reached the rim. It didn't have much oven spring. Also, it was too sweet for a white bread. It think this dough is better suited to cinnamon bread/rolls. I'm giving it 3 stars. However, I will try to make it again. Other factors may have been at play - mainly the cold weather. I will update the review then.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Queen G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12130902/"
                }
            }
        ]
    }
]