[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219065/willard-family-german-chocolate-cake/",
        "name": "Willard Family German Chocolate Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5625976.jpg",
            "width": 3024,
            "height": 2604
        },
        "datePublished": "2020-06-19T03:45:54.000Z",
        "description": "This recipe has been in my family for a very long time. My great-grandma could make this with her eyes closed. My father was born on her birthday so she made this cake for him every year. Even shipped it to him in Korea when he was stationed there in the army.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "1 3-layer cake",
        "recipeIngredient": [
            "1 (4 ounce) package sweet baking chocolate (such as Baker's German's Sweet Chocolate®) - broken into pieces",
            "½ cup boiling water",
            "1 cup margarine, softened",
            "2 cups white sugar",
            "4 eggs, separated",
            "1 teaspoon vanilla extract",
            "2 ½ cups sifted all purpose flour",
            "1 teaspoon baking soda",
            "½ teaspoon salt",
            "1 cup buttermilk",
            "1 cup evaporated milk",
            "1 cup white sugar",
            "3 egg yolks",
            "¼ cup margarine",
            "1 teaspoon vanilla extract",
            "1 ⅓ cups sweetened flake coconut",
            "1 cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 8-inch cake pans and line bottoms with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chunks of chocolate into the boiling water and stir until the chocolate has melted; set aside to cool. In a large bowl, beat 1 cup of softened margarine with 2 cups of sugar with an electric mixer until light and fluffy. Stir in 4 egg yolks, one at a time, beating well after each addition. Beat in 1 teaspoon of vanilla extract and the chocolate-water mixture until thoroughly blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift the flour, baking soda, and salt into a bowl. Beat the flour mixture into the liquid ingredients, alternating with buttermilk, in 3 or 4 additions. Beat until batter is smooth, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a metal or glass bowl, beat the reserved egg whites until they hold stiff peaks when the beaters are lifted straight up. Gently fold the beaten egg whites into the batter, keeping as much volume as possible. Pour the batter into the prepared cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cakes have browned lightly and a toothpick inserted into the center of a cake comes out clean, 35 to 40 minutes. Allow the cakes to cool in pans before removing.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make frosting, pour the evaporated milk into a large saucepan, and mix in 1 cup of sugar, 3 egg yolks, 1/4 cup of margarine, and 1 teaspoon of vanilla extract. Bring to a boil, reduce heat to medium, and cook until thickened, stirring constantly, about 12 minutes. Remove from heat, and mix in the coconut and pecans, beating the frosting until cooled and spreadable. Frost and fill the cake with the coconut frosting.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kelly MacDonald"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.75886524822695,
            "ratingCount": 141,
            "itemReviewed": "Willard Family German Chocolate Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "809.3 calories",
            "carbohydrateContent": "101.8 g",
            "cholesterolContent": "144.1 mg",
            "fatContent": "41.8 g",
            "fiberContent": "3.7 g",
            "proteinContent": "11.5 g",
            "saturatedFatContent": "11.4 g",
            "servingSize": null,
            "sodiumContent": "617 mg",
            "sugarContent": "74.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-02-07T02:49:14.653Z",
                "reviewBody": "Fabulous! This was my first attempt at a German Chocolate cake, I kind of expected it to be a little more complicated but this was easy. I had to use the milk and vinegar substitute for the buttermilk because I forgot to bring my list to the store and of course forgot the buttermilk :( It worked fine. I used butter in both the cake and the frosting since I never have margarine. I also made some chocolate frosting for the sides of the cake, I didn't have enough of the coconut frosting but I think that is because I'm a little heavy handed with frosting. My family was sad when this cake was gone and there was a fight over the last piece ( I won! ) Thanks for the great recipe, its a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-01T17:07:20.877Z",
                "reviewBody": "Way more work than what it is worth. Also there is a recipe inside the pkg of Baker's German Sweet Chocolate that is almost exactly the same and less tedious. I agree w/ other reviewers who say it is not chocolate enough. The one inside the candy bar's pkg tastes more chocolately, more than likely because they use 1/2 c less flour. They have you melt the chocolate in the butter instead of water (water dilutes, butter enhances). So there is a not the dilution of the water in the cake. Also in the pkg directions you don't have to separate the eggs and beat the egg whites stiff, just add the eggs. Candy bar's recipe tastes better and is less work.\n(To be honest, this is so close to the candy bar recipe it seems like a lightly modified knock-off.)They make it into cupcakes but just use cake pans instead. The frosting recipe is the same as this one too. I also agree that you have to do the frosting plus 1/2 to barely have enough to do a cake. The candy bar's package gives you more frosting for it does it as 1.5 of this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "M2mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9958530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-20T02:44:17.987Z",
                "reviewBody": "GREAT recipe! The cake was moist and delicious and the frosting amazing! I've made many other types of chocolate cakes from scratch but this was my first German Chocolate cake. Rave reviews from all our guests who shared it with us. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3818292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-17T16:35:30.673Z",
                "reviewBody": "Good",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara Wright",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4090420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-12T21:53:08.247Z",
                "reviewBody": "Great Cake! My brother doesn't like cake at all, but he has always loved German Chocolate cake.... so he knows when it's good and he loved this cake and frosting. As did everyone else. It was super light, fluffy and moist (don't overcook it even a little). I made 36 cupcakes and they were amazing. You do need to cook the frosting and stir for 10-12 minutes, but I thickened it too much because as it cooled it got much to thick especially after adding the nuts and coconut flakes. To correct for this just add SWEETENED CONDENSED MILK and a little real milk until it brings it to the consistency you can spread. I would suggest when you are heating the sauce for the frosting you should stop cooking it whenever you notice it no longer falls immediately back into place when you move your spoon through the sauce. This will be close to 9-12 minutes depending on your stove. Remember, as it cools it will get even firmer. Other than my learning curve, this recipe is an ABSOLUTE WIN and I am using it anytime I need German chocolate cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nina ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thejoyninja/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-18T20:55:46.537Z",
                "reviewBody": "Delicious cake and recipe was easy to follow! I love to bake but am somewhat of a beginner and this recipe was straightforward and easy to follow! The frosting came out great. I know my husband will love it for his birthday!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jskates67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8647400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-26T15:46:45.25Z",
                "reviewBody": "Edited based on making this again as cupcakes:)...Everyone raved about this cake - I've never made it before and I think it came out great. I wanted my frosting to cover it entirely so ended up with little bare spots around the edges that I filled in with chocolate frosting (\"Creamy Chocolate Frosting\" by Tracy on this website). The frosting is only meant to cover the top and in between layers so make more if you want it to be more rich and/or have more full coverage....I've since made this again as cupcakes! I've posted a picture of them. I followed the recipe to a 't'. Did not make any modifications and again received RAVE reviews! People went out of their way to tell me how great they were....To make them into cupcakes I filled the paper cake cups to about 2/3-3/4 full and baked at 350 for about 18 minutes. You know they are ready when the tops look porous like sponges and the edges get just a little bit brown. Also use a toothpick:) I was able to make 24 cupcakes out of this recipe and the coconut frosting was the perfect amount for them. I used my same chocolate frosting to fill in around the edges.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jules",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2117103/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-27T06:00:18.513Z",
                "reviewBody": "Great cake. Made it for my husband on our anniversary. I substituted some of the boiling water with some coffee. I would strain the frosting mixture over a colander in case you accidentally cook some of the egg (like I did).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Raye Ann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2043058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-03T09:47:21.467Z",
                "reviewBody": "The recipe looks complex but is so worth it! I'm not a very experienced baker so was a bit worried but followed the instructions to the letter and it came out perfect:) Just a note: the picture contains butter icing not in the recipe on the sides. Budget a bit of exra marge icing sugar and cocoa for that:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tally1302",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9539591/"
                }
            }
        ]
    }
]