[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219289/high-five-orange-rolls/",
        "name": "High Five Orange Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F733442.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2020-06-19T03:46:33.000Z",
        "description": "My son loves the orange rolls that come in a can. But he wanted them homemade. After trying a couple recipes and none of them meeting his approval, I came up with my own. After getting thumbs up AND a high five from my son, I finally had a recipe! These are made overnight and baked in the morning.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT11H35M",
        "recipeYield": "18 rolls",
        "recipeIngredient": [
            "1 tablespoon white sugar",
            "1 tablespoon active dry yeast",
            "1 cup warm milk",
            "½ cup warm water",
            "1 egg, beaten",
            "½ cup orange juice",
            "½ cup butter, melted",
            "¼ cup instant vanilla pudding mix",
            "1 tablespoon orange extract",
            "5 cups bread flour, or more if needed",
            "1 teaspoon salt",
            "½ cup butter, softened",
            "2 tablespoons grated orange zest",
            "1 teaspoon orange extract",
            "¾ cup white sugar",
            "1 (8 ounce) package cream cheese, softened",
            "½ cup butter, softened",
            "2 cups confectioners' sugar",
            "2 teaspoons orange extract",
            "2 tablespoons milk, or more as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle 1 tablespoon white sugar and the yeast over the warm milk and warm water in a bowl. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes. Mix in the egg, 1/2 cup orange juice, melted butter, vanilla pudding mix, and 1 tablespoon orange extract. Stir in 5 cups bread flour and salt. Add more bread flour if the dough is too sticky. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, 8 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the dough in an oiled bowl and cover with a clean cloth. Allow the dough to rise in a warm place until doubled in size, about 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1/2 cup softened butter with the orange zest and 1 teaspoon orange extract in a small bowl until smooth. Set aside. Grease a baking sheet, or cover with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough out on a floured surface and roll out into a 24x12-inch rectangle. Spread the butter mixture evenly over the dough, then sprinkle with 3/4 cup white sugar. Roll up the dough, beginning with the long side. Cut the dough into 18 1 1/2-inch rolls. Arrange the rolls cut-side up on prepared baking sheet. Cover with plastic wrap and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the plastic wrap from the rolls and allow them to rise in a warm place for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown, 25 to 30 minutes. Allow rolls to cool slightly before frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the rolls are baking, cream together the cream cheese and 1/2 cup softened butter until smooth. Stir in the confectioners' sugar and 2 teaspoons orange extract. Stir in milk, a little at a time, until frosting is smooth and spreadable. Spread the frosting over the slightly cooled rolls.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rae"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.513888888888889,
            "ratingCount": 72,
            "itemReviewed": "High Five Orange Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "438.1 calories",
            "carbohydrateContent": "55.6 g",
            "cholesterolContent": "65.9 mg",
            "fatContent": "21 g",
            "fiberContent": "1.1 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "12.8 g",
            "servingSize": null,
            "sodiumContent": "331.5 mg",
            "sugarContent": "26.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-11-02T11:22:09.197Z",
                "reviewBody": "I am so happy with this recipe, I don't know where to start! These rolls are absolutely perfect in every way. I followed the recipe and the \"Cook's Note\" and will never change a thing. We have been on a cinnamon roll kick lately and I have been searching for the perfect dough. THIS is it! So tender, they almost melt in your mouth. The orange flavor in the dough, filling and frosting is spot on. The cream cheese frosting...addictive. This recipe is also very easy and quick. They doubled in 1 hour on the first rise. I was serving these as dessert, so no overnight refrigeration. The dough is so easy to work with, that the rolling and filling took approx. 5 minutes to complete and they were in the pan for the second rise. They doubled in 25 minutes and into the oven they went. Exactly 25 minutes later they were perfectly baked and the wonderful orange aroma was filling the kitchen. We couldn't wait. My aunt and I stole a corner roll and ate it straight from the oven. I knew right there that there is no reason to search any further for the perfect recipe. rae, Thank You for sharing your outstanding High Five Orange Roll recipe. We will enjoy it often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-21T04:50:44.01Z",
                "reviewBody": "MAKE THIS ONE!!! Oh my gosh. I have tried a LOT of recipes... I'm a food blogger and a stay-at-home mom with just 1 kid so far. And after our first bites my husband and I both declared that it might be THE best recipe I have EVER made. I mean I this will definitely be THE Christmas morning recipe for my family and I think I may even refuse to make it any month other than December just to keep a special Christmastime feeling in the taste. It is PERFECTION! I followed the directions exactly other than using 4 cups of bread flour and 2-3 cups of regular flour. Bread flour actually makes for a tougher heartier dough and I like a little of the softer stretchier aspects of regular flour in breakfast pastries. Yes it took me about 6 cups of flour not 5. I added maybe another cup in the mixer and probably another cup kneading. I only kneaded 7 minutes because I kept having to add more flour. I was worried they'd be too dry... but they were perfect! I was also worried because the dough didn't taste amazing on its own but it's ALL about the filling and frosting. The filling ends up caramelized at the bottom of the pan... SO GOOD. I also followed another reviewer who used one 9x12 glass baking/casserole pan and another smaller square one greased bottom and sides saving the smaller pan for another day. Basically these rolls are soft moist stretchy sweet-but-citrusy perfection with a hint of savory (salt) in the cream cheese. You CANNOT go wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa.murakami",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4790572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-07T15:38:09.847Z",
                "reviewBody": "A MUST! Wonderful! I saw this recipe and had to try it. It makes plenty so I knew I would have enough to give to a friend and enough for my family. I made the dough but erred several times. I didn't realize it only called for 1/4 cup of the pudding mix until AFTER I had already added the whole package. Also while writing this review and re-reading the recipe...I discovered that I inadvertantly left out the salt. It made no difference. These stilled turned out wonderful. I divided the dough in two uneven portions just to make it easier for me to work with. The smaller portion I made into 9 rolls which I placed in a 9x9 inch pan. The larger portion I cut into 12 rolls and placed in a 9x13 inch pan. (I used a long piece of dental floss slid under the roll criss-crossed on top and pulled to \"cut\" each roll. Works very nicely and keeps the rolls nice and round.) I placed the larger pan in the fridge to save and bake the next day. The smaller pan I let rise to bake the same day. We keep the house cool so I let them rise in a slightly warm oven (that had been turned on for just a minute then turned off) with a bowl of hot water on the rack underneath. After I baked and frosted them hubby delivered them to my friend who raved. I couldn't wait to bake the second pan the next day for us. Well worth the wait! Makes more than enough frosting so I froze some for the next time. Do not leave out the zest as that adds a deeper orange flavor. I will also add zest to the frosting next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Poutbaby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2166546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-06T09:23:52.953Z",
                "reviewBody": "I made these rolls before they were famous!!! This is my original review These really are wonderful breakfast rolls perfect light taste for summer Breakfast s. I halved the recipe and made these in my bread machine placing all the wet ingredients in first followed with the dry. Once the dough cycle had finished I rolled out the dough I did change the filling slightly to the one in the recipe. I melted the butter and added the orange extract to it (did not use the zest as I am not a fan) brushed this mixture on to the rolled dough I then sprinkled with Brown sugar and cinnamon topped with a handful of raisins. Rolled the dough and cut using a sharp bread knife (the halved recipe made 12 standard size rolls). I placed in the greased dish and covered with film I let these rise for a further 30 minutes in my cold oven with the light on removed and stored in the fridge covered overnight. The following morning I removed the rolls from the fridge and let sit on the counter for about 45 minutes to bring them to room temperature before baking. Once baking I started to make the glaze I used 2 tablespoons of freshly squeezed orange juice in place of the milk and orange extract. Thank you for sharing this recipe I know I will be baking them again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheBritishBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/apple-strudel/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-13T13:41:39.437Z",
                "reviewBody": "A terrific recipe! Absolutely perfect in every way. They were so delicious I baked these rolls 3 times in less than a week. Once I substituted white sugar with a generous sprinkling of brown sugar ground cinammon about 1/8 cup of orange juice and raisins in addition to what the recipe called for before rolling the dough. My husband begged me to put it away because he couldn't stop eating the rolls after they were baked. The rolls were soooo soft and the flavor was awesome! Thank you very much for sharing such a wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lupe Cruz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8062113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-07T15:11:19.42Z",
                "reviewBody": "WOW that pretty much sums up these rolls. If heaven smells like anything it is these rolls my apartment smelled so good while baking them and I absolutely could not wait for them to be done. If you are looking at this recipe and are a first time bread baker do no be put off by kneading the dough. The dough was VERY easy to work with and the 8-10 minute guideline was perfect. My rolls were not dense or mushy at all. I also followed another reviewer and added 5 minutes to the bake time since I was using a glass dish and the rolls came out perfect! I will upload a picture next time I make these because there are none left this morning =) This should be called double high five orange rolls because I will never use another sweat roll recipe again! One more thing these rolls raised a lot when I baked them so make sure you don't cut them too thick or you might be in trouble! Next time I will just divide the rolls into two pans",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.Gariner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7953768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-30T20:54:57.643Z",
                "reviewBody": "We L-O-V-E-D these! We made a couple of adjustments to the recipe. But they were great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catm16",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7973249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-11T18:50:08.433Z",
                "reviewBody": "I spent A LOT of to try this recipe. Bought orange extract pudding mix bread flour used 3 sticks of butter... Groceries aren't cheap these days! I had read all of the positive reviews and figured they would be great. In my opinion they weren't. They had no flavor. I understand I'm in the minority here but I followed the recipe and instructions exactly and they didn't turn out for me. But Rae - I do LOVE your profile pic:-) the rolls just weren't for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "amydoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-06T23:51:38.363Z",
                "reviewBody": "I've never made sweet rolls before and I decided to take the plunge with these! I followed the recipe exactly and they turned out perfect! I think I baked them for 30 minutes instead of 25 since I used a glass dish. Super yummy this is a must try recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "venzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7231796/"
                }
            }
        ]
    }
]