[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219648/honey-brown-rolls-or-loaves/",
        "name": "Honey Brown Rolls or Loaves",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F768538.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:46:55.000Z",
        "description": "This bread is just like the bread served at several famous casual dining chains. It's very moist, sweet and just hard to stop eating!  Great with soup.",
        "prepTime": "P0DT1H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT2H55M",
        "recipeYield": "1 dozen rolls",
        "recipeIngredient": [
            "1 ½ cups warm water (75 to 85 degrees F, 25 to 30 degrees C)",
            "1 tablespoon white sugar",
            "2 tablespoons butter, softened",
            "½ cup honey",
            "2 cups bread flour",
            "1 ⅔ cups whole wheat flour",
            "1 tablespoon vital wheat gluten",
            "1 tablespoon unsweetened cocoa powder",
            "2 teaspoons instant coffee granules",
            "1 teaspoon salt",
            "2 ¼ teaspoons bread machine yeast",
            "2 teaspoons sesame seeds for sprinkling"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the water, sugar, butter, honey, bread flour, whole wheat flour, vital wheat gluten, cocoa powder, instant coffee granules, salt, and yeast into the pan of a bread machine in the order recommended by the manufacturer. Set the machine for the dough setting, start, and allow machine to complete cycle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the bread pan with dough from the machine, and set pan into warm water (about 90 degrees F, 32 degrees C). Cover the top of the pan with a towel, and allow the bread to rise in the pan until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough out onto a floured work surface, punch down, and divide into 12 equal pieces for rolls, or 3 pieces for small loaves. Form the dough into balls. Line a baking sheet with parchment paper, and place rolls on the prepared baking sheet. Sprinkle with sesame seeds. Place the baking sheet into a warm place, and allow to rise until bread is doubled, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spray the inside of the preheated oven with water, and immediately place rolls in oven. Bake until rolls are light golden brown, 15 to 20 minutes. For loaves, bake until browned and they sound hollow when tapped, 20 to 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.111111111111111,
            "ratingCount": 18,
            "itemReviewed": "Honey Brown Rolls or Loaves",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "212.1 calories",
            "carbohydrateContent": "42.3 g",
            "cholesterolContent": "5.1 mg",
            "fatContent": "3 g",
            "fiberContent": "3 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "210.7 mg",
            "sugarContent": "12.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-01-01T18:55:48.467Z",
                "reviewBody": "I do not have a bread machine to make this recipe I used my Kitchen Aid mixer. I think that any good bread recipe can be easily adapted to be made by hand. I proofed the yeast with the warm water (that I dissolved the coffee granules into) yeast sugar and honey for ten minutes until the yeast \"bloomed\" then added the melted butter and all the dry ingredients. I do NOT have bread flour just regular AP flour. I did not need the vital wheat gluten. This dough was REALLY wet it took another 1 1/4-1/2 cups AP flour to get it to form a ball that I could knead with my dough hook. I kneaded it for five minutes with the dough hook then set it to rise in a greased bowl on a warm heating pad for a couple hours. I then formed it into large rolls and set the formed rolls into greased muffin tins (one 12-cup muffin tin was just right for me) then covered it with saran wrap and let it rise for 45 minutes on the warm heating pad. After the rolls were done I brushed them with vegetable oil for tender tops. I did not sprinkle the tops with sesame seeds as I didn't have any. I think this recipe is a good recipe I know she was going for a knockoff of the Outback's bread--and it's very close. Very chewy roll recipe with a nice fluffy interior. I think it's a good bread recipe today but the flavors will be even better the next day. I think it's a little too sweet for me now but that might mellow by tomorrow.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-09T20:45:22.36Z",
                "reviewBody": "This adapted very well to using my KA mixer. Proofed the yeast (1 pkt of active dry yeast) in warm water (110 degrees F) for about 10 minutes until it reached foamy stage and then added melted butter instant coffee (to dissolve) and honey to the water and stirred it up. I mixed together 1 cup of bread flour 2/3 cup wheat flour sugar salt vital wheat gluten and the cocoa; added this to the mixer bowl and started mixing at a low speed. Then gradually added the remaining 2 cups of flours to reach the right consistency and kneaded for about 4 minutes. Dumped into an oiled bowl and let rise for about an hour. I then formed into rolls and let rise for about another 45 minutes brushed on an egg wash and then into the oven. These soft rolls (definitely not dense) baked up beautifully with a nice flavor and chewy texture. They were just a little doughy in the center but that could be just a matter of difference in oven temperatures. Next time I will bake for an additional 5 minutes. The recipe ingredients were spot on and I did not have to add additional flour. I've not yet baked a lot of rolls and bread but these rank right up there with the best so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-18T05:17:15.747Z",
                "reviewBody": "This was a FANTASTIC recipe. If your buns/loaves came out too dense that means you didn't allow them to rise properly. These were light and airy and perfect with soup.:) Thanks for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BriannaH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3067749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-28T23:08:54.173Z",
                "reviewBody": "This was a gooey mess!!! I thought I could kneed it myself but NOT. I followed the recipe and instructions exactly. I'll be interested to read others' reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandra2312",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3012875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-08T17:57:38.167Z",
                "reviewBody": "Great flavor but a little more dense than we prefer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Patti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3792528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-13T16:57:27.85Z",
                "reviewBody": "Hi Ser Thanks for the receipe. I made these rolls and I must say they were wonderful. The only change I made to the recipe was 1/2 cup vital wheat gluten flour cut down on the bread flour by 1/2 cup and instead of honey I used Agave Nectar. Thanks again for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6418792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-10-19T05:18:45.02Z",
                "reviewBody": "This is a recipe that I submitted to Allrecipes and they published.  However, they changed the directions a bit and I would like to reiterate my directions.  I do not recommend putting the breadmaker pan in warm water and it is not necessary.  Please note this dough is very wet, which is correct, so flouring your hands and having a scaper available to \"punch\" the dough and shape the dough is very helpful.  \n\nMY instructions:  After kneading is complete, remove pan and turn machine off. Put pan with dough in a warm place and let rise for 1 hour to twice the size.  (You can turn your oven on 200 degrees for a couple of minutes to achieve the right amount of warmth, then turn it off.  Cover dough with a clean lint-free towel.)\nTurn dough out onto a floured surface and punch down.  Flour hands and shape dough into 12 equal sized balls or 2-3 loaves. Place on a parchment lined cookie sheet.  Sprinkle with your choice of toppings.\nLET RISE AGAIN, usually about 30 minutes, until doubled in size.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/suzyblueyes/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-27T20:51:48.567Z",
                "reviewBody": "I made this by hand rather than using a machine. I added the yeast to the sugar and warm water and let it proof a bit. Then I added the honey and let it finish proofing. Next I mixed in the butter instant coffee and cocoa gluten and salt. Using a wooded spoon I mixed in the 2 cups of bread flour. I then added a little more than 1 cups of wheat flour to get the dough to the consistency. I turned it out and kneaded it for 5 or 6 minutes. I let the dough rise for about an hour in the oven with a bowl of hot water underneath it. This makes my cool oven just slightly warm and humid for a good rise. After rising for about an hour just punch down and turn out the dough and shape into balls. Back to the oven we go for a little over 30 minutes to finish rising. Bake at 350 for about 20 minutes as directed or until slightly brown. They turned out just fantastic soft with a nice light chewy center. Very good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marsha Lea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marshalea/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-03T01:52:04.49Z",
                "reviewBody": "Definitely needs more flour. I used my bread machine and with the exact measurements and yep - a gooey mess. I tried adding more flour on the cutting board and managed to scoop some globs onto a greased baking sheet and let \"rise\" in a warm oven. Baked according to directions and the end result was edible and not bad tasting at all!:) I would still like to have the fluffy round rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Blanchard Angell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianea/"
                }
            }
        ]
    }
]