[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219745/debs-cloverleaf-rolls/",
        "name": "Deb's Cloverleaf Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F839263.jpg",
            "width": 2997,
            "height": 1989
        },
        "datePublished": "2020-06-19T03:47:05.000Z",
        "description": "My grandmother, in the Depression, had five children and not a lot of income. So she had to get up quite early in the morning and make loaves of bread and rolls to sell so that she could supplement the income and keep the family going. My mother would deliver them to the neighbors, still hot out of the oven, with a jar of jam. Now I make my living making bread.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "2 dozen rolls",
        "recipeIngredient": [
            "4 cups hot water",
            "½ cup white sugar",
            "2 tablespoons active dry yeast",
            "9 cups bread flour, divided",
            "2 cups regular rolled oats ",
            "½ cup butter, melted",
            "1 tablespoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the hot water, white sugar, and yeast together in the mixing bowl of a large stand mixer; let sit until it forms a creamy layer on top, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fit the mixer with a dough hook, and slowly beat in 3 cups of bread flour and the rolled oats until the flour is thoroughly worked in. Place the mixing bowl in a warm place, cover with a cloth, and let the batter rise until doubled and puffy, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the mixing bowl back onto the stand mixer, and pour in the butter; start the mixer on low speed, and beat in the remaining 6 cups of bread flour. Sprinkle salt into the dough. Turn the mixer up to medium, and knead the dough until smooth and elastic, 5 to 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat  oven to 375 degrees F (190 degrees C). Grease 24 muffin cups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pinch off about 2 tablespoons of dough, and form into a ball about the size of a large cherry tomato. Place the dough ball into a greased muffin cup; make 2 more balls, and place them into the same cup (3 dough balls per cup). Repeat with remaining dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the rolls in the preheated oven until the turn lightly golden brown, 38 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Deb"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.4285714285714284,
            "ratingCount": 7,
            "itemReviewed": "Deb's Cloverleaf Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "264 calories",
            "carbohydrateContent": "46.4 g",
            "cholesterolContent": "10.2 mg",
            "fatContent": "5.2 g",
            "fiberContent": "2.1 g",
            "proteinContent": "7.5 g",
            "saturatedFatContent": "2.6 g",
            "servingSize": null,
            "sodiumContent": "321 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-06-25T14:56:44.7Z",
                "reviewBody": "I cut this recipe in half to get 12 rolls. I used my Kitchen Aid to make these rolls. I proofed the yeast in the mixer bowl with the sugar and warm water for ten minutes until the yeast \"bloomed\" then I added melted butter and the dry ingredients. I did run my oats through the mini food processor before using it so my oats would be a finer consistancy. I kneaded this dough with my dough hook for about five minutes (I did have to add a quarter cup more flour to get it into a ball and be able to be kneaded with the hook). I set it to rise for an hour in a large greased bowl covered with a tea towel on a warm heating pad for an hour. I used a 1/3 cup measuring cup to make uniform rolls (instead of making cloverleaf rolls only because I was short on time) and rolled them on the counter to make better shaped rolls. I covered the top of the rolls in the muffin tin with saran wrap before letting it rise on the warm heating pad for another hour or so. I baked them at 400 degrees for 12 minutes then brushed the tops of the hot rolls with vegetable oil right out of the oven. These rolls rose beautifully and turned out very fluffy but the flavor wasn't quite right. I think what I was missing was either more butter or a milk flavor. I would like to try these again but I would maybe use half milk next time instead of all water and maybe up the butter. Honestly four and a half stars. They're almost there.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-20T19:55:23.89Z",
                "reviewBody": "I just got done making these rolls and they didn't turn out well. I followed the recipe to the line and they were hard even after having a succesful rising. I would have them rise a second time while having them in the muffin pan if I tried this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsMartin1987",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7996387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-27T22:12:12.497Z",
                "reviewBody": "Wow is all I can say. These rolls turned out to be the best Ive ever made and Ive made a few. I used my Rival roaster oven and mixer with the dough hooks. I wound up making 4 batches to hand out to the homeless with hot turkey soup for Thanksgiving tomorrow. Simple easy and very cheap to make but most of all tasty! Thanks for sharing this. You rock!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emma Crawford",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3748603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-27T09:23:53.9Z",
                "reviewBody": "These are so good!! Super easy and the oatmeal gives the crust a really nice texture. Based on the first reviewers experience I let the dough rise 20 minutes in the muffin pan before baking. They were enormous! The tops actually touched side-to-side during baking. I will make these again and next time maybe try letting them rise just ten minutes in the muffin pan before baking. Yummy rolls!! Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/383532/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-23T07:05:59.507Z",
                "reviewBody": "I made these for Thanksgiving today. #1. These take closer to 3 1/2 hrs. If you watch the video you will see that it says to rise in the muffin tins for about 45 min/till doubled. I did and they had good texture and were fluffy and pretty. #2. They were a bit bland as one other reviewer pointed out I accidently used unsalted butter this didnt help with the blandness #3. I used 375 @ 25min. They were toasty brown on top and very lightly golden on bottom and done. #4.This makes a little more then enough dough then 24 rolls. I ended making one dozen- as I had only two 6 ct muffin tins then when i tried them and realised they needed salt I punched down the second batch and kneaded in some salt then let rise again and not wanting to spend time remaking balls I made two loaves instead. This time I cooked",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10362967/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-17T21:37:32.513Z",
                "reviewBody": "Waaayyy too salty! An awful lot of work to go through with these results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "dcicchel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12880374/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-07T09:06:59.447Z",
                "reviewBody": "These are ok. I ended up with so much dough. Made 24 clovers and one loaf. Salt should be ONE teaspoon not tablespoon when using salted butter. Cooking time was way too long....I watched it close and easily took 15 minutes off the time. My oven is accurate. Recipe does not state to let second rise after clovers formed.....let this rise again! No need to food process the oatmeal. It mixed in nicely and did not distract.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21154093/"
                }
            }
        ]
    }
]