[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219757/hunter-style-chicken-cacciatore/",
        "name": "Hunter Style Chicken Cacciatore",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7980013.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:47:06.000Z",
        "description": "Traditional chicken cacciatore is brought to a new level with onions, peppers, mushrooms and red wine. This hunter-style version gives a heartiness and warmth that will satisfy any appetite! This recipe is inspired by the cacciatore that we enjoy from our favorite Italian restaurant. Serve over pasta with freshly-grated Parmesan and a green salad!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H35M",
        "totalTime": "P0DT2H35M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 teaspoons olive oil",
            "6 cloves garlic, sliced",
            "2 (28 ounce) cans whole peeled plum tomatoes with juice",
            "1 (6 ounce) can tomato paste",
            "¾ cup red wine",
            "1 tablespoon white sugar",
            "1 tablespoon dried oregano",
            "1 tablespoon dried basil",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "2 tablespoons olive oil, divided",
            "1 carrot, chopped",
            "1 stalk celery, chopped",
            "2 green bell peppers, cut into chunks",
            "2 onions, cut into chunks",
            "1 pound fresh mushrooms, sliced",
            "2 eggs",
            "2 cups all-purpose flour",
            "¼ cup olive oil",
            "5 pounds skinless, boneless chicken pieces",
            "1 ½ pounds dry linguine pasta",
            "½ cup chopped fresh parsley",
            "1 tablespoon freshly shredded Parmesan cheese, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 2 teaspoons of olive oil in a large pot over low heat, and cook and stir the garlic until tender but not browned, about 3 minutes. Pour in the tomatoes with their juice, and mash with a potato masher to leave the tomatoes in chunks. Stir in tomato paste, red wine, sugar, oregano, basil, salt, and black pepper, and mix until the tomato paste is smoothly combined into the sauce. Bring to a simmer, and cook, stirring often, while you prepare the vegetables.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon of olive oil in a skillet over medium heat, and cook and stir the carrot and celery until tender, 5 to 8 minutes. Stir into the sauce. In the same skillet, cook and stir the green peppers and onions until the onions are translucent,  5 to 8 more minutes; mix them to the sauce. Heat 1 more tablespoon of olive oil in the skillet, and cook and stir the mushrooms until they give up their liquid, about 10 minutes; stir the mushrooms into the sauce. Allow sauce to simmer while you cook the chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the eggs in a bowl. Place the flour in a separate shallow bowl. Heat 1/4 cup of olive oil in a large skillet over medium heat. Dip chicken pieces in egg, then dredge in flour. Tap off any excess flour, and brown the chicken pieces in the hot oil until browned on both sides, about 15 minutes. Set the chicken pieces aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon about 1 cup of the tomato sauce into the bottom of a large Dutch oven. Place the chicken pieces into the Dutch oven, and pour remaining sauce and vegetables over the chicken; cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the chicken is tender and no longer pink inside, about 1 hour. If sauce begins to boil harder than a simmer, reduce oven heat to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "About 15 minutes before serving time, bring a large pot of lightly salted water to a boil. Stir in the linguine pasta, bring back to a boil, and cook, stirring often, until the linguine is tender but still slightly firm, 10 to 12 minutes. Drain the pasta well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the linguine out onto a large platter, and top with the chicken and sauce. Sprinkle with parsley and Parmesan cheese to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Pam"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.548387096774194,
            "ratingCount": 31,
            "itemReviewed": "Hunter Style Chicken Cacciatore",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "655 calories",
            "carbohydrateContent": "72.9 g",
            "cholesterolContent": "114.2 mg",
            "fatContent": "21.3 g",
            "fiberContent": "6.8 g",
            "proteinContent": "40.1 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "597.7 mg",
            "sugarContent": "9.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-03-18T17:12:55.88Z",
                "reviewBody": "Very good. I made a half-recipe used boneless chicken thighs and finished the cacciatore in the slow cooker (5 hours on low) instead of the oven. I thought the sauce reduced a bit too much in the simmering so I added another splash of wine and about a half-cup of chicken broth. Always looking for recipes that I can freeze in single portions for hubby's dinner (I work nights). This fits the bill nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8680992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-15T07:33:39.777Z",
                "reviewBody": "I would start with the dredged chicken in the Dutch oven brown it, remove it from pan, add veggies cook till soft remove add wine scape up the bits then add tomatoes seasonings and put the chicken and veggies back in pan cook on low until chicken is done much more flavor",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20594651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-11T04:26:30.37Z",
                "reviewBody": "Fantastic! Plenty of leftovers and that is great news since it was so delicious! Next time around I will halve the recipe and use Littleforestelf's review here as a guide. I love Cacciatore and was surprised at how few recipes there were to choose from and very surprised how few reviews this one has received. If you want a great hearty tasting dish folks this is the one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Howard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/howard/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-22T15:21:48.257Z",
                "reviewBody": "Amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5131584/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-12T14:12:04.333Z",
                "reviewBody": "Just delicious! I was hunting for an easy dinner I could prepare ahead for a relatively last minute casual dinner for company. This was perfect! I started the sauce in the afternoon and left it covered on low then cooked the chicken a half hour before guests arrived and popped it in the oven. All I had to do was serve a prepped salad and cook the pasta! It was well received and was asked for the recipe (well being another AR Member she could find it! Lol!). I Used Italian diced tomatoes cutting back on the spices. I added more of all the veggies and used just a half a giant Vidalia. Perhaps because it simmered a while I used a lot more red wine and added some chicken broth as well. Easily adjusted as needed. Could have been because I used the diced instead of plum but the sauce tasted just a touch bitter to me so I added a half teaspoon of baking soda to cut the acidity. Loved it and I look forward to making this again! Thanks Pam!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mickdee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mickdee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-17T03:29:34.967Z",
                "reviewBody": "made this..excellent!! Makes ALOT.. for 2 people..used 3 ribs of celery 2 carrots 1 onion 1 whole chicken cut up. In a 13 quart stock pot...(This will keep us fed for 3 to 4 days).. 1 package linguine noodles...Convection oven 325 degrees for 1-1/2 hours... If camping I would 1/4 the recipe to keep from going bad in the ice chest. You need a REALLY big dutch oven for the whole recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joekat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10303684/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-03T01:14:36.057Z",
                "reviewBody": "Family loved it! Cut the recipe in half. However because others reviewed that the sauce cooked down I used the regular amount of wine and tomato paste instead of halving it. Might use a bit more oregano and basil but that's a personal seasoning preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Littleforestelf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9606511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-13T17:54:28.673Z",
                "reviewBody": "Tasty and not too hard to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Wizardofohms",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8976328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-10T00:03:23.787Z",
                "reviewBody": "Great flavors! This dish has the consistency of a traditional Cacciatore so it doesn't thicken up like a marinara (and we like that). The big change that we made was to add seasoning. First of all the chicken must be seasoned appropriately (either the meat or the breading). Plus the sauce needs more salt for the volume. That addition was enough to really bring out the flavors of the veggies and the meat... yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KLUPICHU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1292567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-08-19T00:20:56.507Z",
                "reviewBody": "Not that I made it, I'm sure it tastes OK. It's just that this recipe is not at all the way Italians prepare this dish. The chicken is not boneless and skinless. It is dredged in flour and browned, then cooked as a fricassee. While their are many permutations of this dish among Italian chefs, baking is not a variation. Neither is using boneless and skinless chicken. Dry white wine is what is most commonly used. Celery, carrots, garlic and onion are the vegetables used in the tomato sauce. Sometimes a cored and seeded bell pepper is cut into julienne strips, always red or yellow pepper, never a green one. This dish often is made a generous amount of ground black pepper from the mill. The variants I have noticed while conversing with other Italian chefs, is whether or not to add basil or marjoram. Most recipes do not call for a green herb to be added, and when it does I guarantee you that it's not oregano. Believe it or not vegetable oil is used for the traditional recipe. This is a bastardized version of the recipe and not really authentic Italian cooking. To learn how to fricassee chicken, try Marcella Hazan's \"Essentials of Classic Italian Cooking\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Newton1689",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26008411/"
                }
            }
        ]
    }
]