[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/401/desserts/candy/toffee/",
                    "name": "Toffee Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/73412/best-toffee-ever-super-easy/",
        "name": "Best Toffee Ever - Super Easy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F11%2F11%2F277766-best-toffee-ever-super-easy-photo-by-frances.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:10:57.000Z",
        "description": "Chocolate and almonds top off a rich buttery toffee. A simple recipe that you could easily remember and whip up any time. I always get compliments and requests for more. Use any type of nut that you like in place of the almonds.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "2 pounds",
        "recipeIngredient": [
            "2 cups butter",
            "2 cups white sugar",
            "¼ teaspoon salt",
            "2 cups semisweet chocolate chips",
            "1 cup finely chopped almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large heavy bottomed saucepan, combine the butter, sugar and salt. Cook over medium heat, stirring until the butter is melted. Allow to come to a boil, and cook until the mixture becomes a dark amber color, and the temperature has reached 285 degrees F (137 degrees C). Stir occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the toffee is cooking, cover a large baking sheet with aluminum foil or parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "As soon as the toffee reaches the proper temperature, pour it out onto the prepared baking sheet. Sprinkle the chocolate over the top, and let it set for a minute or two to soften. Spread the chocolate into a thin even layer once it is melted. Sprinkle the nuts over the chocolate, and press in slightly. Putting a plastic bag over your hand will minimize the mess.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the toffee in the refrigerator to chill until set. Break into pieces, and store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Toffee Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "FUNKYSEAMONKEY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.62379896526238,
            "ratingCount": 1353,
            "itemReviewed": "Best Toffee Ever - Super Easy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "226 calories",
            "carbohydrateContent": "20 g",
            "cholesterolContent": "30.5 mg",
            "fatContent": "16.9 g",
            "fiberContent": "1.1 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "101.1 mg",
            "sugarContent": "18.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-12-16T15:38:26.843Z",
                "reviewBody": "HOORAY! SUCCESS AT LAST!  After 2 successes and 2 \"almost\" successes( my butter pooled on top twice) I read about 50 reviews, applied all the tips and had perfect toffee.  Here are all the tips you need for success too: test your thermometer in boiling water (212f)to be sure it's accurate.  Use a heavy, large pot or pan (I used a 4 quart nonstick pot).  Melt butter/sugar on medium/high heat, whisking the WHOLE time (I used a flat whisk that allowed me to get edges incorporated in very well). Let come to a steady, but NOT rolling boil, at about medium heat, and continue to stir frequently.  At medium heat it really shouldn't burn. Last, keep temping toffee until thermometer says 285-295...at 285 do the ice water test by dropping a dot of toffee into some ice water...it should be brittle.  If so, it's done.  It will be a very dark amber color. Pour into foil lined pan, put on chocolate and nuts and, VOILA!  Perfect toffee!!  Refrigerate before breaking apart!  I also keep it in a cool place (fridge or in an airtight container in the garage, in the winter, then it's extra brittle :)).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan Orsini",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917523/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-09T18:58:57.81Z",
                "reviewBody": "I have been making this toffee for 40 years.  I cook it until 300 degrees.  You have to stir constantly or it burns.  Also, I make it in a 9x13 or 10x14 pan.  I butter the bottom of the pan, spread the crushed almonds over the butter and pour the toffee mixture over that. I sprinkle the chocolate chips on top, let them melt and then spread.  Mmmm, good",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HIPHOP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-17T02:34:36.6Z",
                "reviewBody": "(Here is a hint)! Before you pour on the melted chocolate over the toffee, wipe off the excess oil with paper towel, so that the chocolate will stick better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "P.Adkerson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2208359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-12T19:02:58.107Z",
                "reviewBody": "The butter started to seperate from my toffee and I panicked. I continued cooking it up until 300 and then poured off some of the butter before putting in my pan. I really did not think it would turn out. However I still put on the chocolate and almonds and it tastes fantastic! My mistake was following another reviewers suggestion. I stirred the toffee constantly. You should stir frequently but NOT constantly. Stirring too much will cause seperation. If you have not been stirring constantly and it seperates try lowering the heat a bit and slowly stirring to get the sugar and butter to re-combine. You can also add 1/4 c. to a half a cup of water 1 Tablespoon at a time to help the butter re-mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mandi 'Bates' Snyder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/981316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-16T23:28:35.583Z",
                "reviewBody": "Toffee came out excellent! My mom, who was an expert candy maker, taught us that boiling sugar like in this recipe requires OCCASIONAL stirring. This recipe states to \"STIR OCCASIONALLY\" so follow the recipe. Some women who are not familiar with making candy want to stir and stir because that's what we know, but boiling sugar for candy does not require a lot of stirring. Always use a wooden spoon, no metal (changes the temp). The reason the butter separates: by stirring and stirring you're cooling the sugar down and not allowing it to get hot and cook. Do not take a spoon and scrape the sides of the pot \"above\" the boiling line, that's where the sugar crystalizes. If you scrape, your candy will come out gritty. Hopefully this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "happywifey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/932650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-19T11:28:20.953Z",
                "reviewBody": "As a professional Chef, I say mom2oovc has the best directions.  It is very important to remember the following:\n1. The pot MUST be \"heavy-bottomed\". It allows for the best even heating. Constant stirring should not be necessary at a medium heat.\n2. At medium heat it should take about 20 minutes to reach 285F. If your temp is rising faster than that, your heat is too high. \n3. Remember to consider your sea level. High sea levels affect your results.\n3. Butter pooling or separation is caused from cooking too fast at too high a temp.  At medium heat you will not have this problem.  It is better to heat at a lower temp and adjust if it is taking more than 20 minutes to reach 285. The temp will rise faster in the beginning and slow as it reaches higher temps. Don't rush it!\n4. 285F is \"soft crack\" meaning your toffee will be more pliable or chewy when cooled.  The higher you take it (300-310F), the harder and more brittle the candy will be when finished.\n5. TEST YOUR THERMOMETER!  The boiling water method is best (212F), but remember to take sea levels into consideration! Don't let your thermometer rest on the bottom of the pan, but about 1/2\" above it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Calheart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7401407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-23T16:36:05.82Z",
                "reviewBody": "Wonderful, easy toffee recipe!  I always like to add a few nuts to the bottom of the pan before pouring in the toffee mixture.  Gives the toffee that little extra edge of flavor.  Side note: using a large baking sheet will make for a thinnier toffee bottom, use a small cookie sheet if available.   This recipe is definitely a keeper and great for gifts during the holidays for those friends who do not cook/bake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-28T12:01:43.953Z",
                "reviewBody": "Excellent! I found the solution to the butter separation! Make it in a wide, shallow pan, like a cast iron skillet, and use a metal slotted spoon to whisk the mixture in an up and down motion, making sure to incorporate the separated butter on the sides of the pan. My butter started to separate, but this helped tremendously to incorporate it back  into the sugar. I added vanilla, extra salt, and topped with a dark 60% cocoa chocolate and chopped pecans.  Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "babybunnies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1950576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-10T03:04:31.833Z",
                "reviewBody": "Delicious.  I used 2 sticks of butter and 1 cup dark brown sugar (or light brown) and added a splash of vanilla and the 1/4 tsp. salt.  Poured into 2 9inch cake pans sprayed with pam.  Turned out great with or without chocolate and nuts.  Use the heaviest pan that you have; I have Le Crueset and it helps prevent hot spots.  EDIT 12/23/08: Made a batch with the original measurements (usually make 1/2 batch).  Needed to use 3 cups brown sugar for the 2 cups butter.  DIdn't add chocolate, just pecans.  Much easier to make a half-batch, but was still AMAZING toffee.  12/09/09: Made tonight and added a generous pinch of sea salt and press very finely chopped walnuts into toffee with the back of wooden spoon.  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sweet Apron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1691905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-14T05:53:30.287Z",
                "reviewBody": "Like pralines...too soft, too bland.  \nToffee has to be cooked to 300 degrees or to the hard crack, or 12 minutes boil to where it is truly brownish.  I made it years ago from a recipe and it was perfect but here I couldn't remember the recipe.  I used this recipe but it was all wrong.  If you want a soft praline-like taste then this is it.  If you want genuine toffee, cook it to the hard crack.  I found the real recipe from Betty Crocker, and that is 1 cup butter, 1 cup sugar, not double. 1/8 tsp salt.  However, instead of spreading it on a cookie sheet (unless you just like it paper thin), I recommend pouring it in a lined rectangular cake pan in order to achieve the thickness of a real Heath bar.  Still spread a cup or cup and a half of chips with the back of a spoon, then add any chopped nuts of your choice.  Set naturally or refrigerate for a short while, then break into bite sized pieces.  This is genuine toffee with the genuine flavor, not some spruced-up praline.  Do NOT use a plastic spoon in this recipe.  Use a wooden spoon.  The plastic one will melt into the candy.  I don't recommend this recipe because it is tasteless and not at all toffee-flavored.  It is sugary and like a praline.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2923838/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Best Toffee Ever - Super Easy",
            "description": "NOV 0014 - Best Toffee Ever - Super Easy - APPROVED",
            "uploadDate": "2013-11-26T00:43:56.744Z",
            "duration": "PT1M51.375S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F4e0693df-dcb2-4f6c-b9e6-0e5a7ac53039%2Fdf24d608-7dd3-43f5-bcc1-4a1d40114f96%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2867116323001"
        }
    }
]