[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220505/irish-root-soup/",
        "name": "Irish Root Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F995236.jpg",
            "width": 2736,
            "height": 2736
        },
        "datePublished": "2020-06-19T03:47:51.000Z",
        "description": "A hearty potato soup that goes great with soda bread and an Irish stout.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "¼ cup butter",
            "1 large yellow onion, chopped",
            "2 leeks, white and pale-green parts only, rinsed and coarsely chopped",
            "4 cloves garlic, smashed",
            "1 stalk celery, cut into chunks",
            "4 cups vegetable stock",
            "5 potatoes, peeled and cubed",
            "1 cup vegetable stock",
            "1 ¼ cups sliced baby carrots",
            "3 tablespoons chopped green onion",
            "¾ cup heavy cream",
            "salt and ground black pepper to taste",
            "6 tablespoons shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large stockpot over medium heat; cook and stir the onion, leeks, garlic, and celery in the melted butter until tender, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 4 cups vegetable stock into the stockpot; add the potatoes. Bring the mixture to a boil, reduce heat to medium-low, and cook the mixture at a simmer 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the stock mixture into 3 batches with equal amounts of liquid and vegetables; set aside to cool for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1 batch of the stock mixture into a blender, filling the pitcher no more than halfway. Hold the blender lid firmly in place and carefully start the blender; use a few quick pulses to get the mixture moving before leaving it on to puree. Repeat process with second batch. Return the pureed batches to the stockpot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide third batch into two equal batches. Puree only one of the two batches before returning both to the stockpot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 1 cup vegetable stock to a simmer in a small pot over medium-low heat. Cook the carrots in the simmering stock until soft, 5 to 7 minutes; add to the puree in the stockpot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the green onion and heavy cream through the puree; continue cooking another 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season with salt and pepper; top with Cheddar cheese to serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Erin Roberts"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.712121212121212,
            "ratingCount": 66,
            "itemReviewed": "Irish Root Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "407.7 calories",
            "carbohydrateContent": "45.8 g",
            "cholesterolContent": "69.8 mg",
            "fatContent": "22.2 g",
            "fiberContent": "6.6 g",
            "proteinContent": "8.3 g",
            "saturatedFatContent": "13.5 g",
            "servingSize": null,
            "sodiumContent": "544.3 mg",
            "sugarContent": "7.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-12-02T20:07:11.313Z",
                "reviewBody": "I used all the ingredients listed, but the preparation sounded way too over-complicated for a simple soup.  I made everything in one pot - cooked the carrots with the potatoes after adding 4 cups of chicken broth (because I was out of vegetable stock) to the sauteed veggies.  Then I used an immersion blender just enough to thicken it while still leaving some small chunks of potatoes and carrot pieces.  Stirred in the cream last and garnished with a little cheddar and crumbled bacon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nanerdc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2492219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-21T02:52:35.357Z",
                "reviewBody": "This was delish! The only thing I can think of suggesting is step #5 I would have put that whole batch in that step back into the pot as is with dividing and pureeing. There were a few chunks here and there I could have used a little more with this recipe. But the flavor was over all wonderful. It was creamy (with or without the heavy cream) My family thoroughly enjoyed this very very much. TY",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-19T11:00:38.167Z",
                "reviewBody": "This tastes like liquid baked potatoes in the best way. My 7 year old declared it the tastiest thing she's ever eaten. High praise trust me! I left off the cheddar cheese and used chicken stock instead of vegetable because that's what I had in the cupboard. Next time I'll try it with the vegetable stock.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "annilita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9008890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-29T21:03:26.523Z",
                "reviewBody": "I liked cooking this soup. However the puree procedure is WAY too complicated and long for me. I put the carrots and the potatoes in at the same time and cooked it. Then I pureed the whole soup. I serve this to my 4.5 yr old and my 11 month old sons so we do not need texture! I used an immersion blender to puree it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2499013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-08T16:52:21.793Z",
                "reviewBody": "While I find dishes that are not spicy bland the people I served loved this soup. It is now on our family menu. The puree carries a good flavor is not too heavily or exclusively potato and keeping some solids in for the final product give it the substance of a meal instead of an appetizer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason Cross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9019529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-19T18:40:55.163Z",
                "reviewBody": "This soup is such a delicious comfort food that my family craves and I have to make it at least twice a month no matter what the season is. I've made it with both vegetable stock and chicken stock and they're both good although I slightly prefer using chicken stock. I double the yellow onion and celery to get more daily veggies in our diet. To save time I don't remove any from the pot to puree in a blender. Instead I use a hand blender to puree it while all of the soup is in the pot just long enough to puree it to make it look creamy and so that some potato chunks are left rather than pureeing until it is completely smooth because we like to have some chunks of potatoes. Also I start cooking the sliced baby carrots in a separate pot in some vegetable or chicken stock at the same time that I start cooking the onions leeks and garlic in the big pot so that the carrots can cook long enough to get very soft before I add them to the pot after I've used the hand blender. I've also substituted half and half for the heavy cream and it was just as good while saving some fat and calories. One time I didn't have any half and half or cream on hand so I just served it without either and it was still good since pureeing it makes it very creamy looking and tasting. However we prefer to have at least some half and half added. I think the leeks are what makes this soup so delicious. My kids love it and it's a great way for them to get their vegetables in a healthy soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TX Bluebonnet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3896167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-20T00:13:49.567Z",
                "reviewBody": "Phenomenal! I had to make some substitutions based on what I had but but the general flavor was the same. I used coconut oil as my cooking oil chicken stock instead of vegetable and threw in a few turnips I had. I also used milk instead of cream. Everything else remained the same. I will definately keep this in rotation in my kitchen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2317424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-08T15:44:35.493Z",
                "reviewBody": "Five stars! And I don't take those lightly. I use more carrots and fewer potatoes and I add a couple dashes of truffle oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brooklynsurecooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2600246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-22T02:39:00.77Z",
                "reviewBody": "What a nice way to warm up on a cold day! We loved this soup! I reduced the amount of butter and substituted EVOO instead and at the end when it was time to puree it I just used my immersion blender because it was just so much more effective that way. Such a good soup! I shredded up some Irish chees to sprinkle on top. It was creamy silky and full of flavor. Thank you for the recipe. I will be making this again for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracey Ferrari Posner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6476442/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-05-11T09:22:12.06Z",
                "reviewBody": "I made this soup hoping for a great Irish soup like the soups I had in Ireland. I was disappointed. It was okay but not great. It's really heavy in the dairy and just too rich. I used less heavy cream than what it called for but I would go with even less next time. Not sure I will make it again. I will try other Irish vegetable soup recipes on this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tressa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2295439/"
                }
            }
        ]
    }
]