[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1537/bread/yeast-bread/bagels/",
                    "name": "Bagel Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220619/real-homemade-bagels/",
        "name": "Real Homemade Bagels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F03%2F1120015.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:47:57.000Z",
        "description": "A recipe for that authentic bagel flavor and texture.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "6 bagels",
        "recipeIngredient": [
            "1 ¼ cups water",
            "4 ½ cups bread flour",
            "3 tablespoons white sugar",
            "1 teaspoon salt",
            "2 tablespoons vegetable oil",
            "1 tablespoon instant yeast",
            "4 quarts water",
            "1 cup honey",
            "2 tablespoons poppy seeds",
            "2 tablespoons sesame seeds",
            "2 tablespoons dried onion flakes",
            "1 tablespoon coarse salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine 1 1/4 cup water, flour, sugar, 1 teaspoon salt, vegetable oil, and yeast in the mixing bowl of a stand mixer. Mix on low speed using the dough hook until well-developed, about 8 minutes. To ensure the gluten has developed fully, cut off a walnut-sized piece of dough. Flour your fingers, and then stretch the dough: if it tears immediately, the dough needs more kneading. Fully developed dough should form a thin translucent \"windowpane.\"\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the dough to a lightly oiled bowl, cover it with plastic wrap and a kitchen towel, and let rise for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch the dough down, place it on a lightly floured work surface, and use a knife or dough scraper to divide the dough into 6 pieces (or more, for smaller bagels). Roll each piece of dough into a sausage shape about 6 inches long. Join the ends to form a circle. Repeat with the remaining dough, and let the bagels rest for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 475 degrees F (245 degrees C). Line a baking sheet with parchment paper. Arrange small plates with poppy seeds, sesame seeds, and onion flakes next to the baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring 4 quarts water to a boil in a large pot. Add honey, if desired (see Editor's Note). Boil the bagels, three at a time, until they rise to the surface of the pot, about 1 minute per side. Remove the bagels with a slotted spoon and place them on the parchment-lined baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip the tops of the wet bagels into the toppings and arrange them, seeds up, on the baking sheet. Sprinkle with coarse salt, if desired. Bake in the preheated oven until the bagels begin to brown, 15 to 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Bagel Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PLAWHON"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.369565217391305,
            "ratingCount": 322,
            "itemReviewed": "Real Homemade Bagels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "278.2 calories",
            "carbohydrateContent": "55.9 g",
            "cholesterolContent": null,
            "fatContent": "7.4 g",
            "fiberContent": "1.3 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "1372.4 mg",
            "sugarContent": "53.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-01T00:31:07.053Z",
                "reviewBody": "I'm working on my second batch of this bagel formula.  I use malt syrup as I think it improves the crust a bit.  So far, I've stayed with the Very Hot (475-F) oven and bake to color, a bit less time than called for.  I'm tickeled with the interior textrure and flavor.  If there is one BIG variation, I mix the dough in the evening, oil it very lightly and let it ferment in the fridge for 12-18 hours, allowing about two hours at room temperature to warm before dividing and forming the bagels.  If there is a better formula for bagels at home, I've yet to find it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cedarglen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4795685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-24T21:37:41.433Z",
                "reviewBody": "I followed the recipe, but not the instructions. I added the 1 1/4 cup of hot water, sugar and yeast together in my KitchenAid mixer. I let the yeast get frothy and then added in the salt, oil and 4 cups of flour (anymore and it would have been too dry!). On speed 2, I let it mix then knead the dough for 15 minutes. I was running late, and couldn't get the dough to the consistency as instructed. It broke almost right away when pulled. I popped the dough a warm oven (I put it on 350F just until the elements were red, then turned it off).\nAfter rising for 2 hours, I punched down the dough and started shaping. I made 8 bagels. I didn't have a full cup of honey, so I added some light corn syrup to make up for what I was lacking, a quarter cup. I also didn't use 16 cups of water, I used 13. I let the bagels bathe and then topped them with grated medium cheddar cheese. They baked for 20 minutes at 475F. I pulled them out, let them cool for 15 minutes then tried them. OMG! Delicious! They will be even better with cream cheese smothered over them after toasting them in the toaster! I can't wait for breakfast tomorrow! Thanks for sharing the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WannaBeChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2566972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-16T17:15:39.837Z",
                "reviewBody": "Ok i am the first to review your recipe! Wonderful! So good crusty on the outside an chewey in the middle these taste like a true bagel! I did only end up using  4 cups flour this recipe will be used alot thank you sooo much for sharing! I forgot to add that i hwd some extra dough left an i made some bagel dogs with them! Posted a pic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "missrochester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6418859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-19T17:17:32.95Z",
                "reviewBody": "I found the dough tremendously dry. It taxed the motor on my KitchenAid. In the end, I added at least another 1/4C water and kneaded by hand.  To make only 6 bagels would have resulted in rings the size of bread loaves.  I made 18.  12 would have been on par with the generously over-sized bagels in grocery stores.  \n\nThe flavour is bland.  One reviewer said he leaves the dough to ferment overnight with a long, slow rise.  I think that would be wise. Otherwise the taste is flat.  These need some sort of topping or schmear, rather than eating them on their own.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Mama_B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mama__b/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-13T18:00:56.5Z",
                "reviewBody": "Perfect with 4 cups of Canadian flour.  Made 6 giant bagels.  When boiling, mine floated immediately, so boiled a minute on each side.  Kneeded for about 12 minutes, giving a workout to our 800 watt Cuisinart and dough hook.  Will be making this a lot.  Have eaten 2 already, so I'll tell the kids I made 4.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "saskabush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9438023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-04T21:51:25.717Z",
                "reviewBody": "It's quite tasty. I did change the bread to water to ratio to what i know would work from making tons of bread. 1 and 1/2 water and 4 cups of high gluten flour. I also mixed the dough in my bread machine, it's just easier that way. The recipe is exact to my pizza dough 1 and 1/2 water, 2 tbsp oil, 4c bread or high gluten flour, 1tsp salt(sprinkle about that much) and 3 tbsp sugar(a handful), and 1 pkt rapid rise yeast. I decided to go with Onion bagels, so I added onion powder to the dough (about a few tbsp, just sprinked, so dont know the exact amount) . Once the dough was finished I took the advice of adding honey to the water(not sure if it made any difference, just used up a bunch of my honey). It is just like making pretzels or pretzel dogs I dropped them in the water and flipped after about 30 or so seconds then placed them onto a parchment lined baking sheet. I brushed the top of each with egg white then sprinkled with onion flakes. I then baked in a 400 oven for about 20 minutes checking after 15 then every few minutes until they looked done. I turned the oven off, opened the door and covered with foil. I have learned from making, pizza and pretzles that this helps the chew in the crust. Now I just have to keep from eating them all before the rest of the family comes home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lisagat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9233227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-15T20:39:03.013Z",
                "reviewBody": "The flavor of these is really good, but I had to rate it down because if I wasn't a seasoned bread-maker, I wouldn't have known to not follow the flour amounts recommended here.\n\nAdd your flour a cup at a time if you use this recipe, and STOP adding when the dough is silky and slightly tacky.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Pele",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10454935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-20T14:27:06.053Z",
                "reviewBody": "I'm on the same page as Mama_B. I also had to add 1/4 cup of water and kneaded by hand. They were my first attempt at bagels so I was happy that they turned out, but they really were huge. I'm going to try again and make 8 instead so they're a more normal size. I was happy with how they tasted right out of the oven, but having one for breakfast the next day, they were a bit bland. I did not boil them with honey, so I will also try that next time to add an extra layer of flavor. Oh, and a bit of advice for anyone having trouble rolling out and connecting their bagels into a ring - I saw in another recipe that they form the bagels into balls and just stick their thumb in the middle to make a hole, then stretch the hole to 1/3 the width of the bagel and form it into a bagel shape that way. I did that and it was very easy. PLAWHON - Thank you very much for contributing this recipe! I was very pleased with how easy to follow it was for a novice baker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ericac",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12967747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-05T00:12:19.947Z",
                "reviewBody": "I just made this recipe.  I split the dough into thirds, and made three different types of bagels.  1/3 was plain, 1/3 had cinnamon sugar mixed in, and 1/3 had caramelized onions mixed in.  I am never going to buy bagels again, this was so easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "klinnea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6758294/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Real Homemade Bagels",
            "description": "Learn how to make bagels right in your own kitchen.",
            "uploadDate": "2016-08-01T15:49:58.275Z",
            "duration": "PT1M15.867S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb9a24f02-e03f-4d0d-b685-3930a0f8e121%2F722db13b-891b-4231-ba42-861fabdf22ca%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5067037613001"
        }
    }
]