[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/111/appetizers-and-snacks/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220870/authentic-falafels/",
        "name": "Authentic Falafels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4501457.jpg",
            "width": 1920,
            "height": 1080
        },
        "datePublished": "2020-06-19T03:48:05.000Z",
        "description": "These falafels are the closest thing to NYC street vendor falafels! Made the traditional way with dried soaked chickpeas! Great on a pita with lettuce, cucumber and yogurt. Asafoetida is usually found in Middle Eastern or Indian food stores. If you prefer, you can use 2 to 3 garlic cloves and 1 small chopped onion instead. This is a great base recipe, customize it to your own tastes.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT9H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup dried chickpeas",
            "½ teaspoon baking soda",
            "1 tablespoon water",
            "1 ⅓ tablespoons sesame seeds",
            "2 teaspoons ground cumin",
            "1 teaspoon salt",
            "1 teaspoon baking powder",
            "1 teaspoon ground coriander",
            "½ teaspoon ground black pepper",
            "½ teaspoon red chili powder",
            "½ teaspoon white sugar",
            "¼ teaspoon ground turmeric",
            "1 pinch asafoetida powder",
            "1 quart vegetable oil for frying, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place dried chickpeas in a bowl. Fill with water to cover; stir in baking soda. Soak at least 8 hours or overnight in refrigerator. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place soaked and drained chickpeas in a blender or food processor; blend to a paste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour water into chickpea paste and blend until smooth. Scrape down sides of blender with spatula if needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place sesame seeds, cumin, salt, baking powder, coriander, black pepper, red chili powder, sugar, turmeric, and asafoetida powder in blender with chickpea paste; blend until well mixed. Transfer chickpea mixture to a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Chill chickpea mixture in refrigerator to allow flavors to blend, at least 1 hour and up to two days.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour vegetable oil to a depth of 1 inch in a deep skillet over medium heat and heat to 370 degrees F (188 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scoop up chickpea mixture by heaping tablespoons and form into balls the size of ping pong balls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry balls in hot oil until golden brown, 3 to 5 minutes on each side.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Beans and Peas"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kathleen Woods Rubino"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.275862068965517,
            "ratingCount": 29,
            "itemReviewed": "Authentic Falafels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "261.7 calories",
            "carbohydrateContent": "20.8 g",
            "cholesterolContent": null,
            "fatContent": "17.7 g",
            "fiberContent": "5.9 g",
            "proteinContent": "6.7 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "582.4 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-11T11:21:38.31Z",
                "reviewBody": "I omitted the baking soda, baking powder and sugar.  These are great tasting burgers that I dry fried instead of deep fat fried.  I'll be making them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sueb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2719400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-07T06:35:45.773Z",
                "reviewBody": "I agree with sueb that you can certainly forego the soda baking powder and sugar.  I first learned about falafel from a Lebanese student in my class but for years relied on packaged mix (never as good!).  Another great twist is to buy whole spices and grind them your self - it only adds 2 minutes to prep time but the flavors are so much more vivid.  Also you can finely chop a bit of cilantro or parsley into the mixture.  These make great finger food for parties too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5660813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-09T04:16:39.383Z",
                "reviewBody": "The only reason for the low rating is to warn people to be sure to plan on soaking the chickpeas at least overnight. After 6 hours of soaking I thought I'd better cook them since they were still pretty crispy. BAD idea. They absorbed too much water and when I tried to cook them I ended up with falafel mush and had to throw it all out. The flavor was excellent and I'm going to try this again.  But there's no way I'll cook them and I'd warn people away from using canned beans for the same reason",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "pajamann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/grammyjammy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-27T13:22:33.27Z",
                "reviewBody": "Fabulous!  Followed recipe but omitted sugar and didn't have astafoetida powder.  The baking soda is used to soften the beans and the baking powder is to make the falafel light and airy so I recommend using both.  I let the beans soak overnight and also had to use a bit more water to get the right consistency.  Much more authentic than any recipe that calls for cooked garbanzo beans.  Excellent flavor.  Will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lally",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2049065/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-22T18:20:51.873Z",
                "reviewBody": "Delicious! They come out moister than previous falafel recipes I have tried, and I can say first hand, that these are indeed just like the type you get at a halal foods cart in NYC.  I also omitted the sugar, baking soda, and powder as another member suggested, and it turned out great! I'm going to be making these again for my graduation party... I just might have to double the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TanyaR90",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4472486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-19T18:50:17.51Z",
                "reviewBody": "This was my first time ever making falafel (or anything like it), it was easy and turned out great.  Doubled the recipe, still didn't make enough because there was such demand.  Got rave reviews from a die-hard falafel fan who had repeatedly tried and failed to make it herself.  I did once make falafel-flavored oil by using canned garbanzos and now know that because those are cooked, not just soaked, the starches could no longer (re)bind to each other causing it to fall instantly apart when cooked.  The ground and spiced mixture actually sat in the refrigerator 3 days (one more than the recommended max) but that was fine.  I did use the soda to help the chickpeas soak efficiently (if you skip it, increase the time), and I used the baking powder but not sure how much that really helped the final fluffiness.  I may have over-rolled the balls - they can be pretty large and loose (which means air pockets of fluffy goodness) so long as you're slow and careful getting them into the oil, which if hot and deep enough will instantly sear the outside to prevent disintegration.  Use no more than medium heat so the skillet isn't much hotter than the oil and if possible use infrared thermometer to ensure that the oil is at least 375 before dropping in the balls (which I made slightly larger than ping pong size).  Cooler oil will mess up the texture (as well as risk disintegration) and a hotter pan will burn part of the 'shell'.  I'm now headed to the market for more chickpeas...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hypertrophy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7671041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-29T10:45:21.58Z",
                "reviewBody": "This deserves more than 5 stars, truly. It went BEYOND my expectations on some warmed pita. The dry garbanzos make all the difference. The falafels were light and airy with a nice crispness. I omitted sesame seeds, added garlic and finely chopped onions instead of asafoetida. I also added some cilantro to the mix. Really enjoyed this. Thanks for the recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Food4Thoughts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/food4thoughts/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-16T11:21:38.223Z",
                "reviewBody": "Flavor-wise, the recipe is great! I forgot the baking soda when soaking the chickpeas so they did not blend well. Or I just need a better blender. That said, I had to add more water than was stated to get a good blend. I let it sit overnight and it was still watery. I rolled each patty in bread crumbs and fried them in about 1/4\" of vegetable oil. They came out PERFECTLY considering it was my first time and I had to improvise a bit! My kids (ages 7-13) loved it! There were no leftovers! There was the right amount of crisp on the outside. After I fried each, I let the oil drip onto a paper bag then transferred to the serving plate. Then I sprinkled with a little Kosher salt. For those deathly afraid of frying (like myself), I used less oil than was called for. I cooked on low-medium heat. And I used a flat spatula to slip each patty into the oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mieshka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3409360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-08-10T03:54:31.933Z",
                "reviewBody": "This was my first time making falafel at home. The recipe was clear, clean, and easy. Still, I'm forgetful and left out the baking soda from the soaked chickpeas. I used half a yellow onion and finely chopped garlic in mine and used a melon baller to doll them out to fry. Woooyeee, those are tasty! Time intensive, but so worth it. Next time, I'm going to use a smaller melon baller to further maximize crunch and snackability. I'll definitely be making these again! Next time, I'll throw in the baking soda, and make them spicier. And let me tell you... the next time may be within the week. These suckers are addictive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie Meek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25946425/"
                }
            }
        ]
    }
]