[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/676/meat-and-poultry/pork/ribs/",
                    "name": "Pork Rib Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/997/meat-and-poultry/pork/ribs/baby-back-ribs/",
                    "name": "Baby Back Ribs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220987/baked-bbq-baby-back-ribs/",
        "name": "Baked BBQ Baby Back Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3789556.jpg",
            "width": null,
            "height": null,
            "caption": "Baked BBQ Baby Back Ribs"
        },
        "datePublished": "2012-04-04T17:46:06.000Z",
        "description": "If you're in the mood for a little virtual trip into summer, give this technique a try. This works with literally any dry rub and barbecue sauce combo.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H50M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "1 rib rack",
        "recipeIngredient": [
            "½ cup ancho chile powder",
            "¼ cup white sugar",
            "¼ cup brown sugar",
            "¼ cup salt",
            "2 tablespoons freshly ground black pepper",
            "1 tablespoon ground cumin",
            "1 teaspoon dry mustard",
            "1 teaspoon ground cayenne pepper",
            "½ teaspoon ground dried chipotle pepper",
            "1 rack baby back pork ribs",
            "1 cup barbeque sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 250 degrees F (120 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix ancho chile powder, white sugar, brown sugar, salt, black pepper, cumin, dry mustard, cayenne pepper, and chipotle pepper in a small bowl until combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place ribs meat-side down on aluminum foil. Prick back of rib rack several times with a knife.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Generously apply coating of dry rub to all sides of rib rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With rib rack meat-side down, fold foil around it to create a tight seal. Transfer to sheet pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until tender and cooked through, about 2 hours. Remove and cool 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Increase oven temperature to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Open foil, drain and discard any accumulated juices and fat. Brush barbeque sauce on all sides of rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place rack meat-side up and return to oven, leaving foil open. Bake for 10 minutes, remove from oven, and brush another layer of barbeque sauce on meat-side only. Repeat baking and brushing with sauce 4 more times, for a total of 50 minutes baking time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut rack into individual rib segments and serve with more barbeque sauce.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Rib Recipes",
            "Baby Back Ribs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6061381074168795,
            "ratingCount": 782,
            "itemReviewed": "Baked BBQ Baby Back Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "488.4 calories",
            "carbohydrateContent": "51.8 g",
            "cholesterolContent": "87.6 mg",
            "fatContent": "22.9 g",
            "fiberContent": "1.5 g",
            "proteinContent": "18.9 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "782.3 mg",
            "sugarContent": "42.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-09-02T22:39:43.57Z",
                "reviewBody": "I gotta tell ya...all I wanted was some ribs. I've never made them before so I thought I'd give this a try. All was going well. I had them in the oven all rubbed up. Smelling good! Then it came time to check them. I pulled them out of the oven and, unbeknownst to me, a hole had appeared in the foil and it dumped hot chili powder lava all over my wrist. It hurt so dang much that I threw the ribs up on the counter and juices went all over my tile floor. I yelled a bit, and my dog come running in and started licking it up. I went to shoo him away and slipped and fell on my rump and hurt my knee. I yelled some more and my mother came in to see what the ruckus was and slipped and fell right next to me. When she did, her foot came up kicked me in my nose. Now I'm bleeding all over the dang place. My dogs barking, my mom's freaking out. I'm moaning in pain. When it was all said and done, I ended up with a bandage on my wrist, a swollen knee and two black eyes. And to boot, my dog has irritable bowel syndrome from all that chili powder juice he licked up. All I wanted was some dang ribs!\n\nSoooo....when I finally got a chance to eat these things, they were ok. If you like, and I mean really like chili powder then these ribs are for you. If not, you won't care much for them. The rub is strong and overtakes the flavor of the meat. Just my opinion. But then again, I couldn't breath when I was eating them. Maybe that impaired my judgment a bit. ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14196308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-27T15:47:23.333Z",
                "reviewBody": "This is a 10 star recipe - the best & easiest method to make ribs.  As indicated - use your favorite dry rub and your favorite BBQ sauce but use this low and slow method.  For make ahead 'ready to BBQ Ribs' I usually coat the ribs in the dry rub and wrap tightly and let sit in the refrigerator over night.   Bake at 250 for at LEAST 2 hours - sometimes they take longer.  Then I let them cool in the package - drain the juices out of the package and  store in the refrigerator until we are ready to grill.   Finishing them on the grill, using indirect heat is so easy and there is virtually no clean up other than to  wipe your chops and toss the bones.   Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-17T13:03:16.333Z",
                "reviewBody": "I do a few things differently. Most important is to get the membrane off the back of the ribs instead of just pricking them . Bone side up, make a shallow slice mid way through the rack, then using a paper towel, lift and pull the membrane off the rib bone, it generally comes off easily. Makes a huge difference! I also use my own dry rub mix but that's personal preference. to get them crispy, I throw them on the grill after baking 2.5 hours. when I'm making them for a crowd, I'll bake them in the morning, open the foil and slather on BBQ sauce, then rewrap the foil and ket them rest all day until it's time to throw them on the grill. This way I can enjoy my guests and still serve great ribs!\nIf it's a rainy day, I'll put them under the broiler for about 10-15 minutes instead of grilling, we like our ribs moist with the outside crispy and not so dripping with sauce.  \nOn the positive, this is a good recipe but don't be afraid to adjust the seasoning to your liking. We don't use white sugar at all, the dark sugar adds to the caramelization of the finished ribs and we use a lot less salt. Low and slow is the way way to go when it comes to finger licking, fall off the bone ribs! Enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mammamoey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1554102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-17T20:20:12.083Z",
                "reviewBody": "Finger lickin' good!  The key to \"fall-off the bones\" tender ribs is in the cooking method - low and slow is the way to go and this method is perfect for anytime you want ribs or if it happens to be raining and you can't grill.  And, as Chef John states this works with any dry rub and bbq sauce. So, you can use your favorite combination or get creative -either way you're in for a treat!  I used the rub in the recipe, but played with it a bit to use what I had on hand.  I cut the recipe in half because we had a small rack of baby back ribs and since I didn't have dried chipolte pepper I subbed garlic powder instead.  For the bbq sauce I opted for KC Masterpiece.  We finished these on the grill over low heat basting just as the recipe states for the last 20 minutes. This was so simple and so delicious - perfect with a side of coleslaw and cornbread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-30T17:12:29.28Z",
                "reviewBody": "I made this yesterday wowie was it ever good!  I didn't have \"ancho\" chile powder so I used regular chile powder in its place.  Also didn't have chipotle pepper.  I added some garlic powder.  The meat was so tender I actually couldn't cut through it...fell right off the bone!  Overall this will be my GO TO recipe for ribs!  Thanks Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cass/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-31T20:20:32.69Z",
                "reviewBody": "Absolutely the best oven baked BBQ rib recipe I have ever tried !!! I''ve been on the hunt for a really good oven baked rib recipe, and most have fallen short of my expectations.  Cooking times are spot on, and the ribs are fall-off-the-bone tender!This one is a keeper. You won't be disappointed! Thanks Chef John! I'll definitely be trying other recipes of yours!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RachelB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9368542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-05T22:50:46.45Z",
                "reviewBody": "This recipe provided the method to my goal: ribs that were tender, but didn't fall off the bone (I wanted some chewiness and being able to pick up the ribs and eat them). I didn't use the rub here, but another one I had, but followed the cooking process for the first two hours. Then I put them on the grill, watched them carefully, turning and basting so they wouldn't burn, for about 45 minutes. They were perfect! I cooked three racks at once, and didn't have to increase the cooking times or anything. I will do this recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lollypaul",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5725107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-04T16:43:09.733Z",
                "reviewBody": "This recipe will give you good tender ribs.  With that said, there is nothing special about the recipe itself.  Like Chef John says, you can really season it with anything you want. All I had on hand was the white and brown sugars, plain chili powder and salt and pepper.  I did add some bbq seasoning to it to add extra flavor sicne I did not have those other seasonings.  The main thing to this recipe is the foil cooking method because I use this method with other meats (they always come out tender).  Also, I used pork spare ribs instead and they still came out tender just had to cook an additional 30 minutes.  By pork already being salty, I found that 1/4 cup salt was too much.  Next time, I'll cut down to maybe 2 or 3 tablespoons.  I'll also add more brown sugar... they weren't quiet sweet enough to me but still good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Queen Bee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3801183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-05T14:16:08.373Z",
                "reviewBody": "These ribs were awesome!  I was looking for a great oven baked baby back rib recipe an this one was on the  money.  I added liquid smoke when I added the bbq sauce.  They were very moist and fall-apart tender.  I also let them marinate in the rub overnight in foil before baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRICE OLOOTU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/213484/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "How to Make Baked BBQ Baby Back Ribs",
            "description": "See how easy it is to make flavorful ribs in the oven.",
            "uploadDate": "2013-08-28T16:56:02.155Z",
            "duration": "PT4M28.208S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F28a72eb2-73f6-484b-8cd7-f43d99028b4f%2F27d44eb9-7612-4950-adf7-06e4ee73fd5b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2634562537001"
        }
    }
]