[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
                    "name": "Apple Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220997/chef-johns-caramel-apple-pie/",
        "name": "Chef John's Caramel Apple Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3939816.jpg",
            "width": 1334,
            "height": 1021
        },
        "datePublished": "2012-04-04T21:23:57.000Z",
        "description": "To me, this is the purest and most intensely flavored apple pie recipe there is. The interesting thing about this recipe is the way the caramel sauce is poured over the apples and the lattice crust. You know how with a traditional apple pie some of the apple juices will caramelize as it bakes and bubble out of the pie and bake into and onto the flaky crust? That's how this whole pie is.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "6 tablespoons unsalted butter",
            "½ cup white sugar",
            "½ cup brown sugar",
            "¼ cup water",
            "¼ teaspoon cinnamon",
            "1 pinch salt",
            "5 apples - peeled, cored and sliced",
            "1 pastry for double-crust pie (see footnote for recipe link)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine butter, white sugar, brown sugar, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Apple Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.567873303167421,
            "ratingCount": 442,
            "itemReviewed": "Chef John's Caramel Apple Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "335.7 calories",
            "carbohydrateContent": "48.2 g",
            "cholesterolContent": "22.9 mg",
            "fatContent": "16.3 g",
            "fiberContent": "2.9 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "142.4 mg",
            "sugarContent": "34.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-09-16T00:32:01.17Z",
                "reviewBody": "This pie is absolutely delicious!!  Just a note about it being too watery:  If you aren't doing a lattice top crust, it will definitely be too watery, because not enough liquid can steam out.  I don't recommend doing a crust die, either, unless it's one that cuts out about half of the crust, because it will otherwise not release enough steam.  Additionally, you should allow the caramel sauce to cool quite a bit before adding it to the pie, to the point where it's like a  thick syrup.  The added cooling allows for more water to evorate from there as well.  Also, don't cut your apples too small, or they will release even more liquid as they begin to break down; I suggest no more than six slices per apple.  This helps keep it from turning into an applesauce filling as well.  Finally, the pie MUST cool completely before you cut it.  This will allow the apples to take up some of the liquid they released before, allow even more liquid to evaporate, as well as allow the sugars to congeal.  That's it!  Enjoy this delicious pie!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason Asher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7237041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-09T05:27:25.173Z",
                "reviewBody": "I have tried several apple pie recipes (including Grandma Ople's) only to be disappointed...until this one! I followed the advice of some other reviewers and did a thing or two from my own experience. First, Cut the apples into 8 pieces each. I use 5 large or 6 small/medium Pink Lady or Cripps Pink apples. Second, make sure the sugar mixture is cooled off. I prepare the mixture first, and cut up my apples while it is cooling. Then simply toss the apples in the mixture before pouring them into the crust. Once the lattice top is on, brush the crust with 1 beaten egg, and then evenly sprinkle 1 tablespoon white sugar over the crust. This is finally a go to apple pie recipe for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2869827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-30T03:52:12.637Z",
                "reviewBody": "I made this apple pie for Thanksgiving and everyone loved it, but I made a few changes. One of the reviews  suggested to make the caramel sauce thicker by adding 3 Tbsp of flour to the melted butter before adding the water and sugars. I also used around 6 apples that were cut pretty thin. When the caramel sauce is cool, layer the apples and caramel sauce. I put a layer of apples, then I drizzled a layer of caramel sauce amd then another layer of apples then caramel sauce and so on which I used probably half of the mixture, the rest I poured on the top of the pie on the lattice strips... I also used a different pie crust that is flaky called the best ever pie crust on this website. My picture is the one posted on November 28, 2013. People couldn't believe that I made it being only 14. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CoraRustad",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12509690/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-04T10:20:13.86Z",
                "reviewBody": "To make the caramel sauce thicker, add 3 Tbsp of flour to the melted butter(roux) before adding the water and then sugars.  The apple selection is critical when making a good apple pie.  If your pie turned to soup or mush or collapsed it was the fault of your apples NOT this recipe.  Granny Smith might be too tart and firm for some. Try Winesap, Braeburn, Pink Lady, Gala in season.  Firm, sweet, spicy.  Not soft.  I know many people that swear by golden delicious but I have never had them make a good pie.  July apples make for a great pie during the summer months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "dolfinlvr65",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2180672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-08T00:19:42.65Z",
                "reviewBody": "Quite an easy pie! I used the Pillsbury crust and it tasted really great in this receipe. Do the lattice he shows in the video. Easy and pretty! My son loved this pie. I added 2 extra apples and extra cinnamon (about a tbsp). My only complaint was that the pie was very runny. I cut a few pieces and then drained off about 1/2 at least of liquid from the pie plate before I retuned it to the fridge. Perhaps I did not boil the caramel sauce long enough. I think the pie was fully cooled. I would make this again but I think I might add a couple of tbsp of flour in with the apples to thicken things up a bit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Keep it Simple!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8851577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-16T15:13:52.67Z",
                "reviewBody": "great pie just put alittle corn starch in it and it well be even better unless you like really runny pie I have made it both ways and the corn starch makes all the difference in the world and use at least 3 to 4 different apples gives it a better flavor love the recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Edmondson Nance",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9214369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-17T21:52:18.05Z",
                "reviewBody": "It's important to use BAKING apples in this pie. Repeat after me: \"Granny Smith\". Be sure to let the caramel sauce cool before pouring onto the lattice crust and bake the pie on the lowest rack in your oven. Fantastic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mismadison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-13T04:42:48.75Z",
                "reviewBody": "I followed the recipe just as it was. After reading the reviews I was concerned about the filling being watery. I have had that problem with pies in the past. I did cook the sauce as per the recipe and let it come to a rolling boil. Then let it cool. I used 6 Granny Smith apples and cut them into 8 slices per half. Using the boxed pie crust that just unrolls was so easy! Did the lattice top. I debated if I should use the cornstarch or flour and decided not to. I did just as Chef John said and poured the sauce over the top of the pie...lattice and all. Put the pie on cookie sheet and baked as directed for the first 15 minutes. Then put a pie ring around the edge and finished baking at 350 degrees. I let it cool on the cookie sheet. I was pleasantly surprised that my pie came out like it the recipe!! Loved the simple flavor of the buttery cinnamon sauce with the tart apples! I am sure there are many variations that can be added but if you want a pretty delicious homemade pie...this is one to try! I'm making one to take to Thanksgiving Dinner. That is saying a lot because there is a lot of pressure to make something that everybody is going to like! Thanks Chef John for another successful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "momosdinner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10139606/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-22T12:15:14.233Z",
                "reviewBody": "The carmel sauce is amazing. I always add a palm full of tapioca granuals to my apple pies and I never have a runny pie. (They absorb the extra liquid and can't be seen in the pie.) My Grandma's secret!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Starr Woodall",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10783055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-15T20:44:13.357Z",
                "reviewBody": "I followed the directions exactly. I even lightly floured the apples to try to ensure it would set up and I got soup. Yummy soup but soup. Not really sure how to fix this. Won't be making this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacy Meredith Seiler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3690105/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John's Caramel Apple Pie",
            "description": "Caramel Apple Pie - The Best Apple Pie Ever!",
            "uploadDate": "2011-09-26T21:47:09.813Z",
            "duration": "PT3M39.953S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3dd1af78-7b48-4528-b260-ae1cf852c9b4%2F96b61697-49a7-4174-9e39-b1bf30cd0c56%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1183664231001"
        }
    }
]