[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/221056/strawberry-gelato/",
        "name": "Strawberry Gelato",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Strawberry Gelato"
        },
        "datePublished": "2020-06-19T03:48:16.000Z",
        "description": "This recipe is perfect for 1.5-quart ice cream makers. It's easy to make and tastes great. Making gelato takes some trial and error to figure out the custard bases, flavors, and the quirks of your ice cream maker. Once you conquer the technique you won't believe what you can do.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P1DT0H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 cups whole milk",
            "½ cup white sugar",
            "4 egg yolks",
            "½ teaspoon vanilla extract",
            "1 cup chopped fresh strawberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat milk, sugar, egg yolks, and vanilla with a wire whisk in a saucepan; cook and stir over medium heat until beginning to thicken, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold the strawberries into the thickening mixture. Whisk until the strawberries soften enough to nearly dissolve into the liquid. Continue cooking until nearing a boil and thick enough for a thin layer to cling to a spoon dipped into it, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Chill in refrigerator until completely cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Freeze in canister of ice cream maker according to manufacturer instructions.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Fat Al Johnson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 2.7142857142857144,
            "ratingCount": 7,
            "itemReviewed": "Strawberry Gelato",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "242.7 calories",
            "carbohydrateContent": "35.6 g",
            "cholesterolContent": "217 mg",
            "fatContent": "8.5 g",
            "fiberContent": "1.2 g",
            "proteinContent": "7 g",
            "saturatedFatContent": "3.9 g",
            "servingSize": null,
            "sodiumContent": "57.4 mg",
            "sugarContent": "33.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-11T21:09:17.993Z",
                "reviewBody": "I really hate to rate recipes low especially newer ones. However this wasted A LOT of ingredients because it didn't work for me at all. I cooked the custard on medium as suggested. I was worried about that because I only cook puddings on medium low. I however wanted to follow the directions. It took longer than suggested to thicken and then by the time it did it started some separation. I thought the pale skin toned color looked kind of unappetizing to. I really like custard ice cream and honestly couldn't wait to try this. I have made many ice creams over the years in my ice cream maker. I did notice that this had no cream in the mix. I found that to be very odd to for ice cream. I had high hopes either way. The texture was slightly grainy from the separation and it never hardened up one bit in the ice cream maker. It was just a cold liquid. I am so dissapointed as I have to toss it out. I don't know what else to do with it. I would love to hear about others results. I would like to try it again on medium low like I normally do but fear wasting more food ingredients.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-17T21:15:27.69Z",
                "reviewBody": "The lack of cream in this recipe makes it lower fat but also incredibly fiddly.  Gelato should have *some* cream in it, and this doesn't.  Because of the lack of cream, it's absolutely essential to use whole milk.  Even with whole milk, heating the custard even a little bit too quickly will result in curdling, which is what I assume happened to the previous reviewer.  All stoves are not the same, and slavishly following the recipe to the letter when you know medium is too hot for custard on your stove is a near guarantee that you'll have a failure.  If you can get the heat just right to get this very low fat custard to thicken without curdling, then it's pretty tasty.  It took me three tries and a dozen eggs to manage it, though.  If you're not an extremely experienced gelato maker, I'd recommend passing this recipe over in favor of one that contains at least a 3:1 ratio of milk to cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PhantomMoon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/117127/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-14T11:57:16.567Z",
                "reviewBody": "For my first time making gelato or any ice cream i was very happy with this recipe. For the comment previous to me... i don't think you understand that this is a gelato recipe not a ice cream one. The thing i like about gelato is that is lower in fat due to the lack of cream in it. the portions were just right and i've started to experiment with other flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ashley10824",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9768945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-01T19:18:19.75Z",
                "reviewBody": "Okay I used this as a general idea for my first try with my Lello ice cream maker. I think this recipe is great if you're trying to cut out a lot of the fat and if you're expecting ice cream look elsewhere as this is meant to be a gelato- big difference in texture and flavor folks. I don't use a measure so I'll just give you the run down: I used fat-free half and half as well as a little fat-free yogurt instead of milk defrosted berries and the rest is the same except I did a little less on the sugar and doubled the vanilla because I love it! Sadly the motor on the Lello wasn't working but being determined to have this I hand churned it for the 20 minutes and the finished product was pretty remarkable! Smooth and tasty indeed. Now four hours later it's been in the freezer and I give it a try: the creaminess is still there and the berry flavor is too! Because it's lower in fat it is a little on the stiff side. If I had added a stabilizer it might have fared better but I'd still make it like this nonetheless. The lesser amount of sugar is immediately apparent and you can definitely tell this isn't store-bought. If you're used to or like that sugary taste add more sugar but the creaminess and berries bring a nicer flavor to this. I can't imagine buying a berry ice cream from the store after this. Now if only I can get this machine to work! Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SassyCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6476725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-21T18:11:02.69Z",
                "reviewBody": "I will not be using this recipe again. I have been making homemade ice cream for a long time and this is the first time I have ever failed to get a consumable product.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Virginia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15785848/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-21T18:01:16.33Z",
                "reviewBody": "Tried 2 times. Never thickened. Curdled both times.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "cj1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11396895/"
                }
            }
        ]
    }
]