[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/221101/best-ever-strawberry-cake/",
        "name": "Best Ever Strawberry Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F846554.jpg",
            "width": 1458,
            "height": 1458
        },
        "datePublished": "2020-06-19T03:48:18.000Z",
        "description": "This type of strawberry cake recipe with all-natural strawberry flavoring (no gelatin) is quite rare and difficult to find. This strawberry cake tastes light and fresh, never too sweet. A truly excellent recipe that always turns out fluffy and oh-so moist. Topped with the rich and delicious cream cheese frosting, this cake is truly the best ever. It was a handwritten recipe I found in my mom's recipe book, but I assume she found it elsewhere.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 cup pureed strawberries",
            "¼ cup 2% milk ",
            "6 eggs",
            "1 tablespoon vanilla extract",
            "2 ¼ cups sifted cake flour",
            "1 ¾ cups white sugar",
            "4 teaspoons baking powder",
            "1 teaspoon salt",
            "¾ cup butter, softened",
            "2 (8 ounce) packages cream cheese, softened",
            "½ cup butter, softened",
            "2 cups confectioners' sugar",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease and flour two 8-inch cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix pureed strawberries, milk, eggs, and 1 tablespoon vanilla extract together in a small bowl; transfer to the bowl of a stand mixer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat flour, white sugar, baking powder, and salt into strawberry mixture on Low; add butter and continue beating on Low until evenly combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stop mixer, scrape sides, and beat again for about 30 seconds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide batter evenly between the two prepared cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center of each cake comes out clean, about 25 minutes. Cool the cakes in the pans for about 10 minutes; transfer to wire racks to completely cool, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cream cheese and butter together in a medium bowl until smooth. Gradually beat confectioners' sugar into cream cheese mixture until creamy and fluffy; stir in 1 teaspoon vanilla extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread about 1/2 the frosting on top of 1 cake. Place second cake on top of frosting layer; spread the remaining frosting on top of second cake and around sides of both cakes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cassidylea16"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.2222222222222223,
            "ratingCount": 27,
            "itemReviewed": "Best Ever Strawberry Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "640.6 calories",
            "carbohydrateContent": "74.5 g",
            "cholesterolContent": "185.3 mg",
            "fatContent": "35.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "8.7 g",
            "saturatedFatContent": "21.2 g",
            "servingSize": null,
            "sodiumContent": "641.2 mg",
            "sugarContent": "51.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-03-17T07:31:21.92Z",
                "reviewBody": "Mine came out awesome, but I did do some tweaking, so I gave 4 stars cause I'm not sure how it would have come out with my adjustments. Here's what I did--  first off, I cooked down the frozen strawberries for about 10-15 minutes then strained out the solids with a sieve, pressing out every precious drop of juice ( I had only about a 1/4 cup solids left to discard from about 24 oz berries) I was left with about 1/2 c strawberry reduction.  I used 1/2 c whole milk, 1.5 tsp vanilla, 1.5 tsp strawberry extract, 1/4 tsp red food coloring then with the eggs... I only used the whites, and rather than blending them into the milk mixture,I beat them (at room temp)  with an electric mixer/whisk attachment, till they had soft peaks and blended them in at the end, only for a short time till they were evenly blended, but not enough to chase out the air.  I baked mine in a 10 inch round wilton pan that is 3 in deep, so it took about 40 minutes to cook but will be thick enough to slice through the center to fill. this is THE lightest and airiest cake I've EVER made! Beautifully pink and strawberry flavored!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Leila Demian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9595097/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-10T23:55:50.937Z",
                "reviewBody": "I am happy to be the first reviewer of this recipe! It is quite tasty and VERY rich. A small piece is plenty. The description of this cake says it is light. Though I followed the directions to the letter my cake was rather heavy and dense. It also took much longer to bake than stated (about 35 minutes). The cake does not have a strong strawberry flavor and the color is far from the usual pink color of most strawberry cakes. The frosting really makes the cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-25T19:42:08.28Z",
                "reviewBody": "I made this recipe twice.\nThe first time, I made the cake exactly as the recipe specified, and I found the cake to be delicious and light, but somewhat lackluster in strawberry taste. My friends could hardly tell it was a strawberry cake, apart from the icing, which was store-bought strawberry.\n\nThe second time, I made the cake again in the exact same fashion, but put in considerably more strawberry purée (a little over 2 cups), and completely melted my butter before adding it (just added that to be fair, though I highly doubt it really changed anything). I also added a small handful of diced strawberry pieces to further accentuate the missing strawberry flavor.\nI decided to actually make the recipe's icing this time as well.\nThe second yield was an enormous improvement over the first. So, as long as you make those small adjustments, this recipe is quite tasty and a strong recommendation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Samuel Byrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13536188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-14T15:25:48.123Z",
                "reviewBody": "The cake lacked flavour. The texture was eggy. Not as moist as I had hoped. Colour not appealing. Sorry I would not make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "TraciiVCL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9436191/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-30T13:21:44.53Z",
                "reviewBody": "Thanks to LDamien's advice about whisking the egg whites this cake came out nice and light. I also added the extra strawberry flavoring and didn't blend my strawberries completely so the cakes has some little strawberry pieces which makes it look really nice. Frosting is addictively delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Faith Blaxcell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13995599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-01T20:43:36.813Z",
                "reviewBody": "I haven't actually tried the cake yet but it looks and smells fantastic. However with the addition of the 1/2 strawberry puree to the frosting it's very thin. I added about another 1/2 cup of powdered sugar plus almost 1/2 cup of flour and some cream of tarter but it's still pretty loose.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "miraleslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7243478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-06T23:15:33.867Z",
                "reviewBody": "I made the cake portion of this recipe with no changes except I only had AP flour not cake flour. I made cupcakes from the batter and they were delicious. Cooked for 20 minutes. They didn't have a strong strawberry flavor but were moist. Will definitely make this recipe again and might have to try the frosting next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "rbwannabe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2723382/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-11T23:05:22.397Z",
                "reviewBody": "Yum! I made a sugar-free version using Just Like Sugar (baking version). I also used blueberries instead of strawberries and used a lot more purée than the recipe called for (omitting the milk as well). It came out great! Nice and buttery and not \"eggy\" at all in my opinion (as was stated by some other reviewers). The frosting is a little bitter due to the Just Like Sugar (I'll use powdered xylitol next time) but it's still good. At least my husband & I like it -- we'll see what the kids at my daughter's b-day party tomorrow think of it. Also I made this into cupcakes one heart-shaped 8\" (approx.) cake -- the blueberries resulted in a deep purple cake (so cool) and I'm frosting it pink which shall certainly delight my very girly girl and her girly buddies. And finally I used cake flour and it worked very well though it's probably fine to use all-purpose or even whole-wheat if you wanted to. I may try this again with almond flour -- since we normally eat low-carb -- though I wonder if it will hold its shape. Still fun for an out-of-the-ordinary birthday splurge.:-D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "usignola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4356674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-20T13:00:12.527Z",
                "reviewBody": "I totally wasted my money on this recipe. The cake was heavy and a very dull color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "clarice coleman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17147292/"
                }
            }
        ]
    }
]