[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/221173/aunt-kates-strawberry-cake/",
        "name": "Aunt Kate's Strawberry Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5368945.jpg",
            "width": 1441,
            "height": 960
        },
        "datePublished": "2020-06-19T03:48:21.000Z",
        "description": "This recipe dates back to the early 1900's and was made by my grandmother's sister Kate. I have the fondest memories of my grandmother and my mother making this when strawberries came into season. The cake itself is not very sweet, although the icing is. The balance is perfect. I make this for many occasions, and my secret taste testers have remarked how wonderful it is. Just a side note: using fresh, sweet strawberries is the key.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "1 cup white sugar",
            "½ cup shortening",
            "2 eggs, room temperature",
            "1 teaspoon vanilla extract",
            "1 cup mashed fresh strawberries",
            "½ teaspoon baking soda",
            "2 cups all-purpose flour",
            "½ teaspoon salt",
            "2 cups confectioners' sugar",
            "¼ cup butter, room temperature",
            "¼ cup mashed fresh strawberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease a cake pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat white sugar and shortening together until light and fluffy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat eggs, one at a time, into sugar mixture until well mixed; stir in vanilla extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 1 cup strawberries and baking soda in a large bowl until baking soda is dissolved. This will help strawberries foam and rise in the cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour and salt together in a separate bowl. Stir flour mixture and strawberry mixture by hand, into sugar mixture, alternating flour mixture, then strawberry mixture, beginning and ending with flour mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into prepared cake pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted in the center comes out clean, 25 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat confectioners' sugar, butter, and 1/4 cup strawberries in a bowl with an electric mixer until blended; frost the cooled strawberry cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Drea217"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8529411764705883,
            "ratingCount": 34,
            "itemReviewed": "Aunt Kate's Strawberry Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "263.8 calories",
            "carbohydrateContent": "41.5 g",
            "cholesterolContent": "30.9 mg",
            "fatContent": "10.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "2.6 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "141.9 mg",
            "sugarContent": "28.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-21T20:45:47.22Z",
                "reviewBody": "I had fun playing with this, seeing if I could improve upon some issues of concern.  First, I thought it unusual that baking soda was in the ingredients list, but not baking powder, especially since there wasn’t anything particularly acidic in the ingredients like lemon juice or buttermilk that would necessitate that.  I also noticed the flour to sugar ratio was off, with not enough sugar.  The submitter herself states the cake is not very sweet.  And, while there aren’t many reviews of Aunt Kate’s cake, even some mentioned it was heavy and dense.  Since the submitter also mentioned the cake was from the early 1900’s, I thought maybe baking powder wasn’t on the market yet.  Nope, it was introduced in the mid 1800s.  Still, I thought some baking powder was needed to give the cake some lift, making it lighter and fluffier.  Knowing baking soda is four times as powerful as baking powder, I used  1/4 tsp. baking soda, 1 tsp. of baking powder and just 1/4 tsp. salt.  One cup of strawberries seemed a lot to me for this little cake, which I thought might be “dragging” the cake down – I reduced it from 1 c. to 3/4 c. and added 1/2 tsp. of natural strawberry extract to compensate. Finally, I wanted the cake a little sweeter so I added 2 T. more sugar. I baked this as cupcakes and the changes did prove to result in a light and fluffy, nicely sweet cake. This is just slightly strawberry flavored, but once covered with the frosting (I added 1/2 tsp. strawberry extract) it was just right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-22T23:51:34.113Z",
                "reviewBody": "This was really good!! My 3-year old ate every bite. I found my cake took 35 minutes to cook through (I used a 9\" round cake pan). Had to add the photo it's a real showstopper! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mountain Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3729086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-24T03:23:19.13Z",
                "reviewBody": "My son wanted a Neapolitan cake for his birthday. I used this for the strawberry layer. I didn't make the frosting. This cake has great flavor the strawberry flavor was perfect. It was actually really good. I did sub butter for the shortening. My only complaint is that it was a little dense and just a tad bit dry. Will definitely be making this again. I love that you use real strawberries and the cake is made from scratch. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-14T16:45:21.763Z",
                "reviewBody": "I made this for my dad's birthday. He is always crazy about strawberry cake, and I wanted to find the perfect recipe. This is it. BUT, it does need some modifications. Here is what I changed: 1) I used 1 1/2 cup sugar instead of just 1 cup. 2) Since I modified the sugar amount, I had to use a little extra shortening. (about 1/4 cup extra). 3) I ran my strawberries through the food processor. That really did the trick. You can save some of your strawberries to slice and place on the top of the frosted cake. 4) I used about 3/4 teaspoon baking soda instead of a half teaspoon.  5) There was too much flour. I used about 1 1/2 cup altogether. 6) This fit nicely in a 9x13 pan. 7) This cake is VERY heavy and moist, but that's how we like it. 8) FOR THE FROSTING: I added 1/2 teaspoon of vanilla extract and replaced the butter with shortening. With these modifications (yes, there is a lot of them) this cake was a hit, and just what I was looking for. Don't succumb to using a cake mix!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10188623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-23T16:05:50.697Z",
                "reviewBody": "\"Grease a cake pan.\" What size cake pan? Judging from the amount of flour, I surmised an 8\"-9\" round pan, or an 8\"X8\" square. I backed the soda off to 1/4 tsp and added a tsp of baking powder, since the consensus appeared to be that the cake as written was dense and muffin-like. Also added a bit more sugar (3 Tb,) since many have stated the cake is not sweet enough. 25 minutes was about perfect. I added half of a block of cream cheese to the frosting, and it was delicious. The cake itself doesn't have a lot of strawberry flavor, but when the strawberries are pureed and added to the frosting, that revs up the flavor significantly. Pureeing gave the frosting a consistent, non-chunky pinkness. All in all, as written, the recipe has flaws, hence the 3 stars. But, happily, it was salvageable after the changes delineated above. With those modifications, it's pretty good, 4-1/2 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-24T03:13:05.807Z",
                "reviewBody": "I doubled the recipe to make a 9x13 cake and it's just too dense & not sweet enough for cake. This would make a great strawberry muffin recipe though. Sorry it just wasn't a hit in my house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Art&Jess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2954056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-22T15:05:11.287Z",
                "reviewBody": "I can't wait to make this cake again! I wasn't able to frost it b/c it was too moist & fell apart. That was my fault though. I only had one egg so substituted strawberry applesauce for the other egg. I also think I put in too many strawberries! Honestly though the taste was still fanstastic & can't wait to try it w/frosting. Thanks for this recipe!!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy P.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-24T04:52:01.06Z",
                "reviewBody": "I made this following the recipe exactly except after reading the reviews I added one teaspoon of baking powder to give it a little lift. It is true that this is a rather dense cake and it is not very sweet...however I was expecting this and found it to be a good thing. I would eat the cake on its own truth be told but I went ahead and made the frosting. Now THAT is sweet!!! The cake and frosting complement each other beautifully although I could actually do with a little less frosting (that is just me though). Overall I really enjoyed this- different than the chocolate and vanilla cakes I normally make and a great way to enjoy fresh ripe strawberries:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Puck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-31T03:32:52.083Z",
                "reviewBody": "This is a very heavy cake. It is really thick so if you crave a light fluffy cake this is not the one. The cake itself is not very sweet. The frosting however is TDF! It is sweet and a perfect pairing with the cake. I doubled this and stacked the heavy layers. The icing was running over it and it looked as great as it tasted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNNESKITCHEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1435864/"
                }
            }
        ]
    }
]