[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83312/sticky-monkey-brains/",
        "name": "Sticky Monkey Brains",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3832448.jpg",
            "width": 2205,
            "height": 2205
        },
        "datePublished": "2020-06-19T03:11:54.000Z",
        "description": "This gooey cinnamon pull apart recipe will impress everyone in your family! It is an easy (and I mean EASY), fast, and tasty modification of my boyfriend's grandmother's monkey brain recipe. I use 6 small Bundt pans instead of one big one so the cinnamon balls are more gooey :)Fun to make and even more fun to eat!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 (7.5 ounce) packages refrigerated biscuit dough",
            "⅓ cup white sugar",
            "2 teaspoons ground cinnamon",
            "½ cup chopped pecans",
            "½ cup butter, melted",
            "½ cup brown sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease 6 miniature Bundt pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together the white sugar and cinnamon. Set aside. Use scissors or a knife to cut each of the biscuits into various sizes. Each one can be cut into anywhere from 2 to 5 pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle about half of the pecans amongst the 6 prepared pans. Roll pieces of biscuit in the cinnamon-sugar, and place them into the pans, distributing evenly. Sprinkle any remaining cinnamon-sugar over the dough balls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together the brown sugar and melted butter. Stir in the remaining pecans. Distribute evenly over the pans of dough balls. For ease of getting in and out of the oven, place all of the pans on a cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, or until the biscuits are toasted and cooked through. Remove from the oven, and invert individual pans onto serving plates while still hot.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUGISUGI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.711538461538462,
            "ratingCount": 260,
            "itemReviewed": "Sticky Monkey Brains",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "631.6 calories",
            "carbohydrateContent": "70.9 g",
            "cholesterolContent": "41.7 mg",
            "fatContent": "36.3 g",
            "fiberContent": "2 g",
            "proteinContent": "8.1 g",
            "saturatedFatContent": "14 g",
            "servingSize": null,
            "sodiumContent": "1176.4 mg",
            "sugarContent": "31.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-07T01:48:04.683Z",
                "reviewBody": "This is a recipe I have used since I was a little girl with one exception we would roll the biscut balls in the butter first then the cinnamon and sugar mix before putting the balls into the pan. After putting all the dough in then mix the remainder of the butter and cinnamon and sugar mix and pour it on top. This step only adds to the stickiness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "leslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2176574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-30T20:12:50.697Z",
                "reviewBody": "This is a definite keeper! I had only been looking for an easy recipe that 2 seven year-olds could help me make and this fit the bill. Still, I was a bit skeptical about using the canned biscuits because that \"canned biscuit flavor\" usually comes through in anything you make with them. Not so with these! They were outstanding! Neither of the kids like nuts, so we didn't use them. I don't own a bundt pan of any size, so we we split 3 cans of biscuits (each biscuit cut into 6 pieces) between 2 round cake pans. To avoid cleaning burnt-on sugar off the pans, I lined them with foil, buttered the foil, and sprinkled the bottom and sides with cinnamon sugar before proceeding with the recipe. We shared them with company who popped by and not a sound could be heard while we all indulged in buttery, sugary bliss. Thanks for posting this. Love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beansie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2365227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-25T05:47:26.34Z",
                "reviewBody": "This was really good - actually better than I expected. I used 1-1/2 cans jumbo \"flaky\" biscuits. I used a full-size bundt pan for this and baked it for 35-40 minutes. The biscuits were perfectly done. My only complaint was that my brains weren't stickier. Next time I'll add 50% more of the brown sugar/butter mixture. Thanks so much for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-27T19:17:43.467Z",
                "reviewBody": "The title is disgusting but the product is great! I used two cans and cut each biscuit in half. I put the sugar mixture into a plastic bag and shook the biscuits in them to coat better. Having made them now I wouldn't put the pecans on the bottom b/c they just burnt and didn't stick to the biscuit. When they came out of the oven I wanted to add frosting. I had a container of Betty Crocker Frosting I had bought so I just heated it in the microwave for 15 seconds and drizzled that on top and sprinkled more nuts on top of that. It's great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brandi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1258947/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-11T02:08:08.953Z",
                "reviewBody": "This recipe won me first prize in my family's annual cooking competition. The first time I made this I used Pillsbury's country biscuit dough (2 x 340g packages -about 40g more than the recipe called for - so I left one of the precut biscuits out) and I found it incredibly salty (4 stars). The second time I went with the same amount of Pilsbury FLAKY ROLL dough and it was FANTASTIC. I used 6 aluminum foil mini cake pans with a single layer of dough balls in the bottom and they were perfect. I used the cooking time in this recipe although the instructions on the package of dough said to only cook 11-13 mins - and they did not overcook. The stickiness is my favourite part so I use half again as much butter/brown sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2222060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-23T13:21:04.213Z",
                "reviewBody": "This is an awesome recipe and I have been it this way for a couple years now. If you really want to up the anty add a piece of cream cheese in the middle of each ball of dough. HEAVENLY!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "smatchi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2239616/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-04T10:11:47.927Z",
                "reviewBody": "I followed SunnyByrd's review suggestions and I used 1 1/2 cans of \"flaky\" whomp biscuits and I made a recipe and a half of the \"sticky\" part. I also used a full sized Bundt pan. 35 minutes at 350* and it was just right. Sunnybyrd was right--a recipe and a half was the right amount of sweet sticky awesomeness with the flaky biscuit dough balls. My boys and husband had this pretty much inhaled in less than fifteen minutes. They loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-03T01:29:09.7Z",
                "reviewBody": "The topping is fabulous! Since I didn't have refrigerated biscuit dough I used frozen diller roll dough and it turned out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1832898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-18T02:44:22.6Z",
                "reviewBody": "I made this today for our ladies group at church. What a mess. Im only giving it 2 stars b/c i see that it COULD be worked with and made into a good recipe. Sadly it didnt work out so well. Yes i do admit i didnt do it in the 6 individual bundt pans. I did it in one large one and the biscuits didnt want to rise b/c they were weighed down by everything or so it seemed. Also the biscuits wouldnt cook in the middle. The top was about to burn while the insides were gooey still. So i had to turn out the whole thing onto a baking sheet and bake it like that. Well then it was so dry and basically burnt on the outside b/c of all the sugar that it was not very tasty at all. Good thing the ingredients werent expensive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ShawnaRae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1542146/"
                }
            }
        ]
    }
]