[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/221361/traditional-sauerbraten/",
        "name": "Traditional Sauerbraten",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F888826.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-19T03:48:31.000Z",
        "description": "I found two slightly different hand written versions of this, my Grandmother's recipe. Born in Nekkar am Rhein in the 1904, she naturally learned to cook traditional German meals as a young woman and didn't rely on a cookbook. I try to capture the nuance in this. Serve with potato dumplings.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P2DT4H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 pounds beef rump roast",
            "2 large onions, chopped",
            "1 cup red wine vinegar, or to taste",
            "1 cup water",
            "1 tablespoon salt",
            "1 tablespoon ground black pepper",
            "1 tablespoon white sugar",
            "10 whole cloves, or more to taste",
            "2 bay leaves, or more to taste",
            "2 tablespoons all-purpose flour",
            "salt and ground black pepper to taste",
            "2 tablespoons vegetable oil",
            "10 gingersnap cookies, crumbled"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place beef rump roast, onions, vinegar, water, 1 tablespoon salt, 1 tablespoon black pepper, sugar, cloves, and bay leaves in a large pot. Cover and refrigerate for 2 to 3 days, turning meat daily. Remove meat from marinade and pat dry with paper towels, reserving marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season flour to taste with salt and black pepper in a large bowl. Sprinkle flour mixture over beef.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a large Dutch oven or pot over medium heat; cook beef until brown on all sides, about 10 minutes. Pour reserved marinade over beef, cover, and reduce heat to medium-low. Simmer until beef is tender, 3 1/2 to 4 hours. Remove beef to a platter and slice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain solids from remaining liquid and continue cooking over medium heat. Add gingersnap cookies and simmer until gravy is thickened about 10 minutes. Serve gravy over sliced beef.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Chris Simpler"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6183206106870225,
            "ratingCount": 131,
            "itemReviewed": "Traditional Sauerbraten",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "455.8 calories",
            "carbohydrateContent": "20.9 g",
            "cholesterolContent": "100.3 mg",
            "fatContent": "22.3 g",
            "fiberContent": "1.9 g",
            "proteinContent": "40.7 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "1682.5 mg",
            "sugarContent": "8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-09-30T13:23:40.523Z",
                "reviewBody": "I cooked this in the crock pot all day (8 hours - 6 lbs) after marinating it for 5 days. WOW! Excellent falvor! I have made this in the past and it turned out tough - the crockpot is the way to go! Made the gravy with Nabisco Ginger Snaps - A real hit at our German themed dinner party. I also served spatsel, red cabbage, mashed potatoes and sourdough rolls with Lingonberry jam. Excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5281957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-11T18:19:56.37Z",
                "reviewBody": "My husband bemoaned the closing of his favorite German restaurant so it was time to hit Allrecipes and try to make it myself.  Thank you so much Chris for submitting your grandmother's recipe.  This was surprisingly easy to make.  Do make sure to get roast whose sell by date includes the marinating days, the cooking day, and an extra day if you'll have enough for leftovers.  Husband took a hammer to the ginger snaps in a plastic bag to get them finely crushed as I didn't want to use the food processor; he seemed to enjoy contributing to the cause.  The ginger snaps are essential to the flavor and quickly thickened the gravy; my inner child enjoyed that part though I must admit I'm easily amused. Make sure to remove the solids first as directed.  The meat was wonderfully flavored, tender and delightfully falling apart.  The gravy was so delicious I used an almost sinful amount and was tempted to lick the plate.  This was fabulous! Five stars don't do it justice. Husband was thrilled it turned out so well and emphatic that it was better than the German restaurant's. We will definitely be making this again.  By the way, serving with German Red Cabbage, also on this site, was a must have combination.  Not wanting to tackle too much, I wimped out on the potato dumplings and just served with basic scratch made mashed potatoes. Now that I know this is so easy, maybe next time I'll take on the potato dumplings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bonnie53",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9213001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-14T17:36:27.657Z",
                "reviewBody": "This was my first attempt at making sauerbraten and it turned out delicious! The flavor was mouthwatering and the gingersnaps made all the difference with the flavor. A very nice balance... It was extremely tender, but I wonder if I should slice the meat into serving portions before marinating in the spices? It just fell apart when it was time to serve, it was so tender! YUM. Total comfort food. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3669689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-11T20:12:17.5Z",
                "reviewBody": "Delicious recipe as written. My Oma's recipe, had the following tiny differences. \nMarinade: sliced onions, not chopped. She added a crushed clove of garlic, an extra ½ cup of both water & vinegar, used freshly cracked black PEPPERCORNS and added ½ teaspoon WHOLE allspice with the whole cloves and bay leaves. She always said: Keep things big, so straining them out is easier.\nOma used a covered crock & a plate to marinate the meat in the ice box (I use a gigantic plastic bag in the fridge, today.)\nShe started sauerbraten marinating on a Monday... made an excellent Sunday dinner with red cabbage, potato dumplings & apple strudel.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paul Snave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dfwpaul/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-02T00:15:29.14Z",
                "reviewBody": "This is one fantastic recipe for sauerbraten.   I made the sauerbraten twice within a period of two (2) weeks.  I'm ready to make another batch.  The family loves it!  The only changes I made were:  (1) added about a teaspoon of granulated garlic to the marinate; (2) used chuck roast rather than rump roast due to a cost savings of $1 per pound;  (3) strained the solids from the marinate before cooking the beef; (4) \"finely chopped\" the ginger snap cookies in a food processor, rather than \"crumble\"; (5) whisked the finely chopped ginger snap cookies in enough water to make a smooth consistency (like mayonnaise); then, added to the marinate when making the gravy; (6) added a few splashes of apple cider vinegar, as necessary, to have plenty of gravy.\n \nI served the sauerbraten on a bed of spaetzle egg noodles, with two (2) sides:  homemade German/Polish potato pancakes; applesauce.\n\nAs a side note:  Before eating the second batch, my wife and I intentionally stopped at a restaurant that is known for its sauerbraten.   Although it was very-very good, the sauerbraten recipe herein is as good or better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Howard B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2289507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-18T01:36:11.327Z",
                "reviewBody": "Chris Simpler this recipe was so tasty delicious!! I followed the recipe to a T but marinated for 5 days & used a crockpot on low for 6 hours for 3lbs of roast & oh goodness was it delicious, I can't wait to make it again. This was the first time I attempted it for my husband who loves sauerbraten & he thought it was better than his mothers (WIN!!) I made the sauerbraten along with Kartoffel Kloesse Potato Dumplings http://allrecipes.com/Recipe/Kartoffel-Kloesse-Potato-Dumplings & Grandma Jeanette's Amazing German Red Cabbage http://http://allrecipes.com/Recipe/Grandma-Jeanettes-Amazing-German-Red-Cabbage [which are also both 5 star recipes] they all complimented each other it was an amazing meal!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1616394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-14T16:17:28.737Z",
                "reviewBody": "Memories! Vielen Dank!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Oesi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2031218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-14T21:39:07.577Z",
                "reviewBody": "This takes some advance planning but is SO worth the effort! I browned mine and then cooked it in a crock pot....yum! So the day of the meal really did not take a lot of time or effort and it made a wonderful family meal! We have a traditional German restaurant close by - and this is even better than theirs! Will be making this one again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shazam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8554942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-02T23:38:43.753Z",
                "reviewBody": "This was our first experience with sauerbraten.  The flavours were good but I had a couple of problems. First of all it came out soooo dry. The gravy helped but I don't think gravy should be a rescue.  The gingersnaps are supposed to be crumbled. I would say they need to be crushed into bread crumb consistancy. I had some crumbles that were a little too big and it made my gravy lumpy. I had to strain it. It also didn't thicken as I thought it should so I had to add more.  I may try this again but try to figure out how to make the meat more tender. Glad we tried it. My apologies for not loving it. Maybe next time. Thanks Chris.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Volleyballmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3368022/"
                }
            }
        ]
    }
]