[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/221909/gs-tres-leches-cake/",
        "name": "G's Tres Leches Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F845219.jpg",
            "width": 3413,
            "height": 2443
        },
        "datePublished": "2020-06-19T03:48:41.000Z",
        "description": "A dense yet light dessert better served cold and a day or two old. Room temperature + (over 80 degrees F) is a must for making this cake! You really have to plan this one for something special as far as I'm concerned. It's sooo much better put together and let set for a day or two in the fridge, covered.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT2H5M",
        "recipeYield": "1 9x13-inch cake",
        "recipeIngredient": [
            "1 ½ cups white sugar",
            "¾ cup unsalted butter at room temperature",
            "6 eggs at room temperature, separated",
            "2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "½ teaspoon baking soda",
            "½ teaspoon salt",
            "1 ½ cups whole milk at room temperature",
            "1 teaspoon almond extract",
            "¾ teaspoon cream of tartar",
            "2 tablespoons white sugar",
            "1 (14 ounce) can sweetened condensed milk",
            "1 (12 fluid ounce) can evaporated milk",
            "2 tablespoons whole milk",
            "1 pint heavy whipping cream",
            "¼ cup white sugar",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream 1 1/2 cup sugar and unsalted butter in a large bowl until mixture is fluffy and pale yellow, 3 to 5 minutes. Mix 6 egg yolks into the butter mixture, stirring in each one before adding the next. Whisk flour, baking powder, baking soda, and salt in a separate bowl; gradually stir the flour mixture into the egg yolk mixture, alternating with 1 1/2 cup milk, to make a smooth batter. Stir in almond extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat 6 egg whites with cream of tartar in a bowl with an electric mixer until frothy; gradually beat in 2 tablespoons sugar until the egg whites form stiff peaks. Gently fold the egg white mixture into the batter, retaining as much volume as possible. Pour the cake batter into prepared baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until a toothpick inserted into the middle of the cake comes out clean, 35 to 45 minutes. Cool cake completely in pan on a rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk sweetened condensed milk, evaporated milk, and 2 tablespoons whole milk in a bowl. Use a large fork or skewer to poke holes all over the cake; pour the three-milk mixture over the cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cream with 1/4 cup sugar and 1 teaspoon vanilla extract until the whipped cream holds stiff peaks. Top the cake with whipped cream; refrigerate until cold, at least 1 hour. Refrigerate leftovers. Cake is better a day or two after making.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Garnet B."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.703703703703703,
            "ratingCount": 54,
            "itemReviewed": "G's Tres Leches Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "383.7 calories",
            "carbohydrateContent": "42.7 g",
            "cholesterolContent": "120.7 mg",
            "fatContent": "21.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "7.2 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "221.9 mg",
            "sugarContent": "32.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-13T20:16:12.83Z",
                "reviewBody": "I have heard of tres leche cakes for a long time..but never tried one..till now. I am an instant fan..this cake is the best thing I have put in my mouth in a long time. I am picky when it comes to cakes and this one is worth the time and the wait for the 2 days to enjoy it. The only changes I made was to use a 12 oz can of cocont milk instead of the evaporated milk, poured the milk sauce on when warm, and put on the whip cream after it was refrigerated for 2 days. and topped it with toasted coconut. This cake reminded me of a coconut cream pie souffle'",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dee Stillwell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lillydee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-18T18:28:28.903Z",
                "reviewBody": "I have had tres leches cake before from a a store and bakery-it was good..but then i came across this cake recipe..omg i am Latina and we love our tres leches cake-made this cake last year for my husbands birthday he loved it..i have to practically fight for a piece and it's a good size cake! lol all of our family members raved about this cake! my husband come from a family of 11 siblings including him so if you like rich thick cake that has a perfect amount of just enough sweet,richness that melts in your mouth and dances i would make this cake it's more then worth it..it's on the top of the best cakes i have ever had! did i sell ya? dare ya to live a little! I will be making this cake for my uncle this forth of july-his is the 3rd but i know he will love it! can't wait",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia Weems",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10288835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-19T17:21:33.2Z",
                "reviewBody": "Very good recipe. I made it exactly as written. Next time, I would omit the almond flavoring or reduce it to maybe a quarter teaspoon, it's just not to my taste (to much like Christmas cut out cookies). I would also cut back the sugar a little, maybe by 1/4 cup. don't worry about the liquid being too much it Will all be absorbed by the cake, in fact, it's probably more absorbed then some other tres leches cakes that I've had. the cake will be high and fluffy out of the oven, I ended up baking mine for 37 minutes the top was golden and a few cracks just starting in the middle. The cake will shrink and flatten out (becoming denser) as it cools, I ran a knife around the edges to loosen right away. Letting the cake cool will allow it to continue cooking in case the middle has any slightly gooey parts. All in all it got a thumbs up and with the changes should be a 5 star for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELLEE74",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-03T16:58:33.18Z",
                "reviewBody": "I've had another recipe from this site printed and ready to go for about two weeks. It had hundreds of reviews, but for some reason, at the last minute, I had second thoughts and decided to look around and settled on making this one instead, even though it had only a handful of reviews. I'm SO glad I did! This cake was fabulous!! I'd never made it before, so I was a bit nervous to bring it to a work potluck, but everyone who tried it loved it. I made only two minor revisions - I used vanilla extract instead of almond (daughter has an almond allergy) and used powdered sugar in the whipping cream just because that's what I always use. Followed the directions otherwise exactly as written. Success! Looking at how the measurement of ingredients differs in this one so much from the one I was going to try, I can't even imagine how the other one could work out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sheriw",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5932510/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-10-05T08:57:45.78Z",
                "reviewBody": "My god woman. First things first.. That's the best sponge cake recipe I've ever made. It was flawless! I can see this as is being so lovely on a hot day straight out of the fridge. I'm in IL in the fall however so I jazzed it up!! In the batter I halved the almond extract and added a full tsp of vanilla. I grated some fresh nutmeg (probably about 1/2tsp) and added some cinnamon (probably about 1/4tsp) and a shot of Rumchata. I also added another shot of Rumchata to the whipped cream and probably only used about half the sugar figuring the liquor likely adds some sweet too. And dusted the top w another bit of fresh nutmeg and cinnamon. Made it for a coworkers birthday who loves tres leches. He was SO happy! Resounding success. Thank you so much for sharing. This cake has so many possibilities. I'm going to have to make it again and again to satisfy my curiosity. Is anyone is looking for a good gift I'm going to need a gym membership! Lol. Happy baking y'all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LauraAnne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3591683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-16T01:23:36.12Z",
                "reviewBody": "I had never heard of Tres Leches cake and this was my first time making it. I was surprised that no one else noted that the cake would be totally submerged after pouring the three-milk mixture over it. This had me worried, so I poured out a considerable amount of liquid out of the pan (1/4 of the total) before icing the cake with whipped cream and refrigerating it. It turned out dense, moist, very sweet, but very nice complexity of vanilla and other flavors. (I also replaced the almond extract with vanilla.) It's worth noting that my eggs never stiffened even after I beat them a long time, and it still turned out alright.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Steffani S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1818427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-17T02:55:47.077Z",
                "reviewBody": "I served this cake for a Dia de los Muertos fundraiser dinner and it was a big hit. I've made other recipes for Tres Leche cake but I prefer the flavor and texture of this recipe. I didn't change a thing with this recipe and I did make it two days in advance as recommended. I topped the cake with toasted coconut on top of the whipped cream topping and I'd do that again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4569391/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-06T17:49:47.663Z",
                "reviewBody": "Oh my gosh was this good. I took this to a Cinco De Mayo party for dessert. Everyone raved about it. It was a little time consuming to make but it was well worth it. I made it exactly as the recipe stated. However I did add the toasted coconut on top per another reviewer. I prepared it the day before the party finishing it at 8 pm and then refrigerated it overnight. It was served the next night at about 6 pm. Awesome recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marquitta Kirwan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3925359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-17T22:24:30.25Z",
                "reviewBody": "This is a great recipe. It may seem like a lot of liquid, but it gets absorbed into the cake very quickly. We didn't wait for the cake to cool before we poured the milk mixture on top, and it turned out beautifully. I was a little concerned because the cake rose up really high while it was cooking, but once I removed it from the oven and poked the holes into it, it fell enough so that the topping could be added. The cake turned out very moist and flavorful, but not as wet as other tres leches cakes I've had. The texture was wonderful. \n\nYou can top it with toasted sliced almonds and fresh strawberries to make it extra special. It's the perfect dessert for summer and definitely better served the next day. My husband also tried it topped with coconut and with sliced bananas, and that was good too. You can really customize it to your own tastes. I like that you can bake it in a standard 13x9 inch pan. Other recipes I looked at required pan sizes that we don't have. Will definitely make this one again. Might try substituting vanilla extract for the almond next time, although the almond pairs great with fresh strawberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NewBride",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/790873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-03-12T20:12:08.97Z",
                "reviewBody": "It was so heavy and thick to eat. A stodgy consistency. Not a fan for the work it entailed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Larrlach",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13070040/"
                }
            }
        ]
    }
]