[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83819/strawberry-rhubarb-coffee-cake/",
        "name": "Strawberry Rhubarb Coffee Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F410858.jpg",
            "width": 3504,
            "height": 2336
        },
        "datePublished": "2020-06-19T03:11:57.000Z",
        "description": "Strawberries and rhubarb combine to make a sweet, fruity filling in this cake. The crumb topping adds a little crunch; it would probably be good with some nuts sprinkled on top.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "⅔ cup sugar",
            "⅓ cup cornstarch",
            "2 cups chopped rhubarb",
            "1 (10 ounce) package frozen sliced strawberries, thawed",
            "2 tablespoons lemon juice",
            "3 cups all-purpose flour",
            "1 cup sugar",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "1 cup cold butter or margarine",
            "2 eggs",
            "1 cup buttermilk",
            "1 teaspoon vanilla extract",
            "¾ cup sugar",
            "½ cup all-purpose flour",
            "¼ cup cold butter or margarine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine sugar and cornstarch in a large saucepan; stir in rhubarb and strawberries and bring to a simmer over medium heat. Cook until thickened, about two minutes. Remove from heat, stir in lemon juice, and let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 3 cups flour, 1 cup sugar, baking powder, and baking soda in a large bowl. Cut in butter until mixture resembles coarse crumbs. Beat together eggs, buttermilk, and vanilla in a separate bowl. Stir egg mixture into flour until just moistened. Spoon two-thirds of the batter into  prepared pan; evenly spread on the cooled filling, then cover with remaining batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine 3/4 cup sugar and 1/2 cup flour, and cut in butter until the mixture resembles coarse crumbs; sprinkle crumb topping over the batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until topping is golden brown and a tester inserted in the center comes out clean, 45 to 50 minutes. Cool on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ARKBUCKS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.607407407407408,
            "ratingCount": 135,
            "itemReviewed": "Strawberry Rhubarb Coffee Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "506 calories",
            "carbohydrateContent": "75.8 g",
            "cholesterolContent": "82.7 mg",
            "fatContent": "20.6 g",
            "fiberContent": "1.9 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "12.6 g",
            "servingSize": null,
            "sodiumContent": "306.5 mg",
            "sugarContent": "42.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-10T17:35:23.66Z",
                "reviewBody": "There are three components to this cake -  the filling, the topping and the cake itself, each as good as or better than the next. This cake is perfect and mouth-watering good in every way. I used fresh strawberries for the filling and added water to compensate, enough so as it cooked and thickened it was about the consistency of canned cherry pie filling (which, by the way, would also make a good filling for this cake).  I also added a few drops of red food coloring to give it a good, rich red color.  To tell the truth, I forgot to add the lemon juice but I'm glad I did, as there is plenty of tartness in the rhubarb.  That filling is so good Hubs ate it on some vanilla ice cream as I was waiting for it to cool!  The cake is rich, buttery and moist. Could there be any doubt with all that butter and buttermilk? Out of this world...  And the topping, ohhh, the topping -  buttery, sugary, and a little crunchy.  You will not find a better coffee cake.  And I don't mean just Strawberry Rhubarb Coffee Cake.  I mean ANY coffee cake.  Not at Starbucks.  Not at Grandma's.  Not anywhere.  I will keep this cake in mind for the future and will love to try other fillings when strawberries or rhubarb aren't available.  In the meantime, 'tis the season to make the most of strawberries and rhubarb and this is the perfect recipe for that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-28T18:31:49.217Z",
                "reviewBody": "This recipe is truly wonderful. The cake turns out high and fluffy and the strawberry/rhubarb contrast is wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHARITYBOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-27T21:06:49.03Z",
                "reviewBody": "I've now made this cake threee times because my dad keeps requesting it! I made mine in an angel food cake pan and it turned out perfectly. The moist cake blends perfectly with the sweet filling. Love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AR41",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802070/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-06T19:55:59.7Z",
                "reviewBody": "This is an excellent recipe. Be aware that the batter is thick and sticky. Get enough of it on the bottom of the pan to cover. Then dollop the topp of the filling with the batter and don't worry too much if the top is not covered but do cover the top very well with the topping - which turns sweet-crunchy! My only remark (and not complaint) is that the coffee cake is so good that it overwhelms the filling - even though I used a quart of freshly sliced strawberries to make the cake. This cake is sure to be a crowd pleaser!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SQUEAKYCHU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/269220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-14T18:02:29.29Z",
                "reviewBody": "This coffee cake is not only delicious it's very pretty - pink peeks out from under the crumby sweet topping. The cake itself is very light with a tender crumb. I did have to make a few changes; used fresh strawberries (approx. 15 ounces) and because I didn't have any buttermilk I subbed light cream with a touch of lemon juice added. I also added nutmeg to the batter used brown sugar instead of white for the crumb topping and also added cinnamon to it. Served with a scoop of vanilla ice cream this was absolutely satisfying. I will most certainly be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nala’s Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nalasmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T23:14:25.047Z",
                "reviewBody": "I love anything with Strawberry and Rhubarb and this sure is a nice change from the usual pies. I love the fact that you cook the filling separate and then add it to the cake as a middle layer. I ended up making this in a Bundt pan and didn't use all the filling maybe half of it. It took about 48 minutes to bake and came out delish. I added chopped pecans to the topping and a tich of cinnamong and I also added about a tsp of cinnamon to the cake batter after reading some reviews saying it was bland the addition of the cinnamon nicely complimented the strawberries and rhubarb. With making it in the Bundt pan I had to reverse the order of the layering (put crumb topping in the bottom of the pan and then cake batter topping and cake batter) served it with ice cream for Father's Day dessert it was very well received and as I said above a nice change from the standard pies!:) Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gitano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2356139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-04T17:17:28.083Z",
                "reviewBody": "What a great thing to have for a lazy early summer morning on the patio with a cup of coffee. Made it exactly as written except subbed the milk/vinegar trick for buttermilk as I was out and added about 1/2 teaspoon of cinnamon to the crumb topping. I also used fresh strawberries in place of the frozen again....it's what I had. Really delicious and easy to put together. Made the house smell great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-29T20:51:04.743Z",
                "reviewBody": "Good, but not fantastic.  I think next time I will double the filling (or half the cake), but reduce the sugar as hubby and I both prefer our rhubarb more tart than sweet.  Also, for the topping I might sub brown for the white sugar and add cinnamon as others have suggested.  \n\nJust a hint for the layer of batter on top of the filling - the batter is rather thick so spreading is a bit of a challenge, but if you just glob it on randomly and then flatten your globs a bit with a spoon (you will still see quite a bit of filling uncovered) it really does bake up nicely to cover the filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Veronica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7083241/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-11T04:13:22.81Z",
                "reviewBody": "This is one of the easiest and best strawberry/rhubarb desserts I have ever made. You cannot go wrong with this one. The second time I made it I put all of the cake batter on the bottom topped it with the strawberry rhubarb mixture and then pu on the topping. This worked better for me as it kept the topping on top and not falling off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2386689/"
                }
            }
        ]
    }
]