[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
                    "name": "Custards and Puddings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14444/desserts/custards-and-puddings/creme-brulee/",
                    "name": "Creme Brulee Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83905/calis-sinful-creme-brulee/",
        "name": "Cali's Sinful Creme Brulee",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1096736.jpg",
            "width": 1536,
            "height": 2304
        },
        "datePublished": "2020-06-19T03:11:57.000Z",
        "description": "Chocolate lined ramekins filled with absolutely sinful creme brulee. Top with fresh berries when in season.  Perfect for that special dinner, but easy enough to make everyday!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT6H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ cup semi-sweet chocolate chips",
            "2 cups heavy cream",
            "¼ cup white sugar",
            "1 pinch salt",
            "2 teaspoons vanilla extract",
            "5 egg yolks",
            "4 tablespoons white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place about 2 tablespoons of the chocolate chips into each of four 6 ounce ramekins. Place them in the microwave, and heat on full power for 30 second intervals. Stir, and continue heating until chocolate has melted. Spread to cover the sides and bottom of each ramekin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a saucepan, whisk together the cream, 1/4 cup sugar, and salt. Set over medium heat, and warm until steam rises from the surface. Then in a separate bowl, whisk together the egg yolks and vanilla. When the cream is hot, ladle a little bit into the egg yolks while whisking quickly. Ladle in a bit more to bring the yolks up to a high temperature without scrambling them. Whisk the yolk mixture into the rest of the cream. Ladle into the chocolate lined ramekins.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a towel in the bottom of a baking dish, and place the filled ramekins on top of the towel. Place in the oven, and pour boiling water carefully into the baking dish until it comes half way up the sides of the ramekins. Cover the dish loosely with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 to 40 minutes in the preheated oven, just until the custard is set. Remove ramekins from the dish, and refrigerate for 4 to 6 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Before serving, sprinkle 1 tablespoon of sugar over the top of each creme brulee. Use a kitchen torch or your oven's broiler to caramelize the sugar. It may take 2 to 3 minutes in the broiler. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Custards and Puddings",
            "Creme Brulee Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "caligrrl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.597222222222222,
            "ratingCount": 72,
            "itemReviewed": "Cali's Sinful Creme Brulee",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "679.9 calories",
            "carbohydrateContent": "42.6 g",
            "cholesterolContent": "419.1 mg",
            "fatContent": "55.8 g",
            "fiberContent": "1.2 g",
            "proteinContent": "6.6 g",
            "saturatedFatContent": "33.1 g",
            "servingSize": null,
            "sodiumContent": "57.7 mg",
            "sugarContent": "36.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-18T17:25:26.533Z",
                "reviewBody": "This was my first time making creme brulee, and it turned out great!  Couple things I did.  I heated the cream/sugar/salt over a double boiler until hot, but not boiling.  I tempered the eggs as stated in the recipe  before adding them to the cream mixture.  Once I added the egg mixture, I heated again until hot, but not boiling - then strained into a bowl with a pour spout.  I used the water bath as suggested, but did not cover them with the foil.  I baked for about 45 minutes, as my ramekins were not the short, wide ones - but the narrower, taller ones (I got 5 out of this recipe).  I cooled them for about 10 minutes before refrigerating them. I also brought them to room temp (about 40 minutes) before carmelizing the  top.  I used the broiler, but I think I will invest in a kitchen torch for the next time, as it made the mixture too hot, and I didn't have time to cool them again before serving.  The taste was WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim's Cooking Now",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kimscookingnow/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-26T01:06:38.937Z",
                "reviewBody": "Yummmmm.  We made the recipe as-is, and caramelized the sugar in the oven.  We thought the creme brulee tasted great (with the vanilla as-is).  The chocolate was melty, not hard as a rock for us.  Although I'm sure it was hard as a rock after chilling in the fridge, putting it in the oven to caramelize the sugar melted it.  The amount of sugar in the recipe was too much for our ramekins, ours did not have that much surface area.  I would recommend only using enough sugar to just coat the top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/943395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-16T13:13:27.233Z",
                "reviewBody": "I made this recipe the other day and it turned out great! Definitely a keeper. Following the advice of others I only sprinkled enough sugar just to coat the top of each ramekin. I also mixed a teaspoon of milk into the melted chocolate in each ramekin to prevent the chocolate from getting too hard in the refrigerator.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DessertDave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2483204/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-26T19:53:14.49Z",
                "reviewBody": "WOW so good! I've made this at least 5 times now and every time it gets gobbled up even if I botch it somehow I almost scrambled the eggs once and another time I spilled water into it when filling up the water bath and it still got eaten! One thing I always do is double the recipe you will need to do this if you're serving more than 3 people. I also add a couple of tablespoons of milk to the chocolate so it will spread easier then I stick it in the freezer until the creme brulee is ready. I find adding one extra egg yolk (to the doubled recipe) gives extra flavor. Make the creme brulee one day before but caramelize/torch the sugar just before you serve it. It's really good when it's just below room temp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Meatless Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2935282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T23:28:58.78Z",
                "reviewBody": "This was great but a few suggestions: 1. I followed the other's suggestions and halfed the vanilla 2. The chocolate was great but hard as a rock. I may try melting it in to the cream to make it a chocolate dessert 3. Half the amount of sugar on top. It was way too thick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCOOGY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/994644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-18T06:22:20.36Z",
                "reviewBody": "1 complaint: doesn't make enough! EXCELLENT!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Luvs2Cook!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-19T17:02:10.127Z",
                "reviewBody": "Very good - I loved the twist the chocolate added. Simple but decadent! The vanilla was a bit too much however. Next time I'll use my own favorite creme brulee recipe and just coat the dishes with melted chocolate. Also I used whole milk (lactaid) with pretty good results - two of them set up well and the other two were a little loose but still tasted good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Noeller67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/noeller67/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-28T09:25:15.273Z",
                "reviewBody": "Fun to make BUT it I did everything exactly as said and it turned out to be a liquidly soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "??NAME??",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8129900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-31T18:04:49.663Z",
                "reviewBody": "I love this recipe! I've made it several times, and heard nothing but rave reviews when I serve it. It's best served right after the 4-6 hours of chilling, otherwise the chocolate becomes too hard. But you can also add a little milk to the chocolate to help keep it softer. Instead of white sugar, I use raw sugar, ground powdery fine using a food processor or blender, and only use enough sugar to nicely coat the entire top. Then use a kitchen torch in quick, circular or back-and-forth motions, moving to a different area as the sugar starts to melt  to keep from burning it. Depending on the group I'm serving, the process of caramelizing can also be part of the entertainment for the evening! I've tried some other recipes, but this one is my favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nodda Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6503858/"
                }
            }
        ]
    }
]