[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/84289/resurrection-rolls/",
        "name": "Resurrection Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F03%2F31%2Fresurrection-roll.jpg",
            "width": 1244,
            "height": 1244,
            "caption": "Resurrection roll"
        },
        "datePublished": "2020-06-19T03:11:58.000Z",
        "description": "A great Easter recipe to do with the kids!  Rolls with marshmallows wrapped inside, which become hollow as they bake, it represents the tomb of Jesus on Easter morning, when you break them open they are empty inside!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "8 rolls",
        "recipeIngredient": [
            "1 (10 ounce) can refrigerated crescent dinner rolls ",
            "8 large marshmallows",
            "¼ cup melted butter",
            "2 tablespoons ground cinnamon",
            "2 tablespoons white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate crescent rolls into individual triangles.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together cinnamon and sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip a marshmallow into melted butter, then roll in sugar mixture. Place marshmallow into the center of a dough triangle. Carefully wrap the dough around the marshmallow. Pinch the seams together tightly to seal in marshmallow as it melts. Place on a baking sheet. Repeat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated oven until golden brown, about 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mommyof3"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3125,
            "ratingCount": 96,
            "itemReviewed": "Resurrection Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "227.6 calories",
            "carbohydrateContent": "24.1 g",
            "cholesterolContent": "15.3 mg",
            "fatContent": "13.3 g",
            "fiberContent": "0.9 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "321.8 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-25T14:15:37.86Z",
                "reviewBody": "I found this recipe years ago and have been making them with my nieces, and then with my own kids every Easter ever since.  A big family favorite.  The kids always look forward to making them together just before the rest of the meal is ready.  As we do, we talk about taking sinless Jesus (marshmallow), anointing Him in oils (butter) and incense (cinnamon), wrapping Him in the shroud (crescent roll), and then placing Him in the tomb (oven). We always make at least two batches and they go fast.  It's so fun to see everyone open their \"empty tombs\" at the table.  \n\nMy advice: 1. don't skimp on the crescent rolls -- use the name brand.  They really do hold up better; 2. Keep the crescents refrigerated till needed; 3.  Bake at 350 for 10-12 minutes; 4.  Don't worry about the leakage - they're just as good messy! Just use a stoneware baker with shallow sides or a jelly roll pan with a parchment paper liner; 5. When you serve, don't use napkins or doilies -- they can be very sticky.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KarenCooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/767761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-18T18:10:20.03Z",
                "reviewBody": "Wow, thanks for a wonderful idea!  I had no spills of the marshmallow -- only delicious, empty tombs!  I dipped the marshmallows in butter, then rolled them in cinnamon-sugar.  After rolling each marshmallow in one triangle, I rolled another triangle around it in the opposite direction.  I crimped all edges, then rolled the entire thing in butter and then in the cinnamon-sugar.  I baked them @ 375 for about 20 minutes; when I took them out of the oven, they smelled heavenly!  There were absolutely no holes or leaks or any sign of the marshmallows on the outside, so it was just as much of a treat for me to break open the tomb to find it empty.  My kids were in awe as they realized the lesson in what we had done -- that which our Savior has done for all of us!  Thanks for a new & wonderful tradition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandy Lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1541853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-26T18:01:37.167Z",
                "reviewBody": "I made these years ago and jumped on AllRecipes to find a good recipe to do them again.  This one is perfect, except for one thing:  400 degrees for fifteen minutes charred mine!  I made a second batch at 375 degrees for 10 minutes, and they were perfect.  \n\nFurther, the whole of the Resurrection symbolism wasn't shared!  Jesus is the marshmallow, and He is anointed with oil (butter) and spices (the cinnamon and sugar) before he is wrapped in expensive cloth (dough) and placed in the tomb (oven).  Our our year old caught the whole of the Easter story through this symbolism.  It's quite clever.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "waterwater",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3036694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-18T00:39:58.84Z",
                "reviewBody": "Having read that other reviewers had difficulty with the marshmallow leaking out, I pinched and sealed mine so that NOTHING could get through the dough.  Wrong!  Some marshmallow seeped out of every one of them, some more than others.  (It's not really a problem since you want the inside to be hollow anyway.  When I make them again for Easter, I will take the advice of some of the other reviewers and use two pieces of crescent roll for each.  The dough actually isn't very thick with one, so I don't think it would be too much.  I will also leave out the sugar and just roll the marshmallows in butter then cinnamon.  The marshmallows alone would make the rolls sweet enough.  Good recipe, and a fun thing to try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mallinda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/206971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-13T01:48:14.177Z",
                "reviewBody": "I am so glad that I tried these before Easter Sunday morning. This batch was a flop for me....and I cooked them exactly like the recipe called for. My \"tombs\" collapsed! I am going to try them again, and take a previous reviewer's advice by wrapping them with 2 triangles. I sealed mine up really good, but the marshmallows still oozed out. I would recommend cutting back the temperature (maybe to 375) and the time to 10-12 minutes. They were a little well done. I would definitely recommend a trial time if you are planning on using these for Easter Sunday morning!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MOONPIE67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-13T15:22:23.867Z",
                "reviewBody": "These are always good! Even my husband who does not like marshmallows will eat them. After making several times I've found that the best way to contain the marshmallow ooze is to cook them in greased muffin tins instead of a baking sheet. Blessings! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "INSPIRINGOTHERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/380554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-22T21:44:42.17Z",
                "reviewBody": "Delicious! I didn't close some of the rolls all the way but it just made a little enterance to the cave. Topped with \"glory icing\" (confectioner's sugar melted butter and milk) and they were fantastic. Anyone who liked this recipe may want to try making \"Baby Jesus Rolls\" by pinching off the pointy end of a crescent roll triangle and forming a ball roll the rest of the dough like one would normally and stick the ball on the end. When baked it will look like a baby Jesus in swaddling clothes! Thanks for a great Easter recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "twicethesugar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1630594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-29T23:14:58.5Z",
                "reviewBody": "Delish!!  We used toothpicks to help roll the marshmallows which my kids related to the nails on the cross (pretty smart!) and I threw them in muffin tins seam side up with very little seepage.  These are so yummy you will want to make them all year long!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MayberryGal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3140095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-03T15:33:59.737Z",
                "reviewBody": "I loved the story behind these rolls and had the opportunity to share it with my kids friends recently (even though it was after Easter). I read most of the reviews and really tried to figure out how NOT to let them leak. First I tried by rolling each triangle a little thinner before rolling around the marshmellow. Next I tried the \"seal with a fork\" technique to close the edges of the dough. Last step was to apply a small dab onto the seams to try and seal them even more. Of course it didn't work!! Maybe they are suppose to ooze out onto the pan! I did line the pan to prevent a big mess. The end result was a sweet tasting crescent! Kids loved them and wanted me to make more. Next time I will try them with mini marshmallows to see if they are easier to roll and seal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GodivaGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2567051/"
                }
            }
        ]
    }
]