[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17306/soups-stews-and-chili/soup/vegetable-soup/kale-soup/",
                    "name": "Kale Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222726/roasted-vegetable-and-kale-soup/",
        "name": "Roasted Vegetable and Kale Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1307886.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:49:47.000Z",
        "description": "Roasted vegetables, pureed and cooked with broth, kale, and a nice mix of Italian sausages make up this hearty soup. This soup brings out the rich flavors of kale and leaves out its typical bitterness. This soup is a winter staple in our family.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil, divided",
            "3 carrots, peeled and quartered lengthwise",
            "2 large tomatoes, quartered",
            "1 large onion, cut into 8 wedges",
            "½ small butternut squash - peeled, seeded, and cut lengthwise into 1/2-inch thick wedges",
            "1 Yukon Gold potatoes",
            "6 cloves garlic, unpeeled",
            "salt and ground black pepper to taste",
            "4 (4 ounce) links sweet Italian sausage, casings removed",
            "2 (4 ounce) links hot Italian sausage, casings removed",
            "6 ¼ cups vegetable broth, or more if needed",
            "4 cups finely chopped kale leaves",
            "3 sprigs thyme",
            "1 bay leaf",
            "1 (15 ounce) can garbanzo beans, rinsed and drained",
            "1 (15 ounce) can kidney beans, rinsed and drained"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Brush a jelly roll pan with a thin coat of olive oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange carrots, tomatoes, onion, squash, potatoes, and garlic on the prepared pan. Drizzle remaining olive oil over the vegetables; season with salt and pepper. Turn the vegetables with a spoon to help coat evenly with the oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in preheated oven until browned and tender, turning occasionally, 20 to 30 minutes. Set vegetables aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the vegetables roast, place a large skillet over medium heat. Crumble sweet Italian sausage and hot Italian sausage into the skillet. Pour 1/4 cup vegetable broth over the sausage. Cook, breaking the sausage apart with a spoon as it cooks, until the sausage is cooked through and no longer pink, 7 to 9 minutes. Transfer sausage to a paper towel-lined plate to drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut squash and carrots into 1/2-inch pieces; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Peel garlic cloves; place in a blender with roasted tomatoes and onion and blend until smooth. Pour the mixture into a large pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1/2 cup broth onto the jelly roll pan. Scrape any browned bits from the surface of the pan with a wooden spoon or spatula; pour broth and browned bits into the pot with the blended tomato mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour remaining vegetable broth into the pot. Add kale, thyme, and bay leaf to the mixture; bring to a boil. Reduce heat to medium-low and simmer until the kale is tender, about 30 minutes. Add sausage, carrots, potatoes, squash, garbanzo beans, and kidney beans to the soup; continue cooking until hot, about 10 minutes. Thin the soup with more vegetable broth as desired. Season with salt and black pepper. Discard thyme sprigs and bay leaf to serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Kale Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Betsy B"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.75,
            "ratingCount": 88,
            "itemReviewed": "Roasted Vegetable and Kale Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "563.9 calories",
            "carbohydrateContent": "56.2 g",
            "cholesterolContent": "49.7 mg",
            "fatContent": "27.3 g",
            "fiberContent": "12.6 g",
            "proteinContent": "26.3 g",
            "saturatedFatContent": "8.1 g",
            "servingSize": null,
            "sodiumContent": "1686.5 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-11-04T00:20:23.62Z",
                "reviewBody": "I had to do some adapting based on what I had, but this is a great base recipe.  With more veggies, I don't think you need the sausage. It would make a great vegetarian soup. My adaptations, if you care, were: I used canned diced tomatoes as the base for the puree.  I roasted garlic, red and yellow peppers, sweet potatoes, broccoli, and carrots.  I had no onion to roast, so I used onion flakes when cooking the sausage.  I added some of the roasted vegetables along with the garlic to the tomatoes to puree.  I only had sweet Italian sausage, so I added about 1/4 teaspoon of red pepper flakes, and about 1/4 teaspoon of cayenne pepper to give it some spice (not needed, but I like spicy). Then I did the whole thing in the crock pot.  about an hour on low to soften the kale, and then about 2 hours on high once you add the veggies.  Add water, salt & pepper as needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ty Furman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7829180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-21T05:07:10.507Z",
                "reviewBody": "I tried this recipe and loved it. I got kale in my veggie co-op and didn't know what it was. I also got butternut squash and potatoes so this recipe was perfect. I only had Jimmy Dean breakfast sausage so I used it. It tastes great in there! I didn't have the right seasonings so I liberally applied Italian seasoning and crushed red pepper. I also used chicken broth instead of vegetable broth because it was all I had available. The mix of the beans squash meat potato broth and chickpeas is really good. And the kale... I like it! I never knew it until now. I will be adding this recipe to my list of things to make on a regular basis!! (Even if I don't get kale in my co-op box again!) NOTE: The picture does not do justice to this recipe! Mine is BEAUTIFUL with all the bright colors in it. I'll try to take a picture!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tallen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10786026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-17T04:39:53.763Z",
                "reviewBody": "Of course I changed the recipe a bit. Less evoo, no beans or chick peas (forgot to buy them) but it was AAmaZing!!!  Try it!!! Super healthy. \nMy editions are: peal the skin off the butternut squash before cooking and do not include the stems in the kale. Trim the leaves off first. Great recipe. Easy. I feed 30 people at my house once a month and this is my favorite recipe so far!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "autumnchick84",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5086674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-27T03:52:53.82Z",
                "reviewBody": "Oh, this was so good. My whole family loved it. I followed the recipe exactly except I used homemade chicken broth instead of vegetable as I didn't have any, but other than that I stayed true to it as written. I have to say this makes a lot of soup though - I'd say 8-10 servings rather than six as it is very filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3628370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-11T11:20:38.067Z",
                "reviewBody": "Good recipe. An earthier more hearty take on minestrone. Next time I may go with a different type of sausage just to tweak it but I will definitely keep in the recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "song",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8545327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-28T22:03:27.667Z",
                "reviewBody": "This is a DELICIOUS recipe! I've gotten rave reviews from everyone who has tried it. I did substitute canellini beans for the garbanzoes (my husband doesn't like garbanzoes) Jimmy Dean breakfast sausage for the Italian sausages and a sweet potato for the Yukon gold. Do be aware that the 1-1/2 hour time is WAY low. I don't think I'm THAT slow. Maybe that time would be right with a hubby or someone helping with cutting and peeling but if you're doing it by yourself be prepared for it to take closer to 3 hours from start to finish. But if you have the time it's well worth the trouble!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Creager Cash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8777793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-12T02:43:26.46Z",
                "reviewBody": "I really loved this recipe. I omitted the sausage and made a fabulous vegetable soup. I added turnips and used cannelini beans instead of kidney. Delicious! I would definitely chunk and roast my root veggies beforehand for a softer texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "myohmeah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2822010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-02T21:57:51.013Z",
                "reviewBody": "Wow this soup is delicious. The roasted veggies and pan drippings add so much flavor. I included the kidney bean liquid in the soup. I substituted a can of white beans in tomato sauce (including the sauce) for the garbanzo beans which I did not have on hand. My whole family really liked this soup. Definitely a keeper recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle J.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4296086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-24T00:34:13.743Z",
                "reviewBody": "I made this without the meat and it was still really good. The broth with the baked bits and puree makes the soup. I'm sure it's even better with the sausage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2985825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-31T22:57:59.743Z",
                "reviewBody": "Although my husband loved this recipe I did not care as much for it. The potatoes should not be roasted with the other veggies as the other veggies take longer to soften and the potatoes are left to mush. I never use Kale and did not realize you have to clean it first. The garlic is another ingredient that should not be roasted. I would make this again with the changes I now know but for others may not as the recipe was made with too many unnecessary steps...but I am a soup person and am always looking for another good healthy soup recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kstoner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6644053/"
                }
            }
        ]
    }
]