[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/84405/choereg-armenian-easter-bread/",
        "name": "Choereg (Armenian Easter Bread)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2171835.jpg",
            "width": 2457,
            "height": 2457
        },
        "datePublished": "2020-06-19T03:11:59.000Z",
        "description": "Ok...so my mother would just kill me if she knew I made our family recipe for Choereg public.  But my policy is 'why keep a good thing to myself'. Choereg is a traditional, slightly sweet bread, especially made for Easter.  It is delicious for breakfast with a nice cup of coffee. It takes some level of skill, but anyone used to handling yeast should not have a problem.  You can find Mahleb at Middle Eastern grocery stores, especially around Easter. It will be with the spices.  Please do not omit it, as this is what gives it its distinctive flavour and aroma.",
        "prepTime": "P0DT6H0M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT6H25M",
        "recipeYield": "5 loaves",
        "recipeIngredient": [
            "1 cup whole milk",
            "1 cup unsalted butter",
            "1 cup margarine",
            "1 cup white sugar",
            "½ cup lukewarm water",
            "2 teaspoons white sugar",
            "2 (.25 ounce) envelopes active dry yeast",
            "5 eggs",
            "6 cups all-purpose flour, or as needed",
            "1 ½ teaspoons baking powder",
            "1 ½ tablespoons ground mahleb",
            "1 ½ teaspoons salt",
            "1 egg, beaten",
            "1 tablespoon sesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium heat, combine the milk, butter and margarine. Heat until butter and margarine are melted, but do not let it boil. Stir in 1 cup of sugar until dissolved, then set aside to cool to lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a small bowl, dissolve 2 teaspoons of sugar in warm water. Sprinkle the yeast over the surface, and let stand until frothy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crack the eggs into a large bowl, and stir a little to break up the yolks. Slowly pour in the heated milk mixture while whisking constantly, so as to temper the eggs and not cook them. Add the yeast mixture, and stir just until blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the flour, baking powder, mahleb, and salt. Make a well in the center, and pour in the wet mixture. Stir until it forms a sticky dough. Pour onto a floured surface, and knead in additional flour as needed to make a more substantial dough. Knead for about 10 minutes. Place in an oiled bowl, and set in a warm place to rise for about 2 hours, or until doubled in size.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the dough has doubled, punch down again, and let rise until doubled. It will only take about half as long this time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate the dough into 5 even portions, then separate each of those into thirds. Roll each of those into ropes about 12 inches long. Braid sets of three ropes together, pinching the ends to seal, and tucking them under for a better presentation. Place the loaves onto baking sheets lined with parchment paper. Loaves should be spaced 4 inches apart. Set in a warm place to rise until your finger leaves an impression behind when you poke the loaf gently.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Brush the loaves with beaten egg, and sprinkle with sesame seeds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 minutes in the preheated oven, or until nicely golden brown all over.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ani"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.780821917808219,
            "ratingCount": 73,
            "itemReviewed": "Choereg (Armenian Easter Bread)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "248 calories",
            "carbohydrateContent": "26.8 g",
            "cholesterolContent": "54.3 mg",
            "fatContent": "13.8 g",
            "fiberContent": "0.8 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "229.6 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-08T23:21:35.71Z",
                "reviewBody": "Ani, God Bless you for sharing this coveted recipe!  I lost my grandmother's recipe for choereg :(\nNo doubt I was thrilled to find this, which turned out as good as I remember grandma's.  I had to use about 8 cups of flour for this recipe, and instead of the butter/margarine combo, I used all butter and the result was superb!  Thanks again for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-16T22:27:33.007Z",
                "reviewBody": "This recipe was wonderful and easy to follow. I used all butter instead of half butter and half margarine. My husband requested I make this as his grandmother is Armenian and many of his Aunts make it in smaller loaves than this recipe calls for to hold their boiled eggs in on the Easter table. As he requested it a bit late I did an online search and found this. My husband said it tasted just like he remembered. As the recipe says DO NOT omit the Mahleb! It may be hard to find but it does make the recipe perfect. Also using the same braiding technique mentioned on smaller sections of dough and connecting the ends to form a small circle produces a lovely \"egg cup.\" when you do this the same cooking time applies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Rudd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2009920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-12T22:03:54.17Z",
                "reviewBody": "Thank you bunches for sharing your mother's recipe. I'm sure she won't be upset once she learns that it has received so many stars; ) WHERE TO PURCHASE MAHLEB: you can purchase it on-line by going to The Spice House. (Ani is registered with them.) TIPS by D McM from Toronto: Use mahleb in similar quantity to how you use nutmeg in any bread or pastry recipe. Mahleb does wonders when added to the dough of shortbread pound cake pie crusts and waffles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYBERGIFTS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/568083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-22T21:34:55.843Z",
                "reviewBody": "You can replace the mahleb with 2 tbsp. freshly ground orange peel and decorate the top after brushing with egg with whole almonds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tsaneto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5681417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-16T22:44:24.077Z",
                "reviewBody": "Ani's mother would probabably kill her for divulging the formula... my grandmother never wrote them out! This is a great recipe. Only problem was the dough was too soupy I had to add about 1 to 2 cups of flour (to the halved recipe) Norm Grandparents were the Azadians Syracuse NY",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Norman L Jones Sr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1620226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-12T17:40:40.89Z",
                "reviewBody": "Added about 2 extra cups of flour otherwise perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1116283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-11T19:52:52.4Z",
                "reviewBody": "I have not made this particular recipe.  However, I spent an entire weekend trying to duplicate my grandmother's recipe which of course was not written down.  I found several recipes...this one being close if not dead on to the base recipe that I used. (Some from the internet, one from the St. James Armenian Church recipe book (Richmond, VA).\n\nAfter a couple of close encounters, I remembered that my grandmother used evaporated milk.  When I substituted evaporated milk for whole milk, it tasted identical to my grandmother's.\n\nMy grandmother would put M&M's, colored sugar, and gummy candies on top of the bread (likely for us!).  We loved the way that it smelled in the kitchen.  She made it at Christmas as well as Easter.  \n\nOh, how I miss her cooking--both the smell and taste of it!  These also make WONDERFUL dinner rolls that your guests will love.  So, don't relegate them to the holidays!\n\nThanks you for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leisa D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1708626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-20T00:05:46.98Z",
                "reviewBody": "Being of Armenian descent I've had my fair share of Choereg, and I must say, this is truly a wonderful recipe.  My mother too would kill me because she gave me her recipe last year (which I lost and couldn't bring myself to tell her) so I found this one, I tried it and EVERYONE was so pleased with the outcome, including my mother who thought it was her recipe! Oh well, at the end of the day it's about yummy food right?! This will just have to be my little secret.  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dancerjax",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6210309/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-17T16:50:14.96Z",
                "reviewBody": "I've had my eye on this recipe for a couple of years now, and finally got around to making it. The flavor is great—I'd never baked with mahleb before. I didn't like working with the dough, though. I found it to be greasy and sticky, almost like braiding cookie dough. I think that the next time I make this recipe (and I do plan to make it again) I'll try bread flour instead of all-purpose and use the method for mixing brioche: letting the dough mix and the gluten structure form before adding room temperature butter, a tablespoon or so at a time, until fully incorporated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-24T23:32:20.843Z",
                "reviewBody": "When it comes to baking my cooking skills drop considerably so I may have done something wrong. I had to add almost 3 cups of flour because the dough was not a dough but the consistency of thin oatmeal you would have for breakfast. It was about right then but of course it was a little heavy then. I have not tasted it yet but I bet it will taste ok but it will not be lite and/or fluffy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Steve Delano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3797881/"
                }
            }
        ]
    }
]