[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/223234/macaron-french-macaroon/",
        "name": "Macaron (French Macaroon)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5575276.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2020-06-19T03:50:10.000Z",
        "description": "This is the quintessential macaron (NOT macaroon) recipe. I am a baker's apprentice, and after much trial and error, we (the baker and I) finally perfected the technique. We decided to share with you all. Pipe your choice of filling on a cookie and sandwich another cookie on top. These are like cloud cookie sandwiches and are delicious if done correctly.  If you want to do it the super-easy way, just fill with your favorite flavor of frosting. Enjoy!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "16 macarons",
        "recipeIngredient": [
            "3 egg whites",
            "¼ cup white sugar",
            "1 ⅔ cups confectioners' sugar",
            "1 cup finely ground almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with a silicone baking mat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg whites in the bowl of a stand mixer fitted with a whisk attachment until whites are foamy; beat in white sugar and continue beating until egg whites are glossy, fluffy, and hold soft peaks. Sift confectioners' sugar and ground almonds in a separate bowl and quickly fold the almond mixture into the egg whites, about 30 strokes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon a small amount of batter into a plastic bag with a small corner cut off and pipe a test disk of batter, about 1 1/2 inches in diameter, onto prepared baking sheet. If the disk of batter holds a peak instead of flattening immediately, gently fold the batter a few more times and retest.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When batter is mixed enough to flatten immediately into an even disk, spoon into a pastry bag fitted with a plain round tip. Pipe the batter onto the baking sheet in rounds, leaving space between the disks. Let the piped cookies stand out at room temperature until they form a hard skin on top, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 285 degrees F (140 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cookies until set but not browned, about 10 minutes; let cookies cool completely before filling.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Liz"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.135416666666667,
            "ratingCount": 384,
            "itemReviewed": "Macaron (French Macaroon)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "189.5 calories",
            "carbohydrateContent": "36.4 g",
            "cholesterolContent": null,
            "fatContent": "2.6 g",
            "fiberContent": null,
            "proteinContent": "6.9 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "22 mg",
            "sugarContent": "31.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-22T14:48:16.5Z",
                "reviewBody": "I am the original submitter of this recipe, so here are some tips to follow, since All Recipes changes the recipe a bit when they approve it.  \n\n1.) You have to measure the ingredients by weight.  They've put the weights in the footnotes.  If you measure out, say, three egg whites instead of 50g of egg whites, you might be off enough to mess up the cookie, and it won't puff up correctly (or at all).\n\n2.) YES YOU DO HAVE TO SIFT THE INGREDIENTS!  I'm so lazy.  I've tried to do it without sifting.  It never works out, trust me.  Sift that powdered sugar and almond powder together.  You won't regret it.\n\n2.) The \"silicone baking mat\" in step one was originally a Silpat.  I have tried making these on every surface known to man, including my cookie favorite, parchment paper.  You need the Silpat or you won't be able to get the cookies off the sheet.\n\n3.) People debate on whether it's necessary to let them set for an hour before baking.  We tried setting them from 1 to 240 minutes.  One hour is perfect.\n\n4.) It is possible to mix it too much, and the cookie won't puff up when baked.  Use as few strokes as possible when folding the almond into the egg whites.\n\n5.) I highly recommend finding already-ground almonds, rather than grinding them yourself.  It was our experience that grinding our own almonds resulted in an inferior cookie.  They have to be ground to a very fine powder, and it's nearly impossible to do with regular kitchen equipment.\n\nGood luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3016981/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-20T23:12:55.13Z",
                "reviewBody": "This is a perfect recipe for Macarons; I have made them several times and each time i get perfect round mounds with no cracks and cute little \"feet\". I have, however, made a slight adjustment on the sugar level and have also been able to add flavorings to make different varieties. \n\nWeighing the ingredients is key. Ive found that you MUST weigh the almond flour & powdered sugar. Its not, however, that crucial to weigh the egg whites (i never have. my thought process was, umm if i'm short 3-4 grams am i reaaally gonna try and get 3 grams from another egg? Meh!) 3 egg whites will do the trick :)\n\nIt is also not crucial to add a total of 50 grams of regular sugar to the eggs while youre beating them. This is where I have tested many different weights, and for me and my friends/family, 35 GRAMS is PLENTY sweet enough. Seriously! it already has 200 g powdered sugar! By decreasing the amount of sugar to 35 g only, the almond flavor shines a LOT brighter. Trust me.\n\nTo make chocolate macaroons: sift in one tablespoon of cocoa powder into the almond flour & p. sugar. Easy peasy. Stir in a small amount of Brown Gel food coloring into the egg whites.\n\nTo make coffee macaroons (my fav!): sift one teaspoon of instant espresso powder (you know, the one with the green cap!) into the almond flour & p. sugar. Brown food coloring into the egg whites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "heatherthaung",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12235851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-22T21:51:31.343Z",
                "reviewBody": "Thank you for this recipe! Have never tried a macaron but have recently been obsessed with trying them. Of course, there's nowhere to buy them within a hundred miles and I hate risking buying food online. So I tried this out. For my first try, I think I did really good, considering how hard people always say it is to get them right. Tasted good, had little feet, just didn't puff up all the way (too much liquid in mine, I think-- because i never fully follow directions). The only problem was a technical one. I didn't have a non-stick base (had JUST run out of parchment paper) so 90% of them stuck and lost their bottoms too much to ignore. It wasn't a bad thing though, because my spouse ate them all anyway. He actually didn't like the ones I filled, just the plain ones. ^-^'  Will definitely do this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2411996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-02T20:02:12.33Z",
                "reviewBody": "The ingredients overall worked, but baking them was a complete flop the first time around.  They came out perfectly the second time.  What I did differently the second time.  \nPiping:  I used a real pastry bag.  I tried to shortcut it the first time and it was a sloppy mess.  I also rubber-banded of the end of the bag so the batter wouldn't leak out and cut it right before piping.  I made a template on a piece of parchment paper with circles as a guide for piping so they are more uniform in size. Template was taped to the table and I placed other sheets of parchment on top of template to pipe.  On round one, I noticed the macarons I piped toward the end of the sheet were more loose, so on round two I took a break and iced my hand so that the heat from my hand wasn't loosening up the batter.  \nBaking:  preheat oven to 375.  Before putting sheet in, reduce heat to 325.  Bake 5 min.  Rotate tray.  bake 5 min.  Take sheet out and reheat oven to 375 for next sheet.  I found I could not bake more than one sheet at a time.  \nBaking sheets:  They did not get \"feet\" on any sheet other than an old, thin baking sheet.  My thermal sheets and baking stones did not work. \nAfter filling: let macarons sit for 24 before serving.  Something happens to them to soften the cookie ever so slightly that makes them just like the European macarons my friend was craving.  Serve within 48 hours or freeze.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DebJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2290215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-29T00:13:03.937Z",
                "reviewBody": "I went to french pastry school and have a recipe we used in school for macarons all the time but when I started trying to make them at home it was a total disaster so I've been looking for a good recipe for quite some time that works for home baking. I just made these and after trying sooo many different recipes and methods, finally I found one that worked!\n\nSome notes that helped me: \nI found that to get a really good foot but still have them not crack, to leave them out for 20 minutes on my pan after piping with my fan on them. Tried leaving them out for an hour with no fan before and I had a smaller foot and they cracked. \n\nHit your pan hard on the counter after piping them so any bubbles get out, they're smooth on top and they don't crack. \n\nI did medium peaks (not soft and not stiff) which seemed to work better because too soft of peaks makes it really hard not to overmix your batter when combining. Too stiff makes it really hard to not look chunky. \n\nIn school we were taught to age our egg whites and almond flour. I didn't and it worked fine. I would say that it is really important that the almond flour is dried out though. Humidity will effect the texture.\n\nYou absolutely have to sift the almond flour and confectionary sugar. I hate doing this, but it's necessary. Trust me I've tried to skip this step so many times and it never works. Also, be careful that your almond flour is very finely ground. Sometimes even the stuff you buy can get crumbly.\n\nHope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jswartz100",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3640364/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-29T14:31:12.013Z",
                "reviewBody": "These came out great!  This was my first attempt at macarons and I was afraid because I always hear how hard they are to make.  I can't believe I was able to do it on my first try!  I weighed the ingredients instead of measuring as the author of this recipe suggested: 100 grams egg whites 50 grams white sugar 200 grams confectioners' sugar 110 grams ground almonds.  I also did not have a silicone baking sheet so I lightly greased parchment paper and it worked great. I left them in the oven on 170 degrees for a long time (I think about an hour )because they were too moist in the middle still after the baking time.  They turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bctabby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8632557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-03T20:39:42.233Z",
                "reviewBody": "This is my third macaron recipe and FINALLY I got lift and feet and no cracks but ONLY after I bought a scale and weighed everything. Volume measurements didn't work for me at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CORINALAND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1036013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-22T00:43:33.643Z",
                "reviewBody": "I've made this twice and both times the macarons haven't baked. they come out of the oven soft and with an air pocket inside the shell. likely I've somehow over-mixed them but a the same time I'm not sure how to mix them any less without ending up with chunks of almond flour. Also, they don't seem to puff like other macarons- these ones are flatter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "dhansen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2934888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-29T18:13:47.07Z",
                "reviewBody": "I have made these now about half a dozen times and they come out a little better each time I try it.  I have a few suggestions to make them fool proof.  Start with room temperature eggs, add 1/4 tsp Cream of Tartar  when whipping the eggs, (it stabilizes the mixture). I used superfine sugar or Castor sugar to make the meringue smooth, and sifted the almond meal and powdered sugar through a sieve to get out the pieces of almond that were larger.  (A hand sifter cannot sift the meal properly.) When making slightly larger Macarons, add extra minutes to the time. I have even turned off the oven and cracked the door and left the cookies in the oven for 15 to 20 minutes to assure they come off the pan easily. I used a Silpat for some and parchment for others.  Both are good! Once you see the results?  you'll be hooked! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetserenade",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8712818/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Macaron (French Macaroon)",
            "description": "Watch how to make a perfectly round, crisp macaroon in this video.",
            "uploadDate": "2014-01-07T23:14:17.236Z",
            "duration": "PT3M2.182S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F4cfcc3dd-f791-4fbb-86b9-ca5a0dd40e74%2F306476e4-3e64-4ae8-b77b-371cdcf43a88%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3024725264001"
        }
    }
]