[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17532/desserts/fruit-desserts/blueberry-desserts/",
                    "name": "Blueberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/223399/best-blueberry-buckle/",
        "name": "Best Blueberry Buckle",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4544904.jpg",
            "width": 1704,
            "height": 1704
        },
        "datePublished": "2020-06-19T03:50:19.000Z",
        "description": "Blueberry buckle is one of the first things I learned to bake as a teenager. Always make this with fresh blueberries for best results! Enjoy!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "½ teaspoon salt",
            "¼ cup unsalted butter",
            "¾ cup white sugar",
            "1 large egg",
            "½ cup milk",
            "2 ½ cups fresh blueberries",
            "½ cup white sugar",
            "⅓ cup all-purpose flour",
            "½ teaspoon ground cinnamon",
            "¼ cup unsalted butter, softened"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Butter and flour a springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift 2 cups flour, baking powder, and salt into a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat 1/4 cup butter, 3/4 cup sugar, and egg with an electric mixer in a large bowl until smooth. Gradually add milk and beat until fluffy; stir in flour mixture, making a stiff batter. Gently fold in blueberries and spread batter into prepared springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 1/2 cup sugar, 1/3 cup flour, cinnamon, and 1/4 cup butter in a bowl until blended and crumbly in texture. Sprinkle on top of batter, then lightly press topping into batter using fingertips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until golden and a toothpick inserted in the middle comes out with moist crumbs, about 40 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Blueberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cristina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8441558441558445,
            "ratingCount": 154,
            "itemReviewed": "Best Blueberry Buckle",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "398.7 calories",
            "carbohydrateContent": "66.8 g",
            "cholesterolContent": "55 mg",
            "fatContent": "12.9 g",
            "fiberContent": "2.2 g",
            "proteinContent": "5.5 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "285 mg",
            "sugarContent": "36.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-18T14:23:53.997Z",
                "reviewBody": "This is one of those rare recipes that on its face are simple, yet yield elegant, tasty results. In other words, it’s a great recipe.\nLet me add some comments/observations. Don't be fooled by the batter! It is stiff as noted in the description. You may think you've done something wrong, but the relative lack of liquid in proportion to the dry ingredients makes it that way. Just put the dough in the center of the pan and spread to the sides with a large spatula or back of a spoon. The cooking time (40 minutes) is just right and yields a wonderful texture. \n\nLike most here, we \"tweak\" recipes. My only one I used was to substitute Turbinato for the granulated sugar in the topping. That was the only off recipe ingredient. It made a more crunchy top. \n\nAs for the results, it is a lovely cake. My wife, who was born and raised in the Canadian Maritimes where this is popular exclaimed \"...this is home.\" That makes any cooks day! Thanks Christina!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Skyhawk45",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9237975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-14T03:27:37.847Z",
                "reviewBody": "Followed the recipe exactly except added 1/2 tsp vanilla to the butter/sugar/egg/milk combination, but that is a \"given\" in baking at my house.  It was delicious!  Cake was a wonderful complement to the fresh blueberries.  Didn't take long and was easy to make.  Great with a glass of milk!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty in Plover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10545085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-11T20:08:04.187Z",
                "reviewBody": "This was definitely a 5-star recipe.  It didn't specify what size springform pan to use, so I used the 8\" and it came out perfect!  The cake itself isn't super duper sweet, so it goes well with the sweet and crunchy topping. AND, it's really good with ice cream or whipped cream! The only thing I did different was that I added 1 tsp vanilla, and 1/2 tsp Almond extract.  Almond goes perfectly with blueberries. And don't forget to flour the berries first! Thanks for the recipe.. it was DEElicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Cowan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1947046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-14T11:21:17.933Z",
                "reviewBody": "When it comes to coffee cakes, I am the pickiest person in the world.  I am all about the texture.   Many years ago, I tried a blueberry buckle that won grand prize at a 4-H Fair.   It was to die for!  Unfortunately, I never got the recipe.   I’ve tried many blueberry buckles and coffeecakes  over the years and all  disappointing.   It is with great pride when I say this recipe is a WINNER!  It’s dense, it’s moist, and it’s flavorful.  Perfect with a fresh cup of coffee.  The recipe did not state pan size, but it says 8 servings so  I used an 8” pan.  It took 10 – 15 min. longer to bake, but other factors may have contributed to that.  I didn’t want to make a special trip to the store for fresh blueberries, so  I used a 12oz package of partially thawed, frozen blueberries.  So much for the 8 servings.  Hubby and I completely devoured this a single day, scraping every single crumb from the pan.  Thank you ,Cristina, for sharing your amazing recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIZ&#9829;",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/diz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-05T14:01:37.853Z",
                "reviewBody": "I absolutely love this recipe! The only thing is there were more blueberries than flour??? I doubled the recipe and only used 3 cups of flour but people loved it just as much without all the blueberries. Thanks for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Love2Bake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7493685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-12T01:40:50.957Z",
                "reviewBody": "After picking 12 pounds of blueberries yesterday, I was looking for some new ways to use them and this crumble caught my eye!  I gave this recipe a try this afternoon and am very pleased with the results.  I followed the recipe almost exactly with the exception of adding one teaspoon of vanilla to the egg/butter/sugar/milk mixture.  I also added extra cinnamon to the crumble part and baked it for 45 minutes.  I don't own a springform pan, so I baked this in a bundt pan instead.  I inverted the bundt pan onto a wire cooling rack within minutes of pulling it out of the oven, let it cool for about 20 minutes, then inverted it onto a plate so the crunchy crumble would be on the top.  This recipe is a quick, easy, delicious keeper!  Thank you, Cristina!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MollyMBK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/829612/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-28T23:57:39.723Z",
                "reviewBody": "Rarely do I find a recipe that is perfect without a few modifications. Reading other reviews all I added was one teaspoon of vanilla extract. Otherwise the recipe was made exactly per the instructions. I baked this in a 9\" springform pan for 40 minutes and it came out perfect. The crumb is delicate. The blueberries plump and delicious contrasting with the crunchy streusel topping. It was gone before it was completely cool. Next time I make two! If you have been looking for a blueberry coffeecake recipe this is it. You won't find a better recipe. Thank you so much Cristina for a simple, quick recipe that family and guests will love. This recipe goes into both my summer and holiday line up.\n\nUpdate the second time I made this I substituted brown sugar for the granulated sugar in the topping. We liked it even better with the brown sugar streusel topping. While it's tasty cold it's even better when served warm and fresh from the oven (with a 10 minute rest/cool down period). If you plan to serve it to guests I encourage you to put the dry ingredients together the night before. I threw a towel over the sugar and butter in the mixer bowl, also had the butter in the streusel topping mix. Butter was room temperature the next morning so you can have this in the oven in under five minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TSandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8653517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-15T14:48:32.21Z",
                "reviewBody": "I struggled on the 3rd step of the recipe. I threw out the batter twice as I couldn't get it fluffy.I just couldn't figure out what was wrong? could it be i use low fat milk?? every time i added the milk gradually it curdles... The third try I still couldn't get it right but decided to just follow through the recipe. The dough was so thick and yes i thought this is so wrong BUT it turn out very nice!My whole family loved it.. And the baking smell that filled up the air in my whole kitchen was wonderful! Should have just gone through the 1st attempt. Definitely going to this again. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DemonicMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11923174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-04T15:32:06.23Z",
                "reviewBody": "My son brought over a blueberry buckle for Xmas. It was great and the first time I ever heard of it. So I searched here and found this recipe. I made it last night and before it was completely cooled it was gone! I used a bunt pan like one of the other reviewers because I don't own a spring-form pan. The ONLY other change to the recipe I made is using gluten free all purpose flour since as a family we are trying to eliminate gluten from our diet because my youngest is autistic. This was a big hit and it was rated by the family as better than the one from Xmas no one minded the gluten free. Gluten free has not always been a success but this recipe it was. It is a keeper! Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lwarner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lwarner/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-09-04T00:36:45.94Z",
                "reviewBody": "Made as directed. Very bland. Not sure what it's missing but it's not what I was expecting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Miranda Hoops",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2144796/"
                }
            }
        ]
    }
]