[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/223481/the-real-chicago-deep-dish-pizza-dough/",
        "name": "The Real Chicago Deep Dish Pizza Dough",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2233641.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2020-06-19T03:50:22.000Z",
        "description": "I have it on good authority  that this is the real deep dish pizza dough that's used in Chicago. The real thing is nothing like bread, or even pizza, dough. It is a buttery, flaky crust that is achieved by: 1) using corn oil (not butter) and 2) minimal mixing and kneading times. The pizza itself is built with cheese, toppings, and sauce, in that order. I suggest you use 6-in-1&reg; tomatoes which are far superior to other brands. Classico&reg; ground tomatoes are very similar. Contrary to popular opinion, cornmeal is not used in the dough by Chicago pizzerias.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT6H25M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 ¼ teaspoons active dry yeast",
            "1 ½ teaspoons white sugar",
            "1 ⅛ cups warm water - 110 to 115 degrees F (43 to 45 degrees C)",
            "3 cups all-purpose flour",
            "½ cup corn oil",
            "1 ½ teaspoons kosher salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast and sugar in warm water in a bowl. Let stand for 5 to 10 minutes until the yeast softens and begins to form a creamy foam.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine yeast mixture, flour, corn oil, and kosher salt in a large stand mixer with a hook attachment; knead until dough holds together but is still slightly sticky, about 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form dough into a ball and transfer to a buttered bowl, turning to coat. Cover bowl with a towel and allow dough to rise at room temperature until double in size, 6 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down dough and let rest for 10 to 15 minutes. Press dough into a 10-inch deep dish pizza pan.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "owensjo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5227272727272725,
            "ratingCount": 132,
            "itemReviewed": "The Real Chicago Deep Dish Pizza Dough",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "298.5 calories",
            "carbohydrateContent": "37 g",
            "cholesterolContent": null,
            "fatContent": "14.3 g",
            "fiberContent": "1.5 g",
            "proteinContent": "5.3 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "361.5 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-04T02:19:28.177Z",
                "reviewBody": "Alright, first reviewer!  I took the gamble on making this crust without any reviews to go off off, and i'm glad I took the chance.  Now let me share my experience to make the next guy or gal more confident about making this.\n\nFirst, I actually made two batches of this dough.  I made one exactly as is, for comparison, and I made another using the dough cycle on my bread machine.  I could not decipher any difference in the finished product either before or after baking comparing the dough prepared as indicated, and prepared in the bread machine.\n\nFor the bread machine crust, I put all the liquid ingredients (water and corn oil) in the machine, followed by all the solid ingredients.  I let my breadmaker run on the dough cycle, which is a 90 minute cycle.  I left the house after that and so the dough sat in the machine for about 5 hours after the cycle had finished... and when all was said and done the two dough balls worked the same.  SO, if you want to save some time/effort, feel free to use your bread machine.\n\nNow, on to the crust.  I can't stress enough the importance of flattening the crust, and then letting it rest for 10-15 minutes before trying to stretch it into the pan.  Otherwise, when you try to press the crust against the sides, it will fall back down toward the center.\n\nFinally, I pre-baked the crust for 10 minutes, added cheese, pepperoni and then the tomatoes, and then baked another 30 minutes.  The end result... soft and flavorful.  Pizzeria style for sure!\n\nA+",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jared Bachman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2344570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-20T23:26:59.583Z",
                "reviewBody": "Great dough. I actually left mine on the counter a lot longer than 6 hours - more like 14 hours. Dumped into an oiled cast iron skillet and topped as directed - cheese first, Parmesan and mozzarella then some left over double tomato bruschetta and some fresh orange bell peppers. 450 for about 23 minutes was all it took. Very nice. A great dough for busy working mom's and dad's who can make the dough in the morning and have dinner ready in a flash that evening. Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-16T15:40:21.597Z",
                "reviewBody": "Handsdown BEST pizza dough I've tried yet. I'm so glad I didnt go my normal route and find a recipe with a million reviews. I doubled the recipe when I made this and was able to make a calzone and two medium sized pizza's. I wasnt able to let it rise for 6 hours I only had 2 hours but it still turned out perfect! Thanks for the recipe owensjo my journey to find the perfect pizza dough has come to its end!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2715992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-11T22:05:30.203Z",
                "reviewBody": "This is a very good pizza dough recipe, however it is not authentic Chicago Style Deep Dish dough. At least not like Uno's or Lou Malnati's deep dish pizzas in Chicago. I lived in Chicago for 20 years and ordered from Lou's two or three times a month. Trust me, I know Chicago pizza. Chicago Style Deep Dish Pizza is vastly different from other pizzas, so much so that not even the dough is the same. This dough recipe is similar to other hand tossed recipes. Chicago Deep Dish crust is more similar to a buscuit than to bread. However, I agree that Chicago Sytle does not have corn meal in it, but I doubt if corn oil instead of olive oil could make that much of a difference. They're both vegatable oils. I did make this recipe and it is very good, especailly if you add some seasoning like garlic powder but it is not authentic Chicago Style. The Chicago Style Deep Dish Pizza is constructed in the order described, just not on this dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tom Ford",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-15T01:38:18.327Z",
                "reviewBody": "I wasn't sure if I wanted to make this since I usually stick to recipes with a lot of ratings/reviews. I am SO GLAD I did. I followed the recipe exactly made it last weekend and put it in a freezer ziplock and froze it without letting it rise first. Today (Friday night pizza night) I took it out this morning and put it in an oiled bowl with a towel over it on the counter. By the time I got home from work 12 hours later it was thawed risen and ready to go! I put it in a 12 inch springform pan (the only \"deep dish\" pan I have). I should've made two--it was SUPER thick--like 3 inches (I prebaked it 10 mins as suggested added toppings and baked for 20 mins more--perfect!)! Even with the super thickness my hubby said it's one of the top 5 pizzas he's ever eaten! Totally agree! This is amazing! One of the best cheap easy dinners I've made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jamiej",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9925848/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-05T20:26:01.79Z",
                "reviewBody": "This is great and my dough rose up like the Sear's Tower in Chicago. There is no way it took 6 hrs. I let mine go for 2 hours and that was enough. If I was feeding the Chicago Bear's after the game, this would be the recipe to use!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet Thurston",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6582644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-03T00:39:43.567Z",
                "reviewBody": "Phenomenal - and this is coming from a native Chicagoan!  Important note: you don't need a stand mixer!  I mixed it with a baking spatula until it formed enough to do some kneading in the bowl for about 90 seconds.  \n\nThe one thing I asked my wife to put on our registry list as a deep dish pizza pan.  I've always made the crust from the recipe that came with it, and it was as bland as it could be.  This has the texture and flavor that you want with a deep dish pizza.  Amazingly, the prep is FAR easier than what I used to make.  Out of necessity, I only let it rise for 2.5 hours and it still came out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannie's Beans",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12298973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-31T15:53:33.263Z",
                "reviewBody": "I know I changed a little bit in this recipe (oil type and how I made it rise) but I thought others might benefit from what I found out since there are only 2 other reviews. I really wanted to try this crust but I didn't have the 6 hours to wait so I put it in the oven with a pan of boiling water so it would double in size in the time I had (about 3 hours) and it did work. I am sure the slower 6 hour rise would only make a better crust but I did not have the time. I also used canola oil since that is all I had and using corn oil may improve it as well. I plan to try that next time.\n I didn't have a deep dish pizza pan so I used a pizza stone and a stone with edges so I had a little more of a deep dish and a more normal type crust (I doubled the recipe so I had enough for 2 pizzas). I pre-baked the crust. This made for a crust that was a little crispy on the bottom. If you want a softer crust I imagine you wouldn't want to pre-bake it. I did find that my cheese got really brown though so you might want to add the cheese a little later, especially if you are not pre-baking and want the cheese on top for a more traditional pizza. I added basil and garlic to our crust before baking. We enjoyed this crust and we will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancycs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3568723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-10T17:02:02.69Z",
                "reviewBody": "Wow did we love this crust! I made it in my bread machine and added granulated garlic parmesan and basil. The dough was very sticky but I added a bit more flour and let it rest for about a half hour. It was easy to press into a pizza pan. I prebaked the crust for about 10 minutes and then put pizza sauce sausage pepperoni bacon garlic and onions on it topped with mozzarella. It baked perfectly and the crust was very flaky. Definitely our new pizza crust. Thanks for the post!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Goodwin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10246929/"
                }
            }
        ]
    }
]