[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
                    "name": "Raspberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/223600/raspberry-cream-cheese-coffee-cake/",
        "name": "Raspberry Cream Cheese Coffee Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4465862.jpg",
            "width": 6016,
            "height": 4000
        },
        "datePublished": "2020-06-19T03:50:28.000Z",
        "description": "This is a wonderful alternative to those standard cinnamon-walnut-streusel coffee cake recipes. It's perfect for a brunch or a special family gathering. Prepping the batter in a food processor makes it quick and easy to assemble. You can substitute different preserves - apricot, cherry and blueberry all work well.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 ¼ cups all-purpose flour",
            "¾ cup white sugar",
            "¾ cup unsalted butter, cut into 1-inch pieces",
            "½ teaspoon baking soda",
            "½ teaspoon baking powder",
            "¼ teaspoon salt",
            "¾ cup sour cream",
            "1 teaspoon almond extract",
            "1 egg",
            "1 (8 ounce) package cream cheese, softened",
            "¼ cup white sugar",
            "1 egg",
            "½ cup raspberry preserves",
            "½ cup sliced almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch spring-form pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine flour, 3/4 cup sugar, and butter in a food processor; pulse until mixture resembles coarse crumbs. Remove 1 cup of mixture from food processor and set aside. To remaining mixture in processor add baking soda, baking powder, salt, sour cream, almond extract, and 1 egg; process until batter is just combined and smooth. Spread batter evenly into bottom and 2 inches up sides of prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cream cheese, 1/4 cup sugar, and 1 egg together in a bowl until smooth; pour into batter-lined pan and spread evenly. Spread raspberry preserves carefully over cheese filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir reserved crumb mixture and sliced almonds together in a small bowl; sprinkle over the layer of raspberry preserves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until filling is set and crust is deep golden brown, 45 to 55 minutes. Cool 15 minutes before removing side of pan. Chill completely before serving, about 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Raspberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "springfield70"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 84,
            "itemReviewed": "Raspberry Cream Cheese Coffee Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "419.4 calories",
            "carbohydrateContent": "45.7 g",
            "cholesterolContent": "88.4 mg",
            "fatContent": "24.1 g",
            "fiberContent": "1 g",
            "proteinContent": "6.3 g",
            "saturatedFatContent": "13.7 g",
            "servingSize": null,
            "sodiumContent": "197.8 mg",
            "sugarContent": "25.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-17T12:41:18.283Z",
                "reviewBody": "This coffee cake was AwEsOmE! Moist, creamy and just enough sweet. I used plastic sandwich bags across my fingers when working with the dough to spread it up the sides and again I used one to hold the jam, snipped an end off and piped the jam onto the cream cheese filling. Baked up pretty and I was proud enough to bring it into work to share. This cake was very well received! Kinda like the famous one by \"E\" but so much better because it's fresh. I used lower fat cream cheese and sour cream with no problems. (recipe made for *RECIPE GROUP*)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindalmt/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-05T14:34:09.737Z",
                "reviewBody": "UPDATE: I have made this several times now and wanted to share a tip for working with the sticky dough. Spoon the dough out of the processor placing clumps around in the greased springpan. Lay a piece of plastic wrap, big enough to cover the the pan and more, on the counter and spray generously with Pam. Place wrap over pan, Pam sprayed side against dough, and work the dough out flat and up the sides. The wrap will pull right off with no mess and the dough will be nicely shaped! Also, put the preserves in a baggie and warm gently in warm water. Snip a corner and squeeze the jam onto the dough in circles. Makes it easier to spread out. ORIGINAL REVIEW: Bellepepper made this for Recipe Group and recommended it to me. All I can say is, \"Wow!\", this was really wonderful. I made it the day before, wrapped and stored in the frig. I took it out about an hour before serving, put an almond drizzle over it (confectioner's sugar, a bit of milk and  few drops of almond flavoring) and garnished with fresh raspberries around the top and and plate. I haven't, and wouldn't change a thing, other than to try different jams. This is a keeper! Thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mickdee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mickdee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-11T16:12:17.953Z",
                "reviewBody": "This is a terrific coffee cake. It's moist and flavorful. Love the almond extract. It took longer than an hour for mine to bake in the center when the outer crust was getting dark. It turned out fine. I used Blueberry Sauce, a recipe from AR, instead of the raspberry jam. Drizzled white icing on it made with confectioners sugar and milk. Great Cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lightedway/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-15T18:16:44.337Z",
                "reviewBody": "Made this for Recipe Group...LOVED IT! The biggest pain for me was trying to 'spread' the batter in the pan but I just kept spraying my hand w/ cooking spray and that helped. Also as far as trying to spread the filling over the cheese layer I just spooned small dollops all over the top (I may have used a bit more preserves than called for b/c I didn't measure it) and that worked out great. This was not too sweet but just right perfect amount of cheese raspberry and dough IMO. This was wonderful w/ the raspberry preserves but I can't wait to try it w/ other fruit flavors. This is a definite keeper! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-13T16:12:46.407Z",
                "reviewBody": "This is a keeper. Whole family enjoyed it. It's a little time consuming. I used a can of raspberry Solo filling found in the baking isle. I used an angled spreader to smear out the dough, then cc filling, then raspberry filling, worked great. I had to count the carbs for our family so from my guesstimating it was roughly 400 carbs for the entire dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jenna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3697546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-20T14:04:52.08Z",
                "reviewBody": "This was a great coffee cake that my boyfriend called \"outstanding\" and said I could sell it:). I noticed that some reviewers must have thought they had to cook this until there was absolutely no jiggle in the filling, and they ended up with dry overbrowned cake.  DO NOT OVERBAKE. The filling will finish setting as it cools, like all cream cheese fillings-just bake until the cake is done.  I actually cooked mine for 48 minutes (my springform has a glass bottom so I can make sure it is totally done and a nice golden brown). It was cooked perfectly.  (By the way- I printed this recipe out in 2011 and it did not have \"bake until set\" in it--thankfully).  I preferred it at room temperature by far. When serving, the chilled dough layer was a bit too dense for me (It worked well to chill it slightly at the beginning, then to bring it out well before I wanted to serve it).I had reduced the almond extract, but everyone loved the almond flavor so I think I will put the full amount in next time (also, in 2011, the amount of almond extract was 1 1/2 teaspoons). Next time may try to change  the bottom layer just a little, perhaps adding an agg to make it less dense like bread and fluffier like a cake. I added some vanilla bean paste to the cream cheese layer and it was great to see and taste those little flecks. I also added a simple powdered sugar glaze to some of the cut pieces, but like it better without-it's sweet enough!I will definitely make this one again. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy Cooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4272440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-17T12:03:21.933Z",
                "reviewBody": "Recipe Group Selection: 11 August 2012 Yum Yum Yum. This coffee cake is wonderful! I made as written using my new springform pan for the first time. But.....my oven was a mess when it finished baking. I didn't know the bottom of a springform pan had a top and a bottom. I just washed the pan and popped the bottom in. Mine was in upside down and butter leaked out all over the oven. Luckily it didn't affect the outcome of the coffeecake. It was moist looked great and cut very nicely. My family and parents loved this recipe and I will be making it again. Only next time I will have the pan put together correctly. Thanks springfield70 for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-19T23:31:53.727Z",
                "reviewBody": "Well its in the oven as I write this. This was a tricky recipe for me. I found spreading the dough was a sticky mess even oiling my fingers and using the wrapper from the butter. I wound up wetting a serving spoon and that finally worked for me. I sure hope it doesn't affect the rising of the cake with the extra moisture/water. Also I was tempted to put preserves on the batter and then pour the cream cheese mixture over. But I followed the recipe instead and it was such a mess trying to spread 1/2 cup preserves over. I am sure the preserve layer won't be as pretty because it mixed too much with the cream cheese layer when spreading.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-26T16:09:02.84Z",
                "reviewBody": "I have made this a few times!! We Love it!! I decided to make it again today but realized I was low on ingredients so I had to use what I had on hand! vanilla extract instead of almond I had no fruit preserve so I decided to try it without! added a little cinnamon to the batter and topping and added vanilla extract to the cream cheese filling!! Yummy!!! Just know this recipe turns out fabulous as written and with some Tweaks!! Thank you for such an amazing recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "missrochester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6418859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-25T14:29:48.353Z",
                "reviewBody": "This cake was a total flop for me. The batter is too thick to spread (time consuming). The almond flavoring overpowers the taste of the cake I cut the cream cheese in 1/2 and was still too creamy for our liking and I also ended up baking it for another 20 minutes and the centre didn't set up nicely. I have quite a few clients that I bake for and my hubby is my tester of all new recipes that I try. His comment was \" you can't serve this to anybody\"....enough said.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Hook57",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8806810/"
                }
            }
        ]
    }
]