[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/669/meat-and-poultry/pork/bacon/",
                    "name": "Bacon",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14741/meat-and-poultry/pork/bacon/appetizers/",
                    "name": "Appetizers",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228140/tomato-and-bacon-jam/",
        "name": "Tomato and Bacon Jam",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9370895.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:50:35.000Z",
        "description": "This was given to my mom by her best friend who is a southern girl at heart. It is a sweet and savory flavor that you never forget. Try it with a grilled cheese or on scrambled eggs...you can put it on anything!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT2H5M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "½ pound smoked bacon",
            "2 pounds ripe tomatoes, chopped",
            "1 yellow sweet onion, finely diced",
            "1 cup white sugar",
            "2 ½ tablespoons apple cider vinegar",
            "1 ½ teaspoons salt",
            "¼ teaspoon black pepper",
            "1 dash hot pepper sauce (such as Tabasco®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook the bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. Crumble bacon when cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir tomatoes, sweet onion, sugar, apple cider vinegar, salt, black pepper, and hot sauce together in a saucepan and bring to a boil, stirring constantly to dissolve sugar. Stir in crumbled bacon and cook over medium heat, stirring often, until the spread is very thick, about 1 hour. Adjust salt and black pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cool and spoon into a 1-pint glass jar with a lid; keeps refrigerated for 1 week or frozen for 2 months. If freezing, put spread into small jars and let jars thaw in refrigerator overnight before using.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Bacon",
            "Appetizers"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "3RDTIMESACHARM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.753623188405797,
            "ratingCount": 69,
            "itemReviewed": "Tomato and Bacon Jam",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "140.7 calories",
            "carbohydrateContent": "25.1 g",
            "cholesterolContent": "8.1 mg",
            "fatContent": "3.3 g",
            "fiberContent": "1.4 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "527.8 mg",
            "sugarContent": "23 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-22T17:07:43.35Z",
                "reviewBody": "Oh WOW this is FANTASTIC! I halved the recipe using some beautiful ripe tomatoes from my dad's garden. I'm now wishing that I made the whole recipe b/c I can't stop eating it lol. After tasting it my first thought was crackers w/ cream cheese and this on top...AWESOME! I also plan on trying this on hot dogs/smoked sausages and grilled chicken which I think would be wonderful. When this first started to boil/cook I was worried b/c the tomato skins were coming off and I thought I should've peeled them first but once it was all done everything was 'candied' and you couldn't even tell. Mine took less than an hour to fully thicken so maybe just keep an eye on it while it's going so it doesn't burn. I will def be making this often...it's super easy and super good YUM! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-01T22:56:08.847Z",
                "reviewBody": "So glad I gave this a whirl. I cut back the sugar to 3/4 cup and it is still sweet. Since my bacon wasn't that smokey I also added a bit of liquid smoke. As it was cooking down I drizzled some over grilled zucchini and \"Oh MY!\" I think I will add some chili powder next time just for my taste and cut back the sugar a little more so it is a little more savory. Thanks for posting the recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "misshellis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2452453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-24T03:05:52.617Z",
                "reviewBody": "YUM YUM YUM!\n\nAfter I saw this recipe this morning, I rushed to the nearest Wal-Mart (30 miles) and got my ingredients. After dinner, I whipped it up and we did the taste test. My husband and brother-in-law loved it, as did I. The smell at first was a little odd to me, as I'm pregnant, but once it started really cooking down, I found myself tasting it and loving every different stage more and more. \n\nI look forward to making more this sunday for my husband to take to the teacher's lounge on monday. I am sure we will get more great reviews then. Thank you for a wonderful recipe. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jeniSulli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7821749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-11T06:26:49.2Z",
                "reviewBody": "Me and my oldest son were bored this evening so we decided to give this recipe a shot. I didn't have any fresh tomatoes so we used canned petite diced so we cut the recipe in half in case it didn't work with the canned variety. It did! We loved loved this its so good! We made bagel chips to eat with it very very yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ladybuggs5224",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ladybuggs5224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-10T07:08:46.077Z",
                "reviewBody": "I happened to stumble upon this recipe recommended on the Buzz.  Perfect timing, as I had some late tomatoes in my garden to use up before the frost did them in.  I only had regular bacon, so I decided to add a bit of cumin to lend some smoky flavor.  This is amazing- absolutely delicious!  Thanks for sharing a great recipe :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-05T19:32:28.413Z",
                "reviewBody": "This is awesome. My friends gobbled it up. I served as a topping for fried green tomatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "debbers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4622584/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-10T16:48:17.063Z",
                "reviewBody": "We had an a bunch of cherry tomatoes from the garden and I needed a new recipe to use them up. Found this tried it LOVE it! My husband and daughter were a little nervous because it's called a \"jam\" but thought it was delicious. Made it exactly as the recipe except reduced the bacon to 3 strips (that's what I had on hand). I would reduce the sugar a bit because of the sweeter tomatoes and would up the amount of bacon but I will absolutely make this again. And again. Try it on toasted french bread with a smear of goat cheese topped with the jam. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WagnerMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3284964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-28T20:13:10.907Z",
                "reviewBody": "I am doing something I HATE when other people do which is to review a recipe which I changed. But I think my input may be valuable so here I go. I mostly followed the recipe except: first I doubled it with a pound of bacon which turned out to be fortunate because everyone loved it. Since there are no nice fresh tomatoes to be had at this time of year I used three 24 oz. cans of whole peeled tomatoes. I did NOT double the sugar only used one cup. And finally I whirled the whole shebang briefly in the food processor because I thought it would look nicer - there remained some unappealing-looking lumps of the fatty part of the bacon even though I cooked it very well. My finished product though slightly different from the original recipe was a huge hit - simply served on crackers. But almost everyone felt that it was maybe just a tad too sweet (even at half the sugar). So I will definitely make it again but put less sugar (I'll try 3/4 cup with the double recipe) and I will also throw in a handful of oil cured sun-dried tomato to up the savory content. I think then it will be insanely good. (One final thought you cook this for so long that I don't think I would ever bother starting with good fresh tomatoes - I'd rather use them for something where they stay closer to their natural state. It's so much easier to use canned and still tastes great.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ahnjy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/977580/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-29T07:15:20.94Z",
                "reviewBody": "Delicious! I was looking for something to take to a party and stumbled upon this. it sounded so good I made a double batch to make sure I'd have some leftover...and so glad I did because it was gone quickly at the party. I cut the salt back just a little (although I think it would have been fine at the suggested amount) and forgot to add the optional hot sauce. I simply served it with pieces of crusty bread and it was very yummy. The next day I had some on a bagel with cream cheese and it was super good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carren1105",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3805258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-12-07T00:52:19.213Z",
                "reviewBody": "It was good. I cut the sugar in 1/2 and it was still too sweet for my tastes. I think I am going to try it without any sugar next time or maybe just a Tablespoon of sugar and add more at the end if it needs it. I also would use a small onion or only 1/2 an onion. The recipe has a lot of potential.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Leanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26624645/"
                }
            }
        ]
    }
]