[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228293/curry-stand-chicken-tikka-masala-sauce/",
        "name": "Curry Stand Chicken Tikka Masala Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5504832.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2020-06-19T03:50:45.000Z",
        "description": "A classic curry-stand recipe. This is not haute cuisine; this is the kind of nuclear-orange tikka masala that you crave when you stumble out of a pub at 2 a.m. I make vast quantities of the sauce at one time, and it freezes very well. I also added much more cayenne pepper than 1 teaspoon, but I give out the recipe like this for people who don't like heat.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H5M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons ghee (clarified butter)",
            "1 onion, finely chopped",
            "4 cloves garlic, minced",
            "1 tablespoon ground cumin",
            "1 teaspoon salt",
            "1 teaspoon ground ginger",
            "1 teaspoon cayenne pepper",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon ground turmeric",
            "1 (14 ounce) can tomato sauce",
            "1 cup heavy whipping cream",
            "2 teaspoons paprika",
            "1 tablespoon white sugar",
            "1 tablespoon vegetable oil",
            "4 skinless, boneless chicken breast halves, cut into bite-size pieces",
            "½ teaspoon curry powder",
            "½ teaspoon salt, or to taste",
            "1 teaspoon white sugar, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat ghee in a large skillet over medium heat and cook and stir onion until translucent, about 5 minutes. Stir in garlic; cook and stir just until fragrant, about 1 minute. Stir cumin, 1 teaspoon salt, ginger, cayenne pepper, cinnamon, and turmeric into the onion mixture; fry until fragrant, about 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir tomato sauce into the onion and spice mixture, bring to a boil, and reduce heat to low. Simmer sauce for 10 minutes, then mix in cream, paprika, and 1 tablespoon sugar. Bring sauce back to a simmer and cook, stirring often, until sauce is thickened, 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a separate skillet over medium heat. Stir chicken into the hot oil, sprinkle with curry powder, and sear chicken until lightly browned but still pink inside, about 3 minutes; stir often. Transfer chicken and any pan juices into the sauce. Simmer chicken in sauce until no longer pink, about 30 minutes; adjust salt and sugar to taste.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Chris Bellers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.911777679752977,
            "ratingCount": 2267,
            "itemReviewed": "Curry Stand Chicken Tikka Masala Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "327.8 calories",
            "carbohydrateContent": "13.2 g",
            "cholesterolContent": "105.8 mg",
            "fatContent": "23.4 g",
            "fiberContent": "2.3 g",
            "proteinContent": "17.9 g",
            "saturatedFatContent": "12.7 g",
            "servingSize": null,
            "sodiumContent": "980.5 mg",
            "sugarContent": "7.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-11-20T00:04:00.18Z",
                "reviewBody": "Having said that, I am a health freak who loves curry and Indian food and cannot eat full fat/calorie versions, so I often tweak mine. This recipe is amazing as is and is better than what most Indian restaurants serve.  To make it healthier, I used an 8 oz.can of tomato sauce, a 6 oz.can of tomato paste, and 1 cup of fat-free half and half.  The tomato paste will compensate for the liquidity of the fat-free half and half.  I also used about 1 tbs of olive oil in place of ghee, and used a little olive oil spray when I added the spices to the onions.  For the chicken, I marinated it in a yogurt/spice mixture and broiled it in the oven before mixing it with the tikka curry.  Like I said, original version is 10 stars, and IMHO so is the reduced fat version. I served it with whole wheat homemade roti and roasted peppers/green beans.  My Pakistani husband was more than impressed with the flavors and refused to believe it was healthy!  Thank you for this amazing recipe that will become a staple in our household!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jami Ireland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8619287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-14T05:02:03.003Z",
                "reviewBody": "This recipe is absolutely fantastic. While it may seem like a lot of work, to the uninitiated, it is completely worth every second. I didn't change a thing, it's perfect the way it is. This has become a staple in my house. It freezes well, and even storing in the fridge as leftovers- reheats superbly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "diochick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6234174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-01T22:41:04.107Z",
                "reviewBody": "Sweet Baby Jesus! This is THE Tikka Masala recipe for the masses as well as the elites! Simple to prepare and wonderful to consume! I recommend preparing this dish just as it is written...then modify if you want. The recipe here provides a wonderful dish with a little heat but not a burn. PERFECT IN MY OPINION!  I like heat and will probably add more next time but it is not necessary as this dish is absolutely perfect the way it is. Golf clap!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DLECOUNT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1160739/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-27T16:07:57.95Z",
                "reviewBody": "Being Indian and having my mom make amazing masala sauce, I would say this recipe was very good!  I would personally add more chili pepper, add a tsp of garam masala, and 1 tsp of ground coriander as well.  Really comes out fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mp0681",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5195683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-15T14:35:47.4Z",
                "reviewBody": "This is amazing and has saved us money since we no longer have to go to an Indian resturant.  Couple of notes if you are going to alter this in any way, the portion of cream to tomato is very important or the flavor will be off, I had two 8 oz. cans of tomato sauce and used both, simply added two additional tablespoons of cream and it was perfect.  Also the curry is a must in this!  When tasting the recipe before adding the chicken thought it didn't have the right balance, after the chicken was added and the curry blended into the sauce...Wow!  So if you are going to try making a veg variation with chickpeas or paneer, suggest adding the curry for the chicken directly into the sauce.  Such a fantastic and easy recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GalcticRaptor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/855700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-15T19:24:28.63Z",
                "reviewBody": "YEP!  Try this recipe!  Turns out scarily close to what I get at my local Indian restaurant and the hubby and I enjoyed the leftovers the next night as well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christiana1200",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3499696/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-01T02:28:21.753Z",
                "reviewBody": "I used to use a different Tikka Masala recipe that was on this site. I have deleted that one from my recipe box!!! This has a great flavour and I make it with out too much spice as my stomach doesn't like too much cayenne but my hubby can add more when I serve. I like to marinate my chicken in plain yogurt with some curry, tiny bit of cayenne, cinnamon and bit of turmeric for a couple hours and then skewer and bbq, then I pull it off the skewer and add to the sauce, also add some peas or green beans for a little veggie! Thank you thank you thank you for submitting this recipe!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3632072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-17T16:58:37.07Z",
                "reviewBody": "I haven't reviewed a recipe here in a long time but I had to add my voice to the resounding raves for this dish. Indian food is the cuisine I have the least experience with and I honestly didn't know what to expect from the mixture of spices as I was making this. However, I was looking for something different and hoped for the best. This dish is absolutely delicious. It has a very complex flavor- sweet, hot, tangy, spicy- every component adds to it and I can't imagine omitting a thing. The only thing I did differently was that I used boneless chicken thighs, as it was what I had, and they became tender and moist in the sauce. This recipe makes a lot of sauce and in the future I will double that and freeze some (as some reviewers say it freezes well). It was so delicious, my fiance and I are already talking about when we will make it next! Next time I may try adding in some chickpeas or cubed potatoes or squash when I'm sauteeing the chicken, to soak up every bit of the delicious sauce. But I wouldn't omit or change the ratio of spices, as it's perfect as-is. Fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2298355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-16T14:38:33.13Z",
                "reviewBody": "Absolutely loved this!!! It tastes just like the Tikka Masala from our favorite Indian restaurant, we are in love! And it really is surprisingly simple!\nBecause there are so many; the ingredient list may look daunting to the novice, but the directions are so simple and direct that it should be no problem for even said novice! \nOne good cooking trick I like, when so many ingredients - especially spices - need to be added at once, is to measure them all out ahead of time in a separate bowl. I like to dumb each measurement into a nice neat pile in the bowl so I can keep track of what I've already measured out. Then when the time comes to add the spices I can just dump them all in at once and don't run the risk of burning any of the spices while I'm still measuring and dumping others.\nI also started the chicken (and upped the curry to 3/4tsp) while the sauce was simmering for 10-15 min after adding the cream (side note: YES you MUST use heavy cream if you want this to be the real deal!). You could also start the chicken while sauce is simmering for the first 10 min before adding cream and set it aside to wait for later. Either way, start the chicken while your sauce is simmering to help cut down on time.\nOne last thing, I used a sauce pan for the sauce part instead of a skillet. The higher sides make it so much easier to stir quickly and continuously. ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephicus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6368680/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Curry Stand Chicken Tikka Masala Sauce",
            "description": "Learn how to make this fragrant, delicious, Indian-inspired chicken dish.",
            "uploadDate": "2015-08-11T21:31:17.544Z",
            "duration": "PT2M14.001S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F83e31e15-a2e2-4f9a-b366-aaf9893e0d64%2F518b3730-febf-4e51-90b7-c3f60e3eb9fb%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4414915674001"
        }
    }
]