[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228376/farro-perlato-cereal/",
        "name": "Farro Perlato Cereal",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2298659.jpg",
            "width": 3296,
            "height": 2472
        },
        "datePublished": "2020-06-19T03:50:50.000Z",
        "description": "Farro perlato is the Italian word for emmer wheat. It is a wheat grain, actually a kernel that resembles barley from Popola di Foligno in the heart of Umbria. I have been looking for ways to incorporate this grain that has lots of fiber and protein into our meals. Enjoy this creation!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT8H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 cup farro perlato",
            "1 pinch salt",
            "1 cup 2% milk ",
            "2 teaspoons white sugar",
            "½ vanilla bean, split lengthwise and seeds scraped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place farro in a bowl and cover with several inches of cool water; let stand in refrigerator for 8 hours to overnight. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place farro in a saucepan and cover with water; stir in a pinch of salt and bring to a boil. Reduce heat to medium-low, cover, and simmer until tender, about 15 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix milk, sugar, vanilla bean with seeds, and a pinch of salt together in a saucepan. Cook and stir over medium-low heat until sugar is dissolved and milk is warm, 5 to 7 minutes. Remove vanilla bean and add farro to milk mixture. Cook and stir until heated through, about 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Fran"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3,
            "ratingCount": 5,
            "itemReviewed": "Farro Perlato Cereal",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "194.4 calories",
            "carbohydrateContent": "40.6 g",
            "cholesterolContent": "4.9 mg",
            "fatContent": "2.5 g",
            "fiberContent": null,
            "proteinContent": "7.1 g",
            "saturatedFatContent": "0.8 g",
            "servingSize": null,
            "sodiumContent": "26.3 mg",
            "sugarContent": "6.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-05-29T14:51:45.803Z",
                "reviewBody": "This was the first time i made anything using Farro. Overall It was OK really Filling smelled wonderful but probably wont make again. I skipped part of step 3. After cooking and Draining the Farro I added the Milk Vanilla beans and Sugar (i used 4 teaspoons) right back into the Farro Pot and continued to cook on low for another 8 minutes. I Mixed the sugar and vanilla beans together so the beans would separate nicely.Also added a splash of pure vanilla. The Milk part of this tastes wonderful and i really didnt mind the Farro..but the Farro itself really has no flavor which makes everything kind of bland.. I wonder if you soaked the Farro in water with sugar and vanilla overnight..if it would pick up any of that flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4562668/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-02T14:02:10.25Z",
                "reviewBody": "The inital flavor of the sweet vanilla milk and nutty farro is great then it goes very bland. I added a sprinkle of cinnamon and a drizzle of maple syrup to my bowl after eating a few spoonfuls of the original recipe and it's better. Farro is such a thick hearty grain it seems like it would be hard to flavor it. Maybe if it was cooked like rice pudding it would have more sweetness and flavor. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Foompa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2633503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-27T19:53:20.54Z",
                "reviewBody": "It smells awesome with the fragrant vanilla but the farro itself is bland. I sprinkled with cinnamon sugar which made it a little tastier we enjoyed the chewiness of the farro which I soaked for 12 hours. I would recommend 2 tbsps of sugar not 2 tsps. I remember my grandmother making wheat berries when I was a child she used honey and dried fruit that may be a nice addition to this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "the4taals",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1554570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-05T19:28:26.113Z",
                "reviewBody": "I read the reviews before considering of making it thinking perhaps modifying it would make it less \"bland\". Instead of cooking in plain water I cooked it in coconut milk. As the recipe indicated in another saucepan I cooked the remaining coconut milk raw sugar instead of white and vanilla beans/seeds. I am very happy I only used 1/2 cup of farro because it was just okay even after the alteration of cooking the grain in coconut milk. I'd rather use quinoa pudding recipe on this site over farro as a breakfast cereal. Sorry just not my cup of tea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Francine Lizotte Club Foody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/clubfoodylady/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-03T16:55:49.543Z",
                "reviewBody": "i made this this morning. i was very curious after seeing everyone else's post and pics about it. and i must say i have to agree....bland bland so bland. so i thought i would try a different method. i soaked over night cooked it this morning in a little salted water. i have a jar of leftover vanilla beans that had been soaking in vodka to make my vanilla extract. they've been in that jar which has been empty of extract for quite some time. i threw one of those beans in the pot while cooking the farro. when it was done cooking i drained it added the milk and some homemade apple pie spice maybe a tsp of brown sugar and the same vanilla bean. i thought (duh) it would thicken up like my rice pudding does. then i had one of those \"duh\" moments when i realized there's no starch to thicken it up LOL. so i took it off the stove put it into my bowl drizzled a little pure maple syrup over it and had it like that. i love the chewiness and the sweet milk (what was left of it) and enjoyed it enough to finish it but i won't be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "debbie eckstein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2175240/"
                }
            }
        ]
    }
]