[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228408/german-twists/",
        "name": "German Twists",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4406852.jpg",
            "width": 1936,
            "height": 1936
        },
        "datePublished": "2020-06-19T03:50:51.000Z",
        "description": "This rich and tender sour cream and yeast cookie is delicious and so lovely with its many delicate layers and twists. It is a classic and historic recipe for which many variations can be found. This updated version uses all butter and a food processor for wonderful flavor and ease of mixing. The rich yeast dough actually contains no sugar, but the sweetness and the layering results from well sugaring the dough and work surface, while rolling and folding it several times prior to cutting and shaping the cookies.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H45M",
        "recipeYield": "2 dozen cookies",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "¼ cup warm water",
            "3 ½ cups bleached all-purpose flour",
            "1 teaspoon salt",
            "1 cup butter, sliced",
            "¾ cup sour cream",
            "1 large egg",
            "2 large egg yolks",
            "1 teaspoon vanilla extract",
            "1 cup white sugar, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle yeast over warm water in a bowl and let activate while you complete remaining steps.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place flour and salt into a food processor and pulse once or twice to combine. Scatter butter slices over flour and process until butter is thoroughly mixed into the flour, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk yeast mixture, sour cream, egg, egg yolks, and vanilla extract together in a bowl; pour mixture into food processor. Pulse several times, just until the dough starts to hold together and clean the sides of the bowl (do not overmix). Remove dough from food processor and divide in half; form each half into a thick disk, wrap in plastic wrap, and refrigerate at least 2 hours. For best texture, refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Line several baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle a work surface generously with sugar and roll out one of the dough disks into an 8x16-inch rectangle. Sprinkle dough with a generous amount of sugar. Fold the dough over in thirds, letter-style, and roll out again; fold as before and roll out and fold a third time, sprinkling dough with sugar each time. Finally, roll dough into a 4x14-inch rectangle, about 1/4 inch thick. Repeat process with second dough disk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut strips from the short side of the dough rectangles, making them 1/2 to 3/4 inch wide. Place strips onto the parchment-lined baking sheets, twisting and slightly stretching them. If preferred, form into horseshoe shapes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until lightly golden brown, 12 to 15 minutes. Cookies will puff up a bit to reveal delicate layers. Let cookies cool for about 5 minutes on sheets before transferring to wire cooling racks.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Eliserae"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.434782608695652,
            "ratingCount": 23,
            "itemReviewed": "German Twists",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "190.5 calories",
            "carbohydrateContent": "22.8 g",
            "cholesterolContent": "48.3 mg",
            "fatContent": "9.9 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "159.4 mg",
            "sugarContent": "8.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-10-03T18:19:20.887Z",
                "reviewBody": "These have been a Christmas tradition in our family for three generations. We love to eat them while opening presents Christmas morning. We call them Angel Twists. We make vanilla sugar to use when rolling them out. Instead of my food processor I use the dough hook on my mixer. I have also mixed these by hand. Works no matter which method I use.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "raemmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3992573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-09T06:29:17.02Z",
                "reviewBody": "We like this recipe. It was very easy to put together and I did refrigerate it overnight as the recipe called for. The twists were tender and delicious not too sweet. It really didn't puff up all that much for a yeast cookie but maybe that was because this recipe called for no raising of the dough-just put it right in the oven. tip; we used a ruler and a pizza cutter to cut the strips into even 1 inch wide strips and it worked well to keep them a consistent size for even baking. Thank you for a great recipe-we plan to make it again for the holidays.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Gunkel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-16T02:11:41.567Z",
                "reviewBody": "Delicious! These goodies taste like a yummy yeast donut. . .except better. . .because the texture is delicious! My food processor was too small to mix everything in, so I just split the ingredients. But, it worked out fine. The cookies are time-intensive, but Roth every minute! Would be great for a special breakfast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JillianFaye22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9746732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-22T21:21:23.163Z",
                "reviewBody": "This was a little challenging and time consuming, but magically delicious. Out of all the cookie recipes I did this year, this one was by far the most loved.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12677662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-15T05:35:10.42Z",
                "reviewBody": "Very delicious and a special recipe. It is a bit time consuming but worth the trouble for an elegant and festive cookie. Chilling the dough in the 2 wrapped disks worked out just fine fine for me. The first roll-out does not have to be a perfect rectangle as the first folding of the dough into thirds takes care of the shape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5685596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-17T03:41:14.877Z",
                "reviewBody": "I received this recipe over 50 years ago from my lifelong friend's mom who is now 85 years old. It came from her mom, who brought it with her from Sweden. It is spectacular and is part of Christmas for me. Her version split the butter into half butter/half shortening (I think because in the 1970s butter was very expensive). I will think of her everytime I make these at Christmas, as will my children.\n\n\nUpdate: I notice  this version says to refigerate for 2 hours. My 50+ year old versions says at least 4 hours and up to 2 days. I think this may be why some had poor outcomes with the recipe. It really needs to solidify and 2 hours is not enough. I use overnight (dough one day, rollout/twisting/baking the next).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puako Sunset",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8623089/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-28T08:42:34.8Z",
                "reviewBody": "Oh my gosh! - Someone else has our \"secret family recipe!\";-) We're in the third generation of making these also. They always disappear first at Christmas. I've never seen this recipe in print before. Interesting to see that several others are familiar with it also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judith McMahon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20860639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-16T23:11:44.7Z",
                "reviewBody": "I made these for the Recipe Group's selection for this week. I like these much more than my husband does--he doesn't understand subtle yeast flavor. My family members also loved these. I put together the dough last night and baked them this morning following the recipe until I got to the second clump of dough because I used cinnamon sugar for that half. My dough divided into two 1 lb 1 3/8 oz hunks. I do think that when the dough comes from the fridge that it needs to sit for a while before working with it; my first one was much harder to work with than the second one. I rolled it out on a Silpat with a sheet of parchment on top that had been lightly floured. I kept losing track of how many times I turned and folded but that didn't seem to matter much. I used a plastic knife to cut the slices which took about 13 minutes to bake. My family preferred the cinnamon sugar twists but then we are crazy about cinnamon! Thanks for a beautiful new way to enjoy yeast bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-30T06:04:27.36Z",
                "reviewBody": "I thought this recipe was easy to use and yeilded delicious results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clarisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12242547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-23T04:43:06.797Z",
                "reviewBody": "Aughh! Total fail i was so disappointed. The recioe is EXACTLY like my grandmother s. Yes it has been awhile since I made these they were a flat buttery sugar mess on the tray. What did i do wrong? I read and reread tne instruction no distractions. Help!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sueZenjames",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22811365/"
                }
            }
        ]
    }
]