[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228525/cinnamon-swirl-bread-for-the-bread-machine/",
        "name": "Cinnamon Swirl Bread for the Bread Machine",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2074525.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2020-06-19T03:50:55.000Z",
        "description": "This bread is probably the best thing I make. Just finished making it and half a loaf is gone already while it was cooling. Using the bread machine to make the dough makes it so easy!",
        "prepTime": "P0DT1H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "1 cup milk",
            "2 eggs",
            "¼ cup butter",
            "4 cups bread flour",
            "¼ cup white sugar",
            "1 teaspoon salt",
            "1 ½ teaspoons active dry yeast",
            "½ cup chopped walnuts",
            "½ cup packed brown sugar",
            "2 teaspoons ground cinnamon",
            "2 tablespoons softened butter, divided",
            "2 teaspoons sifted confectioners' sugar, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place milk, eggs, 1/4 cup butter, bread flour, sugar, salt, and yeast into a bread machine in the order recommended by the manufacturer, select the dough setting, and start the machine. When dough cycle is complete, transfer dough to a floured work surface and punch down. Let dough rest for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix walnuts, brown sugar, and cinnamon in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in half and roll each half into a rectangle about 9x14 inches. Spread 1 tablespoon softened butter over the top of each dough rectangle and evenly sprinkle dough with half the walnut mixture. Roll dough rectangles, starting from the short ends, and pinch seams closed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease 2 9x5-inch loaf pans. Fit the rolled loaves into the loaf pans with seam sides down. Cover and let rise until nearly doubled in size, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake loaves in the preheated oven until lightly golden brown and bread sounds hollow when tapped, about 30 minutes. If loaves brown too quickly, lightly cover with aluminum foil for the last 10 minutes of baking. Let bread cool for 10 minutes before removing to finish cooling on wire racks. Sprinkle tops of each loaf with 1 teaspoon confectioners' sugar.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MN Nice"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.720779220779221,
            "ratingCount": 154,
            "itemReviewed": "Cinnamon Swirl Bread for the Bread Machine",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "152.1 calories",
            "carbohydrateContent": "22.4 g",
            "cholesterolContent": "23.9 mg",
            "fatContent": "5.4 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.8 g",
            "saturatedFatContent": "2.3 g",
            "servingSize": null,
            "sodiumContent": "129.2 mg",
            "sugarContent": "7.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-18T22:23:53.43Z",
                "reviewBody": "OH MY GOODNESS!  I cut the recipe in half as I only had one loaf pan.  I will be buying another!  As Hubby cannot have nuts any more, I replaced the walnuts with raisins that I plumped.  He also requested icing on top; so, I used the recipe from Clone of a Cinnabon.  Absolutely delicious.  5 STARS ALL THE WAY!  Thank you MN Nice for sharing your recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-21T03:14:46.14Z",
                "reviewBody": "This cinnamon bread is excellent. I followed the recipe ingredients but made rolls instead of a loaf and added raisins. I LOVE the filling so I doubled the ingredients to satisfy my sweet tooth and I'm glad I did because to my liking there was barely enough to cover both rectangles. I added 1 cup Thomson raisins, soaked for 30 min. in 1/4 cup brandy with a 1/4 tsp sugar sprinkled over them (kills the bitterness)  stirring a few times to coat them evenly. The dough is great to work with and not sticky at all. When I sprinkled the raisins over the sugar mix I put a sheet of wax paper to cover it  and ran the rolling pin over it lightly a few times to press the mixture into the dough (makes rolling it up easier and less filling leaks out). I rolled it up from the long end and sliced it into 1\" pieces and popped them into Pam-sprayed muffin tins. I always brush my rolls with soft butter and sprinkle a little brown sugar over them, about 1/8 tsp on each (to keep some yummy, gooey syrup on the tops). It only took 15 min to turn golden with syrup spread over the tops.Even though I doubled the filling very little of it leaked out. I lifted each to a rack and while still warm I drizzled the tops with basic milk/icing sugar  glaze. When they cooled I drizzled a 2nd layer of glaze over the tops as it will not soak into the roll and disappear.  Then I ate 4 of them! My goodness, this beautiful bread makes accidental rolls a great mistake. Thank you MN Nice for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pretzeld",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5551643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-28T03:12:21.11Z",
                "reviewBody": "Delicious!  Instead of spreading butter before rolling it up, I tried a method I saw online and mixed the cinnamon mixture with egg which acts as a binder. This keeps the layers from separating when it is baked.  I did use too much egg and my mixture was too runny.  Next time I will use 1-2 Tablespoons of egg instead of a whole one.  There will definitely be a next time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LolaMama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821007/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-03T02:41:56.527Z",
                "reviewBody": "I know I have a winning recipe on my hands when my husband and 3 year old start snacking on it as soon as its cool enough to handle and immediatly ask me to make it again soon. This bread turned out so well, just like a cinnamon roll in loaf form. I don't have a bread machine so I did have to adjust the directions for use in my stand mixer. I combined the white sugar and warm milk in my mixer bowl and added the yeast to proof. Once proofed I mixed in the eggs and softened butter until the butter was broken up into chunks and the eggs were mixed in. I then added the flour/salt that had already been mixed to combine. I let the dough hook do all the kneading and when finished I lightly oiled the bowl and the top of the dough, covered with plastic wrap and let it rise until doubled. From that point on I followed the recipe except for doubling the sugar/cinnamon part of the filling. I made one loaf with walnuts and one without since my husband isn't crazy about them. We can't wait to try this bread toasted tomorrow morning. The only change I'll make next time is to brush the dough with an egg wash before baking so it comes out nice and glossy. Highly recommend!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay Vereschagin Tripp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2468270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-29T23:07:58.943Z",
                "reviewBody": "Awesome recipe for cinnamon swirl bread. Besides being fun to make these loaves were absolutely delicious! I opted to use raisins instead of nuts. I shall use nuts next time as I will definitely be making this bread on a regular basis! Thank You for such a wonderful recipe! Yummy stuff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet Shum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3574351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-06T07:36:15.11Z",
                "reviewBody": "Excellent! I could tell from the recipe that there would not be enough filling without the walnuts and since I planned to omit them I too doubled the cinnamon/sugar mixture. When baked and thickly sliced the texture of this bread is smooth and soft the sticky cinnamon-spicy sweetness oozes out and it creates the perfect ratio of bread to filling. The kids slathered their slices in homemade apple butter a friend gave us for Christmas but even plain this stuff is heavenly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAMJMine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2201654/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-31T03:00:16.977Z",
                "reviewBody": "I've tried this recipe twice and being a very novice breadmaker I love the end result! I did not have bread flour so used all purpose flour and did have to let it rise for close to 90 minutes before it had risen enough to almost fill the pan. Very happy with it and my kids love it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hcsmom79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9399246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-17T19:38:26.24Z",
                "reviewBody": "This made two wonderful loaves of goodness. Next time I will roll the dough tighter as my bread was rather holey but this did not affect the flavor or the amount of time it took for the bread to be devoured! A definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShirleyMay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3110372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-29T20:29:51.063Z",
                "reviewBody": "This recipe is awesome! I'm new to baking bread but this was easy came out great and tasted awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bakerjamie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10410312/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-06T02:06:35.503Z",
                "reviewBody": "I feel bad for low-rating this recipe, because I did change it...I doubled the filling as others suggested, and used 1tsp of bread machine yeast as that was the conversion for instant yeast vs. active dry yeast. I'm not sure where I went wrong, but my dough didn't rise and I basically ended up with 2 cinnamon roll logs. They didn't taste terrible, but it would've been nice if they had some more air in them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mmhmm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3660797/"
                }
            }
        ]
    }
]