[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/927/side-dish/vegetables/sweet-potatoes/",
                    "name": "Sweet Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228542/roasted-vegetables-with-spaghetti-squash/",
        "name": "Roasted Vegetables with Spaghetti Squash",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1060097.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2020-06-19T03:50:56.000Z",
        "description": "This is a great fall dish. Roasted veggies sit on a bed of spaghetti squash and are topped with a little melted cheese. Note: vegetables can easily be substituted. I have made this many times with whatever is on hand. However, when I can, I try to use mostly root vegetables in yellow and orange colors.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "cooking spray",
            "1 large spaghetti squash, halved and seeded",
            "1 acorn squash, halved and seeded",
            "1 large sweet potato",
            "3 cups baby carrots",
            "1 onion, diced",
            "¼ cup honey",
            "1 teaspoon ground cinnamon",
            "1 pinch salt",
            "1 pinch ground black pepper",
            "⅓ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (205 degrees C). Coat a large baking sheet with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place spaghetti squash and acorn squash, cut sides down, on baking sheet. Place sweet potato on baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake until squash and sweet potato are tender when pierced by a fork, about 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn oven down to 350 degrees (170 degrees C). Coat a 9x13 baking dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape strands from the spaghetti squash and place into prepared pan in an even layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut sweet potato into bite-size chunks; place into a large bowl. Scoop bite-size chunks of flesh from the acorn squash; add to bowl. Stir baby carrots, diced onion, honey, cinnamon, salt, and black pepper into squash mixture and mix well. Transfer squash mixture to the baking pan and spread evenly over spaghetti squash. Sprinkle Cheddar cheese over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees until cheese is bubbly and brown, about 45 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Sweet Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Gila"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 12,
            "itemReviewed": "Roasted Vegetables with Spaghetti Squash",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "229.7 calories",
            "carbohydrateContent": "49.5 g",
            "cholesterolContent": "6 mg",
            "fatContent": "3.4 g",
            "fiberContent": "4.8 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "148.2 mg",
            "sugarContent": "16.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-03-24T00:42:49.777Z",
                "reviewBody": "I liked this recipe. Did make a couple of modifications though; mainly, using a bit more of the spices/seasonings as well as adding a bit of freshly chopped ginger. Other than that though, made it as instructed and it was delicious! Also, for those who like spiciness (as I really do); sprinkling a bit of red pepper flakes after serving really brings out all the flavors with a kick. Like I said, delicious! I will definitely be making this again in the future (^v^)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "veggiegirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9489673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-31T16:44:44.28Z",
                "reviewBody": "This is a very labor intensive recipe for a mediocre result. We did like it mainly because we love veggies especially squash but it was just okay. Not enough seasoning or salt. Something was missing. I will make again but I'll figure out an easier method and use different spices. I did use parmesan and not cheddar. Maybe that was it. It just didn't rock our world. Thank you for the recipe and the idea of mixing the different varieties of squash.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-06T19:26:11.1Z",
                "reviewBody": "I made the recipe as posted with these exceptions: I cut the recipe in half and baked in an 8x8 square pyrex dish, I sprinkled some salt and pepper over the spaghetti squash and mixed it in a little before adding the top layer, and I added a clove of minced garlic to the top layer. Overall I liked the flavor of the dish and found it to be a good way of using up spaghetti squash without the typical \"add spaghetti sauce and pretend it's noodles\" recipe (which I never really like as much as the real thing). \n\nI found in my attempt at this recipe that the onion and carrots were not cooked through after even 60 minutes in the oven. The crunchiness of the carrots and onions and resulting strong onion flavor detracted from the dish. My one suggestion for this recipe would be to roast the carrots and onion along with all of the other ingredients before chopping them and adding them to the top layer. It may help to put the carrots and onions under the hollow of the spaghetti squash or acorn squash in order to cover and steam them and avoid over-drying. I may also try cutting the amount of onion in half or cutting it in smaller pieces. I'll try it again with these changes and see how it turns out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PiccoBlue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/piccoblue/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-04T09:59:40.037Z",
                "reviewBody": "I liked the concept of this dish. I used the spaghetti squash acorn squash and sweet potato. I left out the carrots and onion although if I were to use them I would just roast them with everything else eliminating the need for another 45 minutes of baking. I also left out the cheese because it didn't make sense to me. Maybe I missed out on something amazing but I didn't want to risk it! After roasting I threw everything into an 8x8 put a generous amount of salt pepper and cinnamon on top drizzled with honey gave it a stir and baked for another 15 minutes. Came out delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Pulley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/hkp123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-05-19T02:08:06.92Z",
                "reviewBody": "My family were not big fans of this one. The carrots came out more crunchy then we would have liked. I could have used less onions in it as well. Personally I probably won't make this again or if I do I will be making some modifications to it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Lusiak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17706512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-24T00:24:00.79Z",
                "reviewBody": "Absolutely delicious! I will definitely make this again. I did wait to add the spaghetti squash and chicken until the end since both were fresh out of the oven rather than letting it cook in the pan a while. I found the texture of the squash held up really well by doing this. The only thing I would change next time is adding the sauce a little at a time. I found it a little too saucey for my liking but it tasted so good it didn't bother me too much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cookingqueen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12202258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-10-09T08:25:03.05Z",
                "reviewBody": "Delicious! I definitely spiced it up. 1 tsp salt 1/2 tsp pepper 1/2 tsp ginger dash of allspice 1tsp cinnamon (as called for). It could have done with lightly sautéing the carrots and onions but not as bad as everyone has said. I did let them soak in the honey sauce while the squash was in the oven. I also added 1/2 of a butternut squash that I had leftover from a previous recipe. I used some lactose free cheese since my husband is lactose intolerant. Also served it with a wheat baguette which gave it a nice base! Will make great leftovers and tastes like fall!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sperea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13991628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-10T02:24:02.727Z",
                "reviewBody": "made this for the family tonight. kids loved it hubby was a \"it's ok\". He is also a Sweet potato cooked carrot squash (any kind) cinnamon (in large amounts) hater. followed almost exact. except we used butternut squash instead of acorn as that was what we had. and feta cheese instead of cheddar (we were out). I also probably doubled if not tripped the cinnamon and doubled the honey (in hopes to please the husband lol) we added the feta with 20min left instead of at the start of the final 45. Over all very good. a bit longer to do then posted as I had to put the sweet potato back in for another 20. though I had a ginormous spaghetti squash and it was a very large sweet potato. small butternut. The only thing I would definitely change and recommend is cook your carrots and onion before. they were all quite crunchy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alyssa Shillington",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17278056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-05-14T06:44:04.167Z",
                "reviewBody": "Just made it for the second time. My family of vegetarians and non love it! I sautéed the carrots and onions to soften them up a bit.  Takes a bit of time to prepare, but well worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen Rohrer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4458882/"
                }
            }
        ]
    }
]