[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
                    "name": "Fish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/422/seafood/fish/mahi-mahi/",
                    "name": "Mahi Mahi",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/84970/macadamia-nut-crusted-mahi-mahi/",
        "name": "Macadamia Nut Crusted Mahi Mahi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5877883.jpg",
            "width": 3264,
            "height": 2208
        },
        "datePublished": "2020-06-19T03:12:05.000Z",
        "description": "This is an unbelievable Hawaiian recipe that utilizes native ingredients to create a succulent hot and sweet entree.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 ounces macadamia nuts",
            "4 ounces plain bread crumbs",
            "6 (6 ounce) mahi mahi fillets",
            "4 ounces butter",
            "2 ounces shallots, diced",
            "4 cups chicken stock",
            "4 ounces pineapple, rough chopped",
            "4 ounces papaya, rough chopped",
            "4 ounces mango, rough chopped",
            "1 tablespoon shredded coconut",
            "2 habanero peppers, seeded",
            "salt and pepper to taste",
            "white sugar to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a food processor or blender, pulse together macadamia nuts and breadcrumbs until finely ground. Pour nut mixture onto a plate, and coat fish fillets on both sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat butter in a large skillet over medium heat. Fry fillets on both sides until nuts are golden brown. Remove to a baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add shallots to skillet, and cook until translucent. Stir in chicken stock. Mix in pineapple, papaya, mango, coconut, and habanero peppers. Season with salt, pepper, and sugar to taste. Simmer until sauce is thick, about 30 minutes. Strain to remove peppers, fruit, and shallots. Reserve sauce in a pan over low heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake mahi mahi in preheated oven about 10 minutes, until internal temperature reaches 140 degrees F. Remove fish, and lightly coat with sauce.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Fish",
            "Mahi Mahi"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef David Highlander"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.442477876106195,
            "ratingCount": 113,
            "itemReviewed": "Macadamia Nut Crusted Mahi Mahi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "464.6 calories",
            "carbohydrateContent": "23.8 g",
            "cholesterolContent": "168.2 mg",
            "fatContent": "25.1 g",
            "fiberContent": "2.6 g",
            "proteinContent": "36.1 g",
            "saturatedFatContent": "11.5 g",
            "servingSize": null,
            "sodiumContent": "1040.6 mg",
            "sugarContent": "7.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-17T19:44:25.373Z",
                "reviewBody": "We had macadamia nut crusted mahi at a *very expensive* restaurant in Hawaii a year and a half ago.  Ever since, my husband has been raving about it.  I decided to try this recipe for our Easter dinner yesterday as a special treat for him.  It was a huge success. :)  He said, \"this is every bit as delicious as _________ restaurant!\"  So there you have it -- from the mahi-loving man himself. ;)\n\nI did make a few changes to the recipe: first, I used more nuts than bread crumbs because I only had seasoned crumbs and didn't want the nutty flavor to get lost.  Second, I forgot to buy a habanero pepper so I just threw some crushed red pepper flakes into the sauce while it simmered.  The spiciness was perfect.  Next, I used about twice as much coconut as the recipe called for because I really wanted the coconut flavor to stand out.  Also, since I used canned pineapple chunks rather than fresh, I used the syrup from the can to sweeten the sauce rather than sugar.  And lastly, I served the sauce over the fish without straining it, sort of like a chutney -- the chunks of fruit were really tasty with the fish.\n\nSuperb recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELSHARK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1326977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-07T16:45:32.593Z",
                "reviewBody": "This recipe is outstanding!!  I served it for a small dinner party (4 people) and I received glowing compliments (this using previously frozen mahi).  Changes I made:  I used a whole can of macadamia nuts (6 ounces) and a smaller amount of bread crumbs (maybe 2-3 ounces?).  I found that I wanted more coating than the recipe calls for.  I also dipped each fillet in an egg mixture (1 whole egg + 1 egg white) before coating.\n\nFor the sauce I didn’t use the pepper as mentioned in other reviews, and instead just added a few shakes of crushed red pepper. I also only used 3 cups of chicken broth instead of 4 and found that I still needed to add a little cornstarch to thicken up the sauce appropriately.  Instead of fresh fruit, I used canned mixed tropical fruit cups.  And instead of sugar, I sweetened the sauce with the juice from the cans (I left the fruit in the sauce when I stirred in the cornstarch instead of straining out the fruit and it was fine this way).  Finally I served the sauce and fruit over the fish like chutney.  I received RAVES from everyone…I had reserved sauce so I served that on the table as well, and everyone was scraping the bowl.  This was definitely a winner and I will certainly be making it again!  My boyfriend LOVED it.  Oh, and another reviewer mentioned that it is a lot of prep work…I didn’t find that to be the case if you used the canned fruits and crushed red pepper…the only chopping I had to do was the onion.  Great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2313945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-27T17:32:32.737Z",
                "reviewBody": "I would never want to mess with a chef's perfection, but Target's Archer Farms brand makes a sauce with habanero's and mangos if you want a short cut. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "organic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2469705/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-16T04:23:20.67Z",
                "reviewBody": "Amazingly delicious!! I've been to many many island resorts and have never had such good mahi mahi as this. And I cut corners even! 1. I used canned tropical fruit and juice to sweeten; 2. Used chili paste from a tube; 3. Used a can of coconut milk instead of regular coconut (it made the sauce thicker) 4. I also dipped the filets in an egg mixture to ensure even coating. 5. I pureed the sauce instead of straining-- if you do this you'll have twice as much as you would otherwise. My bf was so impressed he suggested we save the leftover sauce so I can make it again TOMORROW!! Also I used frozen fish and boullion (not stock)- this meant I didn't have to simmer the sauce in order to reduce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2375178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-21T12:41:27.28Z",
                "reviewBody": "This had lots of flavor! I had to add a bit of water (maybe 1 Tbsp.) to the nuts and breadcrumbs mixture to make it pasty enough to stick to the fish. Worked like a charm. Also did not have haberno peppers so like others I used a dash or two or crushed red pepper flakes (which really gave the dish some heat!). I strained the sauce to thicken it with some cornstarch once it was thickened I added the fruit back to it and served over the baked fish as one reviewer said like a chutney. Keep in mind if you have thick mahi fillets like I had (mine were probably at least 1\" thick) you may have to increase oven time - mine took about 20 min. Also be forewarned - this is a time-consuming recipe and I didn't even chop my fruit I bought the del monte fresh chopped fruit cups. Still a dish to impress your guests. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MomSavedbyGrace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1366670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-15T23:16:36.45Z",
                "reviewBody": "Delicious! I followed the recipe EXCEPT that I did not have papaya and so just added a little extra pineapple and mango to compensate and also did not have the pepper so I followed another's suggestion and just added some red pepper flakes. It did the trick! I also added a little cornstarch to the sauce at the end of the boiling to thicken it up. The dish was delicious and an easy one to impress hubby or company with. Very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1491372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-04T18:55:06.977Z",
                "reviewBody": "The recipe sounded like it would taste great. But it wasn't. It was expensive to buy all of the ingredients which wouldn't be an issue if it actually came out good. I followed the recipe to a \"T\" and the mahi mahi crust didn't tase like a macadamia nut crust..just bread crumbs. The sauce never thinkened up..not even close. The whole meal had no taste to it. Not to mention that the steps listed are out of order! It says to brown the fish then start cooking the sauce for 30 minutes then finish cooking the fish for only 10 minutes in the oven. What do you do with the browned fish for 30 minutes while the sauce cooks? I should have read this recipe more carefully.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "D-Nye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3063048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-04T05:12:30.527Z",
                "reviewBody": "I make this at least twice a month now. I made whole wheat bread crumbs from stale bread that I toasted until dry and put in a food processor. I used red pepper flakes in place of the habanero and I think the sauce is better without the papaya. I thickened the sauce with cornstarch and I sweetened it with honey. I substituted half olive oil for the butter to keep myself from further expansion. Excellent recipe. Thank You!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "babybunnies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1950576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-15T04:36:14.937Z",
                "reviewBody": "FANTASTIC!! I wish I could give this 10 stars! My husband called in the afternoon to say that he had just caught some dorado (that's what us So-Cal folks call mahi mahi) and I wanted to make something that was going to be different than the way I had eaten it before (plain grilled or raw with soy sauce). This was the most delicious fish I have EVER had--restaurant or home cooked--the best. Each and every flavor could be tasted and they combined so well. I had never cooked with habaneros before and DO NOT use more than two but they gave the perfect heat to the sweet fruits and coconut. I was worried that I wouldn't be able to taste the macadamia nuts but even they made themselves known in this recipe. Considering the fish was \"free\" (sorta) it wasn't too expensive of a meal but it is definitely worth the cost even if you have to buy the fish. This meal is worthy of heads of state and actually impressed my husband (he's a fisher not an eater of fish). I will make sure to keep these ingredients on hand during dorado season. Thank you for the superb recipe (and for making me look like a 5-star chef!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teri Carrillo-Fox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stayhomecook/"
                }
            }
        ]
    }
]