[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/347/bread/quick-bread/pumpkin-bread/",
                    "name": "Pumpkin Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228562/pumpkin-muffins-with-streusel-topping/",
        "name": "Pumpkin Muffins with Streusel Topping",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4562141.jpg",
            "width": 1441,
            "height": 960
        },
        "datePublished": "2020-06-19T03:50:57.000Z",
        "description": "This is a moist and hearty breakfast muffin made with fresh pumpkin, oatmeal, and brown sugar.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 1/2 dozen muffins",
        "recipeIngredient": [
            "2 ½ cups all-purpose flour",
            "½ cup rolled oats",
            "4 teaspoons pumpkin pie spice",
            "2 teaspoons baking soda",
            "1 teaspoon baking powder",
            "1 teaspoon salt",
            "1 ½ cups pumpkin puree",
            "1 cup brown sugar",
            "1 cup white sugar",
            "⅔ cup vegetable oil",
            "½ cup applesauce",
            "3 eggs",
            "1 teaspoon vanilla extract",
            "¼ cup raisins",
            "¼ cup packed brown sugar",
            "2 tablespoons butter, softened",
            "2 tablespoons rolled oats",
            "2 tablespoons all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease or line 18 muffin cups with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 2 1/2 cups flour, 1/2 cup oats, pumpkin pie spice, baking soda, baking powder, and salt together in a bowl. Whisk pumpkin puree, 1 cup brown sugar, white sugar, vegetable oil, applesauce, eggs, and vanilla extract together in a separate large bowl. Stir flour mixture into pumpkin mixture; mix well. Fold in raisins.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat 1/4 cup brown sugar with butter in a bowl until creamy and smooth. Whisk 2 tablespoons oats and 2 tablespoons flour, using a fork, into sugar-butter mixture until streusel topping is crumbly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the batter into the prepared muffin tin. Sprinkle each muffin with streusel topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 25 to 35 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Pumpkin Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BRETTNSHARA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.772182254196642,
            "ratingCount": 417,
            "itemReviewed": "Pumpkin Muffins with Streusel Topping",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "291.5 calories",
            "carbohydrateContent": "46.6 g",
            "cholesterolContent": "34.4 mg",
            "fatContent": "10.7 g",
            "fiberContent": "1.6 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "371.5 mg",
            "sugarContent": "28.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-23T20:31:23.397Z",
                "reviewBody": "I’m always pleased when I’m the first reviewer of a recipe and can write an enthusiastic and positive review.  I do have my criticisms of this recipe, but they’re no biggies and don’t detract from the resulting muffin at all.  First, don’t bother measuring out 1-1/2 c. of the pumpkin. After doing so there was so little left in the 15 oz. can that I just used all of it.  Second, I found that just 1/4 c. of raisins was skimpy – so I added another 1/4 cup.  My remaining criticisms are slightly more important.  As I looked over the ingredients and then the batter itself, I could see this was going to make way more than 18 muffins; and so it did.  I got 24 perfectly sized and rounded muffins.  The instructions to make the streusel are unconventional, so I chose to prepare it in the standard manner of mixing the flour and sugar, adding the butter until crumbly (I use a fork) and finally the oats.  Because there were 24 muffins, not 18, I was short of topping and had no motivation to drag things out again to make another batch.  I had enough to top 12 muffins very nicely and chose to leave the other 12 without. With or without topping, they’re lovely.  They’re light and fluffy, not heavy and dense.  Without streusel they’d be great with cream cheese frosting, but they’re just perfect as is.  They’re gorgeous too, and just as delicious as they are pretty, not overly sweet and lightly spiced, so the pumpkin unmistakably takes center stage.  Bonus:  the topping actually stays put!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-19T19:41:48.437Z",
                "reviewBody": "Was craving something with pumpkin and this did the trick! So moist and great flavor, the only thing I would do differently is add some chopped pecans to the streusel...other than that perfect!\r\nUpdate: I added a cream cheese filling to these muffins and it worked out perfectly! I made the filling out of: 8 ounces cream cheese, softened, 1 cup powdered sugar & 1/2 teaspoon vanilla. I then placed the mixture on plastic wrap and made a log out of it, wrapped it up and put in the freezer for a few hours and then just sliced it when I needed it to put in the center of the muffin batter. So good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jasmine Gonzalez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1656171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-05T01:07:58.07Z",
                "reviewBody": "If I were to rate this as a regular size muffin I'd give it 4 stars, but as a mini muffin this gets 5! I was able to make 12 regular muffins and 40 mini muffins. Make sure to double the streusel mixture. Also, I added about 1/2 cup of finely chopped pecans to the streusel; so glad I did! I found that the minis had the perfect balance of streusel-to muffin for optimal flavor; de-friggin'-liscious! I've Pinned the recipe and will be making these numerous times this fall. Great to make, store half to eat within a few days and freeze the rest. Then, as you want a muffin or two, remove from freezer and heat in microwave. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "travelintoto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5029319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-08T20:15:16.487Z",
                "reviewBody": "Oh my!  Just a few things, as noted in the other reviews and I feel the same way...double the raisins,  use the whole 15oz can of pumpkin, and you MUST double the streusel topping!  I ended up with 24 muffins, but I suppose it depends on the size of your muffin cups.  I filled my cups almost to the top, leaving only enough room for the topping and they came out looking great.  These really are fabulous muffins!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Conger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lissa13/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-10T00:25:51.263Z",
                "reviewBody": "Anyone who knows me knows I love to cook. My husband has been looking for a good pumpkin muffin. He was disappointed in Dunkin Doughnuts when he tried their pumpkin muffin. So I decided to give this one a try for him. This recipe was easy and taste awesome! He loved them as well as my daughter! You can't go wrong making theses muffins. Only thing different I did was to add a little more pumpkin spice, oatmeal and double the streusel topping( a must have). I am definitely pinning this one on pinterest.com!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Garvin-Owsley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1971287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-05T02:43:02.21Z",
                "reviewBody": "This is the perfect recipe for fall! But I did have to -triple- the streusel (admit it it's the best part!) to get a nice crunchy top to the 2 dozen mini and 9 full sized muffins the recipe made. I also had to improvise on the 'pumpkin pie spice' seeing as it's not something I keep in the cupboard but a combination of 2.5 tsp cinnamon 1 tsp ginger and 1/2 tsp cloves did the trick quite nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DalayceN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2332099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-03T11:43:38.143Z",
                "reviewBody": "We really loved these muffins but I wish Allreicpes.com had not taken away the Nutritional data at the bottom of all the recipes. As a Weight Watcher I need to have this information and it is a great loss to the site. In fact it was one of the features I originally liked most about the site and has now made this recipes site less useful and less appealing to me. In this day and age where most people are watching fat fibre carbs and protein content (and calories)more closely why would you discontinue this service? Please please reinstate it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon Windeyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8145038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-30T15:44:36.423Z",
                "reviewBody": "So, I've rated this recipe before but I can't find a way to easily update/edit it, so here's another go.  I wanted to update it to mention (since I am not a huge fan of cleaning my muffin tin and I don't like wasting paper & aluminum for the cups) that a single recipe makes two perfect loaves (my Pyrex dishes are 8.5\"x4.5\").  When I bake this recipe I use cream cheese filling (8 oz. cream cheese + 1 c. confectioner's sugar + 1 tsp vanilla) and add pecans to the streusel.  Plus, I really like the flavor of the raisins with the pumpkin so I increase them to 1/2 cup.  I still bake the loaves at 350 but it takes at least an hour in my oven to set up.  Hope this is helpful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/754386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-03T15:54:23.61Z",
                "reviewBody": "Great breakfast and easy! I made one dozen and thinned the rest of the batter for pancakes! The best pancakes I've ever had! My family agrees!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JJKADABA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/541768/"
                }
            }
        ]
    }
]