[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15949/trusted-brands-recipes-and-tips/argo-karo-fleischmanns/",
                    "name": "ARGO&reg;, KARO&reg;, FLEISCHMANN'S&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228883/bacon-and-caramelized-onion-rolls/",
        "name": "Bacon and Caramelized Onion Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1084616.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2012-08-30T19:16:47.000Z",
        "description": "These homemade yeast rolls with bacon, caramelized onions, and smoked Cheddar cheese will take center stage on the dinner table.",
        "prepTime": "P0DT0H55M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "12 rolls",
        "recipeIngredient": [
            "1 cup warm water (100 to 110 degrees F)",
            "1 envelope Fleischmann's® Active Dry Yeast",
            "1 tablespoon sugar",
            "1 teaspoon salt",
            "2 tablespoons extra virgin olive oil",
            "2 ¼ cups all-purpose flour, or more as needed",
            "12 ounces bacon slices",
            "1 large onion, thinly sliced",
            "¼ cup port wine",
            "1 cup shredded smoked Cheddar cheese",
            "3 tablespoons butter or margarine, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine water, yeast and sugar in a large mixer bowl. Let stand 5 minutes, until foamy. Add salt, oil and 1 cup flour; beat for 2 minutes at medium speed. Add enough remaining flour to make a soft dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Knead dough on lightly floured surface for 6 to 8 minutes, until smooth and elastic. Place dough in a well greased bowl, turning once to coat. Cover and let rise in a warm, draft-free place until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While dough is rising, cook bacon in large skillet until just browned but not crispy. Drain well and crumble or chop into small pieces. Reserve 2 tablespoons bacon drippings in skillet. Add onion and cook over medium heat for 15 to 20 minutes or until onions are lightly caramelized. Add Port wine and cook until very little liquid remains. Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch dough down. Roll into a 15 x 10-inch rectangle. Spread onions over dough and then sprinkle with bacon and cheese. Roll dough up from long side, jelly roll style. Pinch seams to seal. Cut into 12 equal slices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place each slice in a greased muffin pan, cut side up. Brush with butter. Cover and let rise in a warm, draft free place until nearly doubled, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated 375 degrees F oven for 20 to 25 minutes, until golden. Remove to wire rack to cool.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "ARGO&reg;, KARO&reg;, FLEISCHMANN'S&reg;"
        ],
        "recipeCuisine": [],
        "author": {
            "@type": "Person",
            "name": "Fleischmann's Yeast"
        },
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.709677419354839,
            "ratingCount": 31,
            "itemReviewed": "Bacon and Caramelized Onion Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "234.3 calories",
            "carbohydrateContent": "20.7 g",
            "cholesterolContent": "27.8 mg",
            "fatContent": "12.4 g",
            "fiberContent": "1 g",
            "proteinContent": "8.6 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "490.4 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-11-01T13:38:47.69Z",
                "reviewBody": "What a beautiful and delicious roll! As much as they sound time consuming, these rolls were fast, easy and addicting.  The dough was easy to work with, which is always a plus. I may have added a little more filling than it called for, but otherwise I kept everything the same.  A definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kori Lavertue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/korilynne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-30T01:27:24.587Z",
                "reviewBody": "I have found my Christmas morning rolls! These are delicious! I followed the recipe exactly and they came out perfect. I got 16 sweet caramelized onion (canned by DH), bacon and cheese rolls. Each ingredient you can taste distinctly. And, goodness you can eat with one hand. These would be great for breakfast. I served with Chicken noodle soup from this site. I am just learning to make breads and rolls using yeast and this recipe turned out fabulous in taste and texture. I will be making these for many meals. I also think it would be easy to tweak. How about cranberries, swiss cheese and toasted or candied walnuts? Yeah, think I'll try that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-19T15:26:33.067Z",
                "reviewBody": "Went a little different with this idea. I didn't have Port so I subbed Marsala. Added a good pinch of Italian seasoning with the onions. Intended to use 6 cheese Italian blend but rolled and cut and realized I forgot the cheese (sitting right in front of me) so sprinkled some on top instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMELA D. aPROpos of nothing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-21T19:44:03.223Z",
                "reviewBody": "These were absolutely great.  I made some changes (I always do, can't help it).  I added some shallots with the onions, then about half way through caramelizing I added some minced fresh rosemary.  I also used more of everything (bacon, cheese, onions) and added some fresh chopped chives for colour and flavour. I didn't have any wine, so I just skipped it...the onions are sweet and I don't think I missed much by leaving it out.  I would emphasize that the onions need at least 20 minutes over medium heat to be perfect...rushing will ruin them. I didn't have smoked cheese, so I used aged cheddar instead.  Flavour and texture was perfect.  The only minor criticism I can think of is that 3T of butter for brushing left me with at least 1T left wasted.   Oh, and I also cut them a bit too large and came out with 8 rolls....but they were cooked at 22 minutes...any smaller and I think they would have been over-done at that time.  Make sure the muffin tin is really well greased...I think I will try just baking them on a tray next time.  Thanks for the recipe, I will be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Starfish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4864773/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-14T13:28:23.307Z",
                "reviewBody": "These are not rolls you want to make when pressed for time, but they are so totally worth any time it takes!  I didn't use the smoked Cheddar cheese, but I will next time---the sharp Cheddar is good, but the smoked would be best!  Port wine, a fortified and thus storable wine, is perfect for these rolls.  I added a tablespoon of flour to my dough but could easily have used one more (it always depends on the atmosphere as to how much flour is needed).  The process of making these is just like making cinnamon rolls.  I would urge you when rolling out the dough to stretch the ball of dough to the length you want it and then roll it out on a well-floured surface from there.  It's hard to start it from a ball and hope to get it into a rectangle because it wants to keep finding its own shape!  I like to leave the rolls just slightly at the golden brown stage so that when I go to heat them in a hot oven without a cover they will brown just a tad more.  My house smelled so wonderful from baking these!  And it was the perfect complement to a ham and bean soup!  Oh, yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-20T17:14:53.007Z",
                "reviewBody": "These were amazing! The dough was actually very easy to work with- I found I needed to add a few more pinches of flour to keep my hands from sticking so keep your flour stash nearby. At the recommendation of another cook I did not have port wine so I substituted 1/4 cup red wine vinegar and a tablespoon of sugar to make mock wine. It turned out perfectly. If you have any leftover dough from the ends shape it into tiny loaves and bake them along side the rolls. They turn into wonderful mini loaves of bread for sandwiches!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LaDonna Langwell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mrswolfie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-19T02:34:57.557Z",
                "reviewBody": "I used my bread machine and made a basic dinner roll dough then followed steps exactly as listed. A and then some! Not complicated at all and they turned out beautifully! Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/551318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-20T15:11:15.68Z",
                "reviewBody": "These were ok nothing special. Usually everyone eats all of my rolls but I had leftovers with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Zola Griffin Paget",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/49258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-06T00:15:48.167Z",
                "reviewBody": "I forgot to add in the cheese before rolling these up but I did top with a little cheese and these were really good as is. Next time I make these the cheese will add even more. I added in garlic to my onions and smoked paprika to the flour mixture because I didn't have smoked cheddar. I was looking for a roll to go with grilled type food and these are the perfect fit. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "duboo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/duboo/"
                }
            }
        ]
    }
]