[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15949/trusted-brands-recipes-and-tips/argo-karo-fleischmanns/",
                    "name": "ARGO&reg;, KARO&reg;, FLEISCHMANN'S&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228886/cranberry-wreaths/",
        "name": "Cranberry Wreaths",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F912945.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2012-08-30T19:20:22.000Z",
        "description": "Cranberry-filled wreaths make a festive addition to your holiday brunch table.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "12 wreaths",
        "recipeIngredient": [
            "3 ½ cups all-purpose flour",
            "¼ cup sugar",
            "1 envelope Fleischmann's® Active Dry or RapidRise Yeast",
            "1 teaspoon salt",
            "¾ cup evaporated milk",
            "¼ cup butter or margarine",
            "¼ cup water",
            "2  large eggs eggs",
            "1 cup finely chopped cranberries",
            "½ cup sugar",
            "1 ½ teaspoons grated orange peel",
            "1 cup powdered sugar, sifted",
            "4 teaspoons evaporated milk, or as needed",
            "½ teaspoon Spice Islands® Pure Vanilla Extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In large bowl, combine 1-1/2 cups flour, sugar, undissolved yeast, and salt. Heat milk, butter, and water until very warm (120 degrees  to 130 degrees F). Gradually add to flour mixture; beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add eggs and 1/2 cup flour; beat 2 minutes at high speed, scraping bowl occasionally. With spoon, stir in enough remaining flour to make stiff batter. Cover tightly with plastic wrap; refrigerate 2 to 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cranberry filling: In medium saucepan, combine chopped cranberries, 1/2 cup sugar, and 1 1/2 teaspoons grated orange peel; bring to boil over medium heat. Reduce heat; simmer, stirring frequently, for 5 minutes or until very thick. Remove mixture from heat, and let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove dough from refrigerator. Punch dough down. Remove to lightly floured surface. Roll to 21 x 12-inch rectangle. Spread Cranberry Filling over dough to within 1/2 inch of edges. Fold crosswise in thirds, to enclose filling, making a 12 x 7-inch rectangle. Press edges to seal. Cut dough into 12 (1-inch) strips. Holding ends of each strip, twist three times. Pinch together ends of each twisted strip to form wreaths; place on greased baking sheets. Cover; let rise in warm, draft-free place until almost doubled in size, about 30 to 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F for 12 to 15 minutes or until done, switching positions of sheets halfway through baking time for even browning. Remove wreaths from baking sheets; let cool on wire racks. Frost wreaths with Powdered Sugar Icing, if desired.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Powdered Sugar Frosting: In bowl, combine powdered sugar, 4 to 5 teaspoons evaporated milk, and 1/2 teaspoon SPICE ISLANDS Pure Vanilla Extract. Stir until smooth\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "ARGO&reg;, KARO&reg;, FLEISCHMANN'S&reg;"
        ],
        "recipeCuisine": [],
        "author": {
            "@type": "Person",
            "name": "Fleischmann's Yeast"
        },
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6,
            "ratingCount": 20,
            "itemReviewed": "Cranberry Wreaths",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "297.8 calories",
            "carbohydrateContent": "54 g",
            "cholesterolContent": "46.3 mg",
            "fatContent": "6.4 g",
            "fiberContent": "1.6 g",
            "proteinContent": "6.3 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "252.9 mg",
            "sugarContent": "25 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-12-05T04:30:00.713Z",
                "reviewBody": "I had left over cranberry sauce from Thanksgiving I needed to use up and this was a great way to do it! So obviously i didn't make the filling and can't say how that turned out. I did add the orange zest to the cranberry sauce and the orange flavor is just right. I did a double batch and did one as the wreaths and the other rolled up like cinnamon rolls. Both worked well. I only had half the amount of evaporated milk but used whole for the rest and it was fine. Next time I will try using orange juice instead of Vanilla in the frosting for an orange flavor. Don't be afraid of the flour on the counter top. You don't want a thick layer but if there isn't enough flour it's not going to be very easy to fold or roll the dough. The recipe says it makes a \"thick batter\". They mean \"soft dough\" so if using a mixer use the bread hooks at least once you start to add the final flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen E.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4639049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-01T02:56:06.873Z",
                "reviewBody": "Perfect for the holidays! I love how these come together. They look so impressive when they're done like a lot more time and effort went into them. I brought these in to work and they were gone in under 10 minutes! I made the recipe exactly as written. The only thing I might change next time is to use a bit less orange peel. Make sure you chop the cranberries really fine. It'll make it easier to spread the filling. For the icing I used vanilla-nut extract. Nice combo of flavors!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "France C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/francecevallos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-04T03:42:22.07Z",
                "reviewBody": "This was an adventure! First- I was out of AP flour but since I have been dabbling in gluten free baking I had some rice flour on hand. I subbed that for the AP flour and it resulted in a lovely dough but one that did not rise and also there was no way I was folding it without it cracking. Second- in a strange twist I had no oranges (when I almost always have them) but I did have Cointreau (when I almost never have liquor)...so I subbed that in for the orange. Those were my only ingredient changes. After a rather comical couple of minutes trying to chop the rollie-pollie cranberries I put them in my blender to chop them. I was careful to pulse until finely chopped but not completely mashed. Now I was at a loss as to what to do with my dough. Ultimately I rolled it into balls flattened the balls into rounds then spread some cranberry filling on half the rounds and topped with the remaining rounds. I crimped them together brushed with an egg wash and baked them. Then I topped them with the frosting which I added a 1/2 teaspoon of almond extract to in addition to the vanilla. These turned out incredibly amazingly good- kind of like a super fancy Pop-Tart! I have every intention of making these again the proper way but I am so happy I was able to turn what could have been a failure into a delectable success. I do believe when I make this again I will still sub the Cointreau for the orange- it gives such a lovely depth of flavor. Overall a must try!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-22T02:15:21.533Z",
                "reviewBody": "These were really good. I do think that next time I make these I will add a few tablespoons of orange juice to the cranberry filling to make it more sauce-like instead of dry. With no liquid in the filling it didn't really \"spread\" well. I also will roll them up and slice them like a cinnamon roll instead of the wreath shape. With young children time is precious!! They were delicious. I will definitely make them again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5565815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-04T10:48:09.657Z",
                "reviewBody": "These took a bit of time but were well worth it in the end! Every part of it tasted wonderful! The bread was light and the twist was beautiful to look at. I skipped the icing and they were sweet enough with out them. Because of where I live I had to use dried cranberries which I added some liquid to and allowed to soak while I made the dough (also had to skip the oranges though I think it would only add another wonderful dimension to the taste!) I wasn't sure putting the dough in the fridge would let it rise but it did! Kids hubby and company all loved them!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7744063/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-14T06:34:08.923Z",
                "reviewBody": "I read every review before I started. You were all very helpful. Surprise! The dough does rise in the refrigerator. I would recommend proofing the yeast. If the milk mixture is too hot you'll waste time and ingredients. (Like I did.) Do use the bread hooks. Cranberries are not available where I'm based so I used a one cup jar of cranberry sauce and added one teaspoon of orange zest and 1/4 cup of sugar. To answer Kate's question.... yes you fold it like a brochure so there is one layer on the bottom and two layers that overlap on top. They turn out just fine! This is a very nice holiday breakfast bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cynthiaross/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-15T12:28:22.947Z",
                "reviewBody": "Delicious! I made these with a whole wheat dough. I cooked the cranberries with honey and grated orange peel until it looked like the juice had evaporated. These were so good that I didn't want to frost them! These are my newest Christmas tradition!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sueb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2719400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-15T04:42:32.417Z",
                "reviewBody": "Came out great. I put the cranberries in the food processes instead of chopping. Much quicker easier and came out perfect sized. I refrigerated the dough for 3 hours. And proofed next to the warm oven for about half hour. I had to triple the cranberry concoction and glad I did because one batch would not have been enough for the amount of dough. The directions for this recipe could have been t together better but overall great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kendrapreston",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4890764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-24T19:18:56.733Z",
                "reviewBody": "they are delicious but what a mess! All my filling scooshed out so I made the wreaths and scooped the filling into the middle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lettuceleaf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3909564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-19T00:42:45.653Z",
                "reviewBody": "They looked amazing but they were Not good at all",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "junoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12834297/"
                }
            }
        ]
    }
]