[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17532/desserts/fruit-desserts/blueberry-desserts/",
                    "name": "Blueberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229029/sour-cream-blueberry-coffee-cake/",
        "name": "Sour Cream Blueberry Coffee Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F896162.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2020-06-19T03:51:25.000Z",
        "description": "This is a spin on traditional coffee cake that me and my fiance love!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "1 9x13-inch cake",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "⅛ teaspoon salt",
            "2 cups white sugar",
            "1 cup butter",
            "2 eggs",
            "1 cup sour cream",
            "½ teaspoon vanilla extract",
            "1 ½ cups packed brown sugar",
            "1 cup all-purpose flour",
            "3 tablespoons butter, melted",
            "2 teaspoons ground cinnamon",
            "2 cups fresh blueberries",
            "1 cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 2 cups flour, baking powder, and salt in a bowl. Beat white sugar and 1 cup butter with an electric mixer in another bowl until light and fluffy; beat in eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Stir in sour cream and vanilla extract. Mix flour mixture into butter mixture until just blended; spread half the batter into prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix brown sugar, 1 cup flour, melted butter, and cinnamon in a bowl until mixture resembles a coarse crumble. Sprinkle half the crumbles and half the blueberries over batter in baking dish. Spread remaining half of batter over blueberries and top remaining crumbles, blueberries, and pecans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 45 to 50 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Blueberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mrs.Encinas:)"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.398773006134969,
            "ratingCount": 163,
            "itemReviewed": "Sour Cream Blueberry Coffee Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "639.5 calories",
            "carbohydrateContent": "90.2 g",
            "cholesterolContent": "87.7 mg",
            "fatContent": "30 g",
            "fiberContent": "2.5 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": "14.9 g",
            "servingSize": null,
            "sodiumContent": "224.7 mg",
            "sugarContent": "63 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-10-03T20:11:43.63Z",
                "reviewBody": "I love/hate this cake, which I’ll have to call my Ugly Duckling Cake.  The instructions for assembly just didn’t work for me – nor did my alternative, tho’ I believe it’s the better of the two options.  The common problem with both methods is that there’s just not enough batter to divide in half and “spread.”  If you “spread” enough batter to cover the bottom there’s not NEARLY enough to “spread” on the top.  I added the blueberries to the batter rather than in two layers, and it would have been an even bigger nightmare to “spread” had I not.  As I tried to “spread” the second half of the batter, the batter took the topping WITH the offset spatula.  I tried my best I but I nearly pitched the whole thing in sheer frustration and disappointment.  But I figured I had nothing more to lose except the cost of the electricity to bake this mess. Topping it with the remaining cinnamon mixture camouflaged the disaster underneath, but I was anxious to see what it looked like inside.  It took longer to bake than indicated, and now I’m calling this a complete and total failure.  I let it cool, cut into the slightly overbrowned topping, carelessly plopped a piece of the cake onto a plate and tasted…. it was heaven.  Moist, buttery rich, with a sweet and flavorful, cinnamony topping.  No, I’m not throwing this out.  No way. It might not meet my standards in terms of prettiness for Hubs to take to a meeting tomorrow as planned, but we’ll enjoy every crumb of this difficult and ugly cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-18T15:36:10.433Z",
                "reviewBody": "For everyone who had trouble getting it to spread out and look pretty:\nI read the reviews for this beforehand, so I knew what to expect when layering the coffee cake, and I took a risk. I added about a tablespoon of milk to the 2nd half of the cake batter after spreading the first down, and that thinned it out just enough to spread out easily without affecting the way it baked. \nThis was an excellent coffee cake! Rich, buttery, nice texture, definitely an A+.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheFlamingAmarant",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9817625/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-27T20:16:45.28Z",
                "reviewBody": "Sooo good! Definitely going to make this again!  When spreading the batter and layers, there was a point where I thought the recipe didn't make enough batter for the pan, but I decided to trust the recipe and it turned out great!  \"Spreading\" the batter after putting the layer of berries and sugar/butter crumbs was a little tricky...but it turns out fantastic!  I used nonfat plain Greek yogurt instead of the sour cream; more nutritious and less fat.  Definitely recommend this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sumpuck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9987124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-09T01:04:06.007Z",
                "reviewBody": "I like homemade blueberry muffins but rarely eat fresh blueberries (tart texture). Anyway before I made this I reviewed the comments and agree it would have been a challenge to divide the batter and spread the top layer. So I made the batter then folded the blueberries into it. Then I put the crumble topping on top before baking (I should have halved the topping bc it was a bit thick and crunchy). It was also easy to make. I made this for my fellowship meeting tomorrow and HAD to try it first. I loved it. The cake was so moist and the blueberries were delicious. It was like eating a fluffy blueberry streusel muffin. Brilliant!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DenaJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10852592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-16T03:23:53.033Z",
                "reviewBody": "This cake is delicious, but allow me to make a suggestion that will make your life a lot easier if you enjoy this cake.  Don't bother dividing the batter.  Just pour the batter into the pan.  Spread it.  Add the blueberries.  Add the topping.  Bake!  It's beautiful, and delicious and not a difficult to prepare hot mess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon Winland Fox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13922530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-21T23:50:20.093Z",
                "reviewBody": "This is a very delicious coffee cake. I read the reviews about the batter being hard to halve and spread. What I did was drop big spoonfuls of batter in the bottom of the greased pan, then bring the globs of batter together. I followed the recipe exactly with the exception of how to halve the batter in the pan. I did the exact same thing with the other half of the batter. I had no problems with it being done this way. I took off one star because this took an hour and twenty-five minutes to bake. At the one hour mark, it wasn't baked in the center. When this had cooled slightly, it was moist, rich and buttery tasting. This really is a great and easy recipe that I will be making again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "robcangel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4775077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-02-19T07:23:42.867Z",
                "reviewBody": "This is the best Blueberry Cake recipes I have ever made and tasted!  I didn't have any issues with making the layers, I simply plopped the blueberries on top of the first layer of batter, creating a deep ribbon of blueberry in the middle and did the same with the remaining batter.  It doesn't have to be a smooth layer, there is baking powder in the mix, and it helps puff up the batter and topping.  I added a little bit of nutmeg and mace, as these are alway my fav spices with cinnamon.  Don't be put off by the reviews...this is a keeper!\nI just made it again tonight, with some extra blueberries, and subbed part of the sour cream for vanilla yogurt.  Creamy and rich, and a little less fat.  I would like to tweak this recipe to get the fat and calories down,  maybe next time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs McManamon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mnmsfavorites/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-10T13:47:00.157Z",
                "reviewBody": "Whenever I make this I always make sure to use frozen blueberries instead of fresh.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Walter's Bride",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2341868/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-30T14:09:44.827Z",
                "reviewBody": "I have to agree that it is slightly tricky to divide the batter when making this recipe. When it comes to the second layer of batter I put dollups of batter over the area and then spread it. It seemed to work. After placing all the ingredients in the 9 x 13 I baked the coffee cake for 45 to 50 minutes and when I was pulling it out of the oven it was still jiggling in the middle so I knew it wasn't done. I had to bake this cake over an hour and maybe 10 minutes more to get it done! I brought it to work and they loved it. It is very moist and yummy. I may make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mjmalone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10525751/"
                }
            }
        ]
    }
]