[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/389/desserts/cakes/coffee-cake/",
                    "name": "Coffee Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/85272/cream-cheese-filled-coffeecake-with-fruit-preserves-and-crumble-topping/",
        "name": "Cream Cheese-Filled Coffeecake With Fruit Preserves and Crumble Topping",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7576297.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:12:08.000Z",
        "description": "If you understand how to vary the recipe, you only need one basic coffeecake in your repertoire. My all-purpose version consists of four components: batter, cream cheese filling, fruit preserves and crumb topping. The last three can be changed (or in some cases, omitted) to create a custom cake.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 (9 inch) square cake",
        "recipeIngredient": [
            "¾ cup all-purpose flour",
            "½ cup dark brown sugar",
            "½ teaspoon ground cinnamon",
            "6 tablespoons butter, melted but not hot",
            "½ cup of your choice - coarsely chopped nuts (walnuts, pecans, almonds), old-fashioned oatmeal or sweetened flaked coconut",
            "8 ounces softened cream cheese",
            "½ cup sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "1 ½ cups all-purpose bleached flour",
            "1 ¼ teaspoons baking powder",
            "¼ teaspoon baking soda",
            "¼ teaspoon salt",
            "5 tablespoons butter, at room temperature",
            "½ cup sugar",
            "1 egg",
            "¼ cup plain low-fat yogurt",
            "½ cup of your choice - raspberry or strawberry jam; peach, cherry, or pineapple preserves; apple butter; orange marmalade or mini chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Adjust oven rack to lower-middle position and heat oven to 375 degrees. Spray a 9-inch square metal baking pan with cooking spray. Fold a 17-inch length of heavy-duty foil to 8 1/2 inches wide and fit in the pan bottom and up 2 sides, so you can use the foil overhang as a handle to pull the baked cake from the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Topping: Use hands to thoroughly mix ingredients in a medium bowl, pressing together to form large clumps; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream cheese filling: Beat cream cheese and sugar with an electric mixer until thoroughly mixed. Beat in egg and vanilla until smooth; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cake: Mix flour, baking powder, baking soda and salt in a medium bowl; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat butter and sugar with an electric mixer set on medium-high until light and fluffy. Beat in egg until smooth. Beat in half the dry ingredients, then the remaining yogurt. Beat until ingredients are fully incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread batter evenly over prepared pan. Spread cream cheese filling over batter. Dollop fruit filling (or sprinkle chocolate chips) over cream cheese filling. Finally, sprinkle evenly with crumble topping, pressing on it lightly to adhere.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake until batter is fully set and topping is golden brown, about 45 minutes. Transfer pan to a wire rack to cool for 5 minutes. Run a thin-bladed knife around the sides, then use foil handles to pull cake from pan onto the wire rack. Cool to room temperature and serve. Can be covered with foil and stored at room temperature for one day.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Coffee Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ben S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.183333333333334,
            "ratingCount": 60,
            "itemReviewed": "Cream Cheese-Filled Coffeecake With Fruit Preserves and Crumble Topping",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312.5 calories",
            "carbohydrateContent": "38.6 g",
            "cholesterolContent": "60.1 mg",
            "fatContent": "16.2 g",
            "fiberContent": "0.8 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "8.6 g",
            "servingSize": null,
            "sodiumContent": "205.4 mg",
            "sugarContent": "23.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-09T19:54:53.463Z",
                "reviewBody": "A good basic coffee cake recipe that should be in everyone's file. Made as directed (fruit added to taste) it works well. Cannot understand how a recipe can be rated when someone takes is apart by the seams and doesn't even follow it. Sorry to complain but this is annoying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EILISH40",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1446852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-01T05:35:57.81Z",
                "reviewBody": "Ok so I made so many changes but it turned out great so I will share them all. First for the cake I used 1/2 cup of un-diluted frozen orange juice concentrate. I creamed that in with the butter sugar and eggs. I also added a couple tsps of vanilla at this point. I increased the sugar to 3/4 cup because I used frozen cranberrys as the fruit and as we all know they can be VERY tart. I used sour cream instead of yogurt because it's all I had on hand. Finally I stired the frozen cranberrys (About 1 cup) right in to the batter. I greased a spring form pan and poured the batter into it. I creamed the cream cheese mixture together as directed and poured that over the batter. I added some nutmeg and probably twice as much butter as called for to the crumb topping and sprinkled that on the top. (Note: next time I make it I will deffinetly use white sugar instead of brown for the crumb topping) I baked it at 350 for probably 45-60 mins. Once out of the oven let cool for at least an hour before removing the outer part of the spring form pan if you choose to use it. It works wonderfuly but needs time to set. Anyway turned out FAB! Served it with some good vanilla ice cream and every one LOVED it! Play with this recipe to make it work for you. It's deffinetly worth it!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsey Wolnowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-29T18:54:08.64Z",
                "reviewBody": "There is a problem with the directions of this recipe. Step 5 should read: Beat in half the dry ingredients followed by half the yogurt. Beat in the remaining dry ingredients then the remaining yogurt. I made it using orange marmalade for the fruit filling and overall it was pretty good. I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BCOMP10444",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/482024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-25T14:58:21.077Z",
                "reviewBody": "I will not be making this again. I pretty much followed the recipe but I added some vanilla and butter flavoring to the cake part because other cooks said it was bland. It wasn't bland so much as it was crusty and I had thought it would be cakey. The cream cheese filling was good and it did set as it cooled not runny at all in fact I could have cooked it less and it would have been fine. The crumb topping wasn't very crumbly; the butter just absorbed the flour until it was a paste. Cinnamon and brown sugar were not the right offsets to the flavor of the cream cheese. I would instead sprinkle the cake with powdered sugar a la Entenmenns cream cheese coffee cake. I may try the filling with another coffee cake recipe or i will just keep looking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1348131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-19T16:58:37.067Z",
                "reviewBody": "Not always a successful baker so followed the recipe EXACTLY using the fruit preserves and cream cheese options. Turned out perfect. Guest loved the crumbles on top nice and plentiful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Yoho",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/222348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-09T00:02:21.047Z",
                "reviewBody": "I was scared to try this, but glad I did!  It is SO good!  I brought it to easter breakfast and everyone loved it!  I was very nervous when spreading the batter onto the foil, it seemed very sticky, but I went for it anyway, and it turned out beautifully!  This is a real keeper and I will be making it again.  Everyone was impressed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lexie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1890687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-23T09:20:07.263Z",
                "reviewBody": "This was a rich coffee cake and very good. I used chocolate chips for the flavor layer and oats in the topping. Next time I'll try it with jam. The crumble topping is delicious but burns very easily so be careful. The cream cheese layer is wonderful and almost makes the cake taste like a chess square. A note about the cake batter: it will be very thick and seem almost too dry when you are mixing it but will bake up nicely. The cake itself is moist when it is served hot but does dry out quickly. That's OK just serve it with coffee!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JenMusic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1528217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T17:45:12.873Z",
                "reviewBody": "The cheese is the best part I will propably make this again with a different batter. I always think coffeecake relies too much on the topping for flavor so I always add a little cinnamon and nutmeg to the batter and I did one and half on the cheese filling with chocolate chips on one side and cherry preserves on the other. Note about preserves - the amount listed may not provide much flavor. I would suggest fruit instead frozen fresh or re-hydrated. Ditto other's comments on the topping burning. The batter cooked up fine but was so thick I had trouble getting it in the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca Crist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/600966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-12T15:49:50.843Z",
                "reviewBody": "Not bad for my first time it is nice and moist and the filling is awsome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Surita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2885533/"
                }
            }
        ]
    }
]