[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/359/bread/quick-bread/fruit-bread/",
                    "name": "Fruit Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/343/bread/quick-bread/fruit-bread/banana-bread/",
                    "name": "Banana Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229353/sour-cream-banana-bread/",
        "name": "Sour Cream Banana Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1129627.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2020-06-19T03:51:36.000Z",
        "description": "This bread is a family favorite. It is very moist, freezes well, and makes a great addition to school lunches with peanut butter spread on a slice.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 5x9-inch loaf",
        "recipeIngredient": [
            "4 very ripe bananas, divided",
            "1 cup white sugar",
            "¾ cup butter, melted and cooled",
            "2 large eggs",
            "⅓ cup sour cream",
            "1 teaspoon vanilla extract",
            "2 cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "½ teaspoon salt",
            "½ cup chopped walnuts",
            "2 teaspoons white sugar",
            "½ teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 5x9-inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mash 2 bananas in a bowl with a fork. Place remaining 2 bananas in a separate bowl with 1 cup sugar and beat the bananas and sugar with an electric mixer until creamed and fluffy, 3 minutes. Beat in melted butter, eggs, sour cream, and vanilla extract until thoroughly combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour, baking powder, and salt together in a bowl and stir the flour mixture into banana-sugar mixture. Fold in mashed bananas and walnuts. Pour batter into prepared loaf pan and tap the pan on the counter several times to remove any air pockets. Stir 2 teaspoons sugar with cinnamon in a small bowl and sprinkle the cinnamon sugar over the top of the loaf.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until bread is golden brown on top and set in the center, 1 hour and 15 minutes; rotate bread pan in oven halfway through baking. Cool in the pan for 10 minutes before removing to finish cooling on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Fruit Bread Recipes",
            "Banana Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "grandma-diane"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.624242424242424,
            "ratingCount": 165,
            "itemReviewed": "Sour Cream Banana Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "338.8 calories",
            "carbohydrateContent": "43.5 g",
            "cholesterolContent": "64.3 mg",
            "fatContent": "17.2 g",
            "fiberContent": "2 g",
            "proteinContent": "4.7 g",
            "saturatedFatContent": "8.8 g",
            "servingSize": null,
            "sodiumContent": "255.6 mg",
            "sugarContent": "22.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-12-30T18:22:55.29Z",
                "reviewBody": "This banana bread was amazing!!!!  It was so moist with a crisper top.  I've tried quite a few banana bread recipes and usually go for the ones with high ratings and a lot of people that have tried it but I decided to try this one because it  sounded interesting.  I thinking creaming half the bananas with the sugar was a great idea.  The cinnamon and sugar on top also added a great flavor.  I split up the mixture and put it into 2 5x9 pans.  They made smaller loafs and I cooked it for 55 minutes total.  I did put in a teaspoon of cinnamon because I love it.  I did rotate halfway as well.  I will be using this as my future banana bread recipe... it was that good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bdent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6388028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-31T01:07:27.163Z",
                "reviewBody": "Tried this recipe today. Oh my God is it good! Nice touch to sprinkle cinnamon sugar over the top before baking. Smelled SO good baking on the oven. My teenagers asked me when they could have a piece even before it was done baking. I baked it for an hour and 15 minutes like the recipe said I think next time I will try taking it out 5 or 10 minutes before that as the top looked like it was starting to get too dark and the crust was a bit too hard for me. Otherwise a GREAT recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5237015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-20T00:00:52.1Z",
                "reviewBody": "Best I've tried, and believe me, I've tried a bunch!!  I think the secret it the creaming of the two bananas with the sugar.  Really infuses the flavor.  Good going!  Did not need to tweek this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiegirl40",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2168957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-20T03:29:29.663Z",
                "reviewBody": "Okay first off let me start off by saying I've tried pretty much every carrot cake recipe known to man from this site and many others. I've never left a review because I'm usually just too lazy to be honest so this is a first for me. This recipe is AMAZING. Every time I've made banana bread there is always something that seems to be lacking. Too overdone on top not enough banana flavor not moist enough it's never just been PERFECT. Well THIS is. I'm sitting here laughing because when I gave a piece to my husband to try after it was done I was literally jumping up and down saying YES! YES! FINALLY! That's how perfect it is. I know some of the other recipes on here may stand out due to their bazillion stars but trust and believe this is one serious underrated banana bread! TRY IT! You will NOT be disappointed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12956338/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-02T16:12:26.07Z",
                "reviewBody": "I only had three banana's but it worked great. Everyone loved it. I tried my homemade vanilla for the first time and doubled the recipe amount because we love vanilla. Don't know if that made any difference or not but this is an easy and simple delicious recipe. Highly recommended.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kewpee Kid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7573963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-09T20:51:28.477Z",
                "reviewBody": "This is seriously the worst banana bread recipe I have EVER made. It's so heavy you could throw it at somebody's head and they'd get a concussion. I am a very good baker and I would NEVER make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Bomboy Gaudreau",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12562099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-03T20:59:52.293Z",
                "reviewBody": "Best banana bread I have made. A recipe wonderful banana flavor and a moist fluffy bread. This will be my go-to from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mcmillan212",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10873141/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-22T15:57:22.49Z",
                "reviewBody": "I prefer muffins instead of a loaf when I make banana bread when it will be eaten at home. It's easier to freeze muffins & pull out just what will be eaten. However muffins tend to be drier even if I reduce the oven temp or the baking time. About 2 months ago I had 4 very ripe bananas & all of my recipes called for 3. Not wanting to throw away the extra banana I thought to search for a recipe that called for 4. I found this recipe & since the bread was going to a church function I made a loaf. Best darn banana bread I ever did eat.( Yep I'm a Georgia girl.) Not sure if it is the extra banana the sour cream or both but the moistness & texture was awesome. Of course I couldn't wait to make muffins & they turned out great. Right out of the oven they were slightly crisp & chewy on the outside & moist on the inside. When I take one out of the freezer I microwave it for 30 sec. Then put it in the toaster oven to crisp the outside. By the way I threw away all of my othe recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "driggersd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6343944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-27T11:31:32.263Z",
                "reviewBody": "I was super excited to give this recipe a shot but it is definitely not what I was expecting. Made as instructed to ensure it came out with the same results. It is much too dense/heavy for my liking. Heavier would have been welcomed but it has to have some fluff to it as well. I bake a lot and don't think I would use this again as written. However it DOES have terrific flavor to it and it doesn't fall apart on you! Those are two things I did love about this recipe. I might talk to some others and see what I could do to tweak this recipe to try it again with better results because it has a lot of potential. I would like it a whole lot better if it wasn't so flat & so heavy. It doesn't bake like a real loaf of bread and needs something to help fluff it a bit and get it to raise up better (maybe baking soda and less egg?) because it didn't rise much at all when it baked. It does have great potential with great flavor and no mess which I did love but it just needs the fluff factor and it would be great! Also loved the idea of sugar & cinnamon sprinkled on top... great addition!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MLefers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mlefers/"
                }
            }
        ]
    }
]