[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229878/wonderful-gluten-free-white-bread/",
        "name": "Wonderful Gluten Free White Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1422275.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "2020-06-19T03:52:03.000Z",
        "description": "Like most people with celiac, I find white bread is one of the foods our gluten-free family misses the most. I created this after much trial and error in trying to make a bread that tastes like real wheat bread.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "1 9x5-inch loaf",
        "recipeIngredient": [
            "1 tablespoon active dry yeast",
            "3 tablespoons white sugar",
            "1 ¼ cups warm water",
            "1 ⅓ cups rice flour",
            "⅔ cup sorghum flour",
            "½ cup potato starch",
            "½ cup cornstarch",
            "⅓ cup vegetable oil",
            "3 eggs",
            "1 tablespoon xanthan gum",
            "1 ½ teaspoons salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease a 9x5-inch loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast and sugar in warm water in a bowl. Let stand until the yeast softens and begins to form a creamy foam, about 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine yeast mixture, rice flour, sorghum flour, potato starch, cornstarch, vegetable oil, eggs, xanthan gum, and salt together in the bowl of a stand mixer; mix on medium speed until incorporated, about 2 minutes. Spoon dough into the prepared loaf pan. Smooth the top of dough with the back of a wet spoon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place dough in a warm place until it has risen just over the top of the loaf pan, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until loaf is medium golden brown, about 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Christy E."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.591666666666667,
            "ratingCount": 120,
            "itemReviewed": "Wonderful Gluten Free White Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "222.3 calories",
            "carbohydrateContent": "34.2 g",
            "cholesterolContent": "46.5 mg",
            "fatContent": "7.6 g",
            "fiberContent": "2.8 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "339.5 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-05-04T18:12:49.557Z",
                "reviewBody": "I couldn't believe it but this bread really is great no matter how you slice it.  I've made numbers of recipes over the years and haven't found one like this.  I've made three loaves of this recipe so far and each has been delicious.  The first attempt was by the book, so-to-speak, except I use fresh yeast (between 18-20 grams) because dry yeast is not available to me and white rice flour.  Second attempt I subbed half white half brown rice for the rice flour but maintained the other types of flours/starches and topped with buckwheat, brown rice and millet flakes.  Third attempt (the one in my picture) 1/2 white and 1/2 brown as well as tapioca for corn starch and guar gum (equivalent doses) for the xanthan (ran out of a few things).  In the second and third attempt I used 2 TBSP of low fat powdered milk and it has a fluffier texture to it and tossed some sesame seeds on top.  Will continue to use this third recipe.  Also, I never used an electric mixer.  All done by hand, much easier I think.  For those who weigh:  181 grams rice flour (my brown and white rice flours weigh about the same)+70 grams sorghum+75grams potato starch+63 grams tapioca.  The conversions on this site seem to go by volume not weight.  Definitely a keeper for basic bread recipe.  Toasted, sandwiches or just plain, simply a winner!  Thanks to Christy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Buckwheat Queen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/melaniegiovenzana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-07T02:17:38.713Z",
                "reviewBody": "Made this for my gluten intolerant Hubby. Good taste! A little dense, don't know if that is normal or not, but still tastes good! I had two pieces. I made it in my bread maker, it has a GF setting. I used GF all purpose flour that already had Xanthum gum in it, so I just added up all the flours and put that many cups of my all purpose in. I also used cocont oil in place of the vegetable oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Meg0525",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4193103/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-11T01:43:45.487Z",
                "reviewBody": "This gluten free recipe for white bread is simply delicious. This was the first \"yeast\" recipe for gluten free bread that I have made. Found it to be simple and straight forward.  The only change was using brown rice flour since I had no white rice flour. I stronly suggest the use of a stand mixer with the bread blade since gluten free dough is much more sticky than traditional yeast bread doughs. \nThe bread holds up very well for sandwiches and makes a wonderful toast for breakfast. I like very much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3234821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-16T21:35:51.527Z",
                "reviewBody": "This bread is the best I've found. I cut it into slices as soon as cool. I wrap a few together in plastic wrap and put each bundle together in gallon ziplock bag. These all go in freezer.  The best toast!!!   Ive made grilled cheese, french toast, and sandwiches and its great. Here i thought I had to give up bread!!!  : )  i use a gluten free baking flour instead of all the ones stated. Much more easy. Just 3 cups of gluten free baking flour!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11244158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-06T22:37:27.79Z",
                "reviewBody": "I've been gluten free for close to two years now. I've always bought Udi's bread, which is ok, but not anything really great. I then bought bread that was $8 a loaf. It felt wet and it was just gross. So this was my first attempt ever making Gluten Free bread because I've been trying to get a feel for baking again.  Well, I can tell you this recipe is worth a shot. Most people who have celiac are allergic to soy and diary, so this was nice because I didn't have to try and sub anything. I made this bread and I only added baking powder, 1/2 tsp to 1 tsp. My daughter and I (GF) thought this was great and so good. It doesn't look like normal bread dough, it has a very wet look. Don't mess with it. I'll never buy bread again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "flower_34",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6699570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-06T20:20:45.033Z",
                "reviewBody": "I made this bread yesterday for a friend who is gluten intolerant. She loved it and said it tasted very good. I followed the recipe exactly using the white rice flour I am going to try with brown rice flour per her request next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Citygirlincountry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/myboysmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-21T03:54:22.18Z",
                "reviewBody": "We went gluten free a week ago (due to Celiac disease). We have eaten better and had more delicious food than we have ever had (so far all from Allrecipes.com). I have already made this bread 3 times. It is AWESOME! I have found it works better using my 9 cup food processor than a mixer. Also, warming the oven (100 degrees and then shutting the oven off) and leaving the bread in the oven for an hour makes it rise much better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris Kiser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13773131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-05T02:49:22.8Z",
                "reviewBody": "Just made this recipe only I used Flaxseed meal instead of Xanthan gum, and Tapioca flour instead of Sorghum flour.  I was scared at how runny the dough seemed but remembered reading about gluten free dough looking like this. It turned out great!  I am very impressed since this was my first attempt at making homemade gluten free bread.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lisawilz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11202366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-12T04:10:37.443Z",
                "reviewBody": "My 8 y/o daughter has Celiac Disease, newly diagnosed. She has been so easy to please, but school lunch has been very bland. This bread was easy and delicious! I followed it exactly with the exception of using fast rising yeast just shy of a TBS because that was all I had, and using a slightly smaller loaf pan to make up for the lack of yeast. It came out GREAT! Sliced and froze individual slices wrapped in wax paper. ****I just made it for about the 20th time and substituted tapioca flour for the sorghum (only because I was almost out) and it resulted in an even softer, spongier slice :D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie Inch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5523665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-13T03:45:18.52Z",
                "reviewBody": "This has the look and texture of the gluten free breads I have tasted such as Udi's brand. It is just slightly more dense. For being homemade. I guess I just expected something so much better. A year or so ago I decided to test gluten or wheat free baked goods to see how they would turn out. I found that despite the wheat not being included they still had tons of starch eggs butter and sugar. Sometimes at rates much higher than regular white or whole grain bread. This bread was no exception. It was super easy to make as no hand kneading or shaping is needed. Though like most gluten free breads I find it very rich and almost too sweet tasting. Definitely not like what I know as regular sandwich bread. This one was so sweet it almost reminded me of a mix between bread and a low sugar pound cake or as another reviewer put it closer to a very sweet \"beer bread.\" I thought the amount of sugar seemed excessive. I liked the crunch it had. However I think that was due to blending rice in my Vitamix grain container to make rice flour. I was just trying to use up sorghum flour potato starch and some xanthum gum. I bought these ingredients solely to test gluten free recipes as I only seem to see these ingredients in them and they do have a shelf life. I would definitely not recommend this recipe to someone that eats regular wheat bread but possibly to someone gluten or wheat intolerant to save some money. Udis & similar brands run about 5.00 a loaf. I got 18 slices total.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            }
        ]
    }
]