[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
                    "name": "Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230083/lemon-crumb-muffins-recipe/",
        "name": "Lemon Crumb Muffins Recipe",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1182214.jpg",
            "width": 3128,
            "height": 2346
        },
        "datePublished": "2020-06-19T03:52:16.000Z",
        "description": "This recipe is contest-winning. For 24 muffins, I used 2/3 of the recipe (5 eggs).",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "40 muffins",
        "recipeIngredient": [
            "6 cups all-purpose flour",
            "4 cups white sugar",
            "¾ teaspoon baking soda",
            "¾ teaspoon salt",
            "8 eggs",
            "2 cups sour cream",
            "2 cups butter, melted",
            "3 tablespoons lemon zest",
            "2 tablespoons lemon juice",
            "¾ cup all-purpose flour",
            "¾ cup white sugar",
            "¼ cup cubed cold butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease or line 40 muffin cups with paper liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 6 cups flour, 4 cups sugar, baking soda, and salt together in a large bowl. Whisk eggs, sour cream, melted butter, lemon zest, and lemon juice together in a separate bowl until smooth; pour egg mixture into flour mixture. Stir until just combined. Pour batter into the prepared muffin cups, filling them 3/4 full.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 3/4 cup flour and 3/4 cup sugar together in a bowl; cut cold butter cubes into flour mixture until mixture resembles coarse crumbs. Sprinkle crumb mixture atop each muffin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a knife inserted in the center of a muffin comes out clean, 20 to 25 minutes. Cool for 5 minutes in the pans before removing to wire racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindi Fortmann"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.512820512820513,
            "ratingCount": 39,
            "itemReviewed": "Lemon Crumb Muffins Recipe",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "299.6 calories",
            "carbohydrateContent": "40.6 g",
            "cholesterolContent": "69.7 mg",
            "fatContent": "14 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "161.3 mg",
            "sugarContent": "23.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-07-24T19:59:05.167Z",
                "reviewBody": "I have made this recipe twice; on the second time around I made a few changes that made a delicious difference.  I halved the recipe, and used low fat sour cream, then I added the juice of 1 1/2 lemons to the batter, I tasted the batter to make sure it had the tang of lemon before I was satisfied.  I used the full recipe for the crumb topping, in other words doubled it for a halved recipe. When the muffins came out of the oven I drizzled a glaze of fresh squeezed lemon juice and powdered sugar over the top and in the crevices of the warm muffins, it made them even moister and more lemony.  I will make this recipe over and over for my family and gifts for friends.  If you love lemon you will love these changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LoriLouise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1906299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-06T04:52:37.373Z",
                "reviewBody": "This recipe was originally published in Taste of Home and I noticed that it leaves out the most vital step of the whole muffin experience! There is supposed to be a Lemon Juice/Sugar syrup that you drizzle over the warm muffins. Believe me, this is so important to make these muffins top notch. They already have a beautiful texture and light lemon flavor, but the sweet tang of the syrup takes these over the top! For the full batch, the original TOH glaze recipe calls for 1/2 cup sugar and 1/3 cup lemon juice. Mix to dissolve the sugar, then drizzle over your warm muffins. I sometimes warm the sugar syrup in the microwave a bit to dissolve the sugar, and I always drizzle the muffins while they are still in the pan because this sends the syrup down the sides of the muffin and creates a wonderful experience in your mouth when you finally have a bite! Plus, it's less messy overall, keep the mess in the pan right! They are easy to take out of the pan, too! I made the entire batch one day and couldn't bake them all that evening, so I saved the remaining batter overnight and baked them the next morning and I had no issues with them rising at all. Also, if I have plain or flavored yogurt to use up, I use that in place of the sour cream. I've made these many times according to the recipe and I find that I like more lemon flavor, so I add 2 - 3 tsp of Lemon Extract to the batter with a little more lemon juice as well. Very forgiving recipe and freezes well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3065971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-22T01:52:23.763Z",
                "reviewBody": "The muffins had a great base and they came out wonderfully but I don't find them to be that phenomenal. Without the crumb topping they would have been very boring. If I ever make them again I think I'll add some more lemon to it; the flavor was rather faint in the final product.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ballet4ever",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9577862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-06T20:04:46.243Z",
                "reviewBody": "I made these today & they are amazing!  I did make a few changes: I used French Vanilla yogurt instead of sour cream and also added lemon extract.  For the topping, I mixed brown sugar, white sugar & lemon zest then sprinkled that on top before baking.  From this recipe, I made 24 mini muffins, 12 regular sized muffins then, with the leftover batter, I added frozen blueberries & made 2 lemon blueberry loaves!  YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOM4JESUSJMJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/884517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-22T16:47:53.387Z",
                "reviewBody": "I think there were aspects of this muffin that I really liked but it would need a little tweaking to the recipe to work for me. I prepared exactly as the recipe stated except I added a little extra lemon juice because it did not seem lemony enough. I also thought the crumble was a little powdery. I think it needs a touch more butter to make it more of a crumble. The batter is unbelievably thick so don't think you did anything wrong once you make it. Based on other reviews I made a simple syrup with 1/3 cup lemon juice and 1/2 cup sugar and drizzled over some of the muffins while they were hot. The ones that had the drizzle were definitely better than the ones that did not. They were slightly dry and they were definitely not overcooked. The texture is heavier than a typical muffin but still good. I would make these again but drizzle a little extra of the simple syrup I made on them next time and that may help with the dryness. I think it would be better with a little extra lemon zest added also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Happyschmoopies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/happyschmoopies/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-25T19:38:31.077Z",
                "reviewBody": "yummy! but the serving size must refer to small muffins.  using large/jumbo cupcake liners, when i halved this recipe I only got 12 muffins out of it.  tasty! I increased the heat to 425 degrees and baked about 20 minutes for a nice rise on the muffins. also added finely chopped pecans, bout 1/2 a cup to the recipe. since i was low on sour cream, i subbed vanilla yogurt and sour milk. also, i used oil in place of the butter in the muffin batter. next time i will use only two eggs, though- it was a little dense.   will make these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mariegg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/yummymommy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-14T15:31:21.04Z",
                "reviewBody": "I also scaled down the recipe to make 10 muffins. I didn't change a thing other than drizzling a little simple glaze (made with granulated sugar and lemon juice) over the tops while they were still warm. Next time I may add a little lemon extract to the batter and some grated lemon zest to the topping to make them a bit more lemony. All in all these are very good muffins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNNINMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/theblondeprofessor/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-24T02:07:55.257Z",
                "reviewBody": "So so delicious. I scaled the recipe to 10 servings and followed exact other than adding dried lemon peel to the crumb topping. Excellent texture and just perfect lemon flavor! Convect baked at 325 took about 25 minutes--do not wait for the topping to brown:) Thank you so much for sharing your recipe Cindi!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ONIOND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1013798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-05T12:12:28.37Z",
                "reviewBody": "By far the best lemon muffins I've ever made. I made a few changes to reduce fat and calories and use up what I had on hand. I only made 1/2 the batch which produced 24 muffins. I used 2T of butter with 1 cup unsweet applesauce and plain nonfat yogurt instead of sour cream. Also I reduced the eggs to 3 and the sugar by 1/4 c. So perfectly sweet tart tangy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keeli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9626188/"
                }
            }
        ]
    }
]