[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/662/meat-and-poultry/chicken/whole-chicken/",
                    "name": "Whole Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230473/high-roast-chicken/",
        "name": "High Roast Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1106549.jpg",
            "width": 2637,
            "height": 2637
        },
        "datePublished": "2020-06-19T03:52:36.000Z",
        "description": "High heat-roasted chicken allows for quick, delicious meals any night of the week.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "1 whole roast chicken",
        "recipeIngredient": [
            "½ cup kosher salt",
            "½ cup white sugar",
            "2 quarts water",
            "1 (4 pound) whole chicken",
            "2 tablespoons unsalted butter, softened",
            "1 tablespoon Dijon mustard",
            "1 clove garlic, minced",
            "1 teaspoon fresh thyme leaves",
            "1 pinch ground black pepper",
            "1 ½ teaspoons vegetable oil",
            "2 ½ pounds russet potatoes, peeled and sliced",
            "1 tablespoon olive oil",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Dissolve kosher salt and sugar in water in a large container to make brine. Place chicken into brine, cover, and refrigerate until chicken meat is seasoned, 1 to 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir unsalted butter, Dijon mustard, garlic, and thyme in a bowl and let stand at room temperature while chicken marinates in brine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove chicken from brine, rinse chicken, and discard used brine. Use a sharp, sturdy knife or poultry shears to slice along both sides of the backbone from the tail to the neck, through the bones; remove backbone and tail. Turn chicken over, spread open with breast side facing up, and hit chicken sharply with the heel of your hand between the two chicken breasts to break the breast bone. Press chicken flat with your hands.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dry chicken thoroughly with paper towels on both sides. Use your fingers to loosen the skin over the chicken breast and thighs. Stir 1 pinch black pepper into the seasoned butter mixture and spread butter mixture generously underneath the skin. Pat chicken dry again. Lay the flattened chicken, breast side up, on the top of a 2-part broiler pan. Rub chicken with vegetable oil and sprinkle with more black pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Move a rack into the lower third of oven and preheat oven to 500 degrees F (260 degrees C). Line the bottom of broiler pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place potato slices into bottom of broiler pan atop aluminum foil; toss potatoes with olive oil and season with salt and black pepper. Place top of broiler pan containing chicken over pan bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast chicken and potatoes in the preheated oven for 20 minutes; rotate pan and roast until an instant-read meat thermometer inserted into the thickest part of a thigh reads 160 degrees F (70 degrees C), about 20 more minutes. Let chicken rest on platter or cutting board while you blot excess chicken fat from top of potato slices. Invert broiler pan bottom to turn potatoes out into a serving dish and blot again with paper towels. Cut chicken in quarters with a sharp knife and serve with potatoes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Whole Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "carabakescupcakes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.571428571428571,
            "ratingCount": 14,
            "itemReviewed": "High Roast Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "991.6 calories",
            "carbohydrateContent": "77.5 g",
            "cholesterolContent": "209.3 mg",
            "fatContent": "45.3 g",
            "fiberContent": "3.8 g",
            "proteinContent": "67.4 g",
            "saturatedFatContent": "14 g",
            "servingSize": null,
            "sodiumContent": "11695.9 mg",
            "sugarContent": "26.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-01-04T01:36:22.19Z",
                "reviewBody": "OMG! You HAVE to try this recipe! I did three things differently from the instructions: I used only half a chicken (used the other half for a different recipe) even though I followed the instructions for brining and cutting----I put foil in a 13x9 pan and used a small grate rather than a broiler pan---and I put a sheet of foil over the top (just laid it on) of the chicken after about 15 minutes so it didn't burn. We don't eat the skin so that is used only for moisture and flavor. The timing on this was just about right on--within several minutes. I don't even want to know how many calories the potatoes have in them because we plan on eating all of them tonight. They are so yummy. Thank you for this technique Cara!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-20T01:02:45.5Z",
                "reviewBody": "The flavor is very very good. I am not crazy about Dijon mustard but I decided to follow the recipe exactly so that I could rate it fairly as written and WOW this was good! I didn't check the weight of my chicken so that is my fault but it took quite a bit longer than the 40 minutes indicated in the recipe. I think the description is a bit misleading. Between brining and preparing the chicken the butter mixture and the potatoes I couldn't make this on a workday even if it did finish baking in 40 minutes. I put green beans in with the potatoes and roasted them and both were delicious! Thank you carabakescupcakes. I will certainly make this again and again. By the time the chicken was finally finished my little girls and I couldn't wait while I took a picture but we all enjoyed it. I will have to add a picture next time I make it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "janet7th",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3202695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-16T16:57:55.49Z",
                "reviewBody": "This is really good! We served it to company and they loved it! I love the method of \"spatchcocking\" a chicken to help it cook faster. So moist and flavorful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsFisher0729",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mrsfisher0729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-08T23:06:47.457Z",
                "reviewBody": "Delicious. Followed the recipe exactly. Once with a whole fryer once with a cut up whole chicken an once with just thighs. (Basically whatever is on sale that week). It has turned out amazing every time! This has become a regular in our rotation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3464452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-10T00:40:15.38Z",
                "reviewBody": "Wow! This was a great dinner. I had an 8lb chicken that had been in my fridge for a few days and needed used up. I made this spur of the moment so I didn't have time to brine my bird. This was so good even without doing that so I can't wait to do the brine next time I make this. I cook whole chickens at least twice a month but this was the first time I spatchcooked one like this. Since my bird was bigger than what was called for I doubled the ingredients. I used my NuWave infrared oven instead of the conventional oven. I put the potatoes on the 1\" rack and the chicken on the 2\" rack. Everything came out so juicy and flavorful. We didn't have any leftovers! This is my daughter's new favorite meal. Thanks for the recipe carabakescupcakes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RainbowJewels",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rainbowjewels/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-12T07:09:14.927Z",
                "reviewBody": "AMAZING!!!! I've made this several times now exactly as written and have had everyone ask me for the recipe. Today I switched it up and used sweet potatoes. It worked! Thanks for this super delicious recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20547005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-04-05T23:51:39.577Z",
                "reviewBody": "Good technique! I remember watching Julia Child and Jaques Peppen arguing good naturedly whether fast or slow roasting is best for chicken. Funny!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KELARJIAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/814189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-21T12:03:52.063Z",
                "reviewBody": "The pan juices made very flavorful gravy. The Yukon Gold Potatoes were soft and yummy after cooking in the juice. I cooked the chicken 50 minutes and it was moist and nicely browned. Will make it again and maybe add other veggies with the potatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue Fontana Hackett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8019109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-01-06T11:04:40.19Z",
                "reviewBody": "I followed the recipe exactly and it was delicious and moist!! I did however have a problem with the temperature. My oven was on broil at 500 degrees chicken on the lower 3rd and started burning within 10 mins. I ended up switching it to convection bake and that worked well! I m not sure how everyone s bird didn t burn at that temp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Angel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4117415/"
                }
            }
        ]
    }
]