[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/726/world-cuisine/european/spanish/",
                    "name": "Spanish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231051/simple-and-creamy-spanish-flan/",
        "name": "Simple and Creamy Spanish Flan",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3371246.jpg",
            "width": 2212,
            "height": 1474
        },
        "datePublished": "2020-06-19T03:53:10.000Z",
        "description": "Flan is a traditional Spanish/Hispanic dessert that can be dressed up any way from chocolate to traditional. This flan is simple, yet creamy and smooth. If you have never had flan or just couldn't seem to get it right, I can assure you that your family and friends will want the recipe. Be daring and try other extracts like almond or orange.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT3H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup boiling water, or as needed",
            "1 teaspoon water",
            "½ cup white sugar",
            "6 large egg yolks",
            "1 (14 ounce) can sweetened condensed milk",
            "1 (13 ounce) can evaporated milk",
            "¼ cup white sugar",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Place a 9-inch metal pie dish into a deep baking pan; pour boiling water into baking pan to reach about halfway up the side of the pie dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1 teaspoon water and 1/2 cup sugar into a heavy saucepan, place over medium heat, and constantly swirl the sugar-water mixture in the pan over the heat until sugar dissolves, melts, and turns into  a golden-brown caramel syrup, about 10 minutes. Watch carefully, the sugar burns easily. Pour melted caramel into the warmed pie dish and gently tilt pie dish to coat the bottom with caramel.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk egg yolks, sweetened condensed milk, evaporated milk, 1/4 cup sugar, and vanilla extract in a bowl until mixture is creamy and thoroughly combined. If mixture is foamy, skim foam off with a folded paper towel. Gently pour custard over caramel in pie dish. Cover baking pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until custard is set but still jiggles slightly when moved, 45 minutes to 1 hour. Remove foil and place baking sheet with water bath and flan in refrigerator to chill, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pie dish from baking pan; run a knife around the edges of flan to loosen from pie dish. Invert flan onto a rimmed serving platter to release custard and let caramel sauce flow over the flan.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Spanish"
        ],
        "recipeCuisine": [
            "European",
            "Spanish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "FleurSweetLoves"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 8,
            "itemReviewed": "Simple and Creamy Spanish Flan",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "331.8 calories",
            "carbohydrateContent": "50.5 g",
            "cholesterolContent": "183.5 mg",
            "fatContent": "11 g",
            "fiberContent": null,
            "proteinContent": "8.9 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "117.4 mg",
            "sugarContent": "50.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-05-31T01:43:47.47Z",
                "reviewBody": "Followed recipe to the T took 2 hours to bake though i recommend 350 degrees. Tastes good though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "danzeik",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10267509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-18T16:50:32.74Z",
                "reviewBody": "Excellent and creamy. We had a few friends that had never tasted Flan taste it as well. They are now hooked on flan. This is the closest I have seen to authentic flan. I can't get enough of it. I also went with 350 degrees oven temp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mrbanks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8602171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-01T10:29:32.86Z",
                "reviewBody": "Awesome recipe. I've been looking for this kind of very European-styled thick, creamy flan. Almost like creme brulee but can stand on its own. \nI actually put the deep dish in the oven, put the empty pie pan in and weight it down, add boiling water in halfway up the outside of the pie pan, then take pie pan out and preheat the oven to 350F. \nI also doubled the caramel recipe since I like to give the pan a good healthy coat. As for the flan part, it's good with the extra sugar but it doesn't need it, especially with the extra caramel on top. I also find that lightly whisking the egg yolks first then adding the condensed milk and lightly whisking again and then finally adding the evaporated milk and whisking until fully blended keeps the foam down since I don't have to go at it to get the chunks blended. When the caramel in the pan cools down enough that when you add a drop of flan it doesn't cook, I put the pan in the deep dish of heated water and then carefully pour the flan mixture into the pan and cover with aluminum foil. Otherwise you need finesse to juggle a hot pie pan with liquid in it and then placing it carefully into a deep dish with hot water without spillage or touching the hot water accidentally. The other way is to put boiling water in after you put the pan in the dish and pour the flan mixture in, but I don't like trying to figure out how much water I need in front of a open oven. In any case, I agree with previous reviews, if you use 325F, you'll need to bake ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alice Goog",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21158578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-13T23:26:20.5Z",
                "reviewBody": "This is my first attempt at flan and I am pleased with the results.   It was very creamy and sweet.   It took closer to the hour in the oven at 350 degrees (as other reviewers have stated).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "duboo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/duboo/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-10T05:34:51.82Z",
                "reviewBody": "Flanally a good flan recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Indio Websto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21603472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-05-14T19:49:14.58Z",
                "reviewBody": "This recipe is awful. I think the directions for using the water bath are backward. I baked the flan covered with foil - no water bath - as instructed. The caramel incorporated itself into the custard plus it ran over the dish onto the bottom of my oven which filled the house with smoke and created a huge mess for me to clean up! All the other recipes say to bake in a water bath and then refrigerate overnight before inverting onto a plate! That's how it should be done!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "pinklowrider",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16702926/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-04-04T05:28:03.51Z",
                "reviewBody": "Love Flan, and this recipe is easy and good.  We like the burnt caramel taste with flan, so we cooked the sugar a little extra.  The flan turned out very flavorful, and the dark brown sauce took it to a new level.  Will definitely be making this again!  We read the directions as cooking it in the water bath, and we turned the oven to 350, it still took a little over an hour.  We removed it from the water bath, and removed the foil before putting in fridge to cool.  Flan was really creamy and flavorful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "judy5674",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12022199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-05-09T20:48:39.75Z",
                "reviewBody": "Way too sweet. I did not do the boiling water first i never heard of using a water bath and putting in boiling water first. Why would you cook the outsides of the flan with the boiling water before you put it in the over? I just put the dishes in the pan and put water around the sides leaving some room so it doesnt over flow and get into the flans. I did 325F for 55minutes and a flan should cook not take forever to cook a hour or a little more at most. But when I chilled these over night and ate it it felt the right firmness but not hard on the outside but like...pudding in the middle. If you like that go for it but I personally like a firmer flan throughout and a even texture. That said this is WAY!! too sweet!! Probably adding some regular milk in would fix that. Not using this recipe again and if I do I'm changing it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25549661/"
                }
            }
        ]
    }
]