[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231289/buttermilk-king-cake-with-cream-cheese-filling/",
        "name": "Buttermilk King Cake with Cream Cheese Filling",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2124691.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2013-02-11T02:50:03.000Z",
        "description": "I grew up eating king cake in NOLA but never really LIKING it. I finally decided to give it a go myself and have to say that this is, hands down, the best I've ever eaten. A conglom of several recipes, it's great with coffee, not too sweet, not too bready, with a rich, tender crumb and the traditional lemon/nutmeg flavors of a genuine NOLA king cake. Best eaten same day but pretty darn good the day after (if there are leftovers!). Enjoy, y'all!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT4H40M",
        "recipeYield": "1 king cake",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "½ cup white sugar",
            "1 (.25 ounce) package rapid rise yeast",
            "1 ¼ teaspoons salt",
            "3 eggs at room temperature",
            "6 tablespoons butter",
            "¾ cup Bulgarian-style buttermilk",
            "¼ cup all-purpose flour",
            "1 (8 ounce) package cream cheese at room temperature",
            "1 cup confectioners' sugar",
            "2 tablespoons all-purpose flour",
            "2 tablespoons lemon juice",
            "1 teaspoon vanilla extract",
            "¼ teaspoon ground nutmeg",
            "1 egg",
            "¼ cup water",
            "1 cup confectioners' sugar",
            "4 teaspoons corn syrup",
            "4 teaspoons milk",
            "1 teaspoon lemon juice, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix 4 cups of flour, white sugar, yeast, and salt together in the work bowl of a stand mixer fitted with a dough hook.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk 3 eggs in a separate bowl. Melt butter in a saucepan over low heat and whisk buttermilk into melted butter; heat until an instant-read thermometer reads 120 degrees F (49 degrees C). Whisk buttermilk mixture into beaten eggs and cool the mixture to 110 degrees F (43 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg mixture into flour mixture on medium-low speed to make a firm, elastic dough, about 10 minutes. If dough doesn't separate from the sides of the mixing bowl during kneading, beat in 1/4 cup more flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough out onto a work surface and knead for 1 minute; form into a ball and place into a buttered bowl, turning dough around to lightly coat with butter. Cover bowl with plastic wrap and let rise in a warm place until doubled, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Butter the outer edge of an 8-inch cake pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir cream cheese, 1 cup confectioners' sugar, 2 tablespoons flour, lemon juice, vanilla extract, and nutmeg in a bowl until filling is smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down dough and turn out onto a lightly floured piece of parchment paper. Roll dough into a 10x28-inch rectangle. Spread cream cheese filling over the rectangle, leaving a 1-inch border along each edge. Lift an edge of the parchment paper sheet to roll dough into a log shape, starting at a 28-inch edge. Pinch seams closed to seal in filling, keeping roll on the parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wrap the filled dough around the outside of the buttered 8-inch cake pan to form the dough into a ring; pinch the edges closed. Use parchment paper to lift the cake and cake pan and slide a baking sheet beneath the parchment. Gently free cake pan, leaving the ring-shaped cake. Whisk 1 egg with water in a small bowl; brush cake with egg wash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake king cake in the preheated oven until golden brown, about 40 minutes. Let cake cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 1 cup confectioners' sugar, corn syrup, and milk in a bowl; mix in 1 teaspoon lemon juice, or amount needed to thin icing to a thick but slightly runny texture. Drizzle king cake with icing.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mississippimarion"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.695652173913044,
            "ratingCount": 23,
            "itemReviewed": "Buttermilk King Cake with Cream Cheese Filling",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "435.7 calories",
            "carbohydrateContent": "67.6 g",
            "cholesterolContent": "98.4 mg",
            "fatContent": "14.6 g",
            "fiberContent": "1.4 g",
            "proteinContent": "9 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "380.8 mg",
            "sugarContent": "30.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-03-05T17:15:12.48Z",
                "reviewBody": "This king cake will sashay its way right into your Mardi Gras traditions. The dough is less eggy than some traditional king cakes and has the pleasant tang of buttermilk and the cream cheese filling is the bomb. It's a king cake to convert the king-cake averse because it's both moist and not-too-sweet. I had to use 1 cup additional flour to get the dough to leave the sides of the bowl but it rose beautifully. (My trick for proofing dough: A hot-water bath in a very low oven. Put the dough in a buttered medium ceramic bowl that you've warmed with hot water and dried wrap it with plastic and then nest it in a large ceramic bowl with a little hot water. Set the whole thing in your oven and turn the oven to 110 degrees. In two hours you'll have doubled dough.) I also added some vanilla bean paste and extra lemon juice to the icing to boost the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicholio",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nicholio/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-19T00:36:52.16Z",
                "reviewBody": "So glad y'all like it! I felt like this recipe should've come with a disclaimer: if you're looking for a cake that oozes cream cheese frosting, this isn't it. The \"filling\" nearly absorbs into the cake as it bakes, giving it a soft and flavorful but not runny center.\n\nAlso, nutmeg and lemon *were* the traditional NOLA King Cake flavorings (anyone remember McKenzie's? :); what we've had for decades now is a cinnamon substitution - basically, a cinnamon coffee cake with colored sugar. *meh*\n\nThanks for your comments, everyone! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mississippimarion",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5980959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-19T13:40:59.513Z",
                "reviewBody": "I only used the bread portion egg wash and icing portion (replaced 1t lemon juice with equal amount of milk) of this recipe. Best King Cake I've ever had! For the filling I used 1/2 cream cheese (8oz cream cheese 2T sugar 2T flour 1t vanilla extract and 2 egg yolks) and 1/2 warmed Nutella.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Josephine Roeper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/josephineroeper/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-17T22:30:35.193Z",
                "reviewBody": "skipped cream cheese and went with almond filling. I didn't have buttermilk so I used almond milk with a teaspoon of vinegar..I would definitely go with buttermilk next time. I'm sure its a 5 star recipe. I think I just overbaked it a little.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Grumpy's Honeybunch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/grumpys_honeybunch/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-03-05T04:16:08.153Z",
                "reviewBody": "I saw this recipe in my recent edition of All Recipes Magazine. My husband's family is originally from New Orleans so I thought I would bake this as a treat. I'm a very experienced baker so this seemed easy enough. I made the dough as directed however I didn't roll it out on parchment; it rolled easily on the counter and I just transferred it to the baking sheet as I would a traditional yeast coffeecake ring. It baked for the 45 minutes but I still thought it was a bit \"doughy\" even though the exterior was a nice medium golden brown. Also the recipe advises to use a 8\" round pan to mold the ring around. That didn't work for me because I was using a traditional 1/2 sheet pan so there wasn't room along the edges for the dough to fit so I used a bowl that was about 7\". We did not like the filling. All you can taste is the tartness of the cream cheese. We prefer the traditional cinnamon version of King Cake. No one in my family was familiar with the lemon/nutmeg flavoring. I wanted to like it but it just didn't do it for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "cookinginsd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2677040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-06T01:21:32.017Z",
                "reviewBody": "We used this recipe for a recent volunteer event capped by a mardi gras celebration. I had previously cooked the king cakes for the event but passed the duty along this year. The baker made four of them. All our volunteers enjoyed the cake so much that we had to send a link to the recipe. Not too sweet not too doughy wonderful filling and icing. Traditional nutmeg rather than commercial heavy to cheaper cinnamon flavor. Very time consuming but from the eater's point of view...oh my well worth the wait.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jax",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13269527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-10T09:02:42.757Z",
                "reviewBody": "My husband misses Louisiana food and decided we should try this recipe. We added 1/2 cup more sugar to the filling and left out the lemon but otherwise followed the recipe. It was very good! It was rich and soft.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lydia K Trowbridge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13127190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-05-19T10:28:38.763Z",
                "reviewBody": "I have made this recipe 4 times now and it just gets better each time. No it's not as sweet as the now-popular cinnamon sugar-heavy version. The flavors are much more subtle and evocative of the king cakes from the 50s. Only change I've made it adding a few tablespoons to lowfat buttermilk since I can't find the kind called for. I can't get enough of this cake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Adams Grewe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21567311/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-14T13:54:13.237Z",
                "reviewBody": "Everyone liked it. Next time I will use colored frosting because the decorator sugar wouldn't stick. Will also increase lemon and nutmeg. Loved the way the filling melted into the surrounding. Will remake as a sweet breakfast bread. (Easy to add sugar to inside and save time not dealing with frosting.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1627708/"
                }
            }
        ]
    }
]