[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1785/soups-stews-and-chili/stews/irish-stew/",
                    "name": "Irish Stew Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231751/guinness-irish-stew/",
        "name": "Guinness&reg; Irish Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7826830.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:53:37.000Z",
        "description": "With this wonderful cool weather arriving this recipe is a perfect hearty Irish comfort food. After cooking and enjoying the great flavors, it reminded me and brought back warm thoughts of the mutton stew I had in Dublin, Ireland last year! Irish stew, is traditionally made of lamb or mutton, potatoes, onions, and parsley. But I am using beef. Original Irish stew was a thick and hearty meal, meant to keep a body warm and on your feet for many hours of hard work.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H15M",
        "totalTime": "P0DT3H35M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "4 pounds boneless beef chuck roast, cut into 11/2-inch cubes",
            "2 tablespoons vegetable oil",
            "¼ cup all-purpose flour",
            "2 pinches salt and ground black pepper, or to taste",
            "2 pinches cayenne pepper",
            "¼ cup vegetable oil",
            "2 yellow onions, chopped",
            "4 cloves garlic, crushed",
            "¼ cup tomato paste",
            "1 teaspoon water, or as needed",
            "3 cups Irish stout beer (such as Guinness®), divided",
            "2 sprigs fresh thyme",
            "4 large potatoes, chopped",
            "2 cups chopped carrot",
            "2 tablespoons chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Toss beef cubes with 2 tablespoons vegetable oil in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour, salt, black pepper, and cayenne pepper in a separate bowl. Dredge beef cubes through flour mixture until evenly coated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1/4 cup vegetable oil in a large skillet over medium-high heat; cook and stir coated beef cubes, working in batches, until beef is browned on all sides, 5 to 10 minutes. Transfer browned beef to a Dutch oven or heavy-bottomed pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook and stir onions and garlic in the same skillet used for browning beef until lightly browned, 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir tomato paste with enough water to partially dilute; pour into onion mixture. Stir to blend. Reduce heat to medium, cover Dutch oven, and simmer for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour half the Irish stout into the onion mixture, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer entire mixture to the browned beef. Pour remaining half of Irish stout into beef mixture; add thyme.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover Dutch oven, reduce heat to low, and simmer for 2 hours. Add potatoes and carrots and simmer, stirring every 20 minutes, until potatoes are soft, about 1 hour. Adjust salt as needed; garnish with parsley.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Irish Stew Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mycocinamykitchen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.333333333333333,
            "ratingCount": 27,
            "itemReviewed": "Guinness&reg; Irish Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "526.5 calories",
            "carbohydrateContent": "37.2 g",
            "cholesterolContent": "82.5 mg",
            "fatContent": "28.4 g",
            "fiberContent": "4.8 g",
            "proteinContent": "25.8 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "133.4 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-10-13T03:02:43.32Z",
                "reviewBody": "In order to really enjoy this, I did have to make some off-the-cuff modifications.  First off, it sure takes a LOT more than the specified amount of flour and oil to brown that much meat.  I used cubed London Broil and I doubled the batch.  Additionally, as there wasn't much liquid specified, I added several cups of beef broth.  It would have been horribly dry without that.  I used a crock pot instead of a dutch oven which I don't own.  Guinness wasn't available so I used Deschutes black butte porter - it has a stronger flavor and color than Guinness.  I also don't peel potatoes - carpal tunnel syndrome is a royal pain.  The way I did it turned out quite nicely.  It's keeping well for leftovers though I wouldn't take a chance on freezing it as it would likely destroy the texture of the spuds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GeekGurl2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12189136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-07T18:15:26.16Z",
                "reviewBody": "This was delicious. Very similar to what we had while visiting Ireland. I cut my potatoes and carrots in larger chunks and added them after 1 1/2 hrs of simmering beef because they take longer to cook than smaller pieces. I think the directions mean cover \"skillet\" instead of \"dutch oven\" in step five and then add everything to beef in dutch oven in step six. At least that's the way I made it and it turned out great. I also added extra sprig of fresh thyme and a sprig of rosemary. I think you could substitute tsp of thyme and rosemary if fresh not on hand. Add salt and pepper to taste. I also think this would be a good slow cooker recipe. Gave this to friends for a thank you gift and they raved about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1598019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-15T23:53:57.31Z",
                "reviewBody": "I made this stew and substituted the beef with leg of Lamb it was so good I couldn't stop eating it also had soda bread and a Scotch on the rocks to wash it down",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Edward Symbouras",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6450503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-17T18:57:34.797Z",
                "reviewBody": "We went to Ireland a couple years ago and had Guiness stew for the first time. I love stew, but loved that even more, so I tried it here at home.  I think the secret is to use beef broth for most of the liquid, and just one bottle of Guiness added for the last part of the cooking process, so it doesn't get too bitter.  Also, they didn't have very many potatoes IN the stew. What they did there was have mashed potatoes on top of the stew, so I only put in one potato for thickening in the stew, and just make mashed potatoes for the top now and serve the stew with a scoop of mashed on top, which has been a big hit with the family. Everything else is about the same as this recipe, but I do mine in a crock pot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "germanwife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1454086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-08T02:45:39.79Z",
                "reviewBody": "I enjoyed the recipe and it had a lot of good ingredients but it seems to be lacking on spices. One thing that was quite good was the Guinness as it sweetened the base of the stew giving it a unique taste. The beef chuck roast pieces turned out wonderfully though quite tender and tasty! I only give it a 4 as it could have used a little extra oomph that I felt was lacking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason Rasmussen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/knight42/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-20T00:10:31.697Z",
                "reviewBody": "Added a few things. Before dredging the beef I dipped it in an olive oil red wine Worcestershire mixture. Then in the flour salt cayenne and pepper mixture ( needed way more than stated in the recipe so just remade each time needed) browned beef in the skillet only added one FINELY chopped onion with five or six cloves of garlic ( my boyfriend hates onions) then cooked in a crock pot. Let sit on low for two hours. Then added Half a box of Campbell's chicken broth. One beef cube crushed carrots and potatoes a sprinkle of chili flakes. Then turned the crock pot to high. Cooked for two more hours stirring occasionally. Added canned peas cooked for one more hour. Made tea biscuits for mopping up the delicious gravy. Will make this again for sure!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ninosxo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12110703/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-30T14:54:05.39Z",
                "reviewBody": "My husband came home from work saying he had guinness stew at a pub in Boston for lunch. I did a little digging and tried this recipe. OMG so delicious.. I will never make plain old beef stew again. I did add some beef broth and extra guinness as suggested to make more broth. The potatoes and carrots took longer to cook than the recipe stated. Next time I may try cooking it in the dutch oven - in the oven - instead of on stove top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "karn818",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9271664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-18T15:33:47.857Z",
                "reviewBody": "Made this with lean beef stew meat I subbed 1/2 the potatoes with turnips and also added 1 chopped leek after the onions browned. Also in place of straight Cayenne I used Penzey's Black & Red Spice (a blend of hot Cayenne and black pepper). Admittedly I paired this recipe down sort of off the cuff as we made it with 1.2# of meat - and I just eye balled all the rest of the ingredients. We used about 1 1/2 cans of Guinness (14.9 oz cans) and it filled our Lodge 10\" Dutch Oven. We really liked this - and in hindsight the directions - 1 thru 4 where you mix the tomato paste with water and simmer the onions really is what helped make this so flavorful. Don't skip that step. That being said next time I might add a whole variety of different root vegetables and try other beers or maybe dark red wines for flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TVANWIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1446631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-03-21T05:39:49.677Z",
                "reviewBody": "Get a BIG Dutch oven for this one. I had to transfer from my Dutch oven to my large slow cooker. It couldn’t even hold the 4th potato. Overall, the finished product was great. And the longer it cooked, the better it was. I set the slow cooker on high for  hours. Potatoes were still a little firm. After the 4 hours, the cooker automatically switched to warm. Another 45 minutes and it hit perfection. The sauce thickened and the meat was fork tender.. I served it",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John Geoghegan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23886318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-04T16:42:11.827Z",
                "reviewBody": "I wanted to love this but it was pretty bland. I didnt love the strong taste of the guinness beer I think 3 cups is too much. I added some beef stock to balance it out but it was just ok.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Momma of 2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3412909/"
                }
            }
        ]
    }
]