[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15494/desserts/cakes/cake-mix-cakes/layer-cake/",
                    "name": "Layer Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232909/american-flag-cake/",
        "name": "American Flag Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2368098.jpg",
            "width": 2045,
            "height": 1360
        },
        "datePublished": "2013-05-29T19:52:38.000Z",
        "description": "Unfurl the red, white, and blue with this beautiful, easy, and patriotic flag cake perfect for the 4th of July, Memorial Day, or any favorite occasion. Assemble and frost the pretty cake and wait for the oohs and ahhs!",
        "prepTime": "P0DT1H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 layer cake",
        "recipeIngredient": [
            "3 (10.25 ounce) packages white cake mix",
            "9 egg whites",
            "1 cup vegetable oil",
            "3 ¾ cups whole milk",
            "2 tablespoons clear vanilla extract",
            "2 tablespoons red food coloring",
            "1 tablespoon blue food coloring",
            "1 cup white chocolate chips",
            "10 cups fluffy white frosting",
            "1 tablespoon white chocolate chips, or as needed",
            "2 tablespoons white sugar, or as needed",
            "1 4-inch round paper or cardboard stencil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and line 4 8-inch round cake pans with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine white cake mix, egg whites, vegetable oil, milk, and vanilla extract in a large mixing bowl. Beat for 30 seconds using an electric mixer on low speed. Increase mixer speed to medium and beat for 2 more minutes. The batter will still be slightly lumpy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the red cakes, measure half the batter into a separate bowl and whisk in red food coloring. Evenly transfer the red batter into 2 of the 8-inch prepared cake pans; smooth tops of batter with a spatula. Transfer half of the remaining uncolored batter into a 3rd prepared cake pan; smooth top as before. This will be the white cake portion.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add blue food coloring to the remaining uncolored batter in the large mixing bowl; fold 1 cup white chocolate chips into blue batter until combined. Transfer batter to remaining prepared 8-inch cake pan; smooth top of batter with a spatula.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake all 4 cakes in the preheated oven until a toothpick inserted into the center of each cake comes out clean, about 30 minutes. Remove the cakes from oven and place onto cooling racks until cooled completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Run a knife around edge of each cooled cake. Invert cakes, remove pans, and peel off parchment paper. Use a sharp knife to trim tops of cakes flat and even.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut both of the red cake layers and the white cake layer in half horizontally. You will have 4 thin red cake layers and 2 thin white cake layers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a 4-inch round stencil on top of 1 thin red cake layer; cut out a 4-inch red cake round. Repeat, placing stencil on 1 thin white cake layer to make 1 4-inch white cake round. Center the 4-inch round stencil on the blue cake; cut out and remove center portion covered by the stencil to make a blue cake ring.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble the cake, you will need 2 thin 8-inch red cake layers, 1 thin 8-inch white cake layer, 1 4-inch thin red cake circle, 1 4-inch thin white cake circle, and 1 blue 8-inch cake ring. Reserve the leftover thin red cake layer and other cake pieces for making crumbs for decorating.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble cake, place 1 8-inch thin red cake layer on a cake pan and frost the top generously with white frosting. Place the thin 8-inch white cake layer on top of the red one, and frost the top. Place remaining 8-inch thin red cake layer atop the white one. Frost the red layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the blue ring cake on top of the 2nd red cake layer and carefully frost the inside of the blue cake ring. Gently fit the 4-inch white cake layer into the blue cake ring. Frost the top of the 4-inch white center. Place the 4-inch red  cake layer on top of the white one. Gently press small cake circles flush with the top of the blue ring.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Frost the entire outside of the cake generously with the remaining frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crumble red and blue pieces of leftover cake into 2 separate bowls. Score lines into the top of the cake's frosting with a kitchen knife to make a flag design on top of the cake. It should have a 2-inch square at the upper left for blue field and white stars, and 7 thick horizontal stripes about 1 inch wide.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill the square field at the upper left with blue crumbs and press 1 tablespoon white chocolate chips upside-down into the blue crumbs to make 'stars.' Fill the bottom stripe and every other stripe with red crumbs to make red stripes. Sprinkle white sugar generously into the white stripes to make them stand out.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, cut cake into wedges. The inside of the cake will reveal its layers of red and white stripes and blue field with white chocolate chip stars in every slice.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Layer Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.154929577464789,
            "ratingCount": 71,
            "itemReviewed": "American Flag Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1110 calories",
            "carbohydrateContent": "214.7 g",
            "cholesterolContent": "8.2 mg",
            "fatContent": "25.6 g",
            "fiberContent": "0.5 g",
            "proteinContent": "10.6 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "768.7 mg",
            "sugarContent": "200.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-07-08T16:09:13.633Z",
                "reviewBody": "Absolute best show-stopping cake I have ever served!  My guests were so impressed that they didn't want to cut into it- but they did and the taste was superb!  Moist, colorful and just extraordinary for a patriotic holiday.  If there is any down-side, it is the amount of time to prepare since you must not only make the 4 cake layers but also cut and mold and frost in-between various shapes and decorate the top... but it was ALL worth it.  Serve it and they will never want anything else again, guaranteed.  I used another recipe from this site, Sturdy Whipped Cream Frosting, and it was perfect for binding everything in place, not overpowering the cake and also providing a cool touch for those summer-time barbeques.  Just be sure you have the CLEAR vanilla extract- the other will turn the cake yellow and ruin the presentation.  Did I mention I LOVE this?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "minaayindra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8864380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-07T18:34:17.343Z",
                "reviewBody": "I followed the directions and had the cakes baked, cooled and cut, but when I tried to assemble it, everything went to hell. \nFirst, trying to ice a red cake with white icing is impossible. The icing picked up red crumbs when I tried to spread it and the whole thing looked like a muddled mess. Next, when trying to add subsequent layers, they broke and cracked and fell to pieces.\nThe blue layer just sort of sagged around the edges and as a result, ended up breaking and sliding off down the various sides of the cake.\nNext time, I'll buy a cake and spend my money on alcohol.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "KimbaLouise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5961499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-25T01:22:20.25Z",
                "reviewBody": "The first item of the ingredient list: 3 (10.25 ounce) packages white cake mix was confusing to me. There are NO 10.25 ounce packages of cake mix in the supermarket so I measured out 3 x 10.25 ounces of cake mix. Had I reviewed the back of the packages I would have realized that the 10.25 ounce notation was incorrect. It should read 16.25 ounce. The liquid measurements agreed with the use of the 3 16.25 ounce cake mixes. As a result lots of crumbling falling and mess. The finished cake looked awful as a whole but cut into beautiful layers. Next time I will use ALL the cake mixes and not fixate on the weight of the flour mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Meg Swant",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13645815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-09T22:26:41.027Z",
                "reviewBody": "I skipped the white cake and did all red, the cream cheese frosting acts as the white stripe, I think it looks much better this way. The stars didn't come out for me, next time I'll use pine nuts or something....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "H.Carl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7559978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-06T15:28:25.35Z",
                "reviewBody": "This cake is time consuming but WORTH IT!  The presentation is so impressive and a crowd pleaser.  I went with other suggestions and left the cake plain white on the outside with simple piping and some white sugar glitter with a few white chocolate chips sprinkled on top and two small American flags that I crossed and had standing in the cake. So when it is sliced... Wow!  My tips for baking. I didn't have clear vanilla so I left it out until I divided and colored the batter and used my regular vanilla in the colored batter and I used almond extract in the white portion. Also I freeze the white chocolate chips then toss them in flour before adding them in the blue batter.  You will see the stars.  Lastly after i bake the layers and they are still hot. Using a pot holder to protect my hand, I press the cake firmly into the pans. This evens out the layers and makes them more dense which makes them easier to slice after they have cooled. They will still be very moist. I used a cream cheese frosting for the middle and I used a whipped cooked buttercream frosting for the outside. Definitely use parchment paper for baking and put your layers cut side down to make frosting easier.  The flavor was great and it's a very delicious cake! I have already received requests for next year.  Loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "airjewel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/airjewel/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-04T22:08:41.64Z",
                "reviewBody": "I frosted this cake with the Fluffy White Frosting recipe that I found on this site. I did not add any embellishments to the frosting because I wanted the effect of cutting a solid white cake and revealing the flag inside. Make sure you cool the cakes until they are stone cold before attempting to cut them in pieces. If they are at all warm the cakes will crumble and break. This cake was a hit at the Fourth of July family and friends picnic. I presented it with four sparklers poked into the top and lit as I carried it out to the table!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "barbara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11623485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-04T15:41:20.627Z",
                "reviewBody": "This cake is absolutely stunning.  It takes a lot of time and requires patience, but well worth the effort.   I used white chocolate frosting between the layers and butter cream frosting for the sides and top. My rating is for the creative idea, NOT the cake recipe.  The cake part of the recipe will leave you scratching your head and a notepad full of scribbles trying to figure out how to adjust.  First, I could not find a 10.25 oz cake mix which left me wondering if there was a error when this got published.  So, I watched the video and it couldn’t be more vague.  It skips over the recipe only saying to use 3 boxes of cake mix and follow the directions on the back of the box.  Easy enough, but that’s not the written recipe because the written version clearly modifies the box instructions.  My advice is to use your favorite white cake recipe or mix and make 2-8\" red cakes, 1 blue, and 1 white and use this recipe for the assembly instructions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIZ&#9829;",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/diz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-27T18:41:18.783Z",
                "reviewBody": "This is NOT an easy cake but WOW the end result was AMAZING. A few words of advice: I skipped the white chocolate chips after watching the video they didn't have the desired effect for me. Clear vanilla extract is hard to find so I substituted a little almond extract and a little orange extract...clear extracts that I had on hand. The cake was still fantastic and I actually enjoyed the little orange touch. I was so surprised at how much food coloring I needed...much more than the recipe called for. I was lucky and had some on hand but make sure you buy more than you think you'd have to. I found that when cutting the cake it was best to use some sort of guide to balance the knife on. It was far too easy to go off course. Store bought frosting was overly sweet and hard to spread when I made the cake the first time so I decided to make whipped cream and frost the cake with that instead. Not only was it delicious and not too sweet it was also easy to spread and sturdy. I found it more dramatic not to do anything with the outside of the cake. It makes it more exciting when you cut into it! Finally when you're done with the cake store it somewhere safe using toothpicks as needed...the cake is prone to cracking and crumbling and parts of it can even crumble off!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily Bregou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13696424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-13T19:27:52.83Z",
                "reviewBody": "Bought three 16 ounce boxes of Duncan Hines moist white cake mix. The \"six\" on the package looks like a zero, and I could not find a 10.5 ounce box. Anyway, I used one box for the white layers, half a box for the blue layer and one and a half boxes for the red layers. I expected to trim quite a bit to achieve even layers. It was more of a challenge than I thought it would be. Used regular liquid food color. Went to the store to buy more, because you need A LOT to get just the right colors. The batter was several un-Godly colors, until I reached the shades of red and blue that I wanted. Reynolds parchment paper kept the cakes from sticking. I would make this cake again, and I love the idea of serving it with lighted sparklers. What a fun and festive holiday dessert!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cynthiaross/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "American Flag Cake",
            "description": "See how to make an American flag cake.",
            "uploadDate": "2013-06-19T18:25:01.726Z",
            "duration": "PT3M0.597S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F663d5ec3-098d-44c8-aded-68fd68048217%2F358b2e92-456e-42f4-9c19-86c80c807bdf%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2491423309001"
        }
    }
]