[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/87793/homemade-ginger-ale/",
        "name": "Homemade Ginger Ale",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8138890.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:12:24.000Z",
        "description": "A fun way to make a family favorite. It tastes a little different than the commercial stuff, but it is much better. Above all things, have fun and feel free to experiment! Try adding fruit extract, if you like.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P2DT0H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ tablespoons grated fresh ginger root",
            "1 cup sugar",
            "¼ teaspoon active dry yeast",
            "1 lemon, juiced",
            "water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Into an empty 2-liter soda bottle, put the ginger root, sugar, yeast, and lemon juice. Fill the rest of the way with water. Screw the cap onto the bottle as tight  as possible. Shake the bottle well, then leave at room temperature until the bottle is too hard to squeeze, about 2 days. Refrigerate. To serve, pour through a tea strainer.\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ILIKEBAKEDZITI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.089285714285714,
            "ratingCount": 56,
            "itemReviewed": "Homemade Ginger Ale",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "100.7 calories",
            "carbohydrateContent": "26.7 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.7 g",
            "proteinContent": "0.2 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "0.6 mg",
            "sugarContent": "25 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-24T15:46:04.72Z",
                "reviewBody": "First let me say that I have not made this recipe.  The yeast you want to try is Champagne yeast (Red Star brand is decent as I use it in Root Beer).  Beer yeast will have too many off flavors that are important for different varieties of beer but not soda.  Also, be careful that you don't bottle in glass as you could create a bottle bomb depending on fermentation temp and how tight the cap/lid is.  As with any fermentation with yeast and fermentables (sugar) there will always be a % of alcohol (small but still present).  After 2-3 days the jug needs to be chilled and kept at fridgerator temps to force the yeast to settle and become inactive (they don't die just become inactive).  Remember, yeast is a living organism and will continue to thrive when conditions are right for them which means eating the sugars and creating the by-product alcohol.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jdca5033",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1953887/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-19T15:04:53.117Z",
                "reviewBody": "This is not a review, as such, but a \"helpful\" hint.  My brother and dad made wine several years ago and experienced a similar explosion (all over the room and one VERY happy guinea pig!) and were told to cap the bottle with a balloon.  The balloon expands with the gas, which can then be vented quite easily by pulling the neck of the balloon away from the bottle's neck.  No explosions and no mess!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4592027/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-08T12:25:18.403Z",
                "reviewBody": "I know this recipe works because it's identical to the one that I already use! I put at LEAST 2 Tbs of ginger root in mine because I love ginger. Because it's a bit difficult to put the grated ginger into those small-mouth bottles you can soak the grated ginger overnight in a separate container strain it and then pour it into the 2-ltr bottle together with the other ingredients. It works either way! Beats store-bought ginger ale by many miles and of course is much cheaper. The only(little)thing I would like to see changed is using something besides regular yeast so that it won't have that slight yeasty taste. Is there anything else that can be used to give it the needed carbonation? Does brewer's yeast have that same taste??",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rena Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1871606/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-01T15:56:59.213Z",
                "reviewBody": "I got this just the way I like it on my fourth try. I used 1/2 pound grated fresh ginger juice from one lemon 1 cup of sugar and 1/8 tsp of yeast. I let all that ferment in the 2-liter bottle for 24 hours during which time I let the pressure off once or twice. Next I pour it through a sieve and a funnel into 20 oz soda bottles. A 2-liter bottle will fill three soda bottles. I leave these out to ferment for at least 24 more hours after which I refrigerate them. All this results in a ginger beer that is very carbonated but without too strong a taste of yeast (at least until you get close to the bottom of the bottle). It is not overly sweet and the ginger and lemon are both pronounced but not overpowering.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Johnny Burnaway",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3709554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-15T19:06:25.057Z",
                "reviewBody": "I've made this 4 or 5 times now each time I try it with more ginger.I'm trying to get it where it has just the right amount of \"bite\" from the ginger.The last batch I made with approximately 355 grams of ginger a WAY lot more than 2 tablespoons.Instead of grating the ginger I run it through my juicer made for a lot less work and it cuts down on the amount of sediment in the bottom of the bottles(I used 2-1 liter bottles).The next time I make this I think I'll cut the sugar back to 3/4 cup.The juice of one lemon is just right also any more and it would change the balance of flavors.One other thing I found is that it's carbonated after only 12 hours on my counter and I live in a basement suite.With my changes what I'm making is basically a ginger beer but that's what I'm trying to achieve.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WHATAYAWANT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/911909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-03T14:30:49.003Z",
                "reviewBody": "I made this recipe and will never try it again. The taste is not anything like a ginger ale tasted more like Fresca. No one mentioned that the carbonation of this particular recipe will make a super mess. Mine was also ready after 24 hours. I opened the bottle after 48 hours then spent a good part of the evening cleaning all the ginger ale from the kitchen. Ceiling to floor. I doubt I will ever try this again. Hopefully this will help another reader when they try to open the bottle!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "DJC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1169893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-22T20:54:25.687Z",
                "reviewBody": "This is wonderful! I don't know why anyone would have such a problem with carbonation unless they don't know how yeast works or don't know how to open a bottle. I am going to play with the sugar ginger and lemon amounts in the MANY batches I plan to make. This is really tasty! And easy! Mine was also ready a little sooner too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gwendolyn028",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2848643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-03T01:22:59.91Z",
                "reviewBody": "Following is a site that has further instructions in making this same recipe but without having to clean your entire kitchen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2838069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-20T17:56:31.65Z",
                "reviewBody": "This is a great recipe. But I STRONGLY recommend everyone to look at e-z caps. They are replacement bottle screw caps that have a hold in them to let out excess gas so no explosions and it keeps just the right amount in for carbonation. They come with a perfect champagne type yeast. Use them with this recipe and you'll never look back.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "rastoma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6370395/"
                }
            }
        ]
    }
]