[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/233538/really-real-strawberry-cupcakes/",
        "name": "REALLY Real Strawberry Cupcakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1032730.jpg",
            "width": 960,
            "height": 961
        },
        "datePublished": "2020-06-19T03:55:33.000Z",
        "description": "I've been messing around trying to make a perfect strawberry cupcake to go with the Real Strawberry Frosting I developed a couple of years ago. It's been a long road and lots of cupcakes tested and tasted along the way. The trick was NOT using puree as I do when making the frosting. Rather, grinding freeze-dried strawberries into a powder brought this cupcake recipe out of my test kitchen and into my recipe box! I am so pleased with the results!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H17M",
        "totalTime": "P0DT0H47M",
        "recipeYield": "20 standard cupcakes",
        "recipeIngredient": [
            "1 ¼ ounces freeze-dried strawberries",
            "¾ cup all-purpose flour",
            "¾ cup cake flour",
            "1 ½ teaspoons baking powder",
            "¼ teaspoon baking soda",
            "½ teaspoon salt",
            "½ cup unsalted butter, room temperature",
            "1 ⅓ cups white sugar",
            "3 eggs, room temperature",
            "1 teaspoon vanilla extract",
            "⅔ cup whole milk, room temperature"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line muffin tins with 20 cupcake liners (for mini cupcakes, line 72 mini muffin tins).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grind strawberries into a fine powder using a coffee grinder or food processor. Whisk strawberry powder, all-purpose flour, cake flour, baking powder, baking soda, and salt together in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat butter and sugar in a bowl with an electric mixer until light and fluffy. Mixture should be noticeably lighter in color. Add room-temperature eggs one at a time, allowing each egg to blend into butter mixture before adding the next. Beat in vanilla extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir flour mixture, alternately with the milk, into butter mixture until just incorporated. Fill lined tins with cupcake batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until cupcakes spring back when gently touched with a fingertip or a toothpick inserted in the center comes out clean, 16 to 18 minutes for regular cupcakes, 8 to 10 minutes for mini cupcakes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Candice"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.327272727272727,
            "ratingCount": 55,
            "itemReviewed": "REALLY Real Strawberry Cupcakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "145.2 calories",
            "carbohydrateContent": "21.6 g",
            "cholesterolContent": "40.9 mg",
            "fatContent": "5.7 g",
            "fiberContent": "0.2 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "125 mg",
            "sugarContent": "13.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-07-23T19:24:15.95Z",
                "reviewBody": "Wonderful! I saw this recipe, and thought--when I read about the freeze-dried strawberry powder--\"GENIUS!\" I made them for a BBQ this weekend, but only got 14 cupcakes. I think of my pan as being a standard-sized pan, and I use a scoop for portioning the batter. In any case, I loved these. I made a second batch of chocolate cupcakes (Extreme Chocolate Cake) to bring along with these. I used an Italian meringue buttercream with fresh strawberry puree for the frosting, which was delicious on both flavors. Oh: I used 1/3 cup of the sugar to help grind the strawberries in the food processor (a trick I use when making almond meal or other nut flours), and used the remaining sugar to cream with the butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-20T14:41:22.21Z",
                "reviewBody": "These have been a very big hit with everyone I've given to taste test for me. The single most common statement everyone makes is \"These really taste like Strawberries REAL strawberries.\" And that is what I want to hear. The final test was making for DD Christine-NICU RN's birthday. I made the CC's and frosted with Real Strawberry Frosting. Then I stuffed strawberries with RSF and froze for about 30 minutes before topping the CC's. They were the hit of the evening!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-13T17:14:41.873Z",
                "reviewBody": "I've been searching for a true, made from scratch strawberry cupcake for awhile that wasn't too wet from the fresh berries, and this recipe is amazingly perfect with great strawberry flavor!  I was always curious about using Trader Joes freeze dried strawberries & this a nice application for them.  Thank you for sharing your recipe - this will be my go-to strawberry cupcake from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stacy66",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10112029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-20T15:00:34.03Z",
                "reviewBody": "Want to make 18 cupcakes with a REAL strawberry taste? Here's your answer! I must tell you about my first attempt to make them! I emptied the package of freeze dried strawberries into my food processor and found to my dismay that there is a little freshness packet in there that says DO NOT EAT! So that got dumped! Second go at it was much more successful. If you do use a food processor be sure to hold your hand over the top feeder because there is a lot of strawberry dust that needs to settle. I did make my own cake flour since Trader Joe's doesn't carry it and I was out (2 tablespoons cornstarch in a measuring cup and then fill with all purpose flour---sift several times before drawing out the 3/4 cup called for). The cupcakes took 18 minutes to bake. And while they were in the oven I worked on the Real Strawberry Frosting---a total must for these cupcakes! And my verdict is YUM! Thanks so much for a great treat Candice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-31T00:37:33.077Z",
                "reviewBody": "YUM!  You can really taste the strawberry flavor!  It's not that often that I get to play with my magic bullet.   Watching the freeze dried strawberries turn to powder was fun.  The recipe was really quick and easy to do.  The hardest part was waiting for them to cool.  Actually, they were warm when we had our first.  (Hubby made me do it).  I frosted them with \"Real Strawberry Frosting\" from this site which is another of Candice's prize recipes.  I made no changes to the recipe.  I got 18 cupcakes and they took 18 minutes to bake.  Thank you Candice for sharing such a YUMMY recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-08T20:06:21.083Z",
                "reviewBody": "I had such high hopes for this and it fell a little short. They were still good cupcakes and everyone ate them up but they did not have a strong strawberry flavor or even color as I hoped. The disappointing part was that they tasted like freeze dried strawberries -- there is an aftertaste with freeze dried strawberries and it just bugged me a little in these cupcakes. It wasn't pure strawberry. I made the frosting as well and felt that needed more - double - the strawberries. Alas I continue my mission for a true clean strawberry cake taste.:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-12T17:52:53.543Z",
                "reviewBody": "Loved it! I just used frozen strawberries instead and added a little bit more I chopped them and added them to batter as they were still frozen. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitchenqueen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12073572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-15T19:51:52.97Z",
                "reviewBody": "so moist.  so delicious.  flavorful and absolutely real strawberry flavor.  i can see myself even adding a second bag of the freeze dried strawberries to the mix to REALLY saturate the strawberry flavor.  one of the best cupcakes i have made in a long time -- and also the strawberry frosting linked to this recipe.  what a decadent treat!  would definitely recommend and will definitely make these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mom2loc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13162347/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-12T12:57:06.477Z",
                "reviewBody": "Batter was too thick to pour. 8-10 minutes for mini cupcakes is not enough time 12-14 maybe. Mine were more like muffins. Wound up making a box mix to take to party at last minute:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "misstoni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10997126/"
                }
            }
        ]
    }
]