[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/233652/homemade-hamburger-buns/",
        "name": "Homemade Hamburger Buns",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9324325.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2013-07-29T20:25:33.000Z",
        "description": "I've gotten a thousand request for these. We're going to make our own, and not only are these going to be the perfect shape, they're going to taste way better than anything that comes out of a plastic bag. The total time takes almost 4 hours, but the actual amount of work involved is maybe 10 minutes.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H45M",
        "recipeYield": "8 buns",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast (such as Fleischmann's ActiveDry Yeast®)",
            "1 pound all-purpose flour, or as needed - divided",
            "1 cup warm water (105 degrees F/41 degrees C)",
            "1 large egg",
            "3 tablespoons butter, melted",
            "3 tablespoons white sugar",
            "1 ¼ teaspoons salt",
            "1 teaspoon olive oil",
            "1 egg, beaten",
            "1 tablespoon milk",
            "1 teaspoon sesame seeds, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with a silicone mat or parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place yeast into bowl of a large stand mixer; whisk in 1/2 cup flour and warm water until smooth. Let stand until mixture is foamy, 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk 1 egg, melted butter, sugar, and salt thoroughly into yeast mixture. Add remaining flour (about 3 cups).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fit a dough hook onto stand mixer and knead the dough on low speed until soft and sticky, 5 to 6 minutes. Scrape sides if needed. Poke and prod the dough with a silicone spatula; if large amounts of dough stick to the spatula, add a little more flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough onto a floured work surface; dough will be sticky and elastic but not stick to your fingers. Form the dough lightly into a smooth, round shape, gently tucking loose ends underneath.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wipe out stand mixer bowl, drizzle olive oil into the bowl, and turn dough over in the bowl several times to coat surface thinly with oil. Cover bowl with aluminum foil. Let dough rise in a warm place until doubled, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough to a floured work surface and pat to flatten bubbles and form into a slightly rounded rectangle of dough about 5x10 inches and about 1/2 inch thick. Dust dough lightly with flour if needed. Cut dough into 8 equal pieces. Form each piece into a round shape, gently tucking ends underneath as before.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use your hands to gently pat and stretch the dough rounds into flat disc shapes about 1/2 inch thick. Arrange buns about 1/2 inch apart on prepared baking sheet. Dust buns very lightly with flour. Drape a piece of plastic wrap over the baking sheet (do not seal tightly). Let buns rise until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat 1 egg with milk in a small bowl, using a fork, until mixture is thoroughly combined. Very gently and lightly brush tops of buns with egg wash without deflating the risen dough. Sprinkle each bun with sesame seeds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until lightly browned on top, 15 to 17 minutes. Buns will stick together slightly where they touch. Let cool completely, tear the buns apart, and slice in half crosswise to serve.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8584905660377355,
            "ratingCount": 848,
            "itemReviewed": "Homemade Hamburger Buns",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "291.7 calories",
            "carbohydrateContent": "48.6 g",
            "cholesterolContent": "58.1 mg",
            "fatContent": "7 g",
            "fiberContent": "1.8 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "414.8 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-08-14T18:06:50.573Z",
                "reviewBody": "Gotta love Chef John's buns! These turned out really well - light, lovely taste and texture. Also delicious when made with whole wheat flour.\n\nThe only change I made to the recipe was to cut the sugar down to 1 tblsp, because 3 tblsp makes it way too sweet for my (European) taste, and it adds unnecessary calories.\n\nI whisked the egg, then tossed all the ingredients into my bread-making machine on the dough-making setting, thereby skipping steps 2 through 6, resuming at step 7.\n\n\nI also use this recipe for hot dog buns, and the results are excellent. For hot dog buns, in step 7, flatten each of the 8 pieces into 15x15cm (6x6-inch) rectangles, very tightly roll each one, pinch the ends and along the remaining edge, then lay out on the baking sheet with the remaining edge down. In step 10, brush lightly with the egg-wash, but skip the sesame seeds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "s©tt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5228918/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-06T02:40:42.917Z",
                "reviewBody": "These buns are so easy to make!  What an easy way for beginners with yeast to start!  I followed the recipe except to add one tablespoon of the sugar to the yeast/flour/water mix in the very beginning.  I weighed the dough of each of the buns at 3.5 ounces, and they handled a quarter pound hamburger perfectly.  I think we would perhaps like them just a tad smaller, so next time I'll do what another suggested and make 10 buns from the recipe.  They were perfect.  I like to slightly undercook my rolls like this (see my photo) so that when I toast them with butter they don't get too dry.  We had delicious hamburgers tonight with organic hamburger meat from Costco!  Yum!  Another winner, Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-12T01:02:40.7Z",
                "reviewBody": "Delicious! I put all of the ingredients into the bread machine and set it to the dough cycle. When it was complete, I proceeded with the rest of the recipe. I do agree with the others that said these are a bit on the big side. I think next time I'm gonna make 10 buns, and that should be the perfect size for us. As soon as hubby took his first bite he said I should make these every time we have burgers. These have a wonderful flavor and texture...A definite keeper~YUM! Thanks for sharing. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-31T22:36:25.023Z",
                "reviewBody": "This was a really fun and easy recipe to make,although I did make some changes of my own.You see,because I'm a vegan health nut I was unable to use eggs,so I substituted with good ole flax seed(1Tbsp of ground flax + 3Tbsp of water = 1 egg)I also used whole wheat flour(Wheat Montana brand)instead of white,1 Tbsp of sugar instead of three and olive oil instead of butter.Because whole wheat is heavier than white, an extra 1/4 cup of water is needed.This is definitely a keeper!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RealEats",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12302635/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-09T12:32:16.237Z",
                "reviewBody": "This recipe is so easy and produces a great bun. Chef John comes through again. Like others have said, the buns at 8 servings are too large. I tried 10 and still felt the buns were a tad large, so today, I'm going to 12 buns. Size is a personal preference so 8 might be fine for you. Try this recipe. You will not be sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "breadman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5994428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-20T16:40:27.243Z",
                "reviewBody": "Not sure what I did...  dough was crawling out of the bowl at 1 hour for the first rise!  I got 12 HUGE buns!  I think I could have gotten close to 18 regular size ones!  Also, everything in me was screaming \"spray the cling wrap! spray the cling wrap!\"  Of course, I didn't listen and... it stuck and deflated my buns!  I baked them anyway, just to see what would happen.  We ate flat bread!  Tasty, but flat!  I  did decrease the sugar to 1 Tbl as someone else suggested.  Not so sure I liked the egg/milk wash.\n \nI will definitely try this recipe again... only I WILL SPRAY MY CLING WRAP!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mama owl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9194481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-16T22:19:46.337Z",
                "reviewBody": "My first time ever making hamburger buns, and I now know I will NEVER go back to store-bought!  So easy, and so delicious!  I agree that the buns are large, and you could easily shape 10-12 instead of 8 and they will still turn out a good size.  I put all ingredients in my bread machine to let it do it's thing, and then step #7 onward after it has risen.  These are a HUGE hit in my family; sloppy joes, hamburgers, pulled pork, it all works great!  Thanks for spectacular recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristina Hooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1874336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-22T09:33:33.647Z",
                "reviewBody": "Ok so I reckon they have a great taste. One wee problem though... The cling film sticks and they deflate when removed. Ended up with flat bread.. hmmm maybe don't use cling film?? One part that was exposed was perfect",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "fueldog",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15669715/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-09T17:17:08.663Z",
                "reviewBody": "I've made these buns many times now. They are WONDERFUL as hamburger buns, sandwich rolls, or just by themselves. I use the dough cycle in my bread machine and they turn out perfectly every time. I don't bother beating the egg. I just throw it in (water, salt, butter/oil, and egg) and then I add the flour, sugar, and yeast. Most of the time, I use olive or rice bran oil instead of the butter just for convenience and it's a bit healthier than the butter. I do not note a difference in taste. I place the dough (after formed into the roll) on a nonstick cookie sheet or a sheet lined with parchment paper. I don't bother covering with plastic wrap (I use to do this but discovered it was not necessary, thankfully)...instead, I just cover them well with a light cotton dish towel. No sticking, no problems...and less trouble. I've made these with or without the egg wash and sesame seeds. They are delightful both ways. My kids prefer them without the seeds anyway. It's hard to find a \"warm\" place in my home for these to rise since I keep my home pretty cool, so I place them in a preheated (175 degree) oven that I turn off a couple of minutes before putting the buns in and let them rise for the recommended time. I love this recipe! Don't bother searching for another. It doesn't get better than this one. Thank you for posting Chef.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mindy T.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3265653/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Homemade Hamburger Buns",
            "description": "See how to make your own homemade hamburger buns.",
            "uploadDate": "2013-07-22T16:01:23.726Z",
            "duration": "PT7M18.571S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F22373a9e-353f-4fb5-88c0-1bc4ed2256eb%2F0d2fb992-1a7e-4579-96ec-351779e41f6f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2559939022001"
        }
    }
]