[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/234131/white-chocolate-bubbling-cauldrons/",
        "name": "White Chocolate Bubbling Cauldrons",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "White Chocolate Bubbling Cauldrons"
        },
        "datePublished": "2020-06-19T03:55:58.000Z",
        "description": "These white chocolate lava cakes take on a Halloween transformation with a little candy coating and imagination. I use Wilton Candy Melts&reg; in Halloween colors, but if you can't find green or black, gel food coloring added to white melts works great.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "6 8-ounce ramekins",
        "recipeIngredient": [
            "1 pound bittersweet chocolate, chopped",
            "1 (12 ounce) package black confectioners' coating (such as black Wilton Candy Melts®)",
            "1 cup unsalted butter, softened",
            "½ cup white sugar",
            "3 eggs, room temperature",
            "3 egg yolks, room temperature",
            "1 cup all-purpose flour",
            "1 cup ground toasted pecans",
            "1 teaspoon vanilla extract",
            "1 (12 ounce) package green confectioners' coating (such as green Wilton Candy Melts®)",
            "1 (12 ounce) package white confectioners' coating (such as white Wilton Candy Melts®)",
            "¾ cup heavy whipping cream",
            "2 ounces bittersweet chocolate, grated",
            "6 chocolate-covered pretzel sticks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Generously butter six 8-ounce ramekins and place on baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1 pound chopped bittersweet chocolate in a plastic or glass bowl in microwave oven on low, stirring every 30 seconds, or in the top of a double-boiler over gently simmering water. Remove melted chocolate from heat and set aside to cool. It should be room temperature but still fluid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt black confectioners' coating in a separate large plastic or glass bowl in microwave oven on low, stirring every 30 seconds, until coating is melted, warm, and smooth. Keep candy warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat butter and sugar in a bowl using an electric mixer fitted with a whisk attachment on high speed until mixture is light and fluffy, about 5 minutes. Add eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in egg yolks one at a time. Continue mixing until batter is thick and lemon-colored, about 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour cooled melted chocolate into butter mixture and mix on low speed, stopping to scrape down sides of bowl, until fully combined. Beat flour, ground pecans, and vanilla extract into chocolate mixture and continue to mix just until batter comes together. Divide batter among prepared ramekins.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes. Remove tray from oven. Carefully place 2 or 3 green candy pieces and 1 white candy piece (or more white than green, if desired) in the center of each half-baked cake. Return cakes to oven and bake for another 10 to 15 minutes, or until a knife inserted in the side comes out clean (do not pierce the centers). Let cakes cool in ramekins for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 2 or 3 pieces of the green candy in a small microwave-safe bowl in microwave set on low, stirring every 30 seconds, until green candy is warm and smooth. Let cool until room temperature but still fluid. Whip the heavy cream in a bowl and gently fold cooled green candy melts into the whipped cream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently unmold cakes onto baking sheet. Carefully dip cakes into black candy coating, or pour it over the cakes to coat. Sprinkle grated chocolate onto a serving platter and place cakes onto the grated chocolate. Spoon a dollop of green whipped cream on top of each cake. Pierce each cake with a chocolate-covered pretzel stick, allowing the bubbling cauldrons to ooze their green and white candy filling. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Loa Ledbetter"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "White Chocolate Bubbling Cauldrons",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "2117.8 calories",
            "carbohydrateContent": "193.1 g",
            "cholesterolContent": "356.9 mg",
            "fatContent": "141.7 g",
            "fiberContent": "9.2 g",
            "proteinContent": "25.4 g",
            "saturatedFatContent": "80.2 g",
            "servingSize": null,
            "sodiumContent": "275.1 mg",
            "sugarContent": "156.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]