[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17157/desserts/chocolate/white-chocolate/",
                    "name": "White Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/234140/halloween-mummy-cookies/",
        "name": "Halloween Mummy Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1605052.jpg",
            "width": 1280,
            "height": 1280
        },
        "datePublished": "2020-06-19T03:55:58.000Z",
        "description": "These coated chocolate cookies are frightfully delicious! They have been a long-time favorite in our house during the Halloween season. I found this years ago published in the local newspaper. I still have the clipping, but cannot give credit to its creator/author, as none was printed in the article. Great family-time baking project; the kids love to help form the chilled dough into the mummy shapes, with clean hands, of course! Great for Halloween, but we also use this dough for Xmas candy cane and wreath-shaped cookies, too. Have fun!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "30 cookies",
        "recipeIngredient": [
            "⅔ cup butter, softened",
            "1 cup white sugar",
            "2 eggs",
            "2 teaspoons vanilla extract",
            "2 ½ cups all-purpose flour",
            "½ cup unsweetened cocoa powder",
            "¼ teaspoon baking soda",
            "½ teaspoon salt",
            "2 (11 ounce) packages white chocolate chips, or as needed",
            "1 ½ tablespoons solid vegetable shortening, or as needed",
            "miniature chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat butter and sugar with electric mixer in a large bowl until smooth. Mix in eggs one at a time, beating the first egg in until fully incorporated before adding the second. Stir in vanilla extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together flour, cocoa powder, baking soda, and salt in a bowl; stir into butter mixture. Shape dough into a log and wrap with waxed paper, parchment, or plastic wrap. Refrigerate until firm, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice pieces off the log and shape them into narrow wedges about 3 inches long. Set cookies on baking tray. Cut more slices and pull off teaspoon-sized pieces and roll into balls; flatten and press balls onto wide ends of wedges for the mummies' \"heads.\"\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated until cookies are set and edges are dry, about 8 minutes. Let cool in pan for 1 minute; remove to wire rack to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine white chocolate chips with vegetable shortening in a microwave-safe bowl. Heat in microwave on low until melted, 1 to 2 minutes, stirring every 20 seconds, until coating is warm and smooth. Coat the tops of each cookie with melted white chocolate using a small spatula or butter knife. Reheat white chocolate mixture in microwave for a few seconds and stir again if it becomes too thick to work with. Repeat coating remaining cookies with white chocolate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a toothpick to score lines for \"bandages\" on each cookie, and place mini chocolate chips on the mummy heads for eyes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "White Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DManfredi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 2,
            "itemReviewed": "Halloween Mummy Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "237.2 calories",
            "carbohydrateContent": "28 g",
            "cholesterolContent": "27.6 mg",
            "fatContent": "13 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "105.4 mg",
            "sugarContent": "19.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-10-29T01:08:57.343Z",
                "reviewBody": "These are really great cookies! Mine took a little longer to bake (maybe about 11 minutes). I left them in until they started to crack a bit on the top and looked like they had set. I used the Ghiradelli candy white chocolate for the coating and it worked better than the white chocolate with the shortening - I tried both and the candy was smoother and easier to use. Both tasted amazing! I just preferred the ease of the candy! Delicious!!! My husband said they tasted like brownies with chocolate on top!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KMCCOR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-01T05:21:48.223Z",
                "reviewBody": "I made these cookies years ago from a recipe I found in a Hershey’s book. I lost it during the last move but realized this was the same. My husband confirmed on the Hershey’s site that it matches so mystery solved! I made the cookie batter exactly as it called for. My first batch on the cookie sheet I made too large so I started to make them smaller and worked out great. They do puff up a little but retains their shape for the most part. The only thing I did differently was the white chocolate. I put some in a ziplock bag, microwaved until soft and snipped off a corner to drizzle it on. This created more of a bandaged look. I didn’t add shortening because I didn’t want it to runny and then the drizzle melt into one big layer. The cookies taste like cakey brownies (which I don’t usually care for, I want fudgy) but these pack so much flavor they are delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BluLouPea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5294818/"
                }
            }
        ]
    }
]