[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15869/cream-puffs/",
        "name": "Cream Puffs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F04%2F20%2F6206622.jpg",
            "width": 1144,
            "height": 1144
        },
        "datePublished": "2000-01-28T14:58:14.000Z",
        "description": "An easy and impressive way to make a great dessert.  Whip them up and watch them disappear!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "20 to 25 cream puffs",
        "recipeIngredient": [
            "2 (3.5 ounce) packages instant vanilla pudding mix",
            "2 cups heavy cream",
            "1 cup milk",
            "½ cup butter",
            "1 cup water",
            "¼ teaspoon salt",
            "1 cup all-purpose flour",
            "4 eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together vanilla instant pudding mix, cream and milk. Cover and refrigerate to set.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large pot, bring water and butter to a rolling boil. Stir in flour and salt until the mixture forms a ball. Transfer the dough to a large mixing bowl. Using a wooden spoon or stand mixer, beat in the eggs one at a time, mixing well after each. Drop by tablespoonfuls onto an ungreased baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes in the preheated oven,  until golden brown. Centers should be dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the shells are cool, either split and fill them with the pudding mixture, or use a pastry bag to pipe the pudding into the shells.\n"
            }
        ],
        "recipeCategory": [
            "Desserts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Shellie Wendel"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6110381077529565,
            "ratingCount": 1522,
            "itemReviewed": "Cream Puffs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "189.7 calories",
            "carbohydrateContent": "15.2 g",
            "cholesterolContent": "76.9 mg",
            "fatContent": "13.3 g",
            "fiberContent": "0.2 g",
            "proteinContent": "2.9 g",
            "saturatedFatContent": "8 g",
            "servingSize": null,
            "sodiumContent": "230.6 mg",
            "sugarContent": "8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-09T19:35:00.373Z",
                "reviewBody": "This was a very good, easy recipe - my only gripe (therefore 4 stars) is that I had to read all the reviews to get it right b/c the instructions were somewhat lacking.  I added about 2 tsp of vanilla and 1 tblsp of sugar to the puff batter, and reduced the eggs to 3 b/c of reviewer's comments about the puff pastry being too eggy.  I think 4 eggs would've been fine, too - I don't mind them being eggy or a bit on the light side flavor-wise since the custard is so sweet.  But it's ESSENTIAL to poke a hole the last couple of mins of baking the puffs so they don't collapse. It's also ESSENTIAL to let the dough cool before adding eggs, otherwise the eggs will start \"cooking\" in the dough & not mix in. Also ESSENTIAL to beat in as much air as possible when mixing the eggs until the dough is a sticky, elasticky, \"chewy\"  consistency.  Maybe Shellie could add these important instructions into the recipe?  While experienced bakers may know this as \"common knowledge,\" a lot of new bakers may not.  I made big ones and bite sized ones - even the big ones cooked through in about 25-28 mins.  Just gotta poke that hole.  To cut back on calories in the filling, I just made the pudding recipe as is, with fat-free milk.  Was still delicious.  I plan on making it with heavy cream for guests later this week.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "w",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-10T22:51:33.797Z",
                "reviewBody": "Awesome recipe and so easy with such elegant results.  I've made this recipe more times than I can count, and haven't changed a thing, except making the prep easier.  No need to cool the water/butter mixture.  Put the hot liquid into your mixer bowl and dump all 4 eggs in at once and mix IMMEDIATELY on med. speed. Mix until the dough is tacky and starts sticking to the side of the bowl and you're done - about 2-3 min. (Mixing in one egg at a time makes no difference in dough texture and only allows more time for your eggs to curdle in the hot liquid.) I use a heaping tablespoon of dough for each, bake exactly 20 min and then poke a small hole with a toothpick in the side of each puff.  No need to let it sit in the oven (or it will dry out)or leaving the oven door ajar while cooling. Just let the steam escape with a toothpick and cool.  Forget all the complicated posts on how to prevent deflation.  I make this professionally for a bakery and my easy tips have never failed - try it.***Update- PLEASE use parchment paper to bake or it will stick. Don't grease your cookie sheet, or the bottoms will burn or get too brown.  Also, add one teaspoon vanilla extract. This will help diminish with the 'eggy' taste. Good luck, and keep trying if you fail the first time. This should be a no-fail recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-05T20:15:18.67Z",
                "reviewBody": "Wonderful recipe!  Very light and delicious.  A tip, though, for this and all cream puff recipes: After baking is finished, turn off the oven, crack the door open with a towel or potholder, and let stand in the oven for about an hour.  This prevents them from sagging!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LCAROLINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-14T22:11:21.357Z",
                "reviewBody": "The ingredients for the recipe were acceptable, it was the directions that lacked proper instructions.  Cream puffs need to be thoroughly dried out or they will fall and be soggy.  After making one batch of soggy puffs I did a little research in order to have success the second time around.  When finished baking, poke a small hole in the side of the puff to let steam escape.  Return to the oven for 10-15 minutes with the door open to continue drying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CHARITYBOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T22:43:54.02Z",
                "reviewBody": "Simply delicious.  Very easy to prepare.  To cut down on clean up and to make filling the cream puffs a snap, put the pudding mix, milk and cream in a zip top bag.  Shake and massage the mixture until uniform, then place in the refrigerator to set (this takes about 15 minutes or so).  Once set, cut about 1/8 of an inch off the tip of the bag.  This way, instead of trying to spoon the mixture into the cream puffs by hand, or transfering the mixture to a pastery bag, you can directly pipe the mixture into the puff.  Be sure to cut only an 1/8 of an inch or so off the bag to ensure maximum control of the amount of filling you're putting into the puffs.  Fill the mixture from the bottom of the puff by making a tiny incision (I used the tip of a steak knife), that way the puff will remain whole and look more appetizing when served (as opposed to slicing it in half and filling it like a sandwich).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dino II",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/837568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-27T02:44:24.367Z",
                "reviewBody": "This recipe is fabulous IF you read the comments of how to successfully make them.  If you don't read the comments you will end up with beautiful cream puffs that deflate while cooling.  Here's how the directions should read:\n\n1. Place the butter and water in a heavy saucepan over medium heat and bring to a boil.  Remove from heat and with a wooden spoon or spatula, quickly add the flour mixture.  Return to heat and stir constantly until the dough comes away from the sides of the pan and forms a thick smooth ball (about a minute or two).\n2. Transfer the dough to your electric mixer and beat on low speed a minute or two to release the steam from the dough.  Once the dough is lukewarm start adding the eggs and continue to mix until you have a smooth thick paste.\n3. Spoon or pipe mounds of dough onto the baking sheet spacing them a couple of inches apart.\n4. Bake at 400 degrees for 15 minutes and then reduce the oven temperature to 350.  Bake for a further 30 to 40 minutes or until the shells have browned and are dry inside.\n5. PRICK EACH PUFF WITH A TOOTHPICK to allow steam to escape and prevent them from falling.  Turn the oven off and, with the oven door slightly ajar, let the shells dry out for a further 10-15 minutes.  Remove from oven and let cool on a wire rack.\n\nI hope this helps all new cream puff chefs and prevents you from having your first attempt flop like me.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2875129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-16T17:00:47.967Z",
                "reviewBody": "Well.. all the reviews say its amazing! I'm a good cook but I have no idea what happened. Very disappointed. The puffs turned into mush, they never did puff or dry, instead they fried in the oven. WHAT WENT WRONG?!?! HELP!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Razoun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-12T17:16:12.97Z",
                "reviewBody": "I have a comment and a question.  The cream is awesome to say the least, however please tell me where I went wrong.  My shells did not rise much at all so I could not fill them.  I had to use one for the bottom and one for the top.  Also, I baked them on a nonstick cookie sheet and the bottoms stuck to the sheet.  Where did I go wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ttsmom02",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1937373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-14T17:59:15.56Z",
                "reviewBody": "This was so simple I have to say!  And the cream filling is to die for, I added a little almond extract to mine.  I brought this to work, and boy do they just think I'm the next best thing!  If you've never made these before, a trick I used was to pipe the dough with a star tip into mini muffin tin.  It helped control size and made it so easy to remove them.  Plus the star tip gave them a pretty look!  Great recipe!  Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1522123/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cream Puffs",
            "description": "Vanilla pudding makes the easy creamy center for this impressive dessert.",
            "uploadDate": "2012-08-14T23:32:48.334Z",
            "duration": "PT4M15.744S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc6de5da0-56f5-4087-8e4a-f085ce8a53f8%2Fd9b53349-0f53-484d-8bc5-d0c8af653cb2%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1785602350001"
        }
    }
]