[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2270/main-dish/savory-pies/shepherds-pie/",
                    "name": "Shepherd's Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16156/ground-beef-shepherds-pie/",
        "name": "Ground Beef Shepherd's Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1648583.jpg",
            "width": 1920,
            "height": 978
        },
        "datePublished": "2000-02-16T01:26:34.000Z",
        "description": "Here's a quick, throw together recipe for shepherd's pie. Browned meat smothered in rich mashed potatoes with your favorite vegetables. A quick and easy dinner to make for your family.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "1 onion, chopped",
            "1 pound lean ground beef",
            "1 teaspoon dried basil",
            "1 clove garlic, minced",
            "1 cup green beans",
            "1 cup tomatoes, diced",
            "2 potatoes, cooked and mashed",
            "1 egg, beaten",
            "½ cup water",
            "¼ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degree F (175 degree C). Coat a 2 quart casserole dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Cook onion in oil for 5 minutes, stirring frequently. Stir in the ground beef and basil, and cook and stir for 5 more minutes. Mix in the garlic, green beans, and tomatoes, and simmer for 5 minutes. Transfer beef mixture to prepared dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, mix together the mashed potatoes, egg, and water. Spread evenly over meat mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated oven for 15 to 20 minutes, or until potatoes start to brown on top. Sprinkle with cheese, and continue cooking for 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Shepherd's Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GINGER P"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.150557620817844,
            "ratingCount": 538,
            "itemReviewed": "Ground Beef Shepherd's Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "404.3 calories",
            "carbohydrateContent": "25.1 g",
            "cholesterolContent": "128.3 mg",
            "fatContent": "21.1 g",
            "fiberContent": "4.3 g",
            "proteinContent": "28.2 g",
            "saturatedFatContent": "7.8 g",
            "servingSize": null,
            "sodiumContent": "228.7 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-28T01:22:07.357Z",
                "reviewBody": "I think Ginger P. has given us a terrific basic recipe that you can change to suit your own tastes!   My husband and I really like bold flavors, so here are my modifications.  I seasoned the meat heavily by adding garlic powder, onion powder, salt, pepper, basil, and a small pinch of red pepper.  I too, added 1 bag of frozen mixed veggies, thawed in the microwave.  Once I had my meat mixture, onion, spices, and veggies combined, I added 1 can of cream of mushroom soup.  Also, I doubled the potatoes.  I mashed them with 1 small can of evaporated milk, and 1/2 stick of butter, 1 egg, salt, pepper, and some garlic powder.  Oh and every chance I get now, I substitute ground CHICKEN for ground beef!  I saw it earlier this year at the grocery and decided to try it.  It is SO good, and not at all like the flavor of ground turkey which can be very stong.  This dish turned out SO good and was very flavorful!   Play around with it and have fun :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1214986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-06T14:34:32.05Z",
                "reviewBody": "Considering I enjoy bolder flavors & shepherd's pie can be somewhat bland, I made this for a church potluck & doubled the ingredients - using 1 lb of spicy breakfast sausage & 1 lb of lean ground beef (like my family does meatloaf), browned the meats with the minced garlic & diced onion (instead of sauteed in oil) & drained the fat.  Added a packet of dry beef & onion soup mix with 2 cups of water & brought that to a simmering boil.  Disolved a few tablespoons of corn starch in another cup of cold water adding slowly to mix.  Voila!  Instant beefy/onion gravy!  Spread that out in my baking dish & layered the drained diced tomatoes, green beans, with an added a can of drained corn.  Lightly salted the layerd veggies.  Always running late, I chose to use boxed dehydrated real potatoes (4 cups of water, 1 cup milk, 1/2 stick butter, 1/2 tsp salt, boiled then added 4 cups of dry potatoes.  Instead of the additional cup of water, I used a cup of sour cream & then mixed in the beaten egg)!  Using a disposable force-bag & a wide tip, topped everything with the high peaked potato stars.  (Appearance and presentation is everything at church potlucks!) Nicely filled a 9X13 deep baking dish.  Baked 25 minutes until potato peaks started to become light golden brown, topped with the cheese & baked another 10 minutes until the cheese melted.  Voila!  The ladies were impressed & asked me how I did it ...  ... That's always a wonderful compliment for a guy who enjoys cooking & good eats!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "James Coop Jr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/803823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-13T03:55:37.45Z",
                "reviewBody": "I made this with a few modifications, after reading other reviews, and evaluating my pantry. Firstly, I ommitted the oil, because I didn't think it was necessary, and added more fat. I browned the ground beef with the chopped onion, and about 2-3 teaspoons garlic powder, as I didn't have any garlic on hand. After draining the fat from the beef, I added 1 can of cream of mushroom soup, and half a packet of dry onion soup mix. I then added the green beans and tomatoes, and also a can of corn. It was plenty to fill a 9x13 dish,  so I doubled the potatoes. I actually used 6, because they were smaller. I didn't add any water to the potatoes, just a tiny bit of milk for creaminess, and stuck with one egg, even though I had tripled the potatoes. I made a mistake and topped it with cheese before baking, instead of later on, but it turned out just fine. This is a wonderful dish that has been added to my list of staple meals for our family. My husband just loved it, and we didn't even put ketchup on it! (That's saying a lot; I eat ketchup on everything.) So thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dorese",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1486849/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-07T07:26:19.52Z",
                "reviewBody": "Excellent basic recipe to run with.  As a suggestion for a more \"dishy\" dish, try tweaking the topping by mixing the cheese into the mashed potato topping and also adding a bit of sour cream and chopped green onions.  Lovely and rich!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deborah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2105329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-06T18:12:15.16Z",
                "reviewBody": "This could be an excellent base for your own pie.  First - not enough mashed taters!  Double it, plus the cheese (mix in the cheese with the taters and make sure you add milk and butter when you mash.  Heavenly.  Secondly, there is no gravy with this recipe.  I usually add beef broth thickened with a roux to the meat and veggies.  Also, the meat is bland so I added a bit of garlic powder and a couple teaspoons of worcestershire sauce and it really made a difference.  We're Australian, so this pie is daily fare in Oz.  Sometimes I've even added a couple teaspoons of horseradish to the potatoes - a little goes a long way, but it sure adds a lovely taste.  Good basic recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LemonLush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bellesaz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T20:43:14.303Z",
                "reviewBody": "Fancy food it is not, but a downright awesome staple food it is!  Tweaked it a little using corn and peas as it seemed the versions I ate in London and in Boston had these veggies.  I was tempted not to add the egg to the mashed potatoes, but don't...some kind of reaction happens and the taters fluff up tremendously, making them not so heavy and much easier to spread over the beef mixture.  As other reviewers suggested, I added quite a bit of seasoning to my taste.  Definitely a keeper.  Thanks, Ginger!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAREN WANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/487729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-01T22:35:23.45Z",
                "reviewBody": "This did not knock our socks off but it's an easy recipe to play around with...adding or taking away what you like.  Instead of adding the canned tomatoes and green beans, I used a can of tomato soup with vegetables and a can of corn.  I also seasoned my ground beef really well, using different spices to prevent that \"bland\" taste.  I topped this with a handfull of cheddar. You can also prepare this the night before and leave in the fridge.  Just don't add the cheese until your ready to bake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-30T03:38:51.31Z",
                "reviewBody": "This recipe turned out awesome!! I agee with some of the others to use more potatoes. I used for small potatoes which would be equivalent to the two called for in this recipe. Next time I will use four large potatoes. I also added a dash of red wine and seasoning salt to the ground beef before sautee-ing. Very flavorful!! Will definately make this again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaye McGlothen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/715611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-10T18:01:13.843Z",
                "reviewBody": "I seasoned the meat with taco seasoning left out the onion and basil. Used a fresh diced tomato canned green beans ad corn. Using 4 red potatoes adding 2 tbl butter and some cream cheese. Turned out FANTASTIC.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIZTIQGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1174258/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Ground Beef Shepherd’s Pie",
            "description": "See a quick-and-easy version of beefy shepherd’s pie.",
            "uploadDate": "2012-10-01T19:20:36.720Z",
            "duration": "PT3M49.354S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0f1ad264-095e-4cd2-996b-a05d75da0c5b%2F4fbd35fb-be89-4928-946a-2da5f6e89660%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1871285060001"
        }
    }
]