[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1469/main-dish/beef/pot-roast/",
                    "name": "Pot Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16346/maries-easy-slow-cooker-pot-roast/",
        "name": "Marie's Easy Slow Cooker Pot Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F02%2F3566746.jpg",
            "width": 960,
            "height": 960,
            "caption": "Marie's Easy Slow Cooker Pot Roast"
        },
        "datePublished": "2000-02-20T12:56:41.000Z",
        "description": "Moist and juicy pot roast done in a slow cooker with carrots, onion and potatoes.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT9H0M",
        "totalTime": "P0DT9H40M",
        "recipeYield": "6 to 8 servings",
        "recipeIngredient": [
            "4 pounds chuck roast",
            "salt and pepper to taste",
            "1 packet dry onion soup mix",
            "1 cup water",
            "3 carrots, chopped",
            "1 onion, chopped",
            "3 potatoes, peeled and cubed",
            "1 stalk celery, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season the roast with salt and pepper to taste. Brown on all sides in a large skillet over high heat, about 4 minutes per side.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the roast in the slow cooker and add the soup mix, water, carrots, onion, potatoes, and celery.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and cook on Low setting for 8 to 10 hours.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Pot Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marie Thomas"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.587837837837838,
            "ratingCount": 2368,
            "itemReviewed": "Marie's Easy Slow Cooker Pot Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "540.2 calories",
            "carbohydrateContent": "18.2 g",
            "cholesterolContent": "147.4 mg",
            "fatContent": "30.6 g",
            "fiberContent": "2.8 g",
            "proteinContent": "45.7 g",
            "saturatedFatContent": "12.1 g",
            "servingSize": null,
            "sodiumContent": "271.9 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-22T16:19:32.813Z",
                "reviewBody": "This is the first thing I cooked in my new crockpot.  Taking other reviewers' advice, I browned a 3.66 lb. boneless chuck roast in a little olive oil after rubbing low sodium Montreal Steak Seasoning and 1 chopped fresh garlic clove.  I cut the roast in half before setting it in the crockpot as it was so big.  I used 2 cans of beef broth instead of water and used small red potatoes, along with 1 sliced onion and I also chopped up some baby carrots, 2 more cloves of garlic and omitted the celery.  Halfway through I ended up adding more potatoes and carrots as I didn't think I had enough veggies. I'm glad I did as the veggies I first included basically turned to mush (but goooood mush).  I also added garlic pepper and garlic salt along the way to taste as it cooked.  This cooked on low from 915am to about 630pm, but really was ready about an hour before.  My husband took a little flour with 3/4 of the juice and some more garlic pepper and made an excellent gravy.  The juice was so hot from the crock pot that we didn't need to put it into a sauce pan. just whisked it up in a bowl.\n\nI have to say, this is the best pot roast.  The recipe is a good template that you can play around with to taste.  The only things I woud change is that I would use whole baby carrots and add in the veggies (all except the onions) about halfway through instead of straight at the beginning.  The other reviewers' comments really helped me in fixing this recipe to my own taste.  It worked out wonderfully",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bethanie Bridges",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2726467/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-30T03:40:32.403Z",
                "reviewBody": "Don't make the mistake I did at first.  The roast I was cooking was only 2 pounds so I thought, \"Half the weight means half the cooking time.\"  After only 4 hours of cooking in the crock pot, the roast was edible--it had a nice flavor and we could definately get our teeth through it, but it wasn't even close to the glorious \"fall apart on your plate\" stage.  We didn't need all of the roast to feed the four of us for dinner, so I left the rest of it in the crock for an additional 4 or 5 hours and by the time I took it out, it was a fabulously tender and tasty roast.  I'm glad I'll know for next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAWANDMEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-28T01:39:50.593Z",
                "reviewBody": "I loosely followed this recipe, and chose it because I wanted an alternative to the standard cream of mushroom soup (I don't mind it too much, but I'm not the biggest fan). I had just over two pounds of beef. To avoid having it turn out bland, I added 1 cup of beef broth instead of water, 1/4 c Worcestershire sauce, parsley, and two cloves of garlic minced. I didn't have onion soup mix, so I added around a tablespoon of onion powder, and some salt and pepper. I also cut up one large carrot, two stalks of celery, 5 small potatoes. Then, I let it all sit and marninade overnight in the slow cooker dish in the fridge. I followed the rest of the directions as written, turning on the slow cooker and letting it all cook 10 hours while I was driving to and from or at work. When I got home, it smelled wonderful (my husband had to smell it all day!) and the meat was falling off the bone. I sampled some of the veggies and almost couldn't stop eating them! I made Sky High Yorkshire Pudding with this (highly recommended). With my slight variations, I give this recipe a 5! Great base to start with and adjust to your taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CafeYork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2397028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-18T14:34:54.95Z",
                "reviewBody": "It would be very helpful and courteous to review a recipe made EXACTLY the way it is written. It is not beneficial at all to read how you rated your own recipes using another person's name. Marie, your recipe made as written, is excellent. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pems008",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2761254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-19T23:23:00.983Z",
                "reviewBody": "THIS IS AWESOME.  Boyfriend and I couldn't believe it!  I modified the recipe based on other people's comments.  Everyone was saying to add Montreal Steak Seasoning, which I didn't have. So I looked it up and it's basically comprised of pepper, salt, and paprica. For the rub i combined 1 Tbsp each  of kosher salt, crushed peppercorns (i crushed), and paprika. I also added about 1 tsp. of garlic powder. This I rubbed on the meat and sprayed a little olive oil over top. To the pot, i added 3 large chopped carrots, six or so small red potatoes (chopped), an onion, and half a container of small fresh mushrooms. Additionally, I added 2 bay leaves, about a tsp. of worshire sauce, and the onion soup mix along with the water. Didn't have celery.  SUPER SPICE-A-RIFIC!!!  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Simone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2152437/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T23:50:36.75Z",
                "reviewBody": "I have cooked a lot of roast in my day and this is the ONLY time it has come out perfect!  I didn't add any vegetables with it except for cutting an onion in half and setting it on top of the roast for the last 3 hours of cooking time.  I made mashed potatoes and green beans separate, just don't like my potatoes to taste like anything except potatoes.  I also whisked 2 teaspoons of cornstarch with 1/2 cup water and added to the au jus that I transfered to a sausepan.  I boiled the au jus mixture for about 5 minutes, whisking often, for a wonderful brown gravy.  I was tempted to not cook it as long as the recipe calls for, but please just let it cook and keep check on the liquid level.  Roast cooked this way just melts in your mouth!  Thanks for sharing your talent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wilemon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/536781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-05T20:28:08.483Z",
                "reviewBody": "Used CHUCK roast-important! Quartered red potatos and put in crockpot with baby carrots. Boiled 1 cup water with 2 beef bullion cubes in microwave. Sprinkled most of the dry onion soup over vegetables(just potatos and carrots-didn't use celery and onion), then added stirred beef bullion and stirred the veggies. Browned roast seasoned with salt, pepper, and garlic powder. Added roast to crockpot,sprinkled remaining dry onion soup mix on roast and spred with a little water,  and cooked for 5 hours on HIGH. Removed roast and vegetables to rest and added gravy to skillet whisking in a half cup of water with 2 TBLS flour to thicken. This was abolutely the BEST! I like the strong flavor it gives the carrots, but you may wish to steam them separately.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUIN33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/696810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-07T14:20:45.243Z",
                "reviewBody": "why do people take a recipe and turn it into another totally differtn recipe using it as a review? Just create a new recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Auntie m",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3238339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-04T20:58:21.07Z",
                "reviewBody": "This was fabulous. I took a few reviewers advice and soaked the roast in red wine vinegar over night. I made a rub with pepper, salt, lemon pepper and freshly minced garlic and then browned the roast on all sides. I was using my mother-in-law's roaster and it didn't have low, med and high so I set it to about 200 degrees  for 8.5 hours. I added the onion soup mix, some onion, lots of garlic, carrots, some celery we needed to get rid of and 2 potatoes. We served it with Sky High Yorkshire Pudding (allrecipes.com) which was great! We also had garlic mashed potatoes and an easy green salad. This was an AT recipe and we'll use it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HollyAnne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2115980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-12T21:01:23.183Z",
                "reviewBody": "I followed the recipe exactly and was a bit disappointed. I had high hopes starting out but the end result was rather bland. Don’t get me wrong, the meat was nice and tender, the veggies yummy (a little mushy, but a good mushy), and there was plenty of gravy. However it needed flavor, also searing the meat with salt and pepper didn’t do anything for it. What I would do next time is sear the meat with Worcestershire, olive oil, and a little butter. Then after I put the meat into the crock-pot with veggies on top of the meat. I would deglaze the pan with a mix of either Merlot or Cabernet Sauvignon and beef stock. Then I would pour the liquid with pan drippings into the crock-pot. I’m not sure if I would use the onion soup mix or not, I think that would depend on the users personal preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "fearevilchickens",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7452226/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Marie's Easy Slow Cooker Pot Roast",
            "description": "Make a top-rated pot roast that’s quick and easy.",
            "uploadDate": "2012-08-08T22:03:13.810Z",
            "duration": "PT3M0.055S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F21bb4097-1658-4d18-aaa1-d886924b9c6b%2Fed8c776a-d60b-4217-a4e8-3956b2307e6c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1777235226001"
        }
    }
]