[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27093/hoagie-bake/",
        "name": "Hoagie Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7350788.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:43:50.000Z",
        "description": "A great, fairly quick recipe for a delicious hoagie bake.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 (8 ounce) packages refrigerated crescent rolls",
            "¼ pound salami, sliced",
            "¼ pound cooked ham, sliced",
            "¼ pound pepperoni sausage, sliced",
            "8 slices provolone cheese",
            "8 slices Swiss cheese",
            "3 eggs, beaten",
            "2 tablespoons grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Coat a 9x13 inch baking dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover bottom of baking dish with 1 package crescent roll dough. Layer with salami, ham, and pepperoni. Cover meat with a layer of Provolone cheese and Swiss cheese. Spread 1/2 of the beaten eggs over the cheese. Top with second package of crescent rolls. Brush with remaining beaten eggs, and sprinkle with Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake, uncovered, in the preheated oven for 25 minutes. Cover with foil, and bake for another 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.448170731707317,
            "ratingCount": 328,
            "itemReviewed": "Hoagie Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "619 calories",
            "carbohydrateContent": "24.9 g",
            "cholesterolContent": "153.5 mg",
            "fatContent": "42.8 g",
            "fiberContent": null,
            "proteinContent": "30.9 g",
            "saturatedFatContent": "18.2 g",
            "servingSize": null,
            "sodiumContent": "1490 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-25T14:55:06.623Z",
                "reviewBody": "I have made this many times using refrigerated pizza dough.  To keep it from being so greasy, microcwave the salami and pepperoni between paper towels.  I don't use the egg, but put pizza sauce over the meat and cheese.  I spray the top of the dough with non-stick spray and sprinkle Parmesean cheese, garlic powder and oregano.  Use more pizza sauce for dipping.  Great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KathyB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/796762/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:27:46.537Z",
                "reviewBody": "This recipe is quick easy and very versitile. Not being a salami fan I added turkey instead. I have made the recipe twice now. Once with and once without the egg. If you use the egg cut it in half. Both times I added creamy italian dressing for a little extra flavor. I would say this is a must. You really need something to give it a kick. Already we are thinking of what other hoagie ingredients we can swap out for a new taste. I used crescent rolls and liked the taste but it is a little greasy. Definately use low fat meats.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-31T17:35:16.03Z",
                "reviewBody": "You only need 1 or 2 eggs; I used 3 and it was a waste of eggs. This was a very rich/heavy/greasy meal but my husband enjoyed it. I bet if you listen closely enough you can hear your arteries clogging up! (LOL) It was more like stromboli than a hoagie. I sprayed the pan with cooking spray as someone suggested which I think really helped. Wish I had seen other reviewers' suggestions to add oregano onions and mushrooms before I made mine I think it would have really enhanced it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-31T15:55:14.323Z",
                "reviewBody": "Excellent! Quick easy tastes great. Since others were saying it is so greasy causing the bottom layer of dough to get soggy I microwaved the meats on paper towels on medium power for just a couple of minutes which got a lot of the grease to come out soaked it all up with paper towels before preparing the hoagie bake came out great and less fat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allison Buckley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-19T03:35:25.333Z",
                "reviewBody": "Current review: I made this again but used pizza dough instead of crescent dough per others' comments. All I can say is if you want pizza make pizza. This recipe really is more interesting and special when made with the crescent dough. Also 2 eggs are plenty. Finally a good addition was to saute a red pepper cut into strips in olive oil and garlic; place between the meat and the cheese layers. Prior review: This turned out well; my husband and brother loved it. For me I recommend adding \"flavor\" and \"color\" items such as herbs tomato slices or sun dried tomatoes mushrooms spinach thinly sliced sweet onion and/or marinara sauce. Nevertheless this was good just as is...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Trieste50",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-31T17:35:16.293Z",
                "reviewBody": "This is SOOOO good! I've cooked it several times and have made different variations of it. My favorite so far is substituting pizza dough for the crescent rolls that the recipe calls for. The crescent rolls have a slightly sweet taste to them that I don't personally care for. I also put italian dressing on over the last layer of cheese then the egg over the italian dressing. After brushing the top layer of bread (crescent or pizza dough) I sprinkle garlic powder and parmesan cheese. I also use all Provolone cheese since I don't like Swiss cheese. Very good lots of compliments and the whole family agrees that they like the pizza dough version the best. They like the consistency of it. I may try it with pizza sauce instead of italian dressing next time! Thanks for the wonderful recipe and a basis to start with that I could play around with!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RABERNET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/73862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-21T22:51:13.407Z",
                "reviewBody": "I'd rate this 5 stars if I didn't have to make changes. I left out the egg because I thought it sounded yucky. I briefly microwaved the salami and pepperoni to render some of the grease. I didn't have any swiss cheese so I substituted a good quality deli sliced American cheese. Sprinkled the meat with some oregano and sliced hot pepperoncinis to make it more hoagie-like. My husband and I really liked the finished dish. He thinks I should use some tomato sauce next time to make it more like pizza but I think that would defeat the purpose of a \"Hoagie Bake\". I was looking for a way to use up a pound of dry salami I had in the fridge and this was perfect. Will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-22T20:36:36.017Z",
                "reviewBody": "I read the reviews and decided to change this is a bit. Smoked turkey instead of the pepperoni only half the salami and mozzarella instead of provolone. We LOVED it! It did not turn out greasy at all - we could pick our pieces up with our hands and eat them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZCANCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/880574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-19T19:32:35.37Z",
                "reviewBody": "I've used this recipe for a long time and have never reviewed it so I figured it was about time. I love this recipe. I basically use ham and cheese and it turns out just wonderful. It reminds me of the ham and cheese rolls a store up the street from where I grew up as a kid sold. They were the best but now that store is out of business. I'm glad that I can still have something that tastes like them when I want. Quick easy good. Who could ask for more?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Lias Payne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jendavis/"
                }
            }
        ]
    }
]