[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16427/slow-cooker-italian-beef-for-sandwiches/",
        "name": "Slow Cooker Italian Beef for Sandwiches",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F11%2F178087.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-01-31T16:32:29.000Z",
        "description": "This makes a sandwich similar to one I used to get at a local restaurant when I lived in a suburb of Chicago. My all time favorite! Serve on crusty rolls with roasted sweet or hot peppers, if desired.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT12H0M",
        "totalTime": "P0DT12H15M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "3 cups water",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "1 teaspoon dried oregano",
            "1 teaspoon dried basil",
            "1 teaspoon onion salt",
            "1 teaspoon dried parsley",
            "1 teaspoon garlic powder",
            "1 bay leaf",
            "1 (.7 ounce) package dry Italian-style salad dressing mix",
            "1 (5 pound) rump roast"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine water with salt, ground black pepper, oregano, basil, onion salt, parsley, garlic powder, bay leaf, and salad dressing mix in a saucepan. Stir well, and bring to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place roast in slow cooker, and pour salad dressing mixture over the meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on Low for 10 to 12 hours, or on High for 4 to 5 hours. When done, remove bay leaf, and shred meat with a fork.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MAUREENBURR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.632192553591576,
            "ratingCount": 2659,
            "itemReviewed": "Slow Cooker Italian Beef for Sandwiches",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "318.2 calories",
            "carbohydrateContent": "1.6 g",
            "cholesterolContent": "100.4 mg",
            "fatContent": "15.8 g",
            "fiberContent": "0.2 g",
            "proteinContent": "39.4 g",
            "saturatedFatContent": "5.6 g",
            "servingSize": null,
            "sodiumContent": "819.1 mg",
            "sugarContent": "1.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-21T13:16:29.543Z",
                "reviewBody": "Absolutely AWESOME!!! The prep couldn't have been easier, and the house smelled wonderful all day.  To save others some time, I read most of the 150+ reviews, and here are the most consistent suggestions that I believe made the recipe: 1) Use a chuck roast instead of rump, as it shreds better (and is cheaper!).  2) Subsitute beef broth for the water  3) Double the salad dressing mix 4) After shredding the beef, put it back in the crockpot to cook an additional half hour to soak in the juices.\r\nI only used a 2 1/2 pound chuck roast, but I used the amount of spices called for a 5 lb. one, and it was just perfect.  I cooked on low for 10 hours, and around the 8 hour mark I took the meat out to shred it and it was so easy, it practically fell apart.  I put it back in and it cooked for another hour and a half along with a couple pepperoncini before we finally got to eat.  I served on toasted hoagie rolls with a bunch of optional toppings....sauteed mushrooms, red onion, sliced pepperoncini and sliced roasted red peppers. Then ran the sandwiches under the broiler to melt the extra sharp provolone cheese.  My husband was in heaven and if we weren't already married I think this sandwich would have gotten me a proposal!  \r\nI had never heard of Italian Beef before, but this recipe makes me want to visit Chicago to try theirs!  Thank you for another permanent in our meal rotation!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MomSavedbyGrace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1366670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-25T12:37:34.327Z",
                "reviewBody": "Tasty and flavorful, as well as easy to make. There is an error in the list of ingredients: it calls for a 4.7 oz package dry Italian salad dressing mix. That would be way too much seasoning. The correct amount is a 0.7 oz package.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIHAELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-22T17:30:16.447Z",
                "reviewBody": "Originally from the Chicago 'Burbs, I've been looking for a good Italian Beef Sandwich recipe for AGES... and this one is the BEST I've found, by far! It tastes almost exactly like the ones I used to get \"back home\"... plus it's sooooo easy to make in the crockpot!\r\n\r\nI followed the recipe exactly, except I substituted beef broth for the water and added 2 packages of the italian salad dressing mix.  I also added a few sliced green peppers to the crockpot an hour or so before it was done. When it was done, I removed the peppers, shredded the beef, and then returned the shredded beef back to the liquid in the crockpot. I then served the shredded beef and peppers on toasted hoagie rolls. My husband and I were in HEAVEN!! :)\r\n\r\nOh, and here's a tip -- make sure you DON'T drain the meat before placing it on the rolls -- the liquid has an AWESOME taste, so make sure you get plenty of it on your sandwich for the best flavor. In Chicago they say \"the wetter, the better\" when it comes to Italian Beef Sandwiches!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindi M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/767105/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-21T22:51:34.177Z",
                "reviewBody": "Made these changes: omitted salt, substituted onion powder for onion salt, used 2 dressing mixes, added 1 1/2 tsp. dried onion, and added 2 beef bouillion cubes to the water.  Cooked on low for about 14 hours; shredded meat and refrigerated meat and juice separately overnight.  In the morning, I skimmed the fat off the juice, and returned the juice & meat to the slow cooker, along with some chopped green pepper, on high to reheat for a couple hours. Served with horseradish and provolone cheese. Was a hit at our family reunion! Leftovers (if any!) reheat well for a quick lunch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/871609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-01T15:27:45.717Z",
                "reviewBody": "I moved from Chicago, and the thing I miss most is the food!  This is a great recipe for the Chicago food blues.  I, too, used the 2 pks of dressing mix (I even use the Italian dressing mix on this site), crushed red pepper, the juice (~1/8 c.) of some sweet and hot peppers, and sliced peppers and onions and serve it on warm Italian bread with mozzarella cheese (with the peppers and onions).  The best thing to do is to have it cook in the slow cooker until it is cooked through, then slice it thinly and return it to the juice for about an hour (just like they do at the beef restaurants).  It was a hit at my daughter's family birthday party, and took hardly any effort.  THANKS SO MUCH FOR THE RECIPE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "(ME)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-19T15:26:14.867Z",
                "reviewBody": "This recipe was good as is but I now use it combined with 3 other recipes for french dip and it is great I use all of the ingredients in this recipe except use only 2 cups of water and leave out both the salt and onion salt I add 2 cups onion sliced thin sauted in 1/4 cup butter 1/2 cup soy sauce 1 can coke do not use diet or an off brand 1 12 oz. can dark beer 1 can beef broth 1 can condesned french onion soup campbells is best I use the zesty soup mix. I try to get at least a 5 to 6 pound roast rump is o.k. if its choice otherwise I use a sirlion tip roast this is much cheaper and less fat than a regular sirlion. I also add italian seasoning basil oregano thyme and white pepper. I slice the meat very thin like a french dip. update I have started leaving the water out and adding another can of low sodium beef broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CODEACE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-12T17:46:52.92Z",
                "reviewBody": "Made this for a casual supper last night and all who ate it said it was the best beef sanwich ever.  I followed advice of others and used 2 cups beef broth and one cup water; also two packages of Italian dressing mix.  My butcher suggested a chuck roast as it shreds more easily for sandwiches.  Slow cooked it and served with optional provolone cheese, thin-sliced red onion, mustard/mayo sauce and horseradish. Buy really good fresh rolls. Soooo yummy and sooo easy - THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JBANDK9S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1319610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-28T17:17:16.187Z",
                "reviewBody": "While the beef was moist and tender, there was way too much salt and pepper to make the broth suitable for dipping.  I ended up diluting it with about 2 cups of water.  Next time I'll eliminate the salt (canned broth is salty enough)and cut the ground pepper in half.  Otherwise, the Italian beef taste was definitely there and very good.  For the person in Phoenix, try Luke's at 16th Street and Indian School for their Italian beef.  It's the closest thing I've found to the real stuff.  A suggestion for another reviewer: If you want the beef sliced rather than shredded, make it the day before.  After a night in the fridge, slice it across the grain and gently warm it in the broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KAET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/75655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-24T21:41:59.653Z",
                "reviewBody": "This is fantastic! I've had so many people request this recipe. I'm really glad I found this recipe. I grew up in Chicago where you can order this anywhere you can buy pizza or a hot dog, but here in Phoenix no one has ever heard of it. It's my little taste of home. This is even better when you replace the water with chicken broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "APRIL4181",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-04T22:19:39.210Z",
                "reviewBody": "Not very impressive, I used beef broth and two packets of Italian and it was still kind of bland!  It was too expensive to make for the result we got.  so disappointed",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Marisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4236504/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Italian Beef for Sandwiches",
            "description": "Make this great Italian beef for sandwiches in your slow cooker.",
            "uploadDate": "2012-05-09T00:35:32.450Z",
            "duration": "PT2M16.277S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F930c2eaa-4495-45cb-83ed-494c6100232b%2F4b7cce1f-94d3-4a1b-8dd0-442a6f12b928%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1628833600001"
        }
    }
]