[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15855/bread/quick-bread/tortillas/",
                    "name": "Tortilla Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17500/corn-tortillas/",
        "name": "Corn Tortillas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1102056.jpg",
            "width": 3032,
            "height": 2250
        },
        "datePublished": "2000-04-18T01:49:07.000Z",
        "description": "This is the real thing!  A simple mixture of masa harina and water results in the most wonderful corn tortillas you ever tasted. The secret is to use a cast iron pan! You can buy masa harina at Mexican grocery stores or in the ethnic food aisle of large supermarkets.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "15 tortillas",
        "recipeIngredient": [
            "1 ¾ cups masa harina",
            "1 ⅛ cups water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together masa harina and hot water until thoroughly combined. Turn dough onto a clean surface and knead until pliable and smooth. If dough is too sticky, add more masa harina; if it begins to dry out, sprinkle with water. Cover dough tightly with plastic wrap and allow to stand for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat a cast iron skillet or griddle to medium-high.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough into 15 equal-size balls. Using a tortilla press, a rolling pin, or your hands, press each ball of dough flat between two sheets of plastic wrap.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Immediately place tortilla in preheated pan and allow to cook for approximately 30 seconds, or until browned and slightly puffy. Turn tortilla over to brown on second side for approximately 30 seconds more, then transfer to a plate. Repeat process with each ball of dough. Keep tortillas covered with a towel to stay warm and moist until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Tortilla Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "jenn"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.408376963350785,
            "ratingCount": 191,
            "itemReviewed": "Corn Tortillas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "145.6 calories",
            "carbohydrateContent": "30.4 g",
            "cholesterolContent": null,
            "fatContent": "1.5 g",
            "fiberContent": "3.8 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "3.6 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-22T22:43:43.187Z",
                "reviewBody": "This is a very \"basic\" corn tortilla recipe.  Traditionally, at least in Northern Baja - we use salt and 'additional' lime juice with the masa harina to prepare corn tortillas.  There aren't many different types of masa harina - because masa harina is corn flour made from corn and lime.  \nThe commonly available brand in the US is Maseca; although I believe Quaker also makes masa harina.  Maseca makes a masa harina for tortillas (white bag) and a masa harina for tamales (peach/brown bag).  Honestly I'm not sure what the difference is between the two because the masa harina for tamales doesn't include baking powder or salt... which must be added when making tamales.  So I believe the two are probably identical; but I cannot confirm this.  \n\n\nIn my experience corn tortillas don't \"puff\" (they are not made with baking powder, so they will not puff like flour tortillas would).  However, the corn tortillas should turn light/ med-light brown.  No oil is needed to 'cook' the tortillas - and although it is best to use a cast iron skillet - a comal can also be used (thin round griddle-like pan).   \n\nThe water amounts are just an estimation (as the temperature and humidity will always play a factor in the process).  I use a little less water and add as needed (until the dough doesn't stick).  Use  parchment paper instead of wax paper to press the tortillas (tortilla press is essential - but may be done using a heavy plate/pan.  This is not as effective and a press.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T05:25:45.59Z",
                "reviewBody": "A few helpful hints to an otherwise good recipe.\r\n\r\n1)  A tortilla press is definitely the way to go.  Less than ten bucks, no muss, no fuss.\r\n\r\n2)  Don't use plastic wrap or wax paper; both are too fragile and sticky.  Use a plastic freezer bag instead and cut the bag to size for your press so you wind up with two sheets of freezer bag plastic.  You still have to be careful peeling the formed tortillas off them but it's MUCH easier than wax paper.  You can reuse the plastic sheets; just rinse (or wash) and dry, then reuse.  Store them with your tortilla press.\r\n\r\n3) Like one other reviewer, I find a dash of salt helpful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SIEGELJD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/729146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-13T14:35:44.827Z",
                "reviewBody": "PLEASE note: for those who are having trouble with sticking, add a bit more masa... your masa is to wet. Here's how; Mix the masa and water with your hands until it does not stick to your hands or the large bowl you mix it in. Continue to kneed at least 3 minutes or longer THEN let it rest and hour or so covered with a damp towel. Make small balls, (golf ball size), and use parchment paper to flatten in a press. Enjoy, for these are wonderful and a delight to eat. I accidentally bought MASECA corn mix one day and now use it exclusively. I hope this helps those who are having trouble.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thegrindre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1279925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-18T12:46:16.287Z",
                "reviewBody": "Addendum: If you make the tortillas ''right'' they WILL puff up (or hinflar as we latin people say), no baking powder is needed. If you go to a tortilla making factory you will see the freshly made tortillas come out of the machine puffed up then flatten as they come off the conveyor belt. The trick to do this at home is to have made the masa done just right, then put it on the skillet and leave it to cook on one side for about 20 seconds then flip it over to the uncooked side and leave it for 10 seconds, then keep flipping it over every 10 seconds or so and press lightly on the corn tortilla occasionally. In some cases you will see some bubble on the surface of the tortilla, on others you will see it puff up dramatically (if you achieve this, congrats....you're Pro). Another tip is to make sure you have a thick cloth or tortilla holder ready and soon as the tortillas come off the comal/skillet, stick em in there and just keep putting in all your tortillas until done then wait about 3 min. Your tortillas will be soft and the final test for perfection is when you can take one tortilla and roll it tightly in your palm without it breaking. Viva tradicion!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KitchenGhoul",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2915205/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-22T23:46:47.437Z",
                "reviewBody": "Alrighty!! I make homemade corn tortillas everyday. There was a previous comment about the tortillas not puffing up. Well, they should puff up. The steam that is trapped within the tortillas makes the tortillas a lot softer.  The trick to this is knowing when to flip the tortillas. When you first make the Masa dough, knead the dough for about two minutes. The masa should not stick to your hands and cleans the sides of the bowl. You're griddle should be on Med. High. Lay your tortilla on the griddle when the tortillas doesn't stick flip it, then when you see golden brown marks on the edge of the tortilla, flip again. Gently press the tortilla in the middle to help it fluff. And there you go. It's not very time consuming. Just have to get into the practice of it. But whatever you do, DON'T add lime!! Or baking powder! The recipe above IS the way they make it in Mexico - that's where I learned. Hope this was helpful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Shurts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3947397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-09T19:08:35.317Z",
                "reviewBody": "My husband is Mexican and I \"home make\" tortillas every night.  He taught me how many years ago.  I have a tortilla press, and I use a  frozen sotrage bag cut to the size of the press circle.  I just throw a couple cups of the Maseca in the bowl, add warm water (warm makes a difference) and about 2 TBSPN. of flour, and mix together until it doesn't stick to your hands or the bowl.  Add Maseca or warm water until the desired consistency.  We use an oblong electric griddle and can cook 6 at a time and I have a tortilla storage tub you can buy at any Latino food store.  We also take the raw (uncooked) tortilla, add leftover cooked chicken and cheese, fold over, press together to seal and cook in a little grease in a frying pan on both sides until golden brown.  They are delicious.  You can add veges, or any meats or any ingredients you want.  These are to die for!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2661844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-29T07:38:40.107Z",
                "reviewBody": "I've come to love making tortillas at home, and I always use this recipe. But I don't have a press, so here's my technique: use a plastic cereal bowl like a cookie cutter to make a perfectly round tortilla. Then just take it off along with the top layer of plastic. Really cuts down on the mess, too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1003294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T18:56:23.02Z",
                "reviewBody": "I use a locally produced masa\r\navailable in our area to make corn\r\ntortillas very similar to your recipe.\r\nI have found that by substituting\r\ngood homemade stock (vegetarian\r\nor meat) makes for a better\r\ntasting tortilla. Sometimes on a few\r\noccasions I wil add a dash of \r\ngarlic salt, onion powder and pepper to the \r\nmasa just to give it a bit of a kick, but\r\nif really isn't necessary if you use\r\nstock as I mentioned. *I cut up small squares\r\nof wax paper to fit the tortilla press to form\r\neach tortilla, stack them one on top of the\r\nother and this avoid them sticking together. \r\n\r\nMake sure to store the tortillas in an airtight\r\ncontainer or ziploc bag in the frig if\r\nyou are not going to cook them immediately.\r\n\r\n** If the tortillas do stick together, as I read\r\nin some of the reviews, it is because\r\ntoo much liquid was used. \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Marco Salmon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/292433/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-04T05:52:05.28Z",
                "reviewBody": "These were great! I used parchment paper to roll the dough. It works wonderfully. No sticking at all. I added a bit of salt to the flour before mixing it with water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUBYWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646268/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Corn Tortillas",
            "description": "See how to make authentic corn tortillas from scratch.",
            "uploadDate": "2012-11-13T18:52:14.199Z",
            "duration": "PT3M23.328S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb2a40b89-5a8b-4ba0-921e-5b994c8ee5bd%2Fd72f163c-dcee-49e8-be7a-815d9779e869%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1966982664001"
        }
    }
]