[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
                    "name": "Stuffed",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17815/simply-lemon-baked-chicken/",
        "name": "Simply Lemon Baked Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1788.jpg",
            "width": 1841,
            "height": 1457
        },
        "datePublished": "2000-03-07T00:46:52.000Z",
        "description": "A whole roasting chicken sprinkled with fresh lemon and paprika, then slow baked with the lemon halves inside! This recipe is very easy and the chicken comes out moist and tastes great!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (4 pound) whole chicken",
            "2 tablespoons salt",
            "1 lemon, halved",
            "1 tablespoon paprika",
            "1 cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rub chicken with salt inside and out. Squeeze lemon juice from lemon halves over outside of chicken, then rub paprika over all. Place squeeze lemon halves inside chicken cavity, then place chicken in a lightly greased 9x13 inch baking dish. Pour a little water over chicken to prevent drying.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 300 degrees F (150 degrees C) for 3 hours, basting with water as needed.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Stuffed"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MOLLYMARIE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.503448275862069,
            "ratingCount": 145,
            "itemReviewed": "Simply Lemon Baked Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "493.2 calories",
            "carbohydrateContent": "1.9 g",
            "cholesterolContent": "170.3 mg",
            "fatContent": "34.3 g",
            "fiberContent": "1 g",
            "proteinContent": "42.5 g",
            "saturatedFatContent": "9.8 g",
            "servingSize": null,
            "sodiumContent": "1903.7 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-09T16:26:27.21Z",
                "reviewBody": "I made this dish last night for dinner, but I modified it a bit.  \n\nI rubbed the chicken with butter and lemon juice on the outside, then I followed it with Mrs. Dash.  I also rubbed the insides with Mrs. Dash before inserting the  cut lemons.  \n\nAfter the chicken was ready, I added about 2 cups of water to the pan, and followed it with about 3 cups of instant rice.  While the chicken cooked, the rice cooked.  The juices & lemon from the chicken seasoned the rice.  \n\nI covered it with foil and let it cook for two hours (it was a smaller chicken).  The last fifteen minutes I took off the foil and let it broil to just crisp the outer layer of skin.  \n\nLast minute mix the rice, and you're set to carve the chicken.  A whole dinner made in one dish.  \n\nGreat recipe. Would make again.  Family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROLLERPIXI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/865693/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T12:22:21.763Z",
                "reviewBody": "Absolutely the juiciest chicken I've ever had.  I was a bit alarmed by the amount of salt and paprika, but I went ahead and followed the recipe.  I think the salt & paprika form a crust which seals in the juices because I've never had such a juicy, tender chicken.  I will be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIKUKAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/143404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T13:54:38.763Z",
                "reviewBody": "This chicken is sooo easy- it is tender, moist and delicious!!  I used 1T of salt on the outside and 1-2t of salt for the inside. I do have one suggestion-seal the entire chicken in foil with 1/4C water, place in a roasting pan and cover. Put the chicken in the oven for 3 hrs and forget about it. This eliminates the need for basting. You'll have the juiciest chicken!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/234055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-20T17:09:09.9Z",
                "reviewBody": "While I like the flavor of lemon my husband likes things plain. So instead of drizzling lemon juice on the outside I just quartered a lemon and stuffed it into the chicken cavity along with a few sprigs of fresh rosemary and thyme. I drizzled a little olive oil over the chicken seasoned with salt pepper and paprika and the lemon/herb flavor was so subtle I could taste it but he could not quite indentify it so it was perfect! Chicken came out very moist and delicious. One change I actually baked at 375 and it took about 1 1/2 hours for a 6-ish lb. chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T11:01:58.077Z",
                "reviewBody": "I have made this recipe a couple of times and the chicken always turns out moist inside. When I made it the first time I worried that the skin would taste too salty but that hasn't been the case-its also nice and crispy. The aroma of the chicken baking is heavenly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AZILE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/132423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-06T19:53:57.14Z",
                "reviewBody": "What a simple recipe! The first time I made this recipe I followed it to the letter and it came out tasting like well baked chicken. Nothing spectacular. But I wanted to give it another chance so I made it again last night with six lemons instead of one (squeezing one whole lemon and a tiny bit of butter over it every 30 minutes and then basting it within an inch of its life) and it turned out lemony and delicious - very tender. Definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMA2DOUGLAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/876822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T20:57:47.86Z",
                "reviewBody": "I can't believe I haven't reviewed this yet - I've made this lots of times over the last few years! I am a fiend for anything citrus, so I hardly ever use just one lemon. Today I made it with two big lemons and a lime, which was delicious and adds much more flavor to the end result. One thing that never made sense to me was the order of the ingredients. Now I always start with the salt on the inside, then juice the lemons onto the chicken, then pat the outside with salt, and then SPRINKLE the outside very generously with the paprika; I much prefer that to the smeary wet paprika that results from patting after the chicken's wet with juice. I also just pour the water into the pan. Why wash off the paprika?! Today I used a covered roaster without basting at all, and it worked wonderfully - but that cuts the cooking time a LOT. Mine was already over temp when I checked it at 2 hrs (but still plenty juicy, thank goodness). A quick zap under the broiler to crisp up the skin, and I think it turned out great. I'll check at 1.5 hrs next time, though! I served it with asian-style shortgrain rice that had chopped cilantro, lime juice and lime zest mixed in, which was a really yummy combo. I spooned a little bit of the pan liquid, with most of the fat skimmed off, over it all. YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-13T23:33:55.81Z",
                "reviewBody": "Easy and tasty. However do not put all of that salt on it! It would ruin this dish. I just lightly sprinkled salt on which was plenty. I probably used less than 1/4 tsp and that was for two chickens! I also used less than half the amount of water and next time I would just omit it. My chicken was super juicy without it and it just diluted the yummy juices in the pan. Try it with a fresh tangerine- it's really good! Sounds wierd but it's great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T12:22:34.64Z",
                "reviewBody": "This recipe was quick easy and delicious. It is great for company. My boyfriend loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANN4260",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185451/"
                }
            }
        ]
    }
]