[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/696/world-cuisine/asian/filipino/",
                    "name": "Filipino",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/28363/adobo-chicken-with-ginger/",
        "name": "Adobo Chicken with Ginger",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F699806.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "2019-04-02T06:43:54.000Z",
        "description": "This is considered the Philippine national dish. The combination of soy sauce, vinegar, garlic, ginger and peppercorns is delicious and actually preserves the chicken! Great for picnics.  My mother taught me how to cook this, using her variation from the original recipe. A delicious, cheap and easy dish! Serve it hot with hot steamed Jasmine rice.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (3 pound) whole chicken, cut into 8 pieces",
            "½ cup soy sauce",
            "¾ cup distilled white vinegar",
            "1 bulb garlic, peeled and crushed",
            "2 tablespoons thinly sliced fresh ginger root",
            "2 bay leaves",
            "½ tablespoon black peppercorns"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the chicken, soy sauce, vinegar, garlic, ginger, bay leaves and peppercorns in a Dutch oven. Bring to a boil over medium heat. Once it boils, reduce heat to a simmer. Cover the pot and simmer for 30 minutes, basting the chicken occasionally. After 30 minutes, remove lid and cook until liquid has reduced to half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove chicken from the pot to a serving plate. Strain the liquid from the pot to remove all the food particles, and set aside. Serve chicken hot over steamed rice and drizzle with reserved sauce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Filipino"
        ],
        "recipeCuisine": [
            "Asian",
            "Filipino"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "COOKIEMONSTER64"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.452574525745257,
            "ratingCount": 369,
            "itemReviewed": "Adobo Chicken with Ginger",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "516.6 calories",
            "carbohydrateContent": "5.3 g",
            "cholesterolContent": "170.3 mg",
            "fatContent": "34.3 g",
            "fiberContent": "0.5 g",
            "proteinContent": "44.2 g",
            "saturatedFatContent": "9.8 g",
            "servingSize": null,
            "sodiumContent": "1363.5 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-17T13:45:32.673Z",
                "reviewBody": "I'm Filipino & this is my favorite dish!  You have to master the soy/ vinegar balance to your taste (sweet, sour, tangy). There are many brands of vinegar (distilled, apple, red wine)& soy sauces (low sodium, black, light)offered with different levels of tartness & saltiness.  If you are lucky to live near a Filipino grocery store, my Lola always recommended \"Native Vinegar (sugarcane) & Soy\" to give it an authentic flavor.  You can also cook chicken (dark)& pork(loin)together for this recipe.  You should marinate it in the refrigerator overnight or 1-2 hrs. prior to cooking. You can also add whole chilis (yellow) place in the side of the pot, not moving or opening them so that it doesn't dominate the dish. Simmer slowly for it to blend.  Don't rush, it won't be as delicious.  It's done when the meats tender.  If you like garlic, take out the meat/sauce from the pot. Saute some oil & garlic pieces & cook in medium heat.  Add the meat & a small amount of sauce back to the pot & saute.  You can also make \"Adobo Fried Rice\".  Transfer the chicken & sauce into a serving dish.  Saute a little oil & garlic.  Add the rice & some of the adobo sauce into the pan & mix thoroughly in high heat.  Vegetarians - you can cook your favorite vegetables like green beans, okra, etc... Chicken Adobo is well loved by all of my foreign friends & it's the most requested dish that I prepare. Enjoy!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Luv2eat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2025162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-29T11:14:06.25Z",
                "reviewBody": "I am part Filipino and generations of my family have always browned the chicken pieces first, in a little oil with one small, chopped onion in a separate skillet - then transfer to soup pot or dutch oven. Browning the chicken with onion first makes a huge difference to the flavor. I use 1/4 cup red wine vinegar and 1 cup water. Eliminate the white vinegar and peppercorns.  Add a little salt if needed. You can also substitute fresh garlic with a generous amount of garlic powder or granulated garlic. It's delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Adams Perez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1588342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-03T14:24:50.563Z",
                "reviewBody": "i am filipino and this is a different version that i am used to .. but it is very good. the key is the right mix of vinegar to soy,*here is my mom's take on this....after boiling the adobo, pan fry in chicken to 2-3 tbsp. of oil.once it has brown, add the adobo sauce till you get a rich sauce . (once you cook it a few times you will get it.) \ni just can't eat it with plain rice... fry garlic till brown and add \"day old rice and a bit of salt\" yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aidynne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1538938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-28T21:59:59.403Z",
                "reviewBody": "I love chicken adobo... I make it from time to time but not following any particular recipe. I thought i would follow this recipe and see how it turns out. I thought the vinegar was way to overpowering. I think its best to use equal parts soy/vinegar. I also prefer to add aprox. 1 cup of water.(which i didnt do with this recipe) It ended up way to strong. I give it a 3 because i wouldn't make it following this exact recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela F.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1154384/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T22:11:51.78Z",
                "reviewBody": "I m ake chicken adobo got it from a sweet little Phooipine lady years ago. Very similar to this recipe. Everthing the same except she told me 1/3 cup vinegar to 2/3 cup soy sauce. she also use 1 pkc Lipton cream of chicken soup and 1 cup water but I just use the can of soup too now. I debone my chicken sometimes or cut up whole chicken and cut breast and thighs in half for more portions. I just made it last night for friends and family my picky 10 year old son was begging for more today.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SYNDI111",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-07T19:30:17.123Z",
                "reviewBody": "I made this tonight (foreign cuisine night) and it was awesome! I used quartered chicken pieces and rice wine vinegar. I almost threw in the onions I'd cooked like another reviewer recommended but after a quick taste of the cooked chicken I discarded that idea as the dish was very flavorful in its own right. I'm positive we will make the again and again. I served with warm Japanese sushi rice (practicing for next week's meal) and it paired very well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T01:09:37.49Z",
                "reviewBody": "This tasty recipe is perfect as is! When I made this for my husband he said it was delicious and very authentic. My husband grew up in the Philippines so he knows authentic Filipino food when he tastes it. For those not used to Filipino food this dish may have too strong of a vinegar taste. You may want to reduce the vinegar to 1/2 cup. For extra kick I added onions more garlic and a few whole jalepeno peppers. Overall an excellent recipe! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EEEBEAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/831264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-11T16:49:00.203Z",
                "reviewBody": "This recipe is pretty spot on. Being Filipina you learn about dishes from the kitchen and not from recipes. However being away from the Philippines sometimes makes you forget and measurements are really helpful. I think what this recipe doesn't discuss which is a very important step in making Chicken Adobo is that before you turn on the heat you need to let all of the ingredients sit for an hour. This lets the vinegar cook on its own. That way the dish never turns out vinegar-y. Instead it has this awesome tangy taste. Also if you add pork the flavors are amazing. Chicken is good in itself though if you don't eat pork. Lastly if you can get a hold of \"pandan leaves\" Try stewing a leaf or two with this. Your guests will never be able to get enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "benanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4764219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-05T00:24:20.973Z",
                "reviewBody": "This is the worst recipe that I have had the misfortune of trying. This chicken tasted like vinegar. My step-son gagged and the only reason that my husband and I ate any is because it is what I had made for our dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "misspiggy067",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1863859/"
                }
            }
        ]
    }
]