[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17990/cake-mix-yeast-rolls/",
        "name": "Cake Mix Yeast Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F812140.jpg",
            "width": 2816,
            "height": 2112
        },
        "datePublished": "1999-12-06T23:33:43.000Z",
        "description": "These crescent rolls are fashioned after cake mix cookies and make for easy baking. They're light, tender and topped with poppy seeds.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "20 rolls",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "1 ½ cups warm water (110 degrees F/45 degrees C)",
            "3 ¼ cups all-purpose flour",
            "1 (9 ounce) package yellow cake mix",
            "¼ cup margarine, melted",
            "2 egg whites, beaten",
            "2 tablespoons poppy seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the flour and cake mix. Beat until dough is smooth. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour. Lightly grease two baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into rounds. Let rest for 5 minutes and then roll into 12 inch circles. Cut each circle into 10 wedges. Brush melted margarine onto the circles. Roll up the wedges, beginning at the wide end. Place on prepared baking sheets with the end of the roll on the bottom. Brush the rolls with margarine and beaten egg white. Sprinkle with poppy seeds. Cover and let rise until doubled, about 25 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 12 to 15 minutes, or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RUTHEY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.108108108108108,
            "ratingCount": 37,
            "itemReviewed": "Cake Mix Yeast Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "155.5 calories",
            "carbohydrateContent": "25.7 g",
            "cholesterolContent": "0.3 mg",
            "fatContent": "4.3 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "115.4 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-11T15:49:49.64Z",
                "reviewBody": "I'm giving this recipe five stars for now.  I just wanted to put up a review that included this warning : Check your box of cake mix! The recipe calls for a 9 oz. box, when the standard cake mix box is twice that.  I made these rolls last night and they were definately not dinner rolls.  They are way too sweet and cakey.  I used the whole box.  I was prepared to leave a scathing review, but realized I messed it up.  I will try this recipe again and leave a new review.  BE AWARE OF THE CAKE MIX AMOUNTS!  These are great sweet rolls to have with coffee though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Z",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:00:49.89Z",
                "reviewBody": "Just made this in my bread machine using the \"dough only\" cycle. I used yeast, water, cake mix and bread flour. I omitted poppy seeds, egg and margarine steps.  After the dough cycle was done I cut dough into 24 peices and let rise on cookie sheet and baked at 350 till light brown.  YUMMY!  Light and Fluffy! The cake mix did the trick! Everyone loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARBOOTJUNKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:00:49.937Z",
                "reviewBody": "FOREVER I have been looking for a sweet dinner roll recipe that I would be proud to make for guests.  This is so delicious.  I have made them twice for parties and I am constantly asked for the recipe.  Thank you for making me a big hit!\r\nThis are so good, they just melt in your mouth!\r\nA HUGE WINNER!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LALEECE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/280367/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-13T17:53:52.97Z",
                "reviewBody": "Read through all of the reviews prior to making the rolls and made sure to use 1/2 of a regular sized box of cake mix.  Used bread flour instead of all purpose flour and doubled the yeast used.  Family and friends over for dinner loved them.  Will make again.  Saved other half of the cake mix and made another batch the next weekend.  In future might just go ahead and mix the second half with the flour and bag for ease in making another batch.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MeggieSuzel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2826374/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-22T17:18:41.97Z",
                "reviewBody": "this recipe saved me!  Had intended to do overnight rolls and forgot to make the dough last night.  Had a box of \"Jiffy\" brand yellow mix in the cupboard intending to make a cinnamon roll recipe so that worked perfectly since it is 9 oz exactly.  No where in the recipe did it say to knead the dough.  I did knead the dough until it had the sheen.  This is a sticky dough but I just kept flouring my board.  I let it rise in a warmed oven for 1 hour and rose nicely double in bulk.  The dough will appear too sticky to be able to roll into anything but I just floured my board and rolling pin and this dough was actually beautiful to work with. Used the pizza cutter to slice into sections and it did not stick to the board at all. Cut each round into 12 sections and used real butter instead of margarine.  They are a sweeter roll but not sickening.  They baked up like a picture.  did some poppy seed, sesame seed, and left some plain.  buttery good.  Really no need to use butter.  The only thing I would suggest is a bit of salt added to the second cup of flour when making the dough.  Salt added directly to yeast mixture can kill the yeast.  Thanks for this nice recipe with a surprisingly lovely dough to work with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:00:49.56Z",
                "reviewBody": "If I had not made them I would not have believed how good this were and I believe in making breads from scratch! Sweet but not too sweet for dinner. Don't let the dough get too stiff - keep it slightly sticky. I just made regular rolls - no rolling into crescents. Did great!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "domesticadmin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/219910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-22T08:53:20.33Z",
                "reviewBody": "Tried these twice and they failed miserably both times although I am a very experienced baker. They didn't rise and were much too sweet. (Looking back at this and more recent reviews I realize that I mistakenly used a LARGE box of cake mix. Thank you to another reviewer for pointing that out! The original submitter needed to be more explicit in specifying that a substandard size of mix was being used. I'll bet lots of us were fooled by not reading carefully. Sorry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Carnahan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:00:49.06Z",
                "reviewBody": "Not a stellar recipe especially if you use a cake mix like Duncan Hines yellow cake mix which has a high vanilla/coconutish flavor. If using this brand mix I strongly recommend that you halve the cake mix and add additional \"bread\" flour as needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "LUEWANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/251062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-21T17:58:03.557Z",
                "reviewBody": "These are WONDERFUL! I mixed mine in the bread machine on the dough setting (because I'm lazy lol). My only issue was that I had to add more flour than called for (maybe 1/2 to 3/4 cup extra). the dough was so fluffy and a real joy to work with. I cut each circle into 12 wedges so I got 24 rolls out of this recipe. I didn't brush them w/ anything before baking but as soon as they came out of the oven I brushed 1/2 of them w/ melted butter and sprinkled some w/ poppy seeds. The other 1/2 I allowed to cool and froze them for another time. I couldn't wait until dinner to try these so I did....they are light fluffy and delicious w/ great flavor...not too sweet just right! To those that had issue it seems to be that the size cake mix was off...I used a 9oz. box of Jiffy yellow cake mix...PERFECT! These will def be made again and again...they couldn't be simplier YUM! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            }
        ]
    }
]