[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/344/bread/yeast-bread/whole-grain-bread/",
                    "name": "Whole Grain Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15509/bread/yeast-bread/whole-grain-bread/wheat-bread/",
                    "name": "Wheat Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18010/flax-and-sunflower-seed-bread/",
        "name": "Flax and Sunflower Seed Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1340303.jpg",
            "width": 6016,
            "height": 4000
        },
        "datePublished": "2000-01-05T22:48:00.000Z",
        "description": "This is a great bread for seed lovers, one of the tastiest I've tried.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "1 - 1 1/2 pound loaf",
        "recipeIngredient": [
            "1 ⅓ cups water",
            "2 tablespoons butter, softened",
            "3 tablespoons honey",
            "1 ½ cups bread flour",
            "1 ⅓ cups whole wheat bread flour",
            "1 teaspoon salt",
            "1 teaspoon active dry yeast",
            "½ cup flax seeds",
            "½ cup sunflower seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place all ingredients (except sunflower seeds) in the pan of the bread machine in the order recommended by the manufacturer. Select Basic White Cycle; press Start. Add the sunflower seeds when the alert sounds during the Knead Cycle.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Whole Grain Bread Recipes",
            "Wheat Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Erna Walmsley"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.784172661870503,
            "ratingCount": 556,
            "itemReviewed": "Flax and Sunflower Seed Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "140.3 calories",
            "carbohydrateContent": "22.7 g",
            "cholesterolContent": "4.1 mg",
            "fatContent": "4.2 g",
            "fiberContent": "3.1 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "168.6 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-05T19:07:00.127Z",
                "reviewBody": "This is a nice recipe!  I don't have a bread maker so I did it this way for 2 loaves.  2 cups of warm water with 6 tbsp of honey dissolved in it.  then sprinkle 2 1/4 tsp of yeast and let proof for 10 minutes.  Then add 1/4 cup of oil and 1 1/2 tsp salt.  Then all your flour (I used about 5 cups, half whole wheat and half white) and seeds.  I also added hemp hearts which are high in omega 6 and omega 3 fats.  Then I let rise in a oiled bowl for 1 hour, punch down and divide into 2 loaves then let rise again for 45 min.  Bake at 375 for 30 minutes.  SOOO GOOD!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LDSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1368822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-23T17:26:21.623Z",
                "reviewBody": "I have made this bread three times once using butter as directed and twice substituting canola oil. It has come out perfect every time! I especially enjoy toasting the slices as it really brings out the flavor in the seeds. I live alone and can't eat all the bread before it gets stale so I slice up the loaf and freeze it in a big Ziploc bag then heat the slices in my toaster oven as needed. Yum!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLBeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/106147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-24T19:57:23.967Z",
                "reviewBody": "I LIKE TO MAKE BREAD WITH MY KITCHEN AID MIXER AND THIS SOUNDED YUMMY SO HERE IS WHAT I DID: DISSOLE HONEY IN THE WATER(WARM) AND THEN PUT THE YEAST IN THE WATER MIXTURE TO ACTIVATE.  PUT ALL THE OTHER INCREDIENTS IN THE MIXER(WITH A DOUGH HOOK ON IT) EXCEPT THE SUNFLOWER SEEDS AND BUTTER(WELL I USED OIL INSTEAD) THEN ON LOW GRADUALLY ADD THE OIL AND YEAST MIXTURE.  MIX FOR ABOUT 7 MINUTES, MAY HAVE TO SCRAP SIDES.  THEN ADD THE SUNFLOWER SEEDS AND LET THEM MIX IN. I THEN ADDED A EXTRA 1/3 CUP OF WHEAT FLOUR BECAUSE IT WAS TOO STICKY. THEN I FORMED DOUGH INTO A LOAF AND PUT IT IN A GREASED LOAF PAN COVERED WITH PLASTIC WRAP TO RISE UNTIL DOUBLED IN SIZE.  BAKE AT 350 FOR 40 MINUTES.  TURNED OUT WONDERFUL!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARLYNBETH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1147889/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T14:26:54.977Z",
                "reviewBody": "I don't own a bread machine and it was still an excellent bread!\n\nTo make this bread the conventional way:\n\nProof yeast in the warm water with honey (I heated the honey in the microwave for 30 seconds)\nCombined all the dry ingredients including flour, flax and sunflower seeds in a large bowl.\n\nMelted the butter an added that to the flour alongside the yeast. Combined and then kneaded the bread for 10 minutes or until the dough was smooth and my arms were about to fall off.\n\nSet to rise in greased bowl for 1.5 hours or until doubled in size.\n\nPunched it.\n\nTransferred dough to a greased bread pan, covered and let rise again for 20 minutes.\n\nBaked in a 350 oven for about 30 minutes. Removed from pan and if the bottom wasn't golden I flipped the bread and put it back in the oven until golden.\n\nRemoved, let cool on wire rack and now I'm enjoying it as we speak. So far best whole wheat bread ever!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie N",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2652991/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-10T17:47:07.59Z",
                "reviewBody": "Love this bread!  I use flax meal because the seed is so biounavailable to the body.  It took nothing away from this recipe.  I make it again and again as a sandwich bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1103676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-14T06:18:30.577Z",
                "reviewBody": "I don't typically buy or like whole wheat breads, but the flax and sunflower intrigued me, as I like both. This turned out really well. In previous reviews, I've said that I don't like the way bread machine bread turns out, so I baked this in my oven. I set my bread machine on the dough cycle, followed the recipe and then put the dough in a greased stoneware loaf pan and let rise for about an hour. Then I baked at 350 for 10 minutes, rotated the pan 180 degrees, and baked for another 10 minutes. It came out perfectly. I wouldn't recommend doing what I did on the first loaf - I sprinkled flax seed on the top, because I thought it would be pretty. Unfortunately, they just don't stick. I'll just throw a handful into the mix next time. \r\n\r\nAnd, if you're unfamiliar with flax, you should know that it really should be ground up well. Your body cannot digest whole flax seed and you will not get the benefit of the flax unless you chew it up completely. It's much easier, and beneficial to grind it in a coffee grinder.\r\n\r\nThanks for a hearty, dense winter bread recipe Erna!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WeirdAuntMartha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/527644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-27T22:49:51.467Z",
                "reviewBody": "Delicious! I will make this again soon to give away - I don't want to share this first batch! I made this bread in the traditional manner without the bread machine: 1. proof yeast in 1/2 cup water 2. add yeast additional water honey and butter to the mix of flour salt and seeds 3. knead by hand or in a sturdy mixer 4. let rise one-hour punch down and let rise 30 minutes 5. shape into two loaves and let rest 20 minutes 6. bake at 400 degrees about 25 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZANNAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-21T20:12:39.93Z",
                "reviewBody": "OH MY Goodness you can't go wrong with this one! makes great sandwiches and morning toast I would make this again and again I highly recommend you try this I used the dough cycle on my bread machine and then kneaded shaped into a loaf and let it rise about 1/2 hour then baked it in a 350 degree oven for 30 minutes AHHHH....the aroma!!! yummy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie Lutsky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1738339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-07T07:13:50.89Z",
                "reviewBody": "This one is a good seed bread and it has exactly the chewy texture I like in a bread. I really don't think honey is overpowering in this recipe but my sister thought it lacked a bit of salt and I think she's right; next time I'll increase salt to 1 5 teaspoon. Other than that this recipe is perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IVANDIEPART",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/805237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-30T13:50:14.18Z",
                "reviewBody": "I've just spent 16 hours trying to make this bread. I realized early on that there isn't enough yeast in this recipe but decided to make it as is. Well after mixing it together and letting it \"rise\" for 2 hours nothing had happened. Since it was evening I figured I could lose nothing by letting it sit in my lighted oven overnight. Yay! it had risen when I checked it in the morning. So then I punched it down and had to let it do the slow rise again in the bread pan. I gave it about 2 1/2 hours and by the end of that time it had risen to the top of the pan but didn't have a bread dome. I baked it for about 30 minutes at 350 in a glass loaf pan. It looks in both composition and texture like a sweet bread. I don't like the initial taste that I've had but I will give it another chance when it's cool. If I make it again it will take some major tweaking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "It's A New Day",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/844886/"
                }
            }
        ]
    }
]