[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19100/strawberry-cake-and-frosting-i/",
        "name": "Strawberry Cake and Frosting I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F231873.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2000-04-01T03:59:43.000Z",
        "description": "If you love the beautiful flavor, aroma and color of strawberries, you will absolutely love this cake.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 - 3 layer 9 inch cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package yellow cake mix",
            "1 (3 ounce) package strawberry flavored Jell-O® mix",
            "3 tablespoons all-purpose flour",
            "½ cup water",
            "⅔ cup vegetable oil",
            "4 eggs",
            "1 (10 ounce) package frozen strawberries",
            "½ cup butter",
            "4 ¾ cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together cake mix, gelatin mix and flour. Make a well in the center and pour in water, oil, and eggs. Stir in half of the container of strawberries. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the Strawberry Frosting: In a large bowl combine butter, confectioners' sugar and the remaining half of the frozen strawberries. Beat on high speed until creamy.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "IMFLIPER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.446153846153846,
            "ratingCount": 195,
            "itemReviewed": "Strawberry Cake and Frosting I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "625.9 calories",
            "carbohydrateContent": "94.8 g",
            "cholesterolContent": "83.2 mg",
            "fatContent": "26.6 g",
            "fiberContent": "1 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "390.7 mg",
            "sugarContent": "77 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-20T22:01:14.81Z",
                "reviewBody": "This is my father-in-laws recipe and we came out to the site to see if people loved it as much as we do. When we saw the issues with the frosting, we realized what we neglected to state in the recipe. We drain most of the juice from the strawberries into the cake, thus not having all that juice in the frosting. This way the frosting is not so runny. Sorry for the mistake... hope you continue to enjoy this. \n\nAnd to the person who said they could just eat the frosting... my brother-in-law does just that with vanilla ice cream.\n\nEnjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1689212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T03:08:33.013Z",
                "reviewBody": "First off let me say that although this recipe gets rave reviews I was still very shocked at the wonderful flavor never having had a fresh strawberry cake not made from a mix. Which the strawberry cake mixes are just awful. Now on to my review. I am a recent graduate of culinary school in Baking and Pastry So I am used to making icings. However I paid close attention to the hints given for this icing as most said that it was to runny. I actually made this for a cake ordered for a customer who wanted it for a birthday cake. So for the icing I followed the hint and drained the strawberrys I also pureeed them through a thin strainer with an  old fashion mashed potato masher. I then drained the puree somewhat on paper towels. This did leave a need for moisture which I filled with a few tbls of both water and strawberry juice. You dont need to drain but I wanted to be able to control the amount of moisture eventually adding a few tbls of milk as well to give it a creamy texture. I believe the recipe calls for 4 3/4 cps of powder sugar. I actually used almost a 2 lb bag. which was a little over 7 cups. With the addition of the liquid it turned out great of course this made a cup or so more icing then needed. I did end up with a flat icing which is what I was looking for. If I would have omited some of the sugar and added a little more milk this would have made a very creamy homestyle frosting. The reason that I focused so much on the icing is because most people said that they coul",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMILEYCATT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/506066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-26T02:08:08.983Z",
                "reviewBody": "This cake gets raves from everyone, especially my kids, even the one who hates strawberries! Best the second day. Everyone is puzzled by the frosting. The trick is to first DRAIN the strawberries in a sieve over a bowl, and SAVE the juice. Use the strawberries as directed; the frosting will not be runny. Add a little cornstarch to the saved strawberry juice, microwave until thickened to a medium gel consistency, then drizzle over the cake and refrigerate. It dresses up the cake! This works in a 9\" X 13\" pan, too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Carnahan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-08T22:41:37.367Z",
                "reviewBody": "Excellent, excellent!  And I’m so glad about it since the strawberry cupcakes I made last week were such a bust.  What a difference!  Everything’s right this time – the texture and crumb is right, the shape is right and, most of all, the flavor is right!  They’re delicious!   I used a quart bag of whole strawberries I had previously frozen.  Once they were thawed I pureed them and measured out 6 ozs.  for the cake, which turned out to be a little better than 2/3 cup.  The remaining puree I reduced (to concentrate the flavor) in a small saucepan over medium low heat.  I used a white cake mix; I like the flavor better than yellow (less cake mix-y tasting for some reason) and I also wanted a truer pink color – didn’t want to try and work around the yellow. I wanted a very distinct strawberry flavor, so I also added in a teaspoon of strawberry extract.  I beat the batter TWO minutes, NOT four, following the instructions on the package.  I made this as cupcakes, and baked them 21 minutes.  For the frosting:  1/2 cup each of butter and hi-ratio shortening,  1/2 tsp. strawberry extract, a pinch of salt, 4 c. powdered sugar and enough of the reduced strawberry puree to achieve the desired consistency for piping, about  4 tablespoons.  I beat it on low speed of my stand mixer for 10 minutes.  The flavor and consistency reminded me of strawberry ice cream – just delicious.  I have to admit I was not expecting to like these cupcakes as much as I did. It was a happy surprise today.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T20:21:18.107Z",
                "reviewBody": "This was good.....I was talking to my friend who has a similar recipe. I told her of some people whose frosting came out runny. We concluded that the recipe should be changed to 1/2 STICK of butter....not 1/2 cup. That will make it very runny. We also used 1lb box of powdered sugar. It was pretty thick so just add strawberry juice 1 Tsp at a time to get it the consistancy that you like. Very sweet cake. I made a double layer 9 in round cake....with strawberry glaze in between the layers. On top and around the bottom I made white-chocolate dipped strawberries....it was beautiful and Yummy!!!! Hope this helps on the frosting thing!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TRINITIK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/656741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-28T14:21:09.673Z",
                "reviewBody": "This cake was so moist and delicous!! All i changed was I used fresh strawberies and white cake mix(all I had).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hmb812001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2070996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-24T04:49:40.653Z",
                "reviewBody": "Everyone seemed to enjoy this.  Icing was pretty sweet, but still good.  I read the authors' notes in the review section and had no trouble with the frosting once I drained the juice into the cake as opposed to putting it in the frosting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Krista Ferrill Donahue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379213/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-19T10:26:57.08Z",
                "reviewBody": "These are fabulous, WAY better than box strawberry cake and frosting!  *UPDATE* For the frosting, reduce the amount of powdered sugar by almost half and add in 8 oz. of cream cheese, you won't be disappointed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FoodFan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1153276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-18T00:39:37.93Z",
                "reviewBody": "This is my daughter's favorite cake! I have been making it for years but misplaced my recipe in our move. I find pureeing the berries makes this recipe fail-proof! Much easier than draining all the good juice off!  I use 2/3 cup in the cake recipe. The pureed berries works great in the frosting too. Just beat butter until fluffy and add powdered sugar and berries alternately until the frosting is the consistency you want.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEREDITHRS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512145/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T17:17:12.133Z",
                "reviewBody": "Wow (and not in a good way). I like to send my hubby w/ office treats every now & then. This time I made Vday treats. These were very appropriate due to their pretty pink color but I'm sorry to say not at all what I expected. My cupcakes didn't turn out at all! I must admit I'm not the world's best baker but I'm not a novice one either (I'm in b/t the 2). Not only were my cupcakes SUPER dry (I made 2 dozen cupcakes which I baked at 350 degrees for 20 min. as suggested on back of cake mix box) my frosting was also TOTAL failure! One VERY important note: You MUST soften your butter B4 creaming w/ your sugar & THEN add your berries. I'm not sure why I didn't do this (duh). I got so wrapped up in reading IMFLIPER's directions I didn't give it a 2nd thought. My frosting was filled w/ lumps that even my powerful KitchenAid couldn't mix. I have 2 more thoughts to share. This recipe calls for a 10 oz. bag of frozen strawberries. It doesn't mention stawberries in syrup (i.e. the sweetened variety in a container that SHOULD be drained). There was no need to drain my berries (there wasn't any juice). I suppose if I allowed my berries to thaw there may have been \"some\" juice but IMFLIPER instructs to use FROZEN berries (?). Second as is this frosting is WAAAY too sweet (my gosh)! I couldn't stomach it & have a real sweet tooth! These remind me of cheap aftificial box muffin mix w/ a sickenly too-sweet frosting. Sorry IMFLIPER. Your dad's recipe is not for me!:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ]
    }
]