[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/344/bread/yeast-bread/whole-grain-bread/",
                    "name": "Whole Grain Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15509/bread/yeast-bread/whole-grain-bread/wheat-bread/",
                    "name": "Wheat Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20179/honey-multigrain-bread/",
        "name": "Honey Multigrain Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F211320.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-09-25T17:09:45.000Z",
        "description": "A loaf with good texture for a multi grain bread.  Just enough of a taste of honey to make great toast or sandwiches.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "2 - 9x5 inch loaf pans",
        "recipeIngredient": [
            "¾ cup cornmeal",
            "3 ¾ cups water",
            "1 tablespoon salt",
            "3 tablespoons olive oil",
            "¼ cup honey",
            "3 (.25 ounce) packages instant yeast",
            "1 cup rye flour",
            "1 cup whole wheat flour",
            "8 cups unbleached flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small saucepan, combine the cornmeal and water. Bring to a boil and cook for 5 minutes. Pour into a large mixing bowl. Stir in salt, oil and honey; let cool until lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the cooled cornmeal mixture with the yeast, rye flour, whole wheat flour and 4 cups unbleached flour; beat well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Allow dough to rise 30 minutes, or until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 40 minutes, or until bottoms of the loaves sound hollow when tapped. Remove from pans and allow to cool on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Whole Grain Bread Recipes",
            "Wheat Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jim Harned"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.407407407407407,
            "ratingCount": 27,
            "itemReviewed": "Honey Multigrain Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "74.6 calories",
            "carbohydrateContent": "13.2 g",
            "cholesterolContent": null,
            "fatContent": "2 g",
            "fiberContent": "1.7 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "293 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-19T18:17:35.13Z",
                "reviewBody": "My kids love this bread.  Here are some hints for Robert from Georgia and any new bread bakers.  First of all, use fresh, tasty ingredients.  Often, locally grown flours will taste best to you.  Filter your water before using it.  So, first put the salt, olive oil, and honey into a large mixing bowl.  Then put the water in a saucepan and add the cornmeal.  While stirring it constantly, bring the cornmeal to a low boil and boil it for 5 minutes.  If you aren't attentive enough, you will get lumps that will need to be picked out during the kneading process.  Add the cooked cornmeal to the mixing bowl and stir until thoroughly blended.  If you have a candy thermometer, stir the mixture until it cools to between 110 and 115 degrees.  If you don't have a thermometer, continue to stir just until there is no more steam coming from the mixture.  This is the time to add the yeast.  Stir in the yeast and let it rest for 10 minutes.  While you are waiting, prepare your flours by sticking a whisk into the flour bag and whisking the flour to fluff it up.  Now add a large cup of rye flour to the bubbly cornmeal yeast mixture and stir it in.  Then add a large cup of whole wheat flour and mix it in.  Next, add all-purpose flour 1 cup at a time until the dough isn't too sticky (probably 3 or 4 cups).  Then sprinkle lots of flour onto your kneading board and scrape all of the dough out of the bowl.  Set your timer for 10 minutes and start kneading the dough, continually sprinkling generous amo",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Miss Juliet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2173988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-12T17:22:20.39Z",
                "reviewBody": "Like the other reviewers (that coincidentally all reviewed in January as well) I found this recipe asking for too much white flour. I used approx. 6 1/2 cups (without changing anything else) and found that perfect. I just couldn't imagine kneading any more into it. Other reviewers mentioned multiple risings which I didn't find necessary. After mixing and kneading I put them in the pans let rise 40 minutes and then baked - how quick and easy! Very nice taste and texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LANGELOTZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1311578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T02:16:54.97Z",
                "reviewBody": "Awesome!! A very tender bread with nice flavour.\n\nLike other reviewers, I didn't use the full amount of flour. I subbed one cup of white flour with multigrain in addition to the rye and whole wheat and didn't keep track of the white flour used. I'd guess maybe 5 cups at the most but am not sure. I didn't like the look of the mixture just after adding the yeast so I threw it out and did it again, this time doing the yeast like all the other recipes I've used have called for - sprinkling the yeast in warm water and letting it sit for a few minutes. I reserved some of the water for the cornmeal before cooking it and used that for my yeast. Don't know if it makes any difference or not.\n\nSomeone commented that the crust was rather hard. After taking the bread out of the oven, I've always brushed the tops with melted butter. I find it makes the tops look golden and gives them a nice sheen as well as softens the crust.\n\nI've just eaten my first slice and it is a nice tender bread. Not bland, with a very subtle taste of honey. I expect that the flavours will be more pronounced after the bread sits overnight, as most loaves taste even better the next day.\n\nFive stars because the only issue seems to be the amount of flour if the recipe is followed as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pleutim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2621182/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-09T15:34:45.5Z",
                "reviewBody": "I was a little concerned because so many people seemed to have difficulties with this bread but I decided to try it anyways since most of the problems seemed to be related to the amount of flour in it - an easy fix. I'm so glad I made it! It had a wonderful smooth texture unlike any other multigrain bread I've made before - due of course to the fact that you cook the cornmeal first. The key I think is to add only a little white flour at first (2 cups maybe when the other flours are added) mixing in more as you knead the bread. This is certainly one of best bread recipes I've ever made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1451169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-02T19:29:01.327Z",
                "reviewBody": "I think that there is too much white flour in this recepie. I ended up using 4 cups and I think that that was too much. I'm going to try 3 and add more if it needs it. I didn't get much rising either. I'm going to try three risings...see if that works. The bread even with it's faults was awesome. Very tastey.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAMSTER20017",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1014782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-17T17:28:41.127Z",
                "reviewBody": "I liked this one and would make it again, I love the taste of home made bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bountiful-life",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4916035/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-20T20:35:15.857Z",
                "reviewBody": "This recipeis great! I took it out of the oven 10 minutes ago and first loaf is almost gone. I didn't have rye flour I used spelt and oat bran instead. I added two tablespoons of vital wheat gluten and a half cup of cooked quinoa. I used less flour than the recipe but I didn't keep track... I just worked it until it was the right texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tacy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-05T00:04:58.913Z",
                "reviewBody": "Delicious and moist. This has a great soft texture. For the flour I don't add in the entire amount of white flour I just knead in what it takes to make a smooth dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nici",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2636223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-10T19:11:20.513Z",
                "reviewBody": "DELICIOUS! We followed others' advice and reduced the amount of white flour. I ended up using 4 1/2 cups. Otherwise followed published recipe and it was great! We ate sandwhiches for lunch and dinner just so we could use the bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ForneySAHM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2692416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-15T14:33:43.31Z",
                "reviewBody": "I wasn't pleased with this at all.Like others mentioned I could only work in roughly 6 cups of white flour.I still had to add an extra cup of water to get the dough to a workable stage.There was just a bit too much dough for 2 loaves so I made it into 3.The finished bread had a hard crust something I didn't like at all.The taste was a little bland for me also.If I make this again (which I doubt) I'd add an extra teaspoon of salt and cut back on the flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "WHATAYAWANT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/911909/"
                }
            }
        ]
    }
]