[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20070/soda-pretzels/",
        "name": "Soda Pretzels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F104762.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2000-07-23T01:05:00.000Z",
        "description": "This recipe for pretzels uses traditional Irish soda bread dough instead of a yeast based dough. It's quick and works great! These pretzels come out great, just like the street vendor type.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "12 pretzels",
        "recipeIngredient": [
            "⅓ cup baking soda",
            "5 cups water",
            "1 ½ cups all-purpose flour",
            "1 ½ cups whole wheat flour",
            "1 teaspoon baking soda",
            "1 cup buttermilk",
            "¼ cup honey",
            "2 tablespoons kosher salt, for topping"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a non-aluminum stock pot, dissolve 1/3 cup baking soda in 5 cups water. Bring water to a boil, and then remove from heat. Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, sift together all-purpose flour, whole wheat flour, and baking soda. Stir in buttermilk and honey until dough pulls together. Turn dough out onto a lightly floured surface, and knead briefly to form a firm dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough into 12 equal pieces. Roll each piece into a cylinder approximately 12 inches long. Form into classic pretzel shape. Pinch ends to seal. Dip pretzels in baking soda solution and then place on lightly greased cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle pretzels with kosher salt, and bake in preheated oven until golden brown, about 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ARVILLALAR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.057142857142857,
            "ratingCount": 70,
            "itemReviewed": "Soda Pretzels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "137.4 calories",
            "carbohydrateContent": "29.6 g",
            "cholesterolContent": "0.8 mg",
            "fatContent": "0.6 g",
            "fiberContent": "2.3 g",
            "proteinContent": "4.4 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "2746.3 mg",
            "sugarContent": "6.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-13T17:07:21.627Z",
                "reviewBody": "These were great but i did make a few modifications.  I only had all purpose flour. I brushed them wth melted butter before baking. To make butermilk, add 1T vinegar to a measuring cup ten fill with milk and let sit for 5 minutes.    Literally only take 10 minutes to bake! The kids were begging for a snack but I really wanted to make them something different and these were PERFECT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2839648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-10T10:25:05.933Z",
                "reviewBody": "It was a fast easy success! I loved how the instructions didn't require a bread machine. PS- It works perfectly fine if you use all purpose flour for wheat and Karo Corn Syrup for honey.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Colormecrazzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2309395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T21:22:36.633Z",
                "reviewBody": "These are pretty good--a nice wheat pretzel! I've been on a pretzel kick lately & I've always made yeast pretzels so I thought I'd give this one a shot. A little sweet and yes it's dense and heavier than yeast pretzels but I expected that. One: it has ww flour in it and two: although baking soda will allow it to rise any dough made with yeast is lighter in my experience. I used vanilla rice milk (all I had) with a bit of lemon juice instead of the buttermilk. I intended to make 12 pretzels but instead cut out 9 pieces of dough--don't ask me how I managed that piece of wisdom! At any rate for the reviewers who expect huge pretzels like the mall don't be fooled by pretzels you make at home. They are never that big! You'd have to make 1 pretzel for every 4-6 pieces of dough! Also there's no need to use as much water or baking soda as called for in the boiling here. I use a large skillet and just fill about 1/2 way with water then toss in some baking soda--it works out for me and you can boil several pretzels at a time that way. You really just want a baking soda bath--as long as water and baking soda are present you're fine. These are really good with the Clone of a Pretzel Dip also on this site. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T01:16:30.997Z",
                "reviewBody": "The directions are little unclear as to what to do with the water and soda at first. Once you get over the slight confusion it is a wonderful recipe. I made it with my kindergarten class and they loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PINA2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/608856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-23T20:01:57.903Z",
                "reviewBody": "I have made multiple pretzel recipes from this site and I always have the same complaint no matter how they taste: They never make a pretzel the same size as the ones you can buy at the mall! I cut this recipe in half because I was making them just for me and I didn't need 12 pretzels. I didn't even get them as big as regular mall pretzels and it only made 2!! So if you are thinking that these will come out making 12 pretzels that are the size of 12 auntie anne's pretzels you will be disappointed. However this is true for every pretzel recipe I've ever made. If you actually make them the size they are supposed to be you will get 12 little pretzels the size of your palm at best. ANYWAY what I have determined is that no matter what pretzel you try they always taste the most authentic if they have the baking soda bath. However you do NOT need so MUCH!! There is always all this baking soda water left over. Cut the amount of soda bath in half at least if not just a quarter. uncooked dough doesn't soak it up much. Also this dough is not hard to work with at all as some people stated. If you brush them with butter half way through baking for a buttery taste. These are OK and will do in a pinch but the yeast ones are more authentic tasting. Find a yeast recipe with a soda bath and you're golden. And bake them on parchment to eliminate sticking to the pan. To compare to something store bought these are most like SuperPretzel that you can get in the grocery freezer section.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "T Roos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1496470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-02T19:56:56.11Z",
                "reviewBody": "Delicious and FAST! I didn't have buttermilk and so I used milk mixed with some vinegar instead. I also used Karo syrup instead of honey. After kneading the dough on my kitchen aid I formed pretzel sticks. I brushed with milk sprinkled some with grated parmesan an some with ground pepper before baking. The sticks were delicious! Crunchy on the outside and soft and chewy on the inside. I did not boil them before I baked them but they turned out fine. These were quick and tasty. Would definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Goodeats",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2397968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T01:16:30.89Z",
                "reviewBody": "These were very good especially considering that they were ready to eat in about 30 minutes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T21:50:20.98Z",
                "reviewBody": "For a soda pretzel it is very good. My daughter made them several times. She got blue honor ribbons at the county and state 4-H fair with this recipe. We used sea salt as the topping. The wheat flour gives it a golden color all throughout.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nanci Sears Perry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2763976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-03T21:51:38.8Z",
                "reviewBody": "I really loved this recipe! I used only whole wheat flour and like others did some substitutions for the buttermilk and honey. I was able to use the dough to create some other amazing breads too-one that I filled with salmon and topped with a nori seaweed strip and another that was filled with curry and covered with bread crumbs on the outside. I'm looking forward to creating even more things with this and sharing them with friends and family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "genkihana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6299223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-01T03:59:40.06Z",
                "reviewBody": "I was dying for soft pretzels and had no yeast when I found this recipe. It makes a nice pretzel a little heavy. I might try some yeast recipes later to compare. If you have a craving try it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "REBECCA70111",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1244945/"
                }
            }
        ]
    }
]