[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20539/adriennes-tom-ka-gai/",
        "name": "Adrienne's Tom Ka Gai",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7901113.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-07-19T12:32:35.000Z",
        "description": "Fragrant, spicy, and absolutely delicious Thai chicken soup.   I've eaten a bit of Thai, and I think this comes very close.  Add noodles if you like with the cilantro.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 teaspoons peanut oil",
            "2 cloves garlic, thinly sliced",
            "2 tablespoons grated fresh ginger root",
            "¼ cup chopped lemon grass",
            "2 teaspoons crushed red pepper",
            "1 teaspoon ground coriander",
            "1 teaspoon ground cumin",
            "1 skinless, boneless chicken breast halves - cut into thin strips",
            "1 onion, thinly sliced",
            "2 cups bok choy, shredded",
            "4 cups water",
            "1 (10 ounce) can coconut milk",
            "¼ cup fish sauce",
            "¼ cup chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium heat, heat peanut oil.  Stir in garlic, ginger, lemon grass, red pepper, coriander and cumin and cook until fragrant, 2 minutes.  Stir in chicken and onion and cook, stirring, until chicken is white and onion is translucent, 5 minutes.  Stir in bok choy and cook until it begins to wilt, 5 to 10 minutes.  Stir in water, coconut milk, fish sauce and cilantro.  Simmer until chicken is thoroughly cooked and flavors are well blended, 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Adrienne Barnett"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.428571428571429,
            "ratingCount": 231,
            "itemReviewed": "Adrienne's Tom Ka Gai",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "255.4 calories",
            "carbohydrateContent": "9.3 g",
            "cholesterolContent": "34.2 mg",
            "fatContent": "17.9 g",
            "fiberContent": "2.3 g",
            "proteinContent": "17.2 g",
            "saturatedFatContent": "13.3 g",
            "servingSize": null,
            "sodiumContent": "1157.7 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-01T21:40:06.64Z",
                "reviewBody": "Hi,\r\n\r\nI'm thai and want to change some ingredients in the recipe.  Well, I will tell you how to cook Tom Ka Gai.  Firstly, you got to cook pieces of chicken breast in coconut milk--you can add some water--depends on how thick you like.  Secondly, put 3-5 pieces of lemon grass (2 inches each), 3-5 pieces of galanga (0.5 centimeters thick), 3-5 kaffir lime leaves (we called it bai-ma-grood), lemon or lime juice, fish sauce, crushed fresh chilli, coasly chopped cilantro, mushroom or cabbage.  The taste will be a bit sour, salty and spicy.  You can buy all ingredients in asian food shop.  Don't put ginger because \"Ka\" in thai means galanga.  Those two are look alike, but their smell are totally different.  We eat Tom Ka Gai with rice and when you eat it don't eat lemongrass, kaffir lime leaves and galanga.  We put it for smell not eat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KANOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549600/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-23T17:34:22.92Z",
                "reviewBody": "Why eat anything else?  Find an Asian market and get  galangal, lemongrass, and kaffir lime leaves. I more or less doubled everything except the fish sauce.  I used 1 reg and one lite coconut milk. Skipped the oil, added some chili paste for extra spice. Omitted the bok choy and used green onions. I used half water and half chicken broth.  Don't forget to serve with rice.  Tastes as good as the recipe from my Thai cookbook. UPDATE: I have since made this with bok choy and did not like it as much, and I love bok choy.  Also, if your soup tastes \"flat\" you need to add a squeeze of lime juice to brighten all the flavors.  The lemongrass should be bruised, give it a bash with the flat side of a knife or smack with your rolling pin, and NOT chopped or consumed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMELA D. aPROpos of nothing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T20:42:55.357Z",
                "reviewBody": "Outstanding! Exotic & unique flavor! I omitted the fish sauce (unable to find any) and had to use dried lemongrass from a spice jar because I couldn't find fresh (I live in a semi-rural area). Per previous comments I substituted chicken broth for the water and reduced the red pepper by half. It was still quite tangy so next time I'll probably reduce the red pepper further. I added a little extra bok choy and cilantro. Thanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-17T08:08:04.443Z",
                "reviewBody": "This recipe is SOO good. It's usually all gone by the end of the day. I took a couple suggestions and it turned out wonderful. I've made this recipe about 5 times. First off DON'T add more that 1 cup of chicken broth thats wayyyy too much and far more salt than necessary. I used 3 cups of water and 1 cup of reduced fat chicken broth. The flavor was just awesome. Also ADD MUSHROOMS! They blend with the flavor so well and really add something special to the recipe. I used a combination of white and brown. We also used 3 small chicken breasts more to chomp on:D If you don't have peanut oil just add 1 tsp peanut butter to the oil you have. With these modifications I find it to be perfect best soup I have ever tasted. Don't skimp on the ginger its fantastic! Great recipe I highly HIGHLY recommend.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mei-Mei",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2660647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-11T17:27:10.217Z",
                "reviewBody": "This recipe was okay. I love Thai food and this soup could be really good with a few changes in the recipe. First of all 2 tsp. of crushed red pepper would ruin the dish. I used 1/2 tsp. crushed red pepper and the soup was still very spicy. Second 1/4 cup fish sauce is too much. I used 3 Tbsp. and still found it overwhelming. Third 10 ounces of coconut milk is not enough. I would recommend reducing the amount of water and using one-and-a-half or two 15-ounce cans of light coconut milk. I did not find the bok choy a necessary ingredient and instead I would add rice noodles. With these changes I will probably make this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/592997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-04T19:57:29.367Z",
                "reviewBody": "OUTSTANDING recipe. I had troube with the lemon grass too. Had to pick it out of the soup like bones from fish. The flavor in this is excellent. As compared to our favorite Tai restaraunt I would say this is dead on! Maybe even better (and this simply isn't possible). Just don't know what the heck to do about this lemongrass issue. Next time I will cut them in long strips and pull them out to serve like bay leaves.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Huck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/220954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T23:51:15.047Z",
                "reviewBody": "This is scrumptious! I used 4 fresh thai red peppers instead of crushed red pepper and I added thai basil dried shiitake mushrooms and bean sprouts puchased from a local Oriental market. I also used frozen shredded lemongrass which helped reduce the prep time. After reading other reviews I substituted half of the water with chicken broth and reduced the fish sauce a bit. Wow it was delicious. I highly recommend this great recipe and look forward to trying it again!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FSUGABRIELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/801001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-30T01:05:56.247Z",
                "reviewBody": "This soup turned out awesome! I used jarred lemon grass and kept them in large pieces so that I could fish them out later. I also used mushrooms instead of chicken and 2 green onion stalks instead of regular onion. Instead of 4 cups of water I used 2 cups chicken broth and an extra 14 oz can of coconut milk. I left out the cilantro as well. As others said this recipe is very forgiving and will taste great with the addition of any vegetables.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sabinah Rafiq",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/212355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-13T05:23:18.81Z",
                "reviewBody": "Yippee!! My guy mentioned that he loves \"lemon grass soup\" so I found this recipe. I can't wait for him to get home from work and try this! I had to use dried lemon grass (wimpy grocery store) but it tastes great! I doubled the garlic (I always do) added shrimp along with the chicken and chicken broth (instead of water). I kept it low carb without rice or noodles. OMG this is the bomb! It screams with flavor! Thanks for posting this EXCELLENT recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1483677/"
                }
            }
        ]
    }
]