[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
                    "name": "Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/30575/blue-cheese-beef-tenderloin/",
        "name": "Blue Cheese Beef Tenderloin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F322520.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:43:58.000Z",
        "description": "This is a recipe for whole beef tenderloin baked and topped with a blue cheese sauce.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (3 pound) whole beef tenderloin",
            "½ cup teriyaki sauce",
            "½ cup red wine",
            "2 cloves garlic, chopped",
            "4 ounces blue cheese, crumbled",
            "⅓ cup mayonnaise",
            "⅔ cup sour cream",
            "1 ½ teaspoons Worcestershire sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place beef in a shallow dish. Combine teriyaki sauce, red wine and garlic; pour over beef. Allow beef to marinate in refrigerator for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place tenderloin on broiler pan, and cook in preheated oven for 15 minutes. Reduce heat to 375  degrees F (190 degrees C), and cook for 30 to 40 more minutes, or to desired doneness. Allow to set for 10 minutes before slicing.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over low heat, combine blue cheese, mayonnaise, sour cream and Worcestershire sauce. Stir until smooth; serve over sliced tenderloin.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "J MILLER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.723809523809524,
            "ratingCount": 315,
            "itemReviewed": "Blue Cheese Beef Tenderloin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "669.4 calories",
            "carbohydrateContent": "5.1 g",
            "cholesterolContent": "143.5 mg",
            "fatContent": "54.6 g",
            "fiberContent": null,
            "proteinContent": "35.1 g",
            "saturatedFatContent": "22.1 g",
            "servingSize": null,
            "sodiumContent": "1042.8 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-02T16:24:33.873Z",
                "reviewBody": "THANK YOU so much for this wonderful recipe! I made this for a party of 12. I was in awe of how it turned out-fab presentation!!  I felt like I created a tavern on the green original. One note-do be very careful and WATCH the internal temp closely!! Remove from oven when it's 140 for medium-which was my goal. The temp will go up (for me it went 8 degrees more) while the tenderloin \"rests\" 10-15min prior to slicing and serving. It came out PERFECT-so juicy and flavorful!! I did put the garlic- in small chunks from the marinade on top of the tenderloin prior to putting it in the oven. Everyone raved! This is my new fav guest/dinner party menu item .....the only downside is the price of beef tenderloin ($13.99/lb) or we'd have this more often and not just special occasions. The cheese sauce was great-but it gets thick once it cools....I'd suggest to keep it in one of the thermal gravy type servers if you have it avail.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dawnincle/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-25T01:39:00.047Z",
                "reviewBody": "Oh My Stars! I screwed this recipe up and came away with a complete winner that has blown us away!!!!! Hubby and I were preparing our Valentines dinner we had two strip steaks. I didn't read the recipe correctly. I halved the amounts due to just having two steaks. I did not marinate the meat we grilled it with salt pepper and garlic powder. I then put ALL of the ingredients together in a saucepan. The exceptions were that I used FETA cheese and used the garlic out of the jar from the produce section. I used a really good Merlot that we had with our dinner. This gave the mixture a pink appearance that was PERFECT for Valentines Day! I was worried in the beginning but it turned out beautiful (candlelight makes us all look better - LOL!) We served this over the steaks sauteed onions jumbo cooked shrimp along with a baked potato that I had coated in olive oil and sea salt and then baked at 425 for one hour. We couldn't eat our salads. This needs to be submitted as its own recipe! My husband kept going \"mmmmm\" during the meal LOL! 2/14/05 Made this again tonight for my children for Valentines Day. I only added a splash of Teriyaki sauce and 2 splashes of Worc. sauce and hubby and I liked it much better. My son went crazy over this! Delish! Thanks:-) Updat - Made this for Christmas Eve 2005. I made it exactly to recipe and it was DELICIOUS! Thanks so much for a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T21:23:46.263Z",
                "reviewBody": "Delicious! My husband and teen loved it. I made this with a beef rump roast since tenderloin is out of our budget.  I increased the garlic in the marinade to 4 cloves since we are garlic fanatics, used Merlot for the red wine, and increased the marinating time to about 3-4 hours for a less tender cut.  I cooked the rump roast in a shallow pan at 325 for about 1/2 hour per pound for medium rare.  Next time I think I will try a London Broil, and cook it using the tendeloin method described in this recipe.  The sauce is outstanding, a wonderful blend of flavors, and the blue cheese taste isn't overpowering.  We enjoyed the extra sauce on our baked potatoes.  Thanks for a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JSCHUKRAFT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/786227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-26T14:20:20.873Z",
                "reviewBody": "I served this to 20 with some modifications. Everyone loved it. Try roasting 2 lbs. of thick cut mushrooms with the roast. I used Shitaki Cremini Button....coated in 4 tablespoons melted butter and 2 teaspoons minced garlic. This makes an excellent side to serve along with the blue cheese sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HALL01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-05T14:54:47.077Z",
                "reviewBody": "I chose this recipe because it used a sauce instead of rolling a layer of blue cheese inside of the tenderloin. It was a great choice. Not only was the sauce delicious (both on the beef but on baked potatoes) but it gave those who didn't like blue cheese a way to enjoy the flavorful meat. Even those who claimed to not like blue cheese approved of the smooth-tasting sauce. My only changes were as others suggested to increase the garlic to three cloves and to marinate it for a longer time. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LORIZC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1406410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-01T17:42:04.25Z",
                "reviewBody": "I made this for my father's 60th birthday dinner and got rave reviews. We all love beef and blue cheese, so the combination was perfect! I had a 6 lb tenderloin. I baked it without stringing it, as I wanted some parts more well done than the middle, as we had a pregnant woman and at least one person who liked their meat well done. That worked out perfectly! I served fresh roasted aparagus and roasted garlic mashed potatoes with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SKWEGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/670757/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-27T15:12:39.28Z",
                "reviewBody": "I am always looking for new ways to prepare beef tenderloiin. The sauce was incredible and I have also used it on grilled ribeyes. The second time I made the sauce it was a bit salty but that was due to the brand of blue cheese. I always serve the sauce on the side. Tremendous flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T01:50:17.513Z",
                "reviewBody": "The meat was a little more well done than our family likes. Those non-blue cheese lovers thought the sauce was too strong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JEWEBER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/277423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-10T23:32:20.687Z",
                "reviewBody": "I just didn't like this sauce. I love blue cheese but this sauce was not good and I ended up throwing the whole thing out. What a waste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "THEGANGSMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1096230/"
                }
            }
        ]
    }
]