[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/200/meat-and-poultry/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
                    "name": "Steaks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1024/meat-and-poultry/beef/steaks/filet-mignon/",
                    "name": "Filet Mignon Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/30578/filet-mignon-with-rich-balsamic-glaze/",
        "name": "Filet Mignon with Rich Balsamic Glaze",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F468582.jpg",
            "width": 3696,
            "height": 2940
        },
        "datePublished": "2019-04-02T06:43:58.000Z",
        "description": "This is an elegant and quick romantic dinner for two. Wonderful served with steamed asparagus and baby red potatoes.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "2 (4 ounce) filet mignon steaks",
            "½ teaspoon freshly ground black pepper to taste",
            "salt to taste",
            "¼ cup balsamic vinegar",
            "¼ cup dry red wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle freshly ground pepper over both sides of each steak, and sprinkle with salt to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a nonstick skillet over medium-high heat.  Place steaks in hot pan, and cook for 1 minute on each side, or until browned. Reduce heat to medium-low, and add balsamic vinegar and red wine. Cover, and cook for 4 minutes on each side, basting with sauce when you turn the meat over.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove steaks to two warmed plates, spoon one tablespoon of glaze over each, and serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Beef",
            "Steaks",
            "Filet Mignon Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LINDA W."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.440896739130435,
            "ratingCount": 1472,
            "itemReviewed": "Filet Mignon with Rich Balsamic Glaze",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "366.6 calories",
            "carbohydrateContent": "5.7 g",
            "cholesterolContent": "80.5 mg",
            "fatContent": "26.2 g",
            "fiberContent": "0.1 g",
            "proteinContent": "20.3 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "63.5 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-08T19:21:13.827Z",
                "reviewBody": "OK, I took  liberty w/ this recipe & made a few changes. I let my filets rest for an hour (helps keep the meat tender...if you apply heat to chilled meat it shocks it & causes it to toughen up) before salt & peppering them (used Paula Deen's house seasoning). I also chose to broil mine & then pulled them out to rest again (this allows the juices to distribute evenly) before I started the balsamic mixture. I did not cook the steaks in the balsamic glaze, instead I doubled the amount of balsamic, added a bit of sugar & garlic (per previous reviews), used merlot but did not double it, & reduced it on the stovetop for about 10 minutes until it was kinda thick & syrupy. I topped my steaks w/ small amounts of crumbled gorgonzola cheese ...broiling for just a minute or two to melt the cheese. I plated the steaks & drizzled the balsamic \"syrup\" over the top. These were out of this world good!  The sweetness of the glaze paired w/ the pungency of the cheese is a taste sensation that my hubby & I really enjoyed!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T20:08:43.5Z",
                "reviewBody": "Here's the trick to make this recipe work: We seasoned the filets with salt and fresh ground pepper and let them rest out of the refrigerator for 20-30 minutes; THEN, we grilled them. In the meantime, we mixed the balsamic vinegar, red wine (used Bordeaux) and a generous pinch of brown sugar. Let it reduce and then served in little sauce cups alongside the filets. My husband LOVED this. I didn't want to take the chance of ruining some great filets by cooking them in the wine/vinegar mixture since a lot of people were turned off by this in their reviews. By allowing it to reduce, it was a little bit thicker (still a bit too thin for me however) and you can merely dunk your bite into the sauce, thereby adjusting how much or little you would like. Will make this again because of the simplicity of the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-30T18:06:17.4Z",
                "reviewBody": "This glaze is the best sauce I've ever tasted.  I think it's impossible to mess it up, you could put in any variation of the ingredients and it would still be tasty.  I followed the recipe until the steaks finished, then took them out, and let the glaze cook down for about 3 minutes, adding brown sugar (1 to 2 tbsp.) and butter (1/2 to 1 tbsp).\nI forgot to double the recipe like everyone else mentioned, make sure you do! Not only is the sauce fantastic on the meat, but SO good with asparagus, dip bread in it, put it on potatoes.  I'm going to make it over and over again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J. Vincent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1690069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-23T01:37:32.717Z",
                "reviewBody": "This was excellent but I made some changes to help it. First, I salt and peppered the steaks and then placed them in the pan in a little bit of olive oil (1-2 tbsps) and browned them on med-hi for 1 minute both sides. I put the 1/4 cup balsamic vinegar in a sauce pan and 1/4 cup sherry (just because i didn't have red wine on hand today) and added 2 cloves minced garlic and 1 heaping tbsp brown sugar. I let this simmer while the steaks were browing. Then I poured the sauce over the steaks and turned heat to low and covered. I cooked my husband's filet for 4 minutes each side to be medium, but I like my with less red and cooked my 6 minutes each side. The sauce reduced perfectly and it became a glaze and was wonderful. Make sure you don't let it reduce too much or it will be a burnt. I liked it with the sherry so much I don't know if i will bother trying with the red wine or not. It had a wonderful flavor. I would definitely only make with garlic added. PERFECT... we felt like we had just eaten in a steak restaurant!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EMMA_LOU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/791193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-15T00:44:28.687Z",
                "reviewBody": "Happy Valentines Day, Oh my!!!! This was heaven, I sauteed about a cup each of onions & mushrooms in 1 tbsp each butter, olive oil, & 1 clove garlic when tender moved to a bowl, increased heat and placed steak in pan, turning after 1 min each side, did not cover, and turning again after 4 min each side, added the balsamic/red zinfandael after 8 min, after 10 min total I added the mushroom/ onion mixture to the pan for another 4 min turnin the steaks again, aftern 14 min total removed the steaks to a plate and continued to reduce the onion/mushroom mixture for another 4 min while the steak rested, a perfect warm pink center, and a mushroom/onion, balsamic/zinfandel side dish to drool over. Happy Valentines Day",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SINGLEDADCANCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/729832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-25T21:46:23.347Z",
                "reviewBody": "I can't comment on the preparation of the steaks in this recipe, as hubby grilled ours outdoors over charcoal.  I do have to say, however, that I would never simmer the filets in the reduction.  In my view that's a good way to ruin very expensive filets! Having said that, I guess what I'm reviewing here is the balsamic/wine reduction which was just too simple to be that good!  Richly flavorful and syrupy, and to think all you have to do is mix up a GOOD red wine and a GOOD balsamic vinegar and simmer it until it reduces about 75 percent. This was as good as any fancier or difficult glaze or reduction than I've ever made or eaten at fine restaurants. This definitely will be something I'll remember to make again. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T23:01:38.03Z",
                "reviewBody": "I absolutely loved this recipe.  We wanted something other than the same old turkey for Christmas this year.  And...We didn't want Christmas leftovers either.  This was perfect.  I tripled the recipe and served 6.  I served it with roasted red potatoes and green beans.  I also served it with homemade foccatia bread served with olive oil and basalmic vinegar.  Steamed artichokes for appetizer and a great recipe I found for chocolate pudding cake by Emeril Lagasse.  My Brother-in-law commented that in a resaurant that would have been a good $60-80 meal per person!  That is the best complement I've ever gotten for my cooking.  I was surprised that other people didn't find the recipe as outstanding as we did.  The key thing i think is to use good quality ingredients.  This isn't something I could afford to make every week.  The steaks alone cost me $55, not to mention the wine...but the topper is the get the best basalmic that you can afford.  We used one aged 18 years. It was really sweet.  Tasted almost like raisins.  I give this 5 stars!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NAT_YSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/540941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-04T13:31:30.37Z",
                "reviewBody": "Made this last night for husband's birthday dinner.  We both loved it.  After reading some of the reviews here, I cooked the sauce separately and made some changes. Used 2 5 oz filets wrapped in bacon and rubbed with coarse ground black pepper & Mrs Dash Garlic & Herb seasoning.  Seared the bacon in a hot pan by turning steaks on their sides with tongs before cooking 3 minutes on each side for rare.  Started out with hot pan and gradually reduced heat as steaks cooked.\nFor the sauce, used red table wine & doubled it along w/the balsamic vinegar called for in the recipe. Added 2 tbsp brown sugar, 1/2 tsp rosemary, 1 tsp minced garlic.  Reduced sauce by half & used for dipping.\n\nWe thought the sauce complimented the meat wonderfully without overpowering it.  This one is definitely a keeper.   ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PatT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1891084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-02T18:32:10.437Z",
                "reviewBody": "Tasted like....vinigar...and I really don't think vinegar and steak should go together. needs more of something, salt maybe, onion seasoning would add a nice touch. The peppercorn could stay, but really, I would try this again if I were cooking on the grill, but this just shouldn't be pan cooked together. as a marinade, I'd do it again, but not exactly like this. I really don't think I'll try this again, I think the measurements are off, with the red wine, not sure, but this wasn't as good as I thought it might be. Also, In my opinion, these reviews here, claiming this recipe to be deliscious or wonderful are just plain OVER RATED!....No one in my family was enthusiastic about this one. I was not impressed, and frankly this may very well be the worst flavor for steak I've ever encountered...Minus some vinigar or wine, cocka!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ZESTYGIRL30",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/481514/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Filet Mignon with Rich Balsamic Glaze",
            "description": "See how to make an impressive steak dinner for two that's also quick and easy!",
            "uploadDate": "2012-08-27T20:37:22.713Z",
            "duration": "PT3M14.403S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F94fa96d3-81eb-4f5e-a9a5-7312dcbd00be%2F856014c2-85f6-4e22-9a53-b6e5ce31f9c3%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1808823533001"
        }
    }
]