[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17041/appetizers-and-snacks/meat-and-poultry/jerky/",
                    "name": "Jerky Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/30795/t-birds-beef-jerky/",
        "name": "T Bird's Beef Jerky",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F564906.jpg",
            "width": 1496,
            "height": 2256
        },
        "datePublished": "2019-04-02T06:43:59.000Z",
        "description": "This is the very best jerky you have ever tasted, I've tried a lot of them, and this one's the best - you will reward me on this one! I use venison when available, but cheap round steak is great also, and it's all done in your oven.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P1DT4H30M",
        "recipeYield": "4 lbs.",
        "recipeIngredient": [
            "4 pounds round steak",
            "4 tablespoons onion powder",
            "1 ⅓ teaspoons black pepper",
            "1 ⅓ teaspoons garlic powder",
            "2 pinches salt",
            "1 teaspoon dry Italian-style salad dressing mix",
            "1 cup Worcestershire sauce",
            "1 cup soy sauce",
            "1 teaspoon hot pepper sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut meat into strips no thicker than 1/4 inch. In a large bowl, mix together onion powder, pepper, garlic powder, salt and Italian seasoning. Stir in Worcestershire sauce, soy sauce and pepper sauce. Place meat into a container, and combine with marinade. Cover, and refrigerate 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place oven rack on the highest level. Place aluminum foil on bottom of oven to catch drips. Preheat oven to 150 degrees F (65 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Insert round toothpicks through the tops of the strips of meat, and hang them from the oven rack. Bake in preheated oven for 4 hours, or until dried to desired consistency.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Meat and Poultry",
            "Jerky Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DEWY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.507462686567164,
            "ratingCount": 201,
            "itemReviewed": "T Bird's Beef Jerky",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "64.7 calories",
            "carbohydrateContent": "1.5 g",
            "cholesterolContent": "17.9 mg",
            "fatContent": "3.6 g",
            "fiberContent": "0.1 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "285.4 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-05-03T22:32:58.247Z",
                "reviewBody": "First -- I quite often wonder why people post a review of a recipe, when they didn't follow the exact directions in the first place!!  e.g. “I made this recipe, but substituted the onion salt and hot sauce with ketchup…..... my husband didn't like it... 2 stars.”.  \r\n\r\nThat is my biggest complaint with the reviews that exist… those people are only reviewing their own versions, not the recipe someone posted, but I digress.\r\n\r\nThis is a good jerky recipe. I followed it to the ‘T’, and therefore can review it.  \r\n\r\nI didn't give it 5 stars, because I felt it could have eased up on the Worcestershire sauce a bit.  I found that flavor overpowering, for the same reason I would never put a steak sauce on a good steak in a decent restaurant:  let the flavors stand on their own.\r\n\r\nSo less Worcestershire, and bump up the traditional jerky salt and pepper aspects, and you will likely have a winner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AGENTORANGE75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1412394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T16:40:06.84Z",
                "reviewBody": "Good recipe, worked well in my electric oven... I turned the heat up to 170 and cracked the oven door to exhaust the moisture.  I tried it a second time substituting teryaki (sp) instead of soy and added some liquid smoke and chili powder... Liked it better this way, not as salty.  Watch your time, don't over cook.  Should bend not snap.  Good stuff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAYHALKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/847097/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-21T17:50:21.06Z",
                "reviewBody": "I followed the recipe to a \"T\" for my 1st batch and it was good. I used venison and after sliceing the meat I rinsed it in tap water to get out as much blood as possible. For my tastes I feel I made some improvements on the following batches. I cut the pinches of salt out and the worcestershire to 3/4 cup and the soy to 3/4 cup and the red pepper to 3/4 t and then I added 2T brown suger, 2T honey, and 1/4 mesquite liquid smoke. I like my version best!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DanWO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1649220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:22:11.873Z",
                "reviewBody": "Well T Bird my husband is a happy man!! He's addicted to Jack Links (store bought) jerky but complains about how expensive it is. This jerky is VERY TASTY not as good as Jack Links but much more tender! I added a tsp. of McCormick Montreal Steak Seasoning and used coarse ground pepper it added such a nice little kick! I saved the metal skewers from store bought shish kabobs & they work great. The guys at our super bowl party ALL loved this THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-17T01:04:17.4Z",
                "reviewBody": "Great Flavor!  I used low salt soy sauce and it was enough salt for me.  Yum.\nMy comments: \nI cut a top round roast lengthwise into two thick pieces.  Avoid/remove the fatty or gristly areas (use for soup or stock). Lightly freeze the slabs.  Cut  along the grain to get the traditional texture - across the grain doesn't work well.  \nMarinate two days for extra flavor saturation. A few times a day, massage and turn the bag to redistribute the marinade evenly.  \nLine the bottom of your oven with foil to catch drips.  I don't turn the oven on until I have it all loaded so it's not hot to work with.  I also wipe down the door which gets VERY messy before heating.\nSeparate the thin cuts from the thick cuts.  Squeegee the marinade off with your fingers to remove excess.  String tips of like sizes onto wooden kebab skewers.  (I get 10 pieces easily on a skewer.)  Then lace them through your oven rack so they all hang down.  Alternate sides of the rack so you have them evenly distributed.  Place the thinner cuts towerd the front so you can easily remove them when dried.  Place a hot pad in the door to hold it slightly open to let the moisture escape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne Romanek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1303676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T16:40:04.437Z",
                "reviewBody": "The cooking method worked very well! If anyone tries to make this beef jerkey watch the heat and time as they vary from oven to oven. I cut down my baking time to 3.5 hours instead and it was well done. Another suggestion is that do select meat with least fat as possible and you will reduce tremendous amount of grease dripping while the jerky's being cooked (and your oven won't smell like it's burning too!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pretty1pink",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/828400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-29T21:53:57.78Z",
                "reviewBody": "I'm totally satisfied! I followed all ingredients to a tee but added a little celery salt and 1 tsp of brown sugar & cayenne 'cuz we're a bunch of daredevils. YEAH! that was my husband's sentiments. He my 2 yr old and myself ate the whole batch last night. I used eye of round steak that had been marked down to practically 0! Also slicing (across grain) is super easy if the steak is a little frozen. I got it paper thin with no trouble. I'm making more after a store run!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "onassis75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/684318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:58:47.083Z",
                "reviewBody": "I cooked this two ways. After the first 24 hours of marinading I dried half of the meat in the dehydrator and put the remaining meat back into the fridge. The 2nd night I cooked the rest of the meat in the oven as directed which was much better...I'm not sure if that was due to cooking method or marinade time. However my boyfriend and daughter thought this was too spicy while my roommate and I thought it was great. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-22T04:07:01.34Z",
                "reviewBody": "Was sooo good that the entire recipe (64 servings) fanished by the end of the day!! I used a dehydrator worked great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BLANGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/442675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T19:48:23.717Z",
                "reviewBody": "My first time making beef jerky. I followed the recipe quite closely only leaving out the Italian seasoning and upping the hot sauce. I didn't hang them I put them on a rack over a sheet pan and used balls of tin foil to make the rack tilt on an angle to let the juices run off. I did four hours at 170 (lowest my oven goes for some reason) and they were nowhere near done...did a further 2 1/2 hours at 190. The texture is a bit off...any bits of fat (I did trim but there's always a bit) are oddly chewy and the rest varies from crunchy to tough. I think that the marinade requires an acid such as red-wine vinegar or lemon juice to give it a better texture and tang. It isn't bad...but it's not great. If I try again I'll use more hot sauce and some vinegar...It's a good thing I started early in the morning or I wouldn't be making the (baked) dinner I had planned. Thanks for sharing. EDIT: After letting them cool they were MUCH dryer than when I took them out of the oven. I think that the recipe should specify that they might not seem quite done when the time is up but that taking them out and letting them cool will dry them out further. I suppose if I had been experienced with this sort of recipe I would know that but I didn't). They are a little too dry now a combination of my own mistake and unclear directions. Again thanks anyway.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5693502/"
                }
            }
        ]
    }
]