[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23145/chicken-enchilada-soup-ii/",
        "name": "Chicken Enchilada Soup II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6117819.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2000-10-12T21:20:53.000Z",
        "description": "This hearty soup won't leave you hungry!  Chicken broth hosts enchilada sauce, processed cheese, onion and garlic for this soup version of a Mexican inspired favorite.  Garnish with shredded cheese and crumbled tortilla chips, if desired.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "1 pound boneless, skinless chicken breast halves",
            "½ cup diced onion",
            "1 clove garlic, minced",
            "4 cups chicken broth",
            "1 cup masa harina",
            "3 cups water, divided",
            "1 cup enchilada sauce",
            "1 pound processed cheese, cubed",
            "1 teaspoon salt",
            "1 teaspoon chili powder",
            "½ teaspoon ground cumin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large pot over medium heat.  Brown chicken breasts for 4 to 5 minutes on each side.  Shred and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To the pot add onions and garlic; saute for 2 minutes, or until onions are translucent.  Pour in chicken broth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl combine masa harina with 2 cups of water and whisk until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To the onions and garlic add the masa harina mixture, remaining water, enchilada sauce, cheese, salt, chili powder and cumin.  Bring to a boil; add shredded chicken.  Reduce heat to low and simmer 30 to 40 minutes, or until thickened.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SILVANUS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.616504854368932,
            "ratingCount": 206,
            "itemReviewed": "Chicken Enchilada Soup II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "241.9 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "59.8 mg",
            "fatContent": "14.2 g",
            "fiberContent": "1.6 g",
            "proteinContent": "16.9 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "703.1 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-22T16:28:08.41Z",
                "reviewBody": "Excellent recipe, i did make modifications to make it taste and look more like Chili's soup. Added: 1 tbs of chili powder, 1/4 teapoon of cayenne pepper, 1 teaspoon of onion powder in place of whole onion xtra lb of chicken, used full 10oz can of enchilada sauce & 1/2 can of tomato paste (small can) and used 1/2 lb of light velvetta these changes it made it taste just like if not better than chili's version with much less fat/cal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sabaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2269697/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-11T17:59:44.64Z",
                "reviewBody": "Could someone tell me what exactly you do with the masa harina powder? I don't feel like I am getting the results I should be with this soup. It turns out really thick lumpy and grainy and tastes like flour... that's why I think I am doing something wrong with the masa harina. You don't directly put the masa harina powder/water mixture in the soup do you? Thanks for any help!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAWKEYEGRRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1348828/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-04T20:09:17.327Z",
                "reviewBody": "Yummy. I think it is close to Chili's C. E. soup. I heated a tbsp olive oil and added 2 cloves of garlic and then added 3 small chicken breasts. I cooked the breasts in a pot on both sides until juices were clear. Then I removed the chicken and added the diced onions and cooked until translucent. I poured in 2 (14.5 oz each)cans of chicken broth and stirred. I mixed 1/4 cup of masa harina which is corn flour (Quaker company makes this also found on the aisle where the Latino food products are or near the regular white flour)with a 1/2 cup of water, stir it well to get out lumps and then I added it to the pot that has the chicken broth and onions. Then I mix another 1/4 cup of masa harina with just enough water to make it like a thick, wet paste, stir it until blended, it should not look dry or crumbly, but smooth and sort of thick. I added this mixture to the pot and stirred. Then I added 1 cup water, I made up a package of mc cormick enchilada sauce and added all of it to the pot (approx. 3 cups or more), 16 oz of velveeta cheese, salt, chili powder & cumin. Stirred. Brought to a boil, stirring often so the cheese did not stick as much and also used a non-stick pot. Added diced cooked chicken. Stirred. Reduce heat and I simmer until thick about 5 minutes. This gives the soup a thick/thin top texture, not as grainy from the masa harina. I topped it with pico de gallo and crushed tortilla chips (Tia Rosa Mega thins) and a little shredded cheese. Excellente!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NEEDGREATRECIPES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1167937/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-30T02:23:26.11Z",
                "reviewBody": "I used this as a basic recipe, but then also added ingredients listed in the Chicken Tortilla Soup I (by Star Pooley), also on this website.\nRevisions using THIS recipe included:  using one whole large chopped onion (rather than 1/2), 3 garlic cloves (rather than 1), did not add the 3rd cup of water, used green enchilada sauce, used real jack cheese (rather than processed \"cheese\" and used it as a garnish only), did not add salt.  I also cut the chicken breasts up into bite-sized pieces and put them in one of those basket-vegetable steamers rather than cooking in oil.\nFrom the OTHER Tortilla Soup recipe, I also added 1/4 tsp oregano, 1 28-oz can crushed tomatoes, 1 c corn, 1 c white hominy, 1 can chopped green chilis, and 1 can black beans.  I used cilantro, grated jack cheese, and crumbled tortilla chips as a garnish.\nI tossed it all in a crockpot to finish up and my hub and I wolfed on it tonight with a margarita.  It was good!  Thanks Letha and Star!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-27T04:45:38.6Z",
                "reviewBody": "This is absolutely one of the best tasting soups I've ever tasted! And I've always been a big soup lover and have made and eaten many kinds of soups! The seasonings are perfect and the texture is smooth and almost creamy. I think that Masa Harina flour gives it that wonderful texture. This recipe goes into my family recipe book to make sure we have it for years to come! In fact this is one of two soups I'm serving for a small holiday get-together w/ my parents who are also soup-lovers. Thanks for sharing this!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurie Woods",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lwoods1111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:52:18.973Z",
                "reviewBody": "Delicious. The masa harina adds a wonderful texture. I omitted the processed cheese and sprinkled a teaspoon of Pepper Jack cheese on each bowl.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "schmerna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-05T20:12:15.043Z",
                "reviewBody": "I have been making this recipe for years. Nearly everyone I give it to loves it. I sometimes use instant corn meal in place of the masa harina. I wouldn't recommend the corn starch that another reviewer used- this recipe gets so much of its character from the masa harina that won't shine through with corn starch. I like to use a small can of mexican style tomato sauce because it gives the same flavor but is less expensive than enchilada sauce. This soup definitely gets much thicker the second or third day so you may need to add water and if keeping it on a simmer make sure to stir often or you will have burnt cheese. (Even then it's pretty good!!!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANDK1997",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/598787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-06T20:03:52.64Z",
                "reviewBody": "What a great soup! I boiled the chicken first and left out the oil and also the salt (I like alot of salt but the cheese has plenty in it). I did find that I had to stir it constantly to keep it from scorching. I couldn't find anything labeled 'masa harina' so I asked at the grocery store and was directed to 'instant corn masa mix'. It worked great! Very tasty! Economical too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MINIVANMOMOF3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/462143/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-04T18:57:56.497Z",
                "reviewBody": "A potluck favorite at work. I shred up a pre-roasted chicken and cut everything else up the night before. Then I bring it all to work and throw it in the crock pot. When lunch time rolls around the office smells wonderful. I go home with an empty crock pot every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/261543/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-24T20:18:47.4Z",
                "reviewBody": "Not to our taste. An earlier reviewer had said it tasted like chili's. NO! I usually don't review recipes I don't like but I don't want to make the mistake of making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "TOODLESTEACHES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/54311/"
                }
            }
        ]
    }
]