[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23874/catherines-spicy-chicken-soup/",
        "name": "Catherine's Spicy Chicken Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F04%2Fimage-616.jpg",
            "width": 1280,
            "height": 720
        },
        "datePublished": "2019-04-04T03:27:48.000Z",
        "description": "This is a great recipe that you can fix to your taste!  The longer it simmers the better.  Top with crushed tortilla chips and shredded cheese.  Enjoy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 quarts water",
            "8 skinless, boneless chicken breast halves",
            "½ teaspoon salt",
            "1 teaspoon ground black pepper",
            "1 teaspoon garlic powder",
            "2 tablespoons dried parsley",
            "1 tablespoon onion powder",
            "5 cubes  chicken bouillon",
            "3 tablespoons olive oil",
            "1 onion, chopped",
            "3 cloves garlic, chopped",
            "1 (16 ounce) jar chunky salsa",
            "2 (14.5 ounce) cans peeled and diced tomatoes",
            "1 (14.5 ounce) can whole peeled tomatoes",
            "1 (10.75 ounce) can  condensed tomato soup",
            "3 tablespoons chili powder",
            "1 (15 ounce) can whole kernel corn, drained",
            "2 (16 ounce) cans chili beans, undrained",
            "1 (8 ounce) container sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large pot over medium heat, combine water, chicken, salt, pepper, garlic powder, parsley, onion powder and bouillon cubes.  Bring to a boil, then reduce heat and simmer 1 hour, or until chicken juices run clear.  Remove chicken, reserve broth.  Shred chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large pot over medium heat, cook onion and garlic in olive oil until slightly browned.  Stir in salsa, diced tomatoes, whole tomatoes, tomato soup, chili powder, corn, chili beans, sour cream, shredded chicken and 5 cups broth.  Simmer 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AUNTTAF"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.747126436781609,
            "ratingCount": 2436,
            "itemReviewed": "Catherine's Spicy Chicken Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "472.6 calories",
            "carbohydrateContent": "50.3 g",
            "cholesterolContent": "81.8 mg",
            "fatContent": "15.3 g",
            "fiberContent": "10.1 g",
            "proteinContent": "39.6 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "2436.4 mg",
            "sugarContent": "14.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-06T21:52:37.987Z",
                "reviewBody": "Lets make this great recipe even easier. Cook the onions and garlic in a big, thick bottomed pan, add the chicken (chopped small or used cooked chicken that comes in the little pouch).Add dry spices and herbs. When chicken is not pink anymore and the rest of the canned ingredients. 1 can of tomato is plenty, the best corn is of the frozen kind. Top with the sourcream, tortilla chips , cheese or whatever else your heart desires! \nIf this is useful-remember to mark it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef 101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1425719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-31T00:49:48.31Z",
                "reviewBody": "The great thing about this recipe is its flexibility.  You can adjust about any quantity to your liking and still enjoy the basic flavors.  For those who thought it too bland or too spicy, the solution is to adjust your seasonings as you go.  The parsley flakes, onion powder and garlic powder are not so critical, but save adding chili powder and salt for the last, especially because the boullion cubes will be salty.  Chili powder intensifies the perception of saltiness, so add it before any salt.  Start with half the recipe quantity of spices, wait 5-10 minutes as the soup simmers for the spice flavor to fully release, then taste.  Repeat this adjustment cycle as necessary until you're satisfied.\n\nWe save the sour cream to add at the table, along with shredded cheddar cheese and corn tortilla chips.  Want great tortilla chips?  Buy a package of fresh corn tortillas.  Spray or brush both sides with olive oil, cut each tortilla in half and then julienne them into 1/4\" strips.  Spread the strips out on a nonstick cookie sheet.  If you like, sprinkle with sea salt, chili powder and/or cumin.  Bake 5 minutes at 425 degrees and check; sample and bake longer until the chips achieve your desired crispness.  The julienned chips are great because they're easy to pick up with a soup spoon.  You'll never go back to store-bought chips!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Uncle Ed's Nephew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1898838/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-28T18:29:56.13Z",
                "reviewBody": "Wow is all I can say. Made this for the 1st time last night and my husband and I both agree it was delicious.  I decided to halve the recipe because I only needed to feed 2 adults and one child and even halfing it left us with plenty of leftovers for another meal.  I did decide to do this in the crockpot though. Here is what I did based off of other suggestions:  \n\nMinus olive oil, corn and beans, threw everything in my crockpot (chicken breasts whole) and set on low for 8 hours.  Last 2 hours, I removed chicken breasts to shred (didn't take much as they fell apart from being in the juices), added chicken meat back in, 1 can of black beans (rinsed and drained), and the corn.  I did not use chili beans, whole tomatoes or sour cream as I prefer a lower in fat and calorie meal.  I did use a fresh pico de gallo from the store instead of canned salsa and used fire roasted diced tomatoes.  I topped our bowls with diced avocado and chopped cilantro and voila!  For the kids I added crushed fritos and cheese, the soup was not too spicy for my 3 year old.  So easy in the crockpot, I highly suggest making it this way.  So much flavor, and I will definitely be adding this to the rounds with no changes.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LASVEGAS00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1093361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-24T21:47:58.28Z",
                "reviewBody": "Excellent recipe, and this is how I make it easier on myself. I use a supermarket rotisserie chicken with the skin removed and shredded off the bone. I saute the garlic and onion in the olive oil and then stir in a little flour to absorb the oil. Then I stir in 2 large containers of good quality chicken stock, and add the shredded chicken. I also use the diced tomatoes with the chiles already in them, and I double the amount and omit the whole tomatoes and tomato soup.  I use a  medium salsa that has black beans and corn already in it too. I also hold off on the sour cream and let each person top their own bowl with corn chips, sour cream, green onions and shredded cheese. Especially good cabin recipe, winter or summer.  Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Blossom77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2380890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-18T22:05:19.223Z",
                "reviewBody": "I really liked this, but like others, I made changes: I left out the whole tomatoes and chili beans; used frozen corn rather than canned and tub of fresh salsa rather than jarred; I didn't have the patience to shred all the chicken, so I diced about half of it and it all broke up just fine; I spooned the sour cream on top of the serving bowls (good without, too) with sliced black olives--all yummy options! This definitely eats like a meal, but you can decrease the chicken if you're just looking for a side dish. Also, it freezes well. Everybody else may already know this, but I accidentally discovered that condensed tomato soup does a GREAT job cleaning electric stove elements and underpans. Those little discs in the middle of the elements are supposed to be silver! News to me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VNITSIRK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/454971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T19:05:21.043Z",
                "reviewBody": "WOW! WOW! AND WOW!  This was the BEST soup I have ever made.  It's the perfect blend of spice and  thickness, and it's FABULOUS.  \n\nMy one suggestion is if you are health conscious replace the sour cream with plain fat free yogurt.  In my opinion plain fat free yogurt tastes very close to sour cream when mixed in with things and it will save you alot of fat and calories!! \n\nAgain, this was a great recipe!! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Whitney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1472504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T02:46:37.287Z",
                "reviewBody": "I LOVED this recipe! I've been trying to eat meals with low to no fat and came across this one. I love spicy food so this was right up my alley. I substituted the tomatoes for a can of Rotel diced tomatoes with green chiles like Lucky0372 did and black beans for the chili beans. PERFECT. Another thing I just boiled the chicken for about 20 minutes took all but 2 quarts water from the pot then threw everything in and simmered for an hour. It was PERFECT. Very spicy! My husband and I sat on the couch eating the soup with a box of tissues in between us for our runny noses from the spice-lol! I've made this 4 times already and have only had the recipe for a few weeks. For me to make a meal more than once over that time is very rare so it HAS to be good. I'll be serving this soup to my grandchildren! (Well I may have to cut down on the spice for them-but I'm keeping it as is for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Applesauce31",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2071240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T20:50:52.15Z",
                "reviewBody": "This soup has become a staple in our house, by far the best soup I ever tasted. We just had a birthday party for my son and we made this soup along with other foods, everyone left with the recipe as they truly loved it. I gave some to my neighbor & he asked for the recipe saying its the best soup in the world. When I make a dish I follow the recipe exactly the first time & make any changes the second time as I see fit. I can say I only made a 3 changes, one was by accident, we forgot the sour cream & I have to admit I didn't notice any difference so to save on unnecessary fat and calories we omit it from now on. I also omit the corn, first I don't notice it in the taste nor feel it adds anything but unnecessary carbs and calories. One other change I make is I add about 1/2 tsp of Ground Red (Cayenne) Pepper. This make a huge difference in kicking it up just a bit, if 1/2 if too much try 1/4 tsp but I suggest adding it if you like a little extra spice is all. It doesn't make it hot but it will clear your sinus's out... This soup has helped me lose weight as I have been cutting fat & calories in my diet so I eat a lot of this soup as it has a lot of fiber, low in fat and low in calories. Since I write down everything I eat and keep track of my caloric intake here are the nutritional changes should you omit the corn & sour cream. 199.4 cal. 1.5g Fat, 25.7g Carbs, 23.4g Protein 7.6g Fiber per serving. Enjoy...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BillR625",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4277591/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-03T20:54:59.237Z",
                "reviewBody": "This is a great recipe!  I usually head straight for the 5 star rated recipes and, to do them justice, follow them to a “T” on the first go around. I’m no expert chef but I have been cooking for family and friends since I was 9 yrs old and as a California born and raised “Span-Mex-Rican” who’s been around Hispanic home cooking all her life, I’ve learned a thing or two about spicy cooking. I made some changes right out of the starting gate on this one. \n\nOmit the ½ Teaspoon salt – there’s plenty of flavoring (and sodium) in the bouillon\nUse 4 cubes of chicken bouillon (1 less than original recipe)\nUse 4 cloves of garlic (1 more than original recipe)\nReplace 2 (14.5 oz.) cans of peeled and diced tomatoes w/ 2 (10oz.) cans of “Ro-Tel Diced Tomatoes w/ Lime Juice & Cilantro”\nOmit the 1 (14.5 oz.) can whole peeled tomatoes all together\nReplace the 1 (10 oz.) can of condensed tomato soup w/ 1 (7.75 oz. can of “El Pato” – Mexican hot style tomato sauce)\nReplace the canned corn w/ 2 cups of frozen corn\n\nFor the Salsa: I used “La Victoria Medium”\nFor the Chile Beans: I used S&W Chile Beans (Pinto Beans, Chili Pepper, Onion, Garlic in Zesty Tomato sauce)\n\nCook as directed except: add Chile Beans before the corn & “lightly” mash the tomatoes and beans in the pot. (This further releases the flavors of the beans & tomatoes into the broth and the smashed beans make for a creamier consistency…I’m not a big fan of whole beans or chunky tomato bits in my soup.) Then add all other ingredients ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cynthiav",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2397938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-03T23:32:10.047Z",
                "reviewBody": "good served with rice--sort of like gumbo or jambolya",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNE LEHMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/263507/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Catherine's Spicy Chicken Soup",
            "description": "This delicious soup takes a little time but is oh so worth it.",
            "uploadDate": "2012-08-19T21:08:32.847Z",
            "duration": "PT4M44.868S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fee5e1d65-3e38-4302-af8b-4d8ee5b4db51%2F9ebe5598-0d40-4131-8692-77c76adc1657%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1793986819001"
        }
    }
]