[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14730/soups-stews-and-chili/stews/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23890/angels-old-fashioned-beef-stew/",
        "name": "Angel's Old Fashioned Beef Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6932297.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-04T03:27:49.000Z",
        "description": "Beef chuck stewed with potatoes, carrots, celery, onions and beef broth for a homey favorite. The aroma that permeates throughout the house while the stew is simmering doesn't do it justice..delicious.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "4 tablespoons vegetable oil",
            "½ cup all-purpose flour",
            "1 tablespoon garlic powder",
            "1 teaspoon salt",
            "1 teaspoon black pepper",
            "2 pounds beef chuck, cubed",
            "12 small boiling onions",
            "6 large potatoes, peeled and diced",
            "6 carrots, sliced",
            "3 stalks celery, sliced",
            "3 (10.5 ounce) cans beef broth",
            "3 tablespoons all-purpose flour",
            "1 tablespoon cold water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large pot heat oil over medium high heat. In a resealable plastic bag mix together the flour, garlic powder, salt and pepper. Add a small handful of meat at a time and shake until well coated; brown in hot oil, about 1 minute per side. Remove the browned meat and continue until all the meat is browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lower heat to medium and add onions. Brown onions on both sides, about 3 minutes per side, then remove from pot and set aside. Drain excess fat from pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To pot add potatoes, carrots, celery, reserved onions, browned meat and broth. Stir all together and bring to a boil. Reduce heat to low, cover and simmer for 2 hours, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For a thicker broth: 1/2 hour before stew is done, combine 3 tablespoons flour and water in a small bowl and mix well, then slowly stir mixture into stew.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Margo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.539344262295082,
            "ratingCount": 610,
            "itemReviewed": "Angel's Old Fashioned Beef Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "347.6 calories",
            "carbohydrateContent": "25.7 g",
            "cholesterolContent": "53.7 mg",
            "fatContent": "19.6 g",
            "fiberContent": "3.4 g",
            "proteinContent": "16.9 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "520 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-08T14:47:27.513Z",
                "reviewBody": "Awesome! Very easy and VERY, VERY good. After reading previous reviews, I took many suggestion to great success. I used to 2 choice round steaks and cut them up. Added 2 more teaspoons of salt. Reduced Pepper to 1/2-teaspoon. The browning of the meat is definitely important, do this with care and make sure you get a nice crust on the meat without burning. Also added to great delight fresh herbs - thyme, sage, rosemary and 2 dry bay leaves as well as 1 can of crushed tomatoes + 2 tablespoons of Worchestire. Warning...you will need a big pot, this makes alot. Another suggestion, brown meat and onions in another large saute pan and deglaze with a little of the broth and butter. I didn't have beef broth so I used beef boullion and boiling water instead and it still turned out great. Also, used corn starch mixed with water instead to thicken. It was all gone and even my mother loved it to my surprise. A definite WINNER and REPEAT recipe. Thanks Angel.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OLIVERCADO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-13T01:28:13.59Z",
                "reviewBody": "When I see FIVE STAR recipes reviewed by this many people, I expect the recipe itself to stand on it's own, with little or no modification.\r\n\r\nAs is, this recipe is a TWO STAR; unless you like somewhat bland mashed potatoes with beef chunks, then I suppose it might be a FOUR STAR.\r\n\r\nI agree with many of the other reviewers that this DOES need spiced up.  I, too, tried the stewed tomatoes, sage, rosemary, thyme, bay leaves and worcestershire sauce.\r\n\r\nAfter those rather major modifications, I still cannot give this recipe a FIVE because, putting the potatoes in when instructed, I ended up with \"tastier mashed potatoes with beef chunks\".\r\n\r\nBeing new to cooking stews, I had no idea that the two hour time would be excessive for potatoes.  Everyone I've talked to since, including good old mother, said they normally add potatoes the last half hour or so of simmering.   Which, makes sense since at about a half hour into the two hours, I got a bit nervous when the potatoes were done, but the carrots were not... AND the flavor had not had enough time to cook into the stew.\r\n\r\nSince I'm a novice chef and am more apt to \"go by the book\" rather than invent ideas on my own, I'd request anyone who got the PERFECT combination of spices and time frames together to improve upon this recipe to create a brand new (and improved) entry on this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "RJNM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/690804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T12:15:49.013Z",
                "reviewBody": "Like many of the reviewers here, I followed OLIVERCADO's reccomendations (sort by most useful to see his review) and made some adjustments of my own to create this delicious stew. These are the changes I made:\r\n\r\n1) From Olivercado: I increased the salt to 3 tsps, and reduced the pepper to 1/2 tsp. I added thyme and sage, but I used 1 tsp each of dried herbs instead of fresh (I omitted the Rosemary). I added 2 bay leaves, 2 TBS worchestershire sauce, and a can of tomatoes, although the ones I had on hand were diced and seasoned with garlic instead of crushed.\r\n2) I cut up a cross rib roast for this dish and so I had about 2.5 lbs instead of 2.\r\n3) I cooked this in the crock pot, having browned the meat and onion first. I cooked on high for 2 hours then reduced the heat to low for about 4 more hours. \r\n4) Because I was using a slow cooker, I reduced the liquid. I added only a cup of beef broth, and a cup of chablis blanc. I usually use red wines or burgandy in beef dishes, but the chablis turned out well giving the finished stew a rich mellow flavor.\r\n5) I used about 5 medium potatoes instead of 6 large. I used a whole chopped yellow onion instead of 12 boiling onions, I used 1/2 lb of prepared (bagged) baby carrots.\r\n\r\nThe stew was rich and flavorful and the consistency just right--no need to thicken. I will definitely make this again although I will probably increase the dried spices to 1 1/2-2 tsps. each and add some green beans. Yum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HappyApple",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T21:09:43.06Z",
                "reviewBody": "Turned out great however I did do the following: #1. Added bay leaf crushed garlic oregano & thyme. #2. Do not add the potatoes carrots and celery until 40 minutes before stew to be done. Bring stew back up to boil add vegetables then reduce heat back to low cover and cook the additional 40 minutes until veggies are done. #3. Like all stews let sit for at least 1/2 hour before serving. Bon Appetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DNUSSER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/907930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-12T18:58:32.64Z",
                "reviewBody": "This is a very delicious and hearty recipe. It will definitely fill you up! I also took much of the advice of OLIVERCADO. You can find the review by searching under most helpful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZABETHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/649768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-12T03:42:45.45Z",
                "reviewBody": "I have tried many different recipes from allrecipes.com and this is the first one I've just HAD to review. It was awesome! I used 6 cups of water with 6 beef boullion cubes instead of canned broth. I also added a splash of marsala wine and a splash of worcestershire sauce. This was absolutely delicous and will be a lifetime keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annette Gestwicki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/608981/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-07T20:49:44.857Z",
                "reviewBody": "I followed some of the other review tips and added two more teaspoons of salt and cut the pepper in half. I added 2 tsp. of paprika to the flour mixture as well. I also added a pinch of tarragon thyme rosemary sage two bay leaves and 1 cup of tomato sauce (my kids don't like tomatos and it makes a wonderful color). I threw the potatos carrots and celery in at the beginning and simmered for two hours and it was VERY tender and delicious. I added another can of beef broth to cover the potatos. Maybe my potatos are bigger:)! Thanks for a wonderfully tasty and easy recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WEELASSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-05T16:10:38.187Z",
                "reviewBody": "Ok, so I read the reviews prior to making this and I think it didn't work too well for us.  I was sure that if I followed the recipe to the T, it would be bland (no seasonings whatsoever).  Anyhow, I would agree to add more seasonings to this (thyme, rosemary, sage and bay leaf), but the suggestion of worchestire sauce and tomato sauce really killed it for us.  Didn't taste like stew we're used to at least.  Next time, I'm skipping the tomato sauce and worchestire and I'm sure it'll work out better for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-04T01:41:21.7Z",
                "reviewBody": "Great tasting. This made more than I thought. But the left overs are great. I added some frozen peas near the end of cooking. I'll do this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeff Stark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1300505/"
                }
            }
        ]
    }
]