[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24085/spicy-vegetarian-lasagna/",
        "name": "Spicy Vegetarian Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3445369.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2019-04-04T03:27:54.000Z",
        "description": "A colorful and tasty veggie lasagna with plenty of peppers and cheese, with red pepper flakes for zip.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (16 ounce) package lasagna noodles",
            "2 teaspoons olive oil",
            "⅔ cup diced red bell pepper",
            "⅔ cup diced orange bell pepper",
            "⅔ cup diced yellow bell pepper",
            "⅔ cup diced green bell pepper",
            "1 small yellow onion, diced",
            "2 (14.5 ounce) cans diced tomatoes",
            "1 (6 ounce) can tomato paste",
            "1 ½ cups water",
            "1 dash crushed red pepper flakes",
            "¼ cup grated Parmesan cheese",
            "1 (15 ounce) container ricotta cheese",
            "1 (8 ounce) package shredded mozzarella cheese",
            "4 eggs",
            "¼ teaspoon black pepper",
            "¼ teaspoon dried oregano, crushed",
            "¼ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Cook lasagna pasta in boiling water for 8 to 10 minutes, or until al dente. Drain, rinse with cold water, and place on wax paper to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook bell peppers and onion in olive oil in a large sauce pan until onions are translucent. Stir in diced tomatoes, tomato paste, water, and red pepper flakes. More red pepper flakes can be added if spicier sauce is preferred. Simmer for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). In a medium bowl, combine Parmesan cheese, ricotta cheese, mozzarella cheese, eggs, black pepper, and oregano.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a small amount of sauce in the bottom of a 9x13 inch baking dish. Reserve 1/2 cup of the sauce. Place three lasagna noodles lengthwise in pan. Layer some of the cheese mixture and the vegetable sauce on top of noodles. Repeat layering with remaining ingredients, ending with noodles. Spread reserved sauce over top of noodles. Sprinkle with grated Parmesan cheese, if desired.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover dish with foil, and bake for 40 minutes or until bubbly. Remove foil during last 10 minutes of baking.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "DEWEESE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.290697674418604,
            "ratingCount": 86,
            "itemReviewed": "Spicy Vegetarian Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312.1 calories",
            "carbohydrateContent": "37.3 g",
            "cholesterolContent": "87.9 mg",
            "fatContent": "10.2 g",
            "fiberContent": "2.9 g",
            "proteinContent": "18.5 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "455.4 mg",
            "sugarContent": "6.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-12T20:32:27.957Z",
                "reviewBody": "This was a great receipe, however the previous reviewer was right, it could more easily be called \"4 pepper lasagna\"\nSo, I kept the red and orange bell pepper and substitued green and yellow zuchini for the others; as well as fresh spinach sauteed with fresh garlic, (OF COURSE!!) in between the noodle and sauce layers. It turned out delicious and the flavors were perfect together. the mix of all the veggies gave it a great hearty texture:) all you need is a crusty baggette to toss along side! ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chefcutie247",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2673095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-13T19:30:11.1Z",
                "reviewBody": "Very good but missing something. The name is a bit misleading as I did not think it was spicy at all, and really the only vegetable besides the onion is bell pepper. A more accurate name would be \"Four Pepper Lasagna.\" Next time I make this, I'm going to add more onions and more spices to the sauce such as salt, pepper, oregano, and basil, as well as more red pepper flakes than what the recipe states, and/or Italian seasoned diced tomatoes. I was also surprised that the recipe didn't call for garlic so next time I'll add a couple cloves. I think these changes will give it the depth of flavor that it needs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TORTOISE33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/556646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T22:35:12.67Z",
                "reviewBody": "Really great. My husband a big meat-eater even loved it. I used a bit more peppers than listed and doubled the red pepper flakes for a great spicy dish. 8 hearty portions. My husband even took leftovers to work for lunch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFERDROZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/438019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T22:34:47.483Z",
                "reviewBody": "Wonderful! I add pecorino romano to my mix and it is wonderful. The key really is to cook the sauce for a while let it develop the flavors. I also add 1/2 cup red wine to the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NRGUPTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/684261/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-30T17:23:23.257Z",
                "reviewBody": "I use this particular recipe as my base anytime I make Veg. Lasagna and it always turns out great. The kick from the red pepper flakes perfectly compliments the cheese and veggies. my only problem with the exact recipe is it has a lot of juice in the bottom of the pan when made to these exact directions that I just drain out the corner of the pan a little. I eyeball the amount of peppers use zucchini spinach and sometimes carrots. I also do not use the tomato paste and water. I sometimes just sauté the onions garlic and peppers leaving out the tomatoes. It still turns out great with a little less juice its also a great base recipe for spinach lasagna. If you want softer zucchini sauté it with the peppers. So my overall suggested changes would be as follows: Saute onions garlic peppers and zucchini use your favorite spaghetti sauce in place of the pepper mixture mentioned here. Layer the mixture and maybe add in spinach if you like. This makes for a more flavorful lasagna as the original as others have mentioned is more like 4 pepper lasagna. The more red pepper flakes you add the spicier it will be if your finding it is not spicy enough for you add more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1576141/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-06T03:20:32.537Z",
                "reviewBody": "This is a really great starting place for a vegetarian lasagna. From making others like this I've learned that unless you bulk it up some with other veggies it just isn't that filling. I also make it a bit healthier by using low fat cottage cheese instead of Ricotta. With the peppers and onions I add in broccoli mushrooms and spinach(frozen). Put in as much as you want. I follow the directions as written for the sauce but keep in mind it will not look very sauce like with the extra veggies. No worries though use it like the recipe suggests it still works great and tastes even better. I add extra red pepper flakes to the cottage cheese mix and only use one egg. I can't imagine using 4 eggs. I also sprinkled the mozzarella on after putting on the cottage cheese mix. I know I've listed a lot of changes but it really is worth playing around with to make it your own.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kate92009",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3163641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-23T15:43:43.107Z",
                "reviewBody": "This lasagna was excellent. I did find that I had at least 1/2 of each pepper leftover which I used the next day for fajitas. Next time for cost savings I might only try three types of peppers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELZWOULDFALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/712609/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-13T17:24:20.607Z",
                "reviewBody": "I've given this recipe four stars, but I don't feel very fair rating it since I varied so far from the recipe.  (The site forces you to \"rate\" if you \"review.\")  Instead of the sauce described, I sauteed a chopped onion, green pepper, and red pepper and then simmered them with a jar of store-bought tomato and basil spaghetti sauce for about half an hour.  I also used low-fat cottage cheese instead of ricotta, which both made the lasagna healthier and gave it a firmer texture.  I've also learned, by trial and error, that the key to successful lasagna is letting it set for 15 or 20 minutes after taking it out of the oven; otherwise it's just a gooey mess.  The idea of a pepper-based sauce was excellent--it gave the lasagna the texture it needed without making it too vegetable laden--both the meat-eaters and the vegetarians at my party really enjoyed it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "youattal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1595134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-04T21:08:25.75Z",
                "reviewBody": "The name drew me to this recipe. And since hubby loves the ingredients we gave it a go. This is a great base recipe for something that can be spectacular. This was very bland. Personally I think it needs garlic basil parsley and more of the stated spices. Perhaps even a red onion. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            }
        ]
    }
]