[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/31818/summer-nights-eggplants/",
        "name": "Summer Nights Eggplants",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2366.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2001-03-11T10:48:18.000Z",
        "description": "I named this recipe after the beautiful summer nights I spent with my family on the balcony eating this tasty recipe, because at this season in Greece we have plenty of eggplants and cook them in various ways.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 large eggplants",
            "½ cup olive oil for frying",
            "2 medium onions, chopped",
            "2 cloves garlic, minced",
            "2 small tomatoes, chopped",
            "1 green bell pepper, seeded and chopped",
            "1 tablespoon chopped fresh parsley",
            "salt and pepper to taste",
            "4 cups dry bread crumbs",
            "1 cup crumbled feta cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove the leaves from the eggplants, and slice in half lengthwise. Carefully scoop out the centers of the eggplants, leaving a half-inch shell so they resemble 'canoes'. Cut the center portion into small pieces, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium heat. Add the onions and garlic, and saute for a few minutes, until tender. Add the eggplant pieces, and cook until soft, about 5 minutes. Then, stir in the tomato, green pepper, and parsley. Simmer for about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from the heat, and transfer to a large bowl. Stir in the bread crumbs until evenly blended. Divide the mixture evenly between the four eggplant shells. Sprinkle feta cheese over the top. Place the eggplant halves on a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 to 20 minutes in the preheated oven, until the tops are browned and the cheese is melted. Serve hot or cold. I prefer them chilled.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "LIOTAKI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9523809523809526,
            "ratingCount": 105,
            "itemReviewed": "Summer Nights Eggplants",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "645.2 calories",
            "carbohydrateContent": "101.3 g",
            "cholesterolContent": "33.4 mg",
            "fatContent": "17.1 g",
            "fiberContent": "12.3 g",
            "proteinContent": "23.4 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "1221.7 mg",
            "sugarContent": "19.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-20T18:24:31.06Z",
                "reviewBody": "This recipe was great! Very tasty. I decreased the amount of bread crumbs to 3 cups and added about ½ lb of ground meat. I browned the meat while sautéing the onion and garlic then followed the recipe as is. I also had to add a little extra olive oil when mixing with the bread crumbs. Everything turned out wonderfully. I am sure it would be just as great without the meat but my husband is a meat eater and I had to put it in somewhere. Thanks for the awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HBURKE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1248830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-15T20:30:44.907Z",
                "reviewBody": "Made a few changes: Cut waaaay back on oil-only used about 2T; diced baby eggplants; more garlic-6 cloves!; 1/2 teaspoon italian seasoning; sauteed in skillet w/1/2c water until tender; added 3c cooked couscous (no breadcrumbs) after tender; stirred in 1/2 c feta; poured it all in a greased casserole dish and topped w/ 1/2c feta and 1/4c dried breadcrumbs-----yummmmmmmy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana Pierpont Sands",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-20T01:30:55.89Z",
                "reviewBody": "After a horrible eggplant parmesan I went on the quest for finding a new tasty eggplant recipe -- and this was it! I adjusted the recipe however. I used 1/4 onion 2 cloves garlic and 1 celery stick. I also added Parmesan cheese to the stuffing mixture. I stuffed the eggplants and drizzled some olive oil over the raw eggplant. I baked it for 20min uncovered and it was perfect! Topped off with some grated marble cheese. Mmmmmm tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "XXXNAUGHTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1386717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-10T19:33:00.23Z",
                "reviewBody": "I would actually give this 3 1/2 stars if I could. It was pretty good I did a lot of tweaking though. I cut out most of the breadcrumbs just sprinkled some on top. I used cous cous in the stuffing. I baked covered for 30 minutes removed foil - cooked an additional 5 minutes (to brown the breadcrumbs) and then topped with cheese and broiled for a few more minutes. The shells were definitely soft and edible this way. When simmering the stuffing I added lemon juice and some chicken broth to make it more moist and flavorful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/916051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-05T04:43:50.14Z",
                "reviewBody": "I was somewhat skeptical of this recipe after reading some of the reviews but it turned out to be DELICIOUS!! here are the few minor changes i made: 1) precook the eggplant in the microwave so it doesn't soak up so much oil (which i also reduced to 1 1/2 tbsp) 2) i didn't have any bread crumbs so i omitted those completely and found it to be moist and delicious just the same! 3) i added italian seasonings and red pepper flakes for some zing 4) as per other recommendations i mixed feta up with everything else and then topped the whole thing off with mozzarella and feta both. one of the best veg-friendly dishes i've found in a while!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Runs With Scissors",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1575130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-24T20:18:10.23Z",
                "reviewBody": "I loved this recipe but made some alterations: I microwaved the cubed eggplant onions and green pepper because too much olive oil is absorbed to saute this. Instead I finished the veggies off by sauteing them with the olive oil garlic to brown them a bit. I added the tomatoes and I added a little ground lamb because I had some left over. I added only 1/2 the breadcrumbs to the veggie mixture. I followed the rest of the recipe as written but I lightly shook a bit of ground cinnamon over the feta before I melted it. Very Greek; very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DIXIEBELLE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1282153/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-01T18:06:37.49Z",
                "reviewBody": "My husband and I both love this recipe just as is! It is hearty and filling and almost tastes as if it were stuffed with crab. This also freezes decently well making for good leftovers. Thanks for a terrific recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2032914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-27T22:58:02.077Z",
                "reviewBody": "Even without one of the main ingredients (I had to substitute grated pepper jack cheese for the feta) this was very tasty. I needed to add olive oil to the skillet a couple of times because the eggplant absorbs the oil as it cooks. I also cut back on the amount of breadcrumbs--4 cups seemed like a lot. Even so there was still a bit more stuffing than I could fit in the shells.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz Pettit Berman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1303005/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-22T04:54:17.513Z",
                "reviewBody": "As-written I can only see this as a 3 star recipe but with some simple changes based partially on common sense personal preference and slightly on what I had handy this versatile recipe is a keeper! What I did: I halved the recipe using one eggplant. Instead of bread crumbs I used about a cup (cooked) of whole wheat cous cous (I accidentally made way too much cous cous but I'll talk more about that in a sec...). I used WAY less oil than called for maybe 4 tablespoons at most. I only had some shredded cheddar and some shredded parmesan cheese so I mixed the cheddar into the filling and used the parmesan on top the last 5 minutes of cooking. I pre-roasted my eggplant halves (sprayed with olive oil spray) for about 15 minutes while sauteing the filler veggies then filled th eggplants and baked it all for another 15 minutes adding parm cheese in the last 5. Everything was perfectly moist flavorful and the skins were toothsome but tender enough to cut and eat. Now what to do with all this extra cous cous I prepared? Luckily there was about a cup and a half of veggie filling that just wouldn't fit into the shells (and I stacked and packed those suckers high!) so I mixed it all together along with the leftovers of a balsamic vinegar swiss chard that I made as a side but found the taste too strong. Voila! Instant lunch for the next day! My husband and I each got 2 meals from this and the leftover filling!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Margar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3863245/"
                }
            }
        ]
    }
]