[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16425/meat-and-poultry/chicken/chicken-breasts/healthy/",
                    "name": "Healthy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24797/mediterranean-chicken-with-eggplant/",
        "name": "Mediterranean Chicken with Eggplant",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2294204.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-04T03:28:10.000Z",
        "description": "I've learned to make this dish from my grandmother who still lives on the shore of the Mediterranean.",
        "prepTime": "P0DT0H50M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "4 to 6 servings",
        "recipeIngredient": [
            "3 eggplants, peeled and cut lengthwise into 1/2 inch thick slices",
            "3 tablespoons olive oil",
            "6 skinless, boneless chicken breast halves - diced",
            "1 onion, diced",
            "2 tablespoons tomato paste",
            "½ cup water",
            "2 teaspoons dried oregano",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place eggplant strips in a big pot of lightly salted water and soak for 30 minutes (this will improve the taste; they will leave a brown color in the pot).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove eggplant from pot and brush lightly with olive oil. Saute or grill until lightly browned and place in a 9x13 inch baking dish. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Saute diced chicken and onion in a large skillet over medium heat. Stir in tomato paste and water, cover skillet, reduce heat to low and simmer for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour chicken/tomato mixture over eggplant. Season with oregano, salt and pepper and cover with aluminum foil. Bake in the preheated oven for 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Healthy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "thepamperedchefny"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9673202614379086,
            "ratingCount": 153,
            "itemReviewed": "Mediterranean Chicken with Eggplant",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "335.6 calories",
            "carbohydrateContent": "26.6 g",
            "cholesterolContent": "82.1 mg",
            "fatContent": "10.6 g",
            "fiberContent": "7.4 g",
            "proteinContent": "35.5 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "146.8 mg",
            "sugarContent": "10.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-16T04:05:53.903Z",
                "reviewBody": "Here is how to improve the taste of eggplant.  Slice it up, then sprinkle salt generously on each side.  Set your slices in a bowl or collander.  Leave it for about 20 minutes.  The eggplant will be covered in \"sweat\", because it is sweating out the bitterness.  Rinse off your eggplant, and cook accordingly.  Yes the water that comes off will be sort of brown.  This will make the eggplant taste better and will eliminate the unnecessary step of boiling, which will make the eggplant mushy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KATIECOWAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441693/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-06T22:55:48.513Z",
                "reviewBody": "Holy Smokes!!!  This was so good and so easy I can hardly believe it!!\r\nI did change the way I sweat the eggplants though.  I salt them and place them in a colander for 30 minutes with a heavy bowl on top of the eggplant.  Then I rinsed off all the extra salt.  I think letting them sit in water would make them too mushy.\r\nOther than that...loved this recipe and will make it again.  I served this with rice (for my husband) and he loved it as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATWALK16",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/330004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-25T01:36:11.2Z",
                "reviewBody": "Great dish if you know what you are doing! I am beginner to cooking with eggplant so I took advice from everyone, sweat the eggplant in a colander,marinated the chicken in balsamic,lemon juice and olive oil and I layered it with ricotta. I think I overdid the cayenne and salt. Anyway wasn't bad for my first try,  I topped with an Italian five cheese blend, we eat cheese by the pound at my house so I knew that would go over well. Next time I will get black olives to use in it. I agree use lots of spice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "outerspacey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1151994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-30T09:47:40.123Z",
                "reviewBody": "I love mediterranean food and this was great (but only got 4 stars as I altered it a bit) I used japanese eggplants - as they were on sale, and diced them up and then added to a casserole dish (the japanese ones do not need salting).  I then diced up the chicken the same size. While the chicken and onion were cooking I crumbled 300g feta (12 onces if you are in the US) over the eggplants.  I added the tomato paste, oregeno, red wine (about 1/4 a cup), the water and 1/4 cup of olives to the chicken mix.  This turned out great, a bit liquidy as the eggplants do release a lot of moisture - so next time I will take away 1/4 a cup of water and use the red wine in its place.  Serve with a crispy greek salad with plenty of tomatoes and cucumber.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZABETH101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389471/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T11:42:55.203Z",
                "reviewBody": "I cut this down to 3 servings since I live alone - it divided very well, though it might be just me but I think that amount would only serve 2.  I did change one thing because I have yet to discover tomato paste for sale in Japan.  I ended up using a can of crushed tomatoes, reduced in a saucepan for 1 hour, and omitting the water.  \n\nDespite my being worried about the eggplant sitting in water for 30 minutes, I followed the recipe but it didn't turn out mushy at all - in fact it was quite the perfect texture.\n\nAlso, (regarding an earlier review) I didn't measure out the amount of oil I used, instead just brushing a thin-ish layer on both sides of the eggplant strips - just enough to cover it so it doesn't burn when sauteéd.\n\nSuggestions for next time would be to add grated/minced garlic when adding the tomatoes, and black olive halves over the top just before baking.\n\nOverall, I was very impressed, and this recipe comes highly recommended.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420588/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-10T22:43:59.34Z",
                "reviewBody": "Made this last night for dinner. My husband declared it \"EXCELLENT\". I did cut the chicken into large pieces then marinated in lemon juice zest balsamic vinegar and olive oil and grilled it half cooked before baking.Also took advice of others and layered ricotta under chicken. Delish! Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "doggymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1091133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-26T22:56:10.29Z",
                "reviewBody": "Delicious - I like that it uses so few ingredients! My version had a few modifications. I marinated diced chicken thighs in a splash of lemon juice and balsamic vinegar. Salted the eggplant slices for 30 minutes then sauteed. Added 1 diced roma tomato with chicken/onion. I used half red wine for the water and whisked the tomato paste into that before adding to the pan. After pouring the simmered mixture over the eggplant I deglazed the pan with chicken broth and poured that on top. It is a good dish, next time I would dice the eggplant instead - the slices were too large for our liking. Served with egg noodles but rice might be easier to manage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fujiq/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-06T15:24:27.153Z",
                "reviewBody": "This was delicious.  I served it with pita bread, and we ate the eggplant/chicken over the toasted pita.  I did make changes, which I think made a huge difference.  For each serving made, I added a clove of minced garlic when I cooked the onions and chicken (I only made two servings, so I added two cloves of garlic).  I also dotted the eggplant with small spoonfuls of ricotta cheese in between the eggplant and chicken, which added a nice creamy layer.  YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "killerbroccoli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1102576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-16T05:41:42.777Z",
                "reviewBody": "I was given 2 eggplants lots of green onions a huge amount of grape tomatoes and had chicken breasts thawing in the fridge so I googled the ingredients and it brought me here to this recipe. I did switch it up some I followed the advice on salting and draining the eggplant cooked it the chicken chunks added the grape tomatoes sliced baby bella mushrooms white and green onions added half a bag of frozen green/red/yellow bell pepper strips one can of petite tomatoes and spices. I googled Mediterranean spices and was given a mixture of cinnamon cumin coriander (used dried cilantro) rosemary oregano (Mexican was all I had) salt/pepper and added it all to taste..turned out to be the best dish ever!! Over rice it's fantastic! Definitely going to make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Daena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7102836/"
                }
            }
        ]
    }
]