[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25185/slow-cooker-chicken-stew/",
        "name": "Slow Cooker Chicken Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F29279.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2019-04-04T03:28:19.000Z",
        "description": "A savory autumn stew with apple, red potatoes, onion and seasoning. This is a very easy tasty chicken dish I concocted when I was trying to think of a dish like pot roast yet using chicken rather than beef.  My husband hates mushrooms, so I tried condensed celery soup, and it works great.  This dish is light yet very zesty and full of flavor.  You can substitute using chicken thighs, but it will increase calories and fat.  I think using biscuit gravy mix rather than onion gravy mix would work (the flavor would go well with chicken), adding richness, although I haven't tried it that way yet, but again, it would add more fat and calories to this dish. Serve with a side of rice or over noodles.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H20M",
        "recipeYield": "6 to 8 servings",
        "recipeIngredient": [
            "3 pounds skinless, boneless chicken breast meat - cut into bite-size pieces",
            "½ teaspoon olive oil",
            "3 cloves garlic, crushed",
            "½ cup water",
            "1 (10.75 ounce) can  condensed cream of celery soup",
            "½ teaspoon ground black pepper",
            "½ teaspoon salt",
            "½ teaspoon Italian-style seasoning",
            "1 apple - peeled, cored and cut into eighths",
            "3 small red potatoes, cut into eighths",
            "1 onion, cut into eighths",
            "1 (1.25 ounce) envelope dry onion gravy mix"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium high heat. Saute garlic and chicken until lightly browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken and garlic in slow cooker; add water, soup, pepper, salt, seasoning, apple, potatoes, onion and gravy mix. Mix all together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set heat on Low setting and simmer slowly for 6 to 8 hours.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUSAN KIM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.126436781609195,
            "ratingCount": 87,
            "itemReviewed": "Slow Cooker Chicken Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "378.3 calories",
            "carbohydrateContent": "28.6 g",
            "cholesterolContent": "122.9 mg",
            "fatContent": "7.6 g",
            "fiberContent": "3 g",
            "proteinContent": "47.2 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "923.8 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-26T02:43:34.25Z",
                "reviewBody": "Oh my!!!!! This was a hit!! I modified it slightly.....added fresh sliced portabello mushrooms, half a bag of frozen broccoli, a half bag of baby carrots (sliced into about 4 or 5 pieces), one sweet potato (bite-sized pieces), added 2 extra apples, 3 extra garlic cloves, and used yukon gold potatoes (bite-sized pieces). I par-boiled the yukon gold potaoes with the sweet potatoes for about 15 minutes before adding them to the slow cooker. I also added about one cup of water and stirred it occasionally for the first few hours. We cooked it for about 10 hours. \nI was looking for something to make for my 82 year old Dad who's wife has been in the hospital for the past month. He's not used to cooking on his own.....or doing anything on his own, for that matter!! I put this stew in little microwave-safe containers and put it in his freezer for him to take out the night before and put in his fridge to thaw to eat the next day. Well.....he said it's the best stew that he's ever had in his whole entire life....and even though he has other food to eat, he's been taking a bowl of this stew out of his freezer every night after supper for supper the next night.... for the past week!! I asked him if he was getting tired of it yet....and reminded him that he has other food to heat up.....but he said that he looks forward to supper every night since he's had the chicken stew in his freezer. I have to admit...it's the best that I've ever had too  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandican",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1788401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T19:03:24.713Z",
                "reviewBody": "Absolutely wonderful after tweeking it a bit! I added carrots and celery and doubled the spices thanks to the reviews here. I sauteed the chicken with the garlic onions and celery and it added a wonderful flavor. My husband was disappointed that I didn't make more. I'll double it next time so he has some to take with him for lunch! Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KDETS89",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1371521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-02T02:28:57.467Z",
                "reviewBody": "We have changed the cook time on this recipe from \"2 hours\" to \"6 to 8 hours.\" - The Staff",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the allrecipes staff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-03T16:16:15.89Z",
                "reviewBody": "I have the pickest husband ever so I changed the soup to cream of chicken. I also tried it with the country gravy instead of onion gravy. We really liked it. My potatoes were not done in time allowed. Next time i will put my crock pot on high. I also added peas and corn. Very good. We mixed in rice and my husband raved about it. needed extra water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "andee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1647172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T20:01:49.39Z",
                "reviewBody": "Very bland needs something I'm not sure what. Potatoes took longer to cook then the rest of the stew. I suggest using less water the broth was too watery.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "KATIE THIEMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/432504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-07T20:32:21.513Z",
                "reviewBody": "This wasn't too bad. I made a few tweaks based on other reviews and past experiences. I definitely have more ideas for the next time. I used chicken breasts with the bone and skin sauteed in a couple of Tbsp. olive oil and garlic with garlic salt and pepper added 1/2 cubed sweet potato celery and baby carrots. I used Lipton golden onion soup mix added another 1/2 c water (total 1c water) and a can of chicken broth. You have to make sure your meat is covered in sauce if you cook it for 12 hrs on low (I commute). I didn't have italian seasoning so I used parsley and a dash of chili powder. The meat fell off the bone and was not too dry. I couldn't taste the apple so next time I will use 2 and probably use granny smith instead of red. I couldn't even taste the cream of celery either so I might not use it next time. I found that it didn't have as much flavor as I usually expect from pot roast or stew. A little more salt helped though. It was probably too diluted with the extra water. Next time I will add more salt/seasoning maybe even some chicken boullion. All in all a good base recipe to build on...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CYUMICKEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1005119/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-26T13:12:22.153Z",
                "reviewBody": "I tried this recipe last night and it was yummy - made the whole house smell good too. I did make some variations to the original recipe though; I added a jar of the premade chicken gravy as well as an envelope of dry onion dip mix because I couldn't find the onion gravy mix at my grocery store. I added carrots and celery to the crockpot and then added a bag of mixed veggies about an hour before serving. Next time I will probably add another apple too. I didn't eat it with rice or noodles because I'm trying to keep my carbs down but it was a very good veggie filled stew.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1533605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-29T22:14:40.717Z",
                "reviewBody": "Lovely recipe simple and no hassle. My bf and I are big mushroom fans so I substituted cream of mushroom soup and also added sliced mushrooms. With crusty French bread made a wonderful meal for a cold evening and will definitely make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChanaLeah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1558551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-27T22:37:57.763Z",
                "reviewBody": "i personally thought this smelled wonderful and i did take a very small taste of the broth as it cooked and thought it was awesome. my son ate up the chicken and my husband said it was good but never wanted seconds or leftovers hence the 4 stars. i used chicken gravy and more of it and cream of chicken soup instead of celery. i also added carrots and celery and an extra potato. my hubby did say he thought it needed more salt...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lockesmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719054/"
                }
            }
        ]
    }
]