[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25210/italian-bread-bowls/",
        "name": "Italian Bread Bowls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5795341.jpg",
            "width": 3519,
            "height": 2780
        },
        "datePublished": "2019-04-04T03:28:20.000Z",
        "description": "These cute little bread bowls are a great way to serve soup in the wintertime. I usually serve a hearty potato soup when I have the time to bake them. They freeze for up to 1 month, if desired.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "8 bowls",
        "recipeIngredient": [
            "2 (.25 ounce) packages active dry yeast",
            "2 ½ cups warm water (110 degrees F/45 degrees C)",
            "2 teaspoons salt",
            "2 tablespoons vegetable oil",
            "7 cups all-purpose flour",
            "1 tablespoon cornmeal",
            "1 egg white",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add salt, oil and 4 cups flour to the yeast mixture; beat well. Stir in the remaining flour, 1/2 cup at a time, beating well with an electric mixer at medium speed after each addition.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 6 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch dough down, and divide into 8 equal portions. Shape each portion into a 4 inch round loaf. Place loaves on lightly greased baking sheets sprinkled with cornmeal. Cover and let rise in a warm place, free from drafts, until doubled in bulk, about 35 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). In a small bowl, beat together egg white and 1 tablespoon water; lightly brush the loaves with half of this egg wash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes. Brush with remaining egg mixture, and bake 10 to 15 more minutes or until golden. Cool on wire racks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make bowls: Cut a 1/2 inch thick slice from top of each loaf; scoop out centers, leaving 3/4-inch-thick shells. Fill bread bowls with hot soup and serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kerri Skrudland"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.480190174326466,
            "ratingCount": 631,
            "itemReviewed": "Italian Bread Bowls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "439.4 calories",
            "carbohydrateContent": "85 g",
            "cholesterolContent": null,
            "fatContent": "4.6 g",
            "fiberContent": "3.4 g",
            "proteinContent": "12.5 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "593.7 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-24T21:00:50.313Z",
                "reviewBody": "The only reason why I am knocking off a star is that I think you should make the recipe int0 SIX bread bowls, not 8... the size you get making six seems perfect. I also did olive oil instead of veg., and I added 1 tbsp. of sugar. I used entirely bread flour, not all purpose. I took the advice of another reviewer and let it rise with a steaming pot in the oven-- worked great! We ate this with \"Super Sloppy Joes\" (search for it) in the middle with cheddar cheese on top. Deliciously filling. One thing to remember though-- making six bowls means they need a little extra time in the oven, maybe 5 minutes or they are a tad doughy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1147886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-17T00:03:40.763Z",
                "reviewBody": "These were very good but a bit time consuming.  They baked up nice and crispy on the outside, just a tad doughy on the inside still.  Next time, I will bake 2 or 3 mins. longer.  I used bread flour instead of all-purpose, perhaps that had something to do with it.  I cut back on the salt to 1-1/2 tsp., next time I will add the whole amount.  As per others' recommendations, I used olive oil and added a Tbsp. of sugar.  I made 6 bowls, which were a good size, but very filling.  (A secret I learned from Alton Brown from the Food Channel - place the dough in an oiled bowl or tall container.  Cover with a cloth.  Boil water and pour into a bowl.  Place both in the oven.  The steam creates the perfect temperature for rising the dough.   Works great every time!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BABSKITCHEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/584321/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T14:39:12.327Z",
                "reviewBody": "For those who find these TOO simple in taste, add 2 tblsp Garlic Powder to the recipe and when putting egg wash on, sprinkle garlic and oregano over both times. This helps the flavor of the bread tremedously!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janille",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-27T17:37:12.873Z",
                "reviewBody": "I only made four bowls cuz we wanted hearty servings of stew -- they turned out perfect, & I don't understand the reviewers who wrote about moulding the bowls around other bowls to form an actual hollow bowl.  Bread bowls are just big ole round loaves of bread that you scoop out to make a bowl you can eat & dip with as you eat the stew or soup in it.  Anyway, to each his own, but I wanted to say that bit in case anyone thinks they can't just accomplish a good ole bread bowl by plopping four round blobs of dough in the oven.  Worked great for us, & my husband raved more over this meal than he has over most any other one!  I made the Beef Stew VI from this site to eat in the bowls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEW44BEAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667068/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T13:29:27.763Z",
                "reviewBody": "Had difficulty with actually getting good bowl shapes as recommended. Came up with a solution that worked great for me. Follow recipe as given but use an inverted oven safe cereal bowl as a form spray with Pam and simply take an appropriate size cut of dough and wrap it around the bowl. Be sure its not overly thick unless you really like thick bread. Bake for 12-15 min.and you have a perfect bowl every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEANE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/984625/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-09T19:41:01.543Z",
                "reviewBody": "I've been using this recipe for quite some time and it is fantastic!  I usually make 6 bowls and I've never had them flatten out.  I think the cornmeal helps to keep them from spreading.  Adding a little sugar to feed the yeast also helps, and I always store my yeast in the freezer so it stays fresh longer (it also improves the proofing).  Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JBOTT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1013483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-10T22:29:29.89Z",
                "reviewBody": "These bread bowls worked out great for our broccoli and cheese soup. I had them rise and bake in small oven safe stoneware bowls which worked out perfectly for individual servings. For those of you who are having problems with your bread rising you may want to try a few things first.  #1 Make sure you have a good active yeast, not an old one. (Note; 2 1/4 tsp of yeast = 1 yeast packet.)  #2 You may want to add a tsp or Tbs (depending on preference)of sugar to the yeast/water mix to help activate the yeast faster. You shouldn't notice much of a taste difference with only a tsp.  #3 If your dough is remaining flat, try the stoneware,oven safe bowl or foil method. It helps shape the loaf up for more filling space, rather than out.  #4 If you are personally finding the bread on the bland side, try adding some of your favorite herbs and spices to the flour mixture. Try 1 Tbs of Italian seasoning for a more robust bread. Maybe add some grated cheese to the dough. If you are having a clam chowder, try adding a Tbs of dill to perk up the flavor. Sprinkle a bit of garlic salt or powder on the tops of the loaves after the egg wash for a bit of a zing. The wonderful thing about bread dough is it can be so versitile to suit your own personal tastes. Jump in and experiment. Just remember, a little bit goes a long way when it comes to herbs and spices.  I just wanted to state that I am not adding these tips to take away from the original recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOLARA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/782961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-13T23:03:57.233Z",
                "reviewBody": "This recipe rocks!  It was awesome with a thick split pea soup- really makes soup special- not a lot of work for the raves, but does require advanced planning.  A TIP:  For the second raise period, split up into individual bowls on a baking tray lined with non-stick baking paper.  DO NOT reknead the bowls- avoid handling them directly before baking so they will stay raised.  Delish! Thanks Kerri!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLONEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/695555/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T23:19:13.75Z",
                "reviewBody": "Excellent bread bowls!!! I made half the recipe for me & hubby.  I added a bit of sugar to proof the yeast.  Maybe it is so dry here (-40 outside!) that I only needed 2.25 cups flour instead of 3.5 cups to make a nice dough in the kitchenaid.  After reading the reviews on about the \"flatness\" of the bowls, I shaped them into 4 round rolls instead.  They rose perfectly and flattened out a little bit.  I skipped the first egg wash and they came out gorgeous!  Beautiful golden, shiny on the outside and soft and moist on the inside.  Served them with chicken stew/chicken pot pie filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MichelleM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-16T19:54:26.497Z",
                "reviewBody": "To be fair the 2 star rating is probably more a reflection of my ability than the recipe itself. It's my first time making bread really. My \"bread bowls\" turned out to be hard very dense...rolls. They didn't rise one bit and I followed the directions as written (except for letting them sit for much longer hoping they would start to rise). I baked until the outside was golden brown but the inside didn't seem fully cooked--and very tough and doughy. I'm pretty sure my error came in with the mixing and/or kneading of the dough because it was very dense from the beginning as I was adding the flour by 1/2 cup to the bowl. Maybe I added too much flour and/or overmixed. And I just read another review that said I shouldn't use a hand mixer? News to me I thought that's what the recipe was talking about. I used mine along with the dough hooks that came with it. So I\"ll try this again...someday...once I get my morale back.:) This was a little time consuming.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "nyladenise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4108611/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Italian Bread Bowls",
            "description": "See how to make homemade bread bowls for soup.",
            "uploadDate": "2012-12-03T16:02:45.665Z",
            "duration": "PT5M16.191S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F93d54401-1636-405d-814e-b3ec1f1059ee%2F89c35001-6afe-4aa7-9807-969e2ba35687%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2007941636001"
        }
    }
]