[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/722/world-cuisine/european/german/",
                    "name": "German",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25194/german-rouladen/",
        "name": "German Rouladen",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F357630.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:28:20.000Z",
        "description": "Meat rolls filled with bacon, onions and pickles.  Delicious, easy recipe learned while visiting Germany.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 ½ pounds flank steak",
            "German stone ground mustard, to taste",
            "½ pound thick sliced bacon",
            "2 large onions, sliced",
            "1 (16 ounce) jar dill pickle slices",
            "2 tablespoons butter",
            "2 ½ cups water",
            "1 cube beef bouillon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the flank steak into thin filets; about 1/4 inch thick and 3 inches wide.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Generously spread one side of each filet with mustard to taste. Place bacon, onions and pickle slices on each filet and form into a roll. Use string or toothpicks to hold the roll together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a skillet over medium heat and melt butter. Place the rolls in the butter and saute until browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in 2 1/2 cups of water and add the bouillon cube; stirring to dissolve the bouillon cube. Simmer the rolls for about an hour.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "German"
        ],
        "recipeCuisine": [
            "European",
            "German"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Ron Oldham"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.581871345029239,
            "ratingCount": 342,
            "itemReviewed": "German Rouladen",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "264.3 calories",
            "carbohydrateContent": "7.7 g",
            "cholesterolContent": "59.4 mg",
            "fatContent": "17.4 g",
            "fiberContent": "1.8 g",
            "proteinContent": "19.1 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "1449.5 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-02-08T21:16:53.687Z",
                "reviewBody": "I am a military wife who currently lives in Germany.  This recipe is close but doesn't taste as good as the ones made in Germany.  I was lucky that I was able to go to a German butcher and purchase the meat that they cut just for Rouladen.  It is very, thin meat about 6 inches long.  Ideally, your meat should be long enough to roll at least 3 times.   You probably won't be able to buy the thick pork bacon that is used in Germany so use thin sliced bacon.  It will taste better than regular thick sliced bacon.  Also, to assist with the flavor put in 1 envelope of Lipton Beefy Onion soup mix.    You can then thicken the gravy after the rolls are done to serve over them. Overall, this a very close copy of what we eat in Germany.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ProudMilitaryWife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1139240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-15T22:19:06.17Z",
                "reviewBody": "We are from the Saar area of Germany so the recipe is the same.\nThe difference is the manner of cooking we bake them in a roasting pan with a bit of water to get those dark drippings on the bottom ( the almost burnt part).\n\nRemove the rolls set roasting pan on stove add your water and get a really high heat to boil.\nIn a seperate container using a blender take cold water and some flour & blend it as you boil and lift the dark drippings add the flour mix.\n\nYou get a nice dark gravy from this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLIEBRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1333070/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T14:04:56.227Z",
                "reviewBody": "I grew up this this recipe. My mother gave it to me back when I got married 20+ years ago and it is loved by my wife and kids. My wife likes the pickles in, but my sons and I don't. I usually have to make 8-10 large ones to feed the family.\r\nMake sure the mustard has horse radish in it. Yum!\r\n\r\nTo make it a little easier, I use \"sandwich steaks\". They're cut thin to begin with and I additionally pound (tenderize) them further sandwiched between plastic wrap or wax paper. The process is the basically the same from there.\r\n\r\nI brown them and place them in a pot with 2-3 cans of beef broth. I also add a bay leaf or two. Two smahed cloves of garlic. (Taken out later) Also a tablespoon of the mustard and a couple of peppercorns are added to the broth. I usually will also add a little worchestershire sauce. I use a medium colored roue (spelling?) to thicken the gravy after I take the rolls out of the pot.Don't forget to remove the bay leaf, garlic, and peppercorns. Let them cook for a good long time until they barely hold together. \r\n\r\nWe serve them with plain boiled russets and top it with the gravy.\r\n\r\n \r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DRBONES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/581691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-24T15:53:55.063Z",
                "reviewBody": "I have made rouladen for years, based on my mom's recipe (who is German - came to US when she was 22).  Couple of hints - vary the mustard type, bacon and pickles for different taste sensations.  And for those who are leery of the pickles, dice them up - still get the great flavor but you don't realize it's in there!  And always make gravy with the liquid - it's the best.  I dice up all the \"stuffers\" - onions, bacon and pickles - and if I have any leftovers after filling the rolls, I throw them in the liquid - makes the gravy even better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2296562/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-30T19:41:41.847Z",
                "reviewBody": "Thank you for this recipe, it turned out delicious. I made a few changes...try it with some horseradish as well as the stoneground mustard. I also browned them on the stove top and then finished them off in the crockpot. Add just a tiny bit of beef bouillion water & a splash of red wine to the slowcooker (also fresh ground pepper & a couple bay leaves) and let them cook on high heat for 3-4 hours. This made let so tender you could cut them with a fork. Quickly whisk the juice from the slowcooker with a little cornstarch/water paste to make a flavourful gravy. Guten Appetit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRUNOSBETH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1901341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-02T00:37:00.967Z",
                "reviewBody": "While I am Italian and grew up with predominantly Italian cooking this is my family's favorite dish probably because when I make it it's considered a special occasion! It is to-die-for good. Like Dr. Bones I use either sandwich steaks or very thinly sliced round steak. I have made it both with and without the pickle and mustard and while I know that to use them is traditional our family prefers them with just the bacon and onion. I simmer them a good hour and a half in beef broth once they're browned adding more broth or water as it reduces. Once they're good and tender I thicken the gravy with flour and more broth. I prefer to serve these little \"roll mops\" with hot buttered noodles but my family insists on mashed potatoes. Thanks for posting the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-18T20:28:38Z",
                "reviewBody": "This recipe is very close to one I'm familiar with, as I cook for a German Family summer camp every year.  This year, we made Rouladen twice in one week, each time making over 250 for our lunch menu!  However,I would add this:  we use regular mustard, garlic salt, NO horseradish, and dice the bacon, onion and pickles up VERY small. We do not use any boullion, but add carrots and celery to the water over the rolls while cooking.  After sauteing and placing them into a shallow baking pan,we cover the pan w/saran wrap and then aluminum foil, put in a 300 degree oven for several hours until tender. We strain the carrots, celery and broth into a tall stockpot, literally \"smashing\" the vegetables through the strainer and  discarding the fiber, then thickening w/corn starch. We serve the traditional Spaetzle, or tiny dumplings alongside. By all means, ask your butcher to cut top round 1/5\" thick for you. In rolling the rouladen, think \"burrito\".  It will keep all the good stuff inside! Good eating!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaynumberone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1493840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-04T18:58:49.9Z",
                "reviewBody": "Unless I missed reading something this recipe is missing a very important component, the gravy. While the meat is simmering, add a bay leaf to the broth. At the end of cooking time discard the bay leaf. Prepare gravy by using brown gravy mix or flour. I grew up in Germany. My Dad made the best rouladen! Good gravy is absolutely essential to this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Californiahiker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2614340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:56:52.287Z",
                "reviewBody": "Rouladen recipes can be different depending on the area of Germany you're from. The part of Germany my parents grew up uses cube steak in lieu of flank and no pickles. We also use beef broth instead of water and add chopped fresh garlic with the onion. Remember to thicken your gravy if necessary. It's always nice trying different variations to recipes. It was good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            }
        ]
    }
]