[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/730/world-cuisine/latin-american/south-american/",
                    "name": "South American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1277/world-cuisine/latin-american/south-american/chilean/",
                    "name": "Chilean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25554/torta-de-hojas/",
        "name": "Torta De Hojas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1130780.jpg",
            "width": 1813,
            "height": 1378
        },
        "datePublished": "2019-04-04T03:28:27.000Z",
        "description": "I loved this recipe 27 years ago when I was in Chile. I haven't made it in years, but I do remember my family really enjoyed it.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT3H30M",
        "totalTime": "P0DT4H30M",
        "recipeYield": "1 9-inch layer cake",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "2 teaspoons baking powder",
            "⅞ cup butter",
            "3 egg yolks",
            "1 cup milk",
            "2 (14 ounce) cans sweetened condensed milk",
            "1 cup chopped walnuts",
            "¼ cup brandy",
            "¼ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Mix together the flour and baking powder; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat the butter until creamy. Blend in the egg yolks, one at a time. Beat in the flour mixture alternately with the milk. The dough will be stiff like a cookie dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough into 10 pieces and shape into balls. Roll each ball into a 9-inch circle. Place on cookie sheets and prick with a fork in several places.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cookies in batches in the preheated oven for 10 to 12 minutes, or until edges are just starting to brown. Let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan, boil the unopened cans of sweetened condensed milk for 3 hours. Monitor the water closely to make sure there is always water covering the cans. Remove cans from heat and let cool for 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small measuring cup, combine the brandy and water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place one cookie layer on serving plate. Brush with brandy mixture, then spread with the now-thickened condensed milk. Sprinkle with nuts. Continue stacking until all layers are used.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "South American",
            "Chilean"
        ],
        "recipeCuisine": [
            "Latin American",
            "South American",
            "Chilean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ILIKECAKES"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.833333333333333,
            "ratingCount": 18,
            "itemReviewed": "Torta De Hojas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "582 calories",
            "carbohydrateContent": "69.9 g",
            "cholesterolContent": "110.6 mg",
            "fatContent": "27.4 g",
            "fiberContent": "1.8 g",
            "proteinContent": "12.4 g",
            "saturatedFatContent": "13.4 g",
            "servingSize": null,
            "sodiumContent": "249.8 mg",
            "sugarContent": "36.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-02T11:34:53.823Z",
                "reviewBody": "Hi everyone! so i live in chile where this is a very popular cake. But it is a very intense cake a little piece will go a loooooooong way thats why several bakerys here have started to include pastry cream in it. so along with the \"manjar\" that is the thickend condensed milk you put one layer of pastry cream and one layer of manjar. To make the manjar more spreadable you need to do this: whip up 3/4 cup of whipping cream and fold in to the manjar. this makes a less intense cake. if you want the intense cake use the manjar mixture without the pastry cream layers. if you use the pastry cream it will still be very intense! You can also make 3 different layeres: whipping cream pastry cream and manjar. this will make it a lighter cake BUT STILL INTENSE! to decorate spread a thin layer of manjar over and around the cake and sprinkle generously with walnuts. it can also be shredded coconut. you can be creative with this. people here even make it with manjar raspberry jam and pastry cream!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katie_luvs2bake!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/katie_luvs2bake/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-13T00:23:13.993Z",
                "reviewBody": "This recipe is an amazing authentic Chilean cake also known as Torta de Mil Hojas or Thousand Layers Cake. I made this for my Chilean husband s birthday and he was very impressed with the results. I rolled each layer out as thin as possible then I cut out the layers by using a 9 round cake pan as a template so all my layers were uniform. Make sure you only cook the layers until they are just lightly brown if you wait too long they will dry out too much and taste burnt. My oven isn t large at all so I could only cook 2 layers at a time. It took a loooonnng time to make everything and put it all together; the est cook time of 1 hour is way off. If I included the cooking time for the sweetened condensed milk the whole cake took me about 5 hours to put together but it was totally worth it. Also the longer the cake sits the more the caramel penetrates the layers so the better it tastes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chileanwife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2849974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T16:12:18.43Z",
                "reviewBody": "This dessert came out fabulous! I had eaten it years ago at a Chilean friends house and mine came out just as good. I added a bit more butter to the pastry just so that it was more flaky and would reduce the chance of it drying out. Mine baked for about 15 mins and the layers were perfect. A trick to cut down the 'dulce de leche' prep time. Put the can of condensed milk completely submerged in a pressure cooker and cook under full pressure for 20 mins. I have done it many times and it come out perfect and in a fraction of the time. It's nice to assemble it and leave in the refrigerator the day before or early in the day before serving as the layers get a bit moist and kind of mesh into each other nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JNW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-19T02:38:28.2Z",
                "reviewBody": "I have been looking for this receipe for 15 to 16 years... after having mislayed mine. My son married a young girl from Chile and I made it for their \"wedding cake.\" It was such a success & the first of many dulces to be eaten til it was gone... the guests even asked for MORE! I can easily give it a 5 star rating all the way down the line. Such a treat!!! joan green/orem utah",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOANPHYLLIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/454033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T20:03:02.797Z",
                "reviewBody": "We adapted this recipe to cap off a Chilean wine tasting party and it was a huge hit. We found that the comments of reviewers on this page were very helpful; e.g. the prep/cooking times are longer than the recipe suggests but the cake is still well worth the effort for a special occasion. It is best to make and assemble the cake the evening before; this allows the cake to settle and solidify (important when it comes to cutting the cake) and for the flavors (brandy \"manjar\" (dulce de leche) sweet cream (which we added) walnuts (not chopped but ground up in a food processor; gave a finer texture)) to infuse into the pastry. Also we felt it helped to paint the baked pastry layers with undiluted brandy. Just before serving we topped the cake with whipped cream fresh raspberries and ground walnuts (see photo by recipe title).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Urocyon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4308211/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-07T17:34:42.277Z",
                "reviewBody": "This was a fantastic dessert! I made the recipe as instructed and it looked like an artisan masterpiece. I got rave reviews on it as well. It is very time consuming I think I may add the whipped topping for the final layer next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shalonda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3038954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T16:42:14.277Z",
                "reviewBody": "This cake was very delicious for my family. I have heard much about \"Torta de mil hojas\" but I ve never tried it before. I decided to try this recipe. I had only one can sweetened condensed milk and I used Katie s suggestions about pastry cream. And to our family taste the cake wasn t so rich and intense. But to my personal taste the dough was too dry. I baked it until lighly brown (some of the layers weren t lighly brown at all) approximately 10 minutes. Probably I don t like such kind of dough. If your layers aren t lightly brown but you feel they are set don t bake any more. I also think it is not necessary to use water when you sprinkle the layers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DiamondGirl amanecer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2761942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-12T16:35:17.653Z",
                "reviewBody": "This recipe is awesome! I used a large plate to cut out the circles so they were all an equal size. I'm making this cake again today to sell at a Chilean fundraiser!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "erinmac",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1600270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T21:25:43.643Z",
                "reviewBody": "We made this for a pot-luck welcoming our friends back home from their vacation of hiking in Chile & Argentine - it was a hit thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "54main",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5684256/"
                }
            }
        ]
    }
]