[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25690/andreas-pasta-fagioli/",
        "name": "Andrea's Pasta Fagioli",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3208554.jpg",
            "width": 2231,
            "height": 2231
        },
        "datePublished": "2019-04-04T03:28:34.000Z",
        "description": "This is a recipe I have adapted a bit from my grandmother's.  It's easy and perfect for a Sunday afternoon with fresh Italian bread.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 tablespoons olive oil",
            "1 onion, quartered then halved",
            "2 cloves garlic, minced",
            "1 (29 ounce) can tomato sauce",
            "5 ½ cups water",
            "1 tablespoon dried parsley",
            "1 ½ teaspoons dried basil",
            "1 ½ teaspoons dried oregano",
            "1 teaspoon salt",
            "1 (15 ounce) can cannellini beans",
            "1 (15 ounce) can navy beans",
            "⅓ cup grated Parmesan cheese",
            "1 pound ditalini pasta"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large pot over medium heat, cook onion in olive oil until translucent.  Stir in garlic and cook until tender.  Reduce heat, and stir in tomato sauce, water, parsley, basil, oregano, salt, cannelini beans, navy beans and Parmesan.  Simmer 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.  Stir into soup.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AVALERIO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4581772784019975,
            "ratingCount": 801,
            "itemReviewed": "Andrea's Pasta Fagioli",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "402.8 calories",
            "carbohydrateContent": "68 g",
            "cholesterolContent": "2.9 mg",
            "fatContent": "7.6 g",
            "fiberContent": "8.4 g",
            "proteinContent": "16.3 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "1222.7 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-01-08T00:48:06.57Z",
                "reviewBody": "Start by saying that I am 100% Italian. This is a recipe for pasta fagioli an Italian soup that means \"pasta with beans\". Pasta Fagioli does not have ground meat,carrots,celery etc. It has pasta, tomato and beans. By the way this recipe as it stands is very good. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "T-Bone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2762186/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-31T04:09:25.403Z",
                "reviewBody": "I will admit I altered the recipe quite a bit, but relative simple changes and this turned out great!  This is definitely a quick fix and don't be fooled into thinking you must have all the ingredients - experiment a little!  \n\nMy recommendations for improvemnent:  Don't use the recommended pasta.  Try using a very small amount of fideo pasta (it plumps and absorbs a lot, so use sparingly to avoid a stew like texture) or you can also try 1/2 - 2/3 cup of mini macaroni (salad macaroni).  The fideo and mini macaroni can be added directly to the soup during the last 20-25 minutes of simmer time.  This elimates the need to cook the pasta separately.  Also, omit the salt.  Substitute chicken (or beef) broth/bouillon cubes instead of the water.  I used 3 cups chicken stock (bouillon) and 2 cups water (which is why I omitted the salt).  I also substituted one 15oz can diced tomatoes and one 15oz can of tomato sauce instead - definitely worth this alteration!  I didn't have navy beans so I used a can of chickpeas instead.  \n\nBe generous with the parmesean cheese - put about a generous 1/2 cup portion instead - this helped with the overall flavor!  \n\nI've made it a few times now and each time it tastes better than the last - especially with the minor adjustments!  Thanks for a great starter recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T19:59:45.797Z",
                "reviewBody": "I was really surprised by how good this is.  I've tried a lot of pasta e fagioli recipes, and none of them have tasted like what I remember eating in Italy as a child--until now.  I didn't experience excessive thickening of the soup, but I did cook it with a lid on.  I do recommend doing this.  It is very thick the next day, but this is expected with bean-based soups, and does fine with a little water added.  Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZEKEBULLSEYE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/734240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T18:53:12.783Z",
                "reviewBody": "Since I’m always willing to try new recipes I tried this one, before reviewing it. While different from mine, this is a good recipe. I’m 67 years old and yes, Italian also (which doesn’t make me an authority)! I have been making my variation of Pasta Fagioli for a long time and I always use celery. For a reviewer to make such a broad statement that celery or carrots are NEVER in Pasta Fagioli, is just wrong. If you like celery or carrots in your Pasta Fagioli, by all means USE THEM! This is a peasant or farmers type meal and they had to use what they had on hand. Yes this is basically a bean and pasta soup without meat, although there are authentic recipes that use Pancetta (Italian bacon), obviously from peasants with more Lira than the average peasant… lol… so if you want meat USE IT! After all, you’re cooking to please yourself and your family. If you check Lidia Matticchio Bastianich’s recipe, (from Lydia’s Italy on PBS) her recipe has potatoes, carrots and ham hocks in it. So you see, as with any recipe, there are probably as many variations as there are cooks, and all recipes are authentic to each individual cook. Experiment and cook to satisfy yourself, that’s what makes cooking fun and exciting! Mangia!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSLYN H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-10T19:27:32.543Z",
                "reviewBody": "This was GREAT!!! I did have to make some adjustments b/c I only had a 40 oz can of cannellini beans so I elimated the navy beans and used the whole can. I also added 2-14oz cans of diced tomatoes and 1-14oz can of sauce. Used chicken broth instead of water. Added a bit of crushed red pepper for some kick some crumbled cooked bacon and served w/ grated asiago cheese. ALSO cook the pasta separately and run cold water on and allow to cool before adding to soup so it doesnt absorb all of the broth!! Great w/ crusty bread and salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOREENBUCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/563422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-19T00:18:14.53Z",
                "reviewBody": "My husband and I thought this was delicious. Based on some of the reviews I decided to reduce the amount of past to 1/2 lb. In the future I would possibly reduce this even further to 1/3 lb. Other than that I think that it is a great recipe. I make it again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNJOR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/317888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-11T16:33:41.983Z",
                "reviewBody": "I have to give this recipe 5 stars because it's definitely the best recipe of it's type that I've tried, from several sources.  I made a few adjustments based on the reviews...I added bite-sized carrots and celery to the onion as it was cooking.  I added a 14.5 oz can of petite diced tomatoes, and used 3 cans of beans: 2 red kidney beans and 1 can of great northern beans (comparable to the other white beans called for in the recipe).  I used less olive oil to cook the onion, and romano rather than parmesean cheese.  I also only used 4 cups of liquid: 2 cups of water and 2 of chicken broth.  I think next time I'll use the full 5 1/2 cups of liquid, as my husband thought the broth was just a bit too tomatoey.  I thought it was great, and I'll definitely make it again.  I served it with the Garden Herb loaf from this site, which is a hearty, chewy bread and a great companion for this soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBERLYMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-27T19:57:20.767Z",
                "reviewBody": "This was delicious. Based on other reviews I added 1/2 package frozen spinach chicen broth rather than water and 1 can tomato sauce & 1 can diced tomatos. Will certainly make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rickie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1727750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-18T19:57:47.31Z",
                "reviewBody": "For all those who didn't think this was \"soup,\" try adding the pasta to each serving individually. That way the \"soup\" doesn't get soaked up.  I cook the pasta, put it separate bowl at the table, or in a ziplock bag and add it as I prepare servings. I do the same with the cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANDMACAROL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/705804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-22T16:39:42.913Z",
                "reviewBody": "this was ok",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "VICKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3096382/"
                }
            }
        ]
    }
]