[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/181/soups-stews-and-chili/soup/noodle-soup/",
                    "name": "Noodle Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26358/awesome-chicken-noodle-soup/",
        "name": "Awesome Chicken Noodle Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4465997.jpg",
            "width": 2290,
            "height": 2290
        },
        "datePublished": "2019-04-04T03:28:49.000Z",
        "description": "Home style chicken noodle soup that really makes a wonderful side or meal, it cures what ails you.  If you like lots of noodles use a whole pound of them.  Serve hot with your favorite salad and bread.  This freezes or doubles well.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 gallon water",
            "1 (4 pound) whole chicken, cut into pieces",
            "1 large onion, peeled and halved",
            "3 bay leaves",
            "10 whole black peppercorns",
            "⅔ bunch celery, leaves reserved",
            "1 pound whole carrots",
            "3 tablespoons chopped lemon grass",
            "¼ cup chicken bouillon powder",
            "1 pound carrots, peeled and sliced",
            "⅓ bunch celery, chopped and leaves reserved",
            "1 (8 ounce) package dry egg noodles"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken and water in a large pot over high heat and bring to a boil.  Reduce heat, cover and simmer, skimming fat as needed, 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the halved onion, bay leaves, peppercorns, whole celery, whole carrots and lemon grass in the pot and simmer, covered 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain broth and reserve chicken.  When chicken is cool enough to handle, remove skin and cut meat into bite-size pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return strained stock to pot over high heat, and stir in chicken base, chopped celery and chopped carrots.  Bring to a boil, then reduce heat, cover and simmer 20 minutes, or until carrots are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Chop celery leaves and stir into pot with the noodles.  Simmer until noodles are cooked, about 10 minutes more.  Stir in chicken and heat through.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Noodle Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ALANK"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.664302600472813,
            "ratingCount": 423,
            "itemReviewed": "Awesome Chicken Noodle Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "302.9 calories",
            "carbohydrateContent": "22.4 g",
            "cholesterolContent": "81.1 mg",
            "fatContent": "12.3 g",
            "fiberContent": "3.9 g",
            "proteinContent": "25.1 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "864.4 mg",
            "sugarContent": "4.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-18T15:36:16.977Z",
                "reviewBody": "This is a great recipe, but can be made a lot easier with a couple of modifications.  I would recommend substituing chicken broth for the water and not use the chicken soup base.  Chicken soup base creates a more artificial flavor.  Boil the chicken in the chicken broth.  Instead of a whole chicken, I cut boneless skinless chicken breasts into pieces.  After boiling the chicken in the broth for 1/2 hour, add the other ingredients already chopped (onion, bay leaves, peppercorns, celery, carrots -- I didn't put in the lemon grass) and cook for 1 more hour.  Then add the noodles and the celery leaves and cook until the noodles are done.  The whole pot can remain heating on the stove on low until your guests arrive.  I upped the recipe to serve 30 people and it worked great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MKOSSEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/571183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-14T04:45:40.153Z",
                "reviewBody": "This is the perfect Chicken Noodle Soup Recipe.  Really it is the homemade chicken broth that makes it!  FYI the Chicken Soup Base is the boullion granules.  Our grocery carries it in 4 oz. containers, the recipe calls for 2 oz. or 4T to make measurement easy.  The boullion adds salt/herbs and a little more flavor.  You could also use Vegetable Base if you have it on hand or the store is out of Chicken.  My husband is sick and he had two bowls, hopefully he'll be feeling better in the morning.  If you are looking for a Chicken Noodle soup recipe and you have the time to put into it look no further this is the one!!  Oh, one last thing, don't skip the lemon grass it is a really special addition.  If you have not purchased it or used it before here are some tips: it is a tough green stalk, looks like a pale thicker version of a green onion and is usually sold individually.  Peel the outer couple layers because they are likely dry and tired and then slice much like a green onion (cut off the hard end first).  It is hard, even after cooking and not so great to eat/chew so remember to strain with the other ingredients.  Hmmm...it really rounds out the flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Baker Horgan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1030871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-21T18:45:52.92Z",
                "reviewBody": "This recipe is delicious, but takes MEGA time! The directions are also a bit confusing and I was not sure what \"Chicken Base\" was. So I finally found something that is called \"Better than Bouillon\" that is basically a bouillon cube type product which is almost a liquid, it is kind of like paste. It was not clear if you are supposed to use 1/4 cup of that in its pure form or 1/4 of the prepared broth. After tasting it was clear it calls for 1/4 cup of the pure bouillon paste which is essentially chicken flavored salt. I also used \"no yolk\" egg noodles and you can't even tell the difference and there is a lot less cholesterol. Good stuff my family loved this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PINKSAND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/654557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-06T01:11:16.11Z",
                "reviewBody": "i make chicken soup all the time and this is very similar to mine, however most people are correct when talking about the noodles. Never cook in the broth, always cook them seperatly and add only the amount you want in your individual bowls to save on broth, then just fridge the noodles and reheat with leftover soup as needed.  also, we ALWAYS with any homemade soup grate lots of ramano or parmesan cheese on top for a delicious salty and pefect topping to the homemade soup.  you won't be dissapointed doing this!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKIN4FIVE05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1315779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-09T02:28:20.173Z",
                "reviewBody": "YUUUMMMMMMY!! Just like my Mom used to make. My children loved this! Try cooking the noodles before adding them to the soup as they consume a lot of the broth. For the chicken base I like to use \"Wyler's chicken (garlic & herb) Shakers\" it isn't as salty as other types. Good recipe! Thank you Alan!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-13T23:48:07.73Z",
                "reviewBody": "A good, basic chicken soup recipe.  We enjoyed it for dinner, and I froze the rest (without noodles) for dinner another night.  Another reviewer mentioned the noodles seeming to be too much.  That may be bacause the soup was allowed to stand too long before serving.  Noodles or rice in soup will continue to absorb liquid and grow in size if allowed to stand too long.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pamc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/54291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-17T15:03:41.817Z",
                "reviewBody": "Confused on the carrots and celery.  Youuse 2/3 oc celery and 1 lb carrots in the begining.  Drain the stock, then add chopped celery ad sliced carrots later.  What happens to the origanl carrots and celery.  It says to cook until carrots are done,",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Frank",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2252664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-27T22:36:02.093Z",
                "reviewBody": "I loved this recipe even though there really aren’t any short-cuts to this recipe and it can be time consuming. Like some other reviewers, I boiled the chicken the night before and made the soup the next day—it was much easier to skim off the fat since the broth was refrigerated over night and also much easier to pull the meat from the bone when the chicken isn’t hot! Also, I cooked the soup using a slow-cooker the next day so it really took me a while!\nAfter reading the reviews it appears some people are confused about the use of celery and carrots twice. It’s better to think of this recipe in two stages—making of the broth and making of the soup. You add celery and carrots at first to make the broth (boil the chicken) and discard everything except the chicken and the liquid after you are done. Later, you add chopped (bite-sized) celery and carrots to the broth to make the soup.\n\nI read almost all the reviews and I used the following suggestions:\n1. Cooked the noodles separately (if you cooked it in the broth you would end up with chicken noodle casserole as noodles soak up a lot of liquid)\n2. Used ¼ cup of “Better than Bouillon” chicken base paste (the broth itself is not strong enough without the base).\n3. The broth is just as delicious without the lemon grass (depending on the time of the year, it’s hard to find lemon grass even in Asian grocery stores).\n4. Used couple of cloves of fresh garlic and few sprigs of parsley for the soup.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BeezlyS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/beezlys/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T20:08:33.71Z",
                "reviewBody": "This soup was awesome! My family absolutely loved this (even the picky ones). It's a bit time consuming but certainly worth it. Actually I did the broth one night and stored it in the refrigerator. The next evening I skimmed off the fat (much easier when the broth is cold) and finished off the recipe. I added 2 cloves of finely chopped garlic to the broth. Also my family doesn't eat broth (don't ask me why) so I doubled the noodles which soaked up all the yummy broth. It actually turned out as chicken noodles rather than soup. They still loved it though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MDIPPEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/698864/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Awesome Chicken Noodle Soup",
            "description": "See how to make an amazing chicken noodle soup.",
            "uploadDate": "2013-01-03T23:15:39.789Z",
            "duration": "PT5M20.654S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7e72f0aa-1a7f-4280-8b05-d90a13181fd8%2F0f4dbaa1-beb3-4003-9324-5dd8fb69e728%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2071398764001"
        }
    }
]