[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26382/chicken-enchilada-soup-iii/",
        "name": "Chicken Enchilada Soup III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5455415.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-04T03:28:50.000Z",
        "description": "This is a copy of a favorite served at a local restaurant.  My family loves it!  Serve soup in bowls garnished with shredded Cheddar or Jack cheese and crumbed tortilla chips.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound skinless, boneless chicken breast halves",
            "1 tablespoon vegetable oil",
            "½ cup diced onion",
            "1 clove garlic, minced",
            "1 quart chicken broth",
            "1 cup masa harina",
            "3 cups water, divided",
            "1 cup enchilada sauce",
            "2 cups shredded Cheddar cheese",
            "1 teaspoon salt",
            "1 teaspoon chili powder",
            "½ teaspoon ground cumin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large pot over medium heat, cook chicken breasts in oil until well browned on all sides.  Remove and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook onion and garlic in remaining oil until onions are translucent.  Pour in chicken broth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, whisk together masa harina and 2 cups water until well blended.  Pour into pot with remaining 1 cup water, enchilada sauce, Cheddar, salt, chili powder and cumin.  Bring to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shred cooked chicken and add it to the pot.  Reduce heat and simmer 30 to 40 minutes, until thickened.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KMHIX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.594861660079052,
            "ratingCount": 506,
            "itemReviewed": "Chicken Enchilada Soup III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "290 calories",
            "carbohydrateContent": "13.8 g",
            "cholesterolContent": "74 mg",
            "fatContent": "16.3 g",
            "fiberContent": "2.4 g",
            "proteinContent": "22 g",
            "saturatedFatContent": "8.6 g",
            "servingSize": null,
            "sodiumContent": "512.2 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-09T17:03:23.543Z",
                "reviewBody": "If you like the chicken enchilada soup form Chili's, then you will love this! For those of you who are unclear, masa harina is just a corn flour (similar to corn meal but ground much finer) and you can find it at your local grocery store.  If you can find the masa, then definitely make this soup! You will not be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan Bilek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/712819/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T22:50:32.97Z",
                "reviewBody": "This is everything you look for in a recipe; easy, quick, delicious and reheatable. It tastes exactly like an enchilada. \nI added chipotle pepper, halved the cheese, and used barbecue chicken breast I already had cooked from last night, which saved on the time. \nFOR THE MASA HARINA HATERS:\nWhen mixing the masa with the water, whisk a little at a time into your water (about a tablespoon at a time) very quickly, until it is all dissolved. This gives it a much smoother consistency and alleviates the grittiness. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2398830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-07T15:40:27.7Z",
                "reviewBody": "Karen, I want to thank you so much for this recipe. It's been a while since a new recipe wowwed me like this one did & my beau just raved about it. Awesome stuff, he said. As usual, I made some adjustments & additions but the recipe, as written, proved to be a great foundation.\nI took a chance & found a more than adequate substitute for the 'gritty' masa to thicken the soup. Other recipes mentioned using torn up unfried corn tortillas (I used about 5 small tortillas-probably few more next time). I don't have a need for any extra masa so the tortillas worked beautifully. They practically dissolve, giving a lovely texture. Be sure to add additional cup or so of liquid. It can be stock, water, V-8 or beer, of course. I may try tequila...I encourage all of you non-gritties to please give this recipe another chance nixing the masa for tortillas. Trust me & Karen.\nAccording to our tastes, I added sauteed onions, chopped fresh jalapenos, black beans, corn & I added some red cayenne pepper, about 1/3 tsp. Be careful-cayenne is hot so add sparingly. It really wakes up the flavor & it makes your tummy warm & happy. Souper Recipe (ha)! 5 Yums Up!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "catzinaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1368198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-02T17:53:46.263Z",
                "reviewBody": "This was excellent! I like others could not find \"Masa Harina\" so I bought something called Maseca......it's what you make corn tortillas out of and it worked great it really gave it that authentic Mexican flavor. Next time I will definately use all chicken broth instead of water. It would be great adding a can of tomatoes or green chilies....it's so versatile you can do anything to it! We topped ours with extra shredded cheese & sour cream.......yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristy Hopkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/999181/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T17:38:48.697Z",
                "reviewBody": "Absolutely fantastic recipe!!!  And additional thanks to the reviewer who suggested using corn tortillas instead of masa harina.  I've used six tortillas and I've used 10.  It's all good. The right enchilada sauce makes all the difference; for authenticity I recommend Las Palmas medium or hot red sauce, if you can find it.  I grew up with this stuff in Southern California, and although harder to find back east it's still possible.  The enchilada sauce-to-water ratio is spot-on as long as you select a quality sauce.  Don't be afraid to use more garlic, 4 or 5 cloves is about right with half of a large onion.  I made this recipe a few different times, and I discovered that you do not need to add cheese during the cooking process.  It's really not necessary for thickness (the corn tortillas are), and the cheese just globs at the bottom and sticks to the pot.  Just add mild cheddar cheese with the rest of your garnish, fresher is better, and you require less cheese (healthier too).  A squeeze of lime in the bowl, some fresh cilantro, some thinly sliced jalapeno, etc., and you're in business!!! I've seen reviews where others keep adding more and more stuff (even beans and Velveeta), and it seems they are trying to create a thicker chile or a dip rather than soup. The goal should be an authentic, light, simple enchilada soup of top fresh quality, so use the right sauce to begin with, keep it light, and enjoy life without clogging your arteries.  Avocado salad makes a great side.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J and A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5431736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-07T18:58:54.687Z",
                "reviewBody": "Please note...A recipe! However I used hot tamale sauce (isn't really that hot) and 1tsp of cumin instead of half to make it more authentic. Also added a can of sweet corn to give the soup a bit more texture and finely chopped 1 large green pepper and one diced tomato to make it more colorful add texture and more authentic. I made this dish for myself and for my boyfriend who is Mexican. Not only did both of us love it but I plan on making it once a week.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PLATO712",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1277853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-22T22:00:15.45Z",
                "reviewBody": "This is an awesome recipe! Very close to Chile's Chicken Enchilada soup which is a favorite in our house. To save time I just throw the shredded chicken in with all the rest of the ingredients bring it to a boil and then turn it down and let it cook. We also cut up corn tortillas into very thin strips and bake them in the oven at 300 for 8 minutes. Then we sprinkle grated cheese and the chips on top. Very yummy! We have made it tons of times!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHCMEOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/313595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-15T03:59:02.09Z",
                "reviewBody": "I made this soup once before using the processed cheese, exactly as written in another recipe.  Everything is exactly the same except for the cheese and it was great.  This time I did as others suggested and used the whole 28 oz can of enchilada sauce and it was way too overpowering.  I used the cheddar cheese and it wasn't as good as velveeta.  It didn't incorporate into the soup as well.  Will have to throw it out and start over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynette Olsen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/425149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-18T20:59:00.78Z",
                "reviewBody": "First off I want to say that I give this recipe 4 stars if made as written. I feel for my taste it needs a bit more spice than what the recipe calls for. I do want to add that this is a great recipe that you can tweak to your own tastes and end up with a fabulous soup. I made as written the first time and while we liked it I felt it could be better so I took the left over soup and added to it as some reviewers suggested 1 can of rotel tomatoes 1 can of mexicorn and added 1 additional tsp. of chili powder and 1/2 additional tsp of cumen. I also feel that 1 full cup of Masa Harina is too much I will use 1/2 cup next time. Give this one a try you will not be disappointed! My Son said it tasted like Chili's only better with the additions. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Noemi - No way is she a",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/noemi/"
                }
            }
        ]
    }
]