[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27190/gyoza/",
        "name": "Gyoza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8068034.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-04T03:29:01.000Z",
        "description": "I learned this recipe for pot stickers while living in Japan. They're great hot or cold, and may be eaten plain or with the dipping sauce. Any ground meat can be substituted for pork.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "30 gyoza",
        "recipeIngredient": [
            "1 tablespoon sesame oil",
            "2 cups chopped cabbage",
            "¼ cup chopped onion",
            "1 clove garlic, chopped",
            "¼ cup chopped carrot",
            "½ pound ground pork",
            "1 egg",
            "1 tablespoon vegetable oil",
            "1 (10 ounce) package wonton wrappers",
            "¼ cup water",
            "¼ cup soy sauce",
            "2 tablespoons rice vinegar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat sesame oil in a large skillet over medium high heat. Mix in cabbage, onion, garlic and carrot. Cook and stir until cabbage is limp. Mix in ground pork and egg. Cook until pork is evenly brown and egg is no longer runny.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat vegetable oil in a large skillet over medium high heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place approximately 1 tablespoon of the cabbage and pork mixture in the center of each wrapper. Fold wrappers in half over filling, and seal edges with moistened fingers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the preheated vegetable oil, cook gyoza approximately 1 minute per side, until lightly browned. Place water into skillet and reduce heat. Cover and allow gyoza to steam until the water is gone.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix soy sauce and rice vinegar. Use the mixture as a dipping sauce for the finished wrappers.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mersi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.430693069306931,
            "ratingCount": 202,
            "itemReviewed": "Gyoza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "183.6 calories",
            "carbohydrateContent": "18.5 g",
            "cholesterolContent": "37.5 mg",
            "fatContent": "8.5 g",
            "fiberContent": "1.2 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "546.3 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-11T04:30:45.037Z",
                "reviewBody": "I have been making gyoza since I was little kid, and I have a few tips to add to this recipe.\r\n\r\nCabbage should be finely chopped. Onions should be green onions, minced. For extra fiber, you can also add finely ground carrot. It is not necessary to pre-cook the vegetables, if you finely chop everything.\r\n\r\nIt is more authentic to use round gyoza wrappers, not wonton wrappers - but sometimes they are hard to find.\r\n\r\nThe way to use round gyoza wrappers is: put a tablespoon of filling inside, wet one-half of the edge of the wrapper with water, fold in half. It should look like a half-circle. Then, crease the round edge about 5 times. Think pinch and fold. It's really quite easy but hard to explain. Look at some pictures of gyoza online if you don't understand.\r\n\r\nKeep the heat to medium after the first batch. It is important to keep a consistent heat so that the gyoza don't burn, but cook the insides thoroughly. It is important to add the water at the end to steam it. Put a lid on after you add the water.\r\n\r\nAlso, making gyoza is very time consuming and messy. Your kitchen will be splattered with a layer of fine grease afterwards.\r\n\r\nIf you want, you can make them outside or in your garage using an electric skillet. This will keep your house clean and from smelling like grease afterwards.\r\n\r\nAlso, heat the soy and vinegar at the end and sprinkle a little cayenne on top for extra zing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEDDYBEARZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1140411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-21T12:45:17.813Z",
                "reviewBody": "Very similar to our family recipe (Japanese American); we don't use egg but gyoza depends on the cook (sort of like a sandwich).  This meat mixture is on the bland side: add ginger, garlic, soy sauce, pepper, etc to taste.  You can put them together then freeze them (lie in a single layer on a cookie sheet, once frozen put into ziplocs).  This helps with the HUGE amount of prep time and work.  You can also fry them (use more oil, skip addition of water) so they are more like egg rolls if you want.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TXMomof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/558072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-01T17:57:13.14Z",
                "reviewBody": "Yum, Yum.  I learned a similar recipe in my Japanese class in high school.  All the differences were that we used a half and half mixture of water and corn starch to seal the gyoza.  Also instead of water when cooking the gyoza you can use a watered down chicken or beef broth instead of just plain water, it gives the dumplings more flavor.  Also sesame oil is MUCH MUCH more tasty (and authentic) then vegtable oil, when cooking the gyoza.  And one last thing, I never add an egg, I find it gives a strange unwelcome texture.  It might hold the mixture together better, but it's really up to you.  Oh and as well, ginger is a must, add one or two tablespoons (to your taste) to the cabbage mixture, as well as a tablespoon of sake (japanese rice wine), and then cook as directed. The onion should also be green, or you could substitute leeks.  It is more authentic to use round wrappers, and pleat them when putting the dumplings together, but it is allot of work, (considering it's just for looks) and they taste the same as the square.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRENNA3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1078540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-05T18:30:12.7Z",
                "reviewBody": "After reading the reviews I chose to NOT cook the vegetables first and I left out the egg as well and had no problems. I made mine vegetarian. The filling I used was: broccoli carrots cabbage ginger and green onion and used my food processor for quick and easy chopping. They came out PERFECT! It was EASY and I made about 50 of them and now have easy lunches this week! Oh for the sauce I used Hoi Sin sauce mixed with a little rice vinegar and chili sauce with fried garlic (all available at any chinese/thai grocery)! SOOOOOO good! It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PUREWATERFALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T21:24:01.96Z",
                "reviewBody": "I just made your recipe and it was wonderful! The only things I did different was using square won ton wrappers (I live in WI it's hard to find actual gyoza wrappers here) and I added minced garlic and fresh ginger root to the veggies. I also used green onions and pulsed it all together in the food processor makes wrapping a whole lot easier. I did omit the egg as I lived in Fussa-shi Japan for 10 years and do not ever recall having egg in my gyoza before. Wonderful recipe though! Thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaime H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1603740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-03T00:33:52.077Z",
                "reviewBody": "I make gyoza all the time and this is a good recipe! I like the sesame oil. In my house we use different ingredients but I thought the carrot addition sounded good. I will try it next time. You can also try adding finely minced ginger and chopped cilantro for extra flavor. As for dipping sauce ponzu is tradition in my family. If you don't have a Japanese market nearby where you can buy ponzu sauce try a mixture of lemon or lime juice and light soy sauce with a drop of light vinegar to taste. Add a shot of la-yu oil or hot sauce for a spicy kick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "C. Hernandez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2230767/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-01T21:48:20.237Z",
                "reviewBody": "Very tasty! Made gyoza as per recipe with the following modifications: added 2 tbl ginger (a must IMO!) a dash of soy to meat mixture 1 tbl of sake. The ginger adds a great flavor. Overall the gyoza were very tasty. One thing I didn't quite understand was how much to cook the meat in the first step. I ended up cooking most of the meat through (in part because I had frozen ground beef which pretty much required me to cook through to break apart) which in retrospect might not be what the recipe stated but aside from the meat inside the gyoza being looser was not a problem. (i.e. nothing was overcooked) My tip for the dipping sauce: I didn't have rice vinegar so I ended up using sushi vinegar which is a bit sweeter due to the addition of sugar. I thought this actually added a little bit (but not too much) of a nice sweetness to the sauce to balance out the flavors. I also added a few dashes (maybe about half a tsp) of \"ra yu\" hot sesame oil to add some of that great sesame oil flavor/smell and some heat to the sauce. Lastly I didn't do it with this recipe but in the past I've cooked frozen gyoza by putting the water (I think I used about half a cup) and oil together in the cold skillet and then adding the gyoza as the water starts boiling. By boiling the gyoza in hot water/oil it cooks the middle more evenly instead of just steaming the wrappers. After the water evaporates if you want a crispier gyoza you can allow it to brown by cooking it about ha",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2474009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-19T23:35:47.413Z",
                "reviewBody": "These were just okay. Pre cooking the filling made them finicky to fold properly so I did a couple this way and the rest I just put the raw filling in which is traditional. I found the filling bland so with my second batch I added a splash of soy sauce splash of oyster sauce splash of sesame oil 1/2 tsp sugar 1/4 tsp of pepper 1/4 tsp of ground ginger. Adding these ingredients and not pre cooking the filling made these a definite 5 star dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefsDaughter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2804220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-15T13:15:44.653Z",
                "reviewBody": "About prep time the first time you make is always the most tedious. As you get used to making you will shorten your prep time! These also freeze very well and no defrost time needed. One last thing...I prefer Napa Cabbage for gyoza! Good luck to everyone!! (Great recipe Meredith!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tamara Grimes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/148571/"
                }
            }
        ]
    }
]