[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/31778/ukrainian-olhas-varenyky-perogies/",
        "name": "Ukrainian Olha's Varenyky (Perogies)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7966773.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-04T03:29:09.000Z",
        "description": "Ukrainian Olha's Varenyky (perogies)  These half moons of dough may be filled with a variety of fruits, vegetables, meats and cheeses, although for Christmas Eve potato and cabbage fillings are the favorite.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "5 cups all-purpose flour",
            "1 teaspoon salt",
            "2 tablespoons butter, softened",
            "1 cup evaporated milk",
            "½ cup water",
            "6 medium potatoes, cut into small cubes",
            "2 large onions, finely chopped",
            "½ cup butter",
            "1 cup shredded Cheddar cheese",
            "salt and pepper to taste",
            "1 pound sauerkraut",
            "2 large onions, finely chopped",
            "½ cup butter",
            "3 cups finely shredded green cabbage",
            "1 cube chicken bouillon",
            "2 teaspoons pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make the dough, combine the flour and salt in a large bowl. Make a well in the center and add the soft butter and evaporated milk; stir gently until all the liquid is absorbed. Add water only as needed, kneading continuously until dough sticks together. Place dough into a greased bowl, turn to coat, and let rest for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the potato filling, place potatoes into a saucepan with water to cover. Bring to a boil and cook until tender, about 10 minutes. Drain and set aside. Melt 1/2 cup butter in a medium skillet, over medium heat. Saute onions in butter until tender. Mix the onions into the potatoes along with the cheese and season with salt and pepper to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the sauerkraut and cabbage filling, pour the drained sauerkraut into a large saucepan. In a medium skillet, saute 2 onions in 1/2 cup butter until tender, about 5 minutes. Stir the onions into the sauerkraut along with the cabbage and chicken bouillon cube. Cook over low heat until liquid evaporates. Season with pepper and remove from heat. Allow the mixture to cool, then run through a grinder or food processor.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the dough from the bowl onto a lightly floured surface. Roll out to 1/8 inch in thickness. Cut into 3 inch circles. Place one tablespoon of filling onto one side of the circle. Fold the other half over and press the edges to seal. Place finished dumplings onto a floured tray and keep covered.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water to a boil. Drop 10 or so dumplings into the water at a time. Cook for 3 to 5 minutes, then remove to a colander to drain. Place finished dumplings onto a lightly oiled dish and turn them to coat with a thin layer. This will keep them from sticking together.  Serve dumplings with fried onions and sour cream. Cooled dumplings also can be fried in oil and butter for a nice crispy surface.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Olga D"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.390243902439025,
            "ratingCount": 41,
            "itemReviewed": "Ukrainian Olha's Varenyky (Perogies)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "635.9 calories",
            "carbohydrateContent": "81.9 g",
            "cholesterolContent": "76.1 mg",
            "fatContent": "27.9 g",
            "fiberContent": "7.4 g",
            "proteinContent": "15.7 g",
            "saturatedFatContent": "17.2 g",
            "servingSize": null,
            "sodiumContent": "918.9 mg",
            "sugarContent": "7.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-27T00:17:01.193Z",
                "reviewBody": "Almost, but not quite, the perfect Varenyky. I have made them for 3 years now, and would suggest the following filling changes: boil the potatoes in the skins and then peel them, mash the potatoes rather than dicing, and add a dash of nutmeg to the filling to enhance the cheese flavour. As for the dough, I found it a bit tougher when cooked than the varenyky I grew up with. Search for an online recipe with fewer eggs, sour cream and butter in the dough; the sour cream seems to make the dough much more workable and tender. Also, after boiling varenyky it seems to help to subsequently cook them even more, either re-heating them in a casserole dish in the oven, or frying them in a pan with a bit of butter an onion. This helps to make them even more tender. This is great logistically when you want to prepare the varenyky well before a meal but re-heat them to serve.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sonyapizza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2651351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-27T18:37:15.327Z",
                "reviewBody": "I've never made perogies from scratch before, but this was relatively easy and simple to follow.  They do take a while to make, but perogies in general take a while to make.  I would mash the potatoes rather than leaving them in cubes though.  This makes it easier to handle.  If you mash the potatoes 5 potatoes is sufficient.  Mixing some bacon bits into the potatoes also helps to add flavour.  Overall, great recipie.  Worth trying~!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOCELYNE27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/565027/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-15T20:20:54.35Z",
                "reviewBody": "I used the dough recipe as I make my own family recipe for my filling..I think by adding the water at a very warm temperature could be making the difference, as for elasticity...It sure worked for me! Great reviews as for taste as well! So thanx!!! Mucho!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TL'sCookin!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3130018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-16T19:37:28.797Z",
                "reviewBody": "My roommate my first year in college was from a polish family and her mom made me the first perogies id ever had. This recipe is very good though it takes a bit of finesse and practice to put the filing in the dumplings the way her mom told me it was supposed to be done. i used mashed potatoes and i put half bacon fat half butter in the skillet when i sauted them for a bit of extra flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "redsand.beach13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5107876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T19:55:31.153Z",
                "reviewBody": "I made the potato filling without the onions because my boyfriend hates onions. I mashed the potatoes a little rather than leaving them in cubes as another review suggested. While I was rolling out the first piece of dough I noticed its similarity to pasta dough - so I used my pasta maker to roll the dough out nice and thin. It was much easier than fighting with a rolling pin! I'll make these again for sure - everyone loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/950841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-30T20:04:52.56Z",
                "reviewBody": "4 hours to make",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KingAdam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2884888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-25T14:12:31.84Z",
                "reviewBody": "I am giving 4 stars since I would give the fillings a 5 and the dough a 3! Both fillings were very tasty although very fattening! I boiled my potatoes in the skins then peeled and mashed them. This holds in the flavor as well as preventing them from being watery (less work too!). I would give the dough 3 stars because mine turned out tough and very difficult to roll out. That may have been my fault though since for some reason I had to add more water than called for because it was too dry with the half cup. Oh a lttle warning...be sure you have the extra time to make these as they are very time consuming! Overall a good recipe though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LURON304",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379075/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-29T19:09:09.7Z",
                "reviewBody": "I've tried homemade perogies at a ukrainian friend's home a couple times before and I had a craving for them so I decided to make them myself using this recipe... They were good but not excellent. The filling was good but could have had a bit more flavour. The problem was the dough was so tough to roll out and it was hard to get it nice and thin. Then in the boiling process it just didn't seem to come out nicely so we fried them up which improved it a lot. Everyone enjoyed these but I have had better and am still searching for the perfect recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CREATIVE ALISON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/702133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-15T01:01:21.477Z",
                "reviewBody": "Very good recipe although I halved the recipe doubled the amount of cheese and more than doubled the amount of salt recommended.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "windelbo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1650926/"
                }
            }
        ]
    }
]