[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/32057/stir-fried-vegetables-with-chicken-or-pork/",
        "name": "Stir-Fried Vegetables with Chicken or Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2325344.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2019-04-04T03:29:11.000Z",
        "description": "I want to thank my Asian friends at work for bringing some very tasty dishes to our potlucks and Cindy Ly for taking the time to write down the ingredients for me. This dish can be made with either chicken or pork.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "½ pound boneless skinless chicken breasts, cut into cubes",
            "2 cloves garlic, chopped",
            "2 tablespoons oyster sauce",
            "1 cup chopped broccoli",
            "1 cup sliced green bell pepper",
            "1 cup sliced carrots",
            "1 cup sliced napa cabbage",
            "1 cup sliced celery",
            "1 cup fresh bean sprouts",
            "1 cup sliced zucchini",
            "1 cup chopped green onions",
            "1 teaspoon salt",
            "½ cup water",
            "2 tablespoons mushroom soy sauce",
            "1 tablespoon cornstarch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a wok or large heavy skillet. Add chicken or pork (see Cook's Note), garlic, and oyster sauce, and stir-fry for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in broccoli, green pepper, carrots, cabbage, celery, bean sprouts, zucchini, and green onions. Season with salt, and stir-fry for 6 to 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together water, soy sauce and cornstarch. Stir into vegetables, and cook for 1 to 2 minutes, or until sauce is thickened.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Nishana Lee"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.444444444444445,
            "ratingCount": 153,
            "itemReviewed": "Stir-Fried Vegetables with Chicken or Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "191.9 calories",
            "carbohydrateContent": "14.7 g",
            "cholesterolContent": "32.9 mg",
            "fatContent": "8 g",
            "fiberContent": "4.1 g",
            "proteinContent": "16.9 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "1174.7 mg",
            "sugarContent": "5.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-11-04T15:44:30.573Z",
                "reviewBody": "I stir-fry all the time, and I thought this was delicious, but the cooking times a methods needed a little tweeking!  I always blanch my veggies for about 4 minutes in boiling water (everything that is raw, even the celery and onions) and then run cold water over them as soon as they come out of the water.  This makes them nice and crisp-tender.  Also, the heat should be on almost the hottest setting and preheated well before adding the pork or chicken (I used teriyaki-marinated pork tenderloin sliced thinly).  Stir-fry meat for about 3 or 4 minutes, just until no longer pink, then add garlic (I also added fresh ginger at this point) and oyster sauce and cook for 1-2 minutes before adding the blanched veggies.  Cook until everything is heated through, then add the water/cornstarch mixture and any canned veggies (I used baby corn and canned bean sprouts) and cook for 1 more minute until sauce is thick.  Stir-fry cooks very quickly, so have everything ready and set up on your counter to be tossed right in when needed!  I served this over rice, and it was a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffinmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2457961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-25T01:22:35.383Z",
                "reviewBody": "This recipe is not complex and not difficult to prepare, but it sure is good. I had a heavy dish for supper last night so I wanted to take it easy tonight and make something healthier. This was what I needed. I modified this a little, using shrimp and the vegetables I had in the crisper: napa cabbage, mushrooms, green onion, orange bell pepper, zucchini, broccoli and celery. I sautéed the shrimp in sesame oil, not vegetable oil, removed it from the pan, then sautéed the vegetables, adding the napa cabbage, green onion and garlic at the end. I returned it all to the pan, then added the mixture I brought together of chicken broth (rather than water), traditional soy sauce (never heard of mushroom), cornstarch and oyster sauce. When it had thickened slightly, just a minute or so, I gave it a very light drizzle of toasted sesame oil. Again, I wanted to keep this on the light side, so while I really preferred this over rice, I tried this product called “Pasta Slim\" – it’s wheat and gluten free and ready in 1 minute. I have to put in a plug for this stuff because it was good enough to be worth mentioning to those of us watching our carbs and calories. I discovered it in the produce section of my market. It’s a precooked “spaghetti” made of tofu (trust me, you wouldn’t even know it!) and konjac flour (whatever the heck THAT is). All I know is, each serving has just 20 calories and 4g of carbs! Anyway, back to the stir fry. This was so good I ate a 2-serving recipe all by myself.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-30T18:01:47.303Z",
                "reviewBody": "I didn't have all of the veggies available that were called for so I substituted quite a few ingredients. I used about a pound of chicken cut into chunks, 3 cloves of garlic and some \"red pepper flakes\" as suggested by another reviewer. I stirfried this for the 10 minutes. I would not cook the chicken this long next time. For veggies I used broccoli, carrotts, celery, green pepper, snow peas, onion, and sliced mushrooms. I found when stir frying this large amount I needed to add a little extra oil and I added a few tablespoons of water so nothing would stick. I didn't have mushroom soy sauce so I used Kikkoman's light soy sauce. I served this over thin spaghetti and sprinkled extra soy sauce over my serving. This came out very good and my grown son and daughter told me it was a keeper. I will  use the correct ingredients next time and see how it comes out. This was great though. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PATTY MAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-11T15:50:58.373Z",
                "reviewBody": "Enjoyed this a lot! It is such an adaptable dish. I substituted cold slaw mix for the carrots and cabbage and used mushrooms instead of the broccoli and zucchini. Also added several chopped cloves of garlic and some sweet brown onion. Served over cooked linguini noodles with extra soy sauce - Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SweetBasil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-09T18:41:13.647Z",
                "reviewBody": "I stir-fry all the time and I thought this was delicious but the cooking times a methods needed a little tweeking! I always blanch my veggies for about 4 minutes in boiling water (everything that is raw even the celery and onions) and then run cold water over them as soon as they come out of the water. This makes them nice and crisp-tender. Also the heat should be on almost the hottest setting and preheated well before adding the pork or chicken (I used teriyaki-marinated pork tenderloin sliced thinly). Stir-fry meat for about 3 or 4 minutes just until no longer pink then add garlic (I also added fresh ginger at this point) and oyster sauce and cook for 1-2 minutes before adding the blanched veggies. Cook until everything is heated through then add the water/cornstarch mixture and any canned veggies (I used baby corn and canned bean sprouts) and cook for 1 more minute until sauce is thick. Stir-fry cooks very quickly so have everything ready and set up on your counter to be tossed right in when needed! I served this over rice and it was a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "dave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8780412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-11T18:01:01.403Z",
                "reviewBody": "I thought this recipe was absolutely delicious. My husband asked for seconds!! I think the napa cabbage was a great addition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KELNICH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1203943/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-11T21:10:02.757Z",
                "reviewBody": "This turned out really well. I added some red pepper flakes and more vegetables than the recipe called for. I served this over udon noodles. Great way to get a lot of tasty veggies. I didn't have chicken or pork but used turkey tenderloins.. delish",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-02T16:18:12.14Z",
                "reviewBody": "I tried this recipe a couple of nights ago for dinner but instead of adding the meat I used just with the veggies as I already had my meat planned and was looking to stir fry some veggies as my side dish. This turned out to be excellent I didn't use all the veggies called for as I didn't have everything so improvised with broccoli bean sprouts mushrooms gr onions yellow peppers and celery. Luckily it's very forgiving and will adapt well with what you have in the fridge! The only other thing I cahnged was not using the mushroom soy sauce (did not have and have actually never even looked for it). I used just regular reduced sodium soy and it turned out great. I didn't add the salt either and was glad as I found that this recipe did not need the additional salt. Hubby and I both really enjoyed thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ANJACKSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1404646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-04T23:14:50.14Z",
                "reviewBody": "Very easy and delicious! Stir frying vegetables with meat is something that I do quite often. I just use what I had in the refrigerator which was carrots broccoli crowns water chestnuts zucchini mushrooms red onions garlic a medley of bell peppers (red yellow and green) and seasoning. I blanched the broccoli in hot water and set it aside. I quickly sauteed the carrots and zucchini in sesame oil and set that aside as well. I already had leftover rotisserie chicken so I cut it up and sauteed it in a little sesame oil with minced garlic for about 5 minutes. I put back the carrots zucchini then added mushrooms and onions. I drizzled enough of the oyster sauce to taste. I mixed in the soy sauce with cornstarch and poured it in the pot. Lastly I added in the bell peppers. I seasoned with black pepper and Hawaiian sea salt. The vegetables were tender-crisp chicken very tender and flavorful. The mixture of vegetables made for a colorful presentation. We served this tasty stir-fry dish over hot rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-10T02:22:05.323Z",
                "reviewBody": "Wow looking at the amount of vegetables called for any Asian person would say that this is enough food to feed an easy 8-10 people. Serve with boiled rice with the portion being 2 parts rice to 1 part entree. This is how an Asian family would serve it. A whole lot less calories for sure. Oh and hold back on the green onions only one or two stalks are needed as they are to enhance the dish not over-whelm it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Sheehy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2331136/"
                }
            }
        ]
    }
]