[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/34512/real-homemade-tamales/",
        "name": "Real Homemade Tamales",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2015%2F04%2F417213.jpg",
            "width": 600,
            "height": 600,
            "caption": "Photo by pelicangal"
        },
        "datePublished": "2001-03-29T17:40:32.000Z",
        "description": "I had been looking for a Tamale recipe for years. One day I went to the international market and stood in the Mexican aisle till a woman with a full cart came by. I just asked her if she knew how to make Tamales. This is her recipe with a few additions from me. The pork can be substituted with either chicken or beef. This is great served with refried beans and a salad.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H35M",
        "recipeYield": "16 tamales",
        "recipeIngredient": [
            "1 ¼ pounds pork loin",
            "1 large onion, halved",
            "1 clove garlic",
            "4 dried California chile pods",
            "2 cups water",
            "1 ½ teaspoons salt",
            "2 cups masa harina",
            "1 (10.5 ounce) can beef broth",
            "1 teaspoon baking powder",
            "½ teaspoon salt",
            "⅔ cup lard",
            "1 (8 ounce) package dried corn husks",
            "1 cup sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place pork into a Dutch oven with onion and garlic, and add water to cover. Bring to a boil, then  reduce heat to low and simmer until the meat is cooked through, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use rubber gloves to remove stems and seeds from the chile pods. Place chiles in a saucepan with 2 cups of water. Simmer, uncovered, for 20 minutes, then remove from heat to cool. Transfer the chiles and water to a blender and blend until smooth. Strain the mixture, stir in salt, and set aside. Shred the cooked meat and mix in one cup of the chile sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Soak the corn husks in a bowl of warm water. In a large bowl, beat the lard with a tablespoon of the broth until fluffy. Combine the masa harina, baking powder and salt; stir into the lard mixture, adding more broth as necessary to form a spongy dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the dough out over the corn husks to 1/4 to 1/2 inch thickness. Place one tablespoon of the meat filling into the center. Fold the sides of the husks in toward the center and place in a steamer. Steam for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove tamales from husks and drizzle remaining chile sauce over. Top with sour cream. For a creamy sauce, mix sour cream into the chile sauce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SADDIECAT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.371069182389937,
            "ratingCount": 318,
            "itemReviewed": "Real Homemade Tamales",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "235.9 calories",
            "carbohydrateContent": "12.6 g",
            "cholesterolContent": "36.8 mg",
            "fatContent": "16.6 g",
            "fiberContent": "2.1 g",
            "proteinContent": "9.1 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "401.4 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-12T18:58:45.153Z",
                "reviewBody": "A few things for the beginner:  it's better to boil the peppers(any kind will do) and all the flavorings for 30ish minutes, and then cook the meat in that broth.  Also, the water should cover the meat in the pan and it needs to be cooked until it is crumbly to the touch--this makes it easier and faster to shred by hand and eliminates any further meat preparation.  Depending on the meat I use my cook time varies between 4 hours to overnight.  I keep my corn husks in hot/boiling water for at least an hour--they need to be very soft.  Two VIP things to note: masa is very bland, there is no substitute for lard!  I use the leftover meat juice instead of broth for my masa, and still add lots of other spices.  When you are making tamales the masa will dry out; just add a little meat juice to keep the consistency.  It should spread like creamy peanut butter.  The corn husks should only measure 4-5 inches across; larger ones can be torn to size.  Place the meat filling along the edge and roll like a cigar. Also when steaming them, they need to be as close to standing upright as possible. Good reference recipe, thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRPTGODDESS1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/504136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-04T17:35:30.193Z",
                "reviewBody": "If you are going to take the time to make tamales, be sure to double or triple the recipe, the Tamales freeze well. You also want them to turn out perfectly. This is a good recipe but the instructions leave out a few important steps: (1.) One of the biggest mistakes is not mixing the masa dough long enough; this causes the tamales to fall apart. Mix the masa dough, with an ELECTRIC MIXER, until a small amount (1 tsp) floats in a cup of water. (2.) Position your corn husks with wide end toward you. Spread a thin layer of masa dough, completely covering the bottom 2/3 of the corn husks and place filling in a line down the center of the dough. (3.) You won't have to secure your Tamales with a toothpick or strip of corn husk, if folded properly. When folding, fold in one long side about 1/3 over dough and filling, fold in the other long side, overlapping the first (like folding a business letter). Fold down the top 1/3 and place in steamer standing upright, with the folded end down and open end up. Don’t over pack the pan, just tightly enough to keep Tamales in an upright position. If you don’t have a Tamale steamer you can use a deep pot with cover. Place a steamer basket in the bottom and stand your Tamales (open end up) in the basket, add water only to the bottom of the basket (you don’t want the Tamales sitting in water) cover, and steam. Check the water level during cooking, to make sure the pot doesn’t run dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSLYN H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-29T15:20:49.54Z",
                "reviewBody": "The directions for preparing the Masa are right on. It's a lot easier than you would expect. To simplify the meat preparation I simply used boiled chicken with monterey jack or queso fresco cheese. The chile preparation is also easy. I added a bay leaf and oregano (remove the bay leaf and add one teaspoon of lemon juice before you blend it). Don't expect a great flavor. The chile is meant to be concentrated so it will taste horrible (very woody and grainy). But when it steams with the masa and meat the end product is wonderful. Placing the masa in the husks is a challenge, be patient. Although, I didn't want to, I had to use extra husk strips to tie the tamales. They kept seeping out in the steamer and would fall apart when I attempted to move them. The last thing you want is wet masa on the bottom of your steamer. I also found the steaming to take ALOT longer. In my case (I've made it 3 times) the steaming took between 2.5-3 hours. I guess it depends on the type of steamer you use. It helps to cover the bottom, sides, and eventually top (once the tamales are in) with extra corn husks. This keeps the tamales dry as you add extra water during the steaming process. It also helps with clean up later. I also put a coin at the bottom of the steamer (when the coin stops clanking, you know that your near the end of water and need to refill it).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAELIAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1086444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-04T22:40:01.373Z",
                "reviewBody": "Tamales are a Christmas tradition here and these are the real deal. I got raves on mine this year from our friends that we gave a dozen to. The chili's used here are very mild, so I use cascabel peppers. I always use 2 pork tenderloins to make mine. I poured all the chili sauce on the shredded meat, added about 1/2 tsp each of ground ancho chili powder and ground chipotle chili powder since it adds a smoked taste. Then let in stand for several hours before I made it into tamales. This is easier done the day ahead. I also add some ground ancho chili about 1/2 tsp. and 1/4 tsp ground chipotle chili to the masa. I use Maseca brand instant corn masa flour. I use almost all the broth and make the masa the consistency of thick cake frosting. I do have to make double the masa to use all my filling though. I don't measure the filling out, I just take some with my fingers and lay out a strip of filling down the center. It gives me 4 dozen tamales. We all agree these are even better the next day. They get spicier after reheating. I took some to work and everyone thought they came from the local (and favorite) tamale shop here. Took a bit of work, but was simple to do, and worth the time. Very easy to do, you just need a little time. If you are going to the trouble and effort you may as well make lots of tamales... I've done these with the lard and with crisco, the lard is better, so don't substitute. Delicioso! Muy Bueno!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~TxCin~ILove2Ck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T00:38:09.14Z",
                "reviewBody": "Good recipe! I used canola oil rather than lard and instead of using a can of beef broth I used broth from cooking the pork roast. I also used hot chili peppers to spice it up a little. They turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1965905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-04T17:56:03.937Z",
                "reviewBody": "I just had to comment on this one because I am mexican and have been making (helping make) tamales since I was about 5 yrs old. You'd be surprised how much a 5 yr old kid can do! We never used gloves to clean the chiles, just because it is so much faster when you don't. Of course, you are taking a huge risk with your eyes, but we all do it that way even still. We always boil onions and other spices with the chiles while they cook and add the onions to the blender too. We use the leftover meat liquid for the masa and we add a little baking powder and salt. We also add chile sauce to the masa! Big improvment on flavor if you do. Our test for if the tamales were done has always been to remove one (a bigger one, since they are less likely to be done) and try to pull the husk off. If it comes off clean, they're done.  And sour cream? That's...different. I'm not sure what it does. We've made beef, pork, chicken, chicken and cheese, chile and cheese and sweet tamales in my lifetime. For the sweet tamales, we mix raisins in the masa and the filling is a cream cheese mixture. Pretty yummy! :)\nAs for this recipe, I haven't done it, but i rated it anyway because it is PRETTY close to how we do it...and they would come out okay.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Chella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6582958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-21T22:49:05.733Z",
                "reviewBody": "Excellent!  I had a hard time spreading the masa on the husks.  I ended up using a moist corn husk to flatten/spread out the masa evenly. The review by Trptgoddess1 on 2/2004 was great and the mention by another review of using MASECA brand masa mix is great.  I also added more chicken bullion powder to my masa.  Try this...If you want to sample the flavor before making all of the tamales, just put a spoonful on a saucer and microwave for about 1 minute or so.  It kind of makes a tamale cookie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "galleria gal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1731128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-29T11:09:31.483Z",
                "reviewBody": "I had tried other recipes and had almost given up.This recipe is fool proof I've made it many times since running across it and it works every time.Depending on if I'm making beef or chicken,I use chicken or beef powdered bullion for the dough,I also mix dried parsley,onion powder and garlic powder, and a touch of cumin  -oh and some powdered ancho pepper.I use a product called Maseca there are two types I do not recommend using the one that lists making tortillas and a bunch of other things the type I use comes in a light peach coloured bag and says Maseca for delicious tamales.For some reason using the other stuff was disasterous for me and if I'm putting hours of labour into a recipe disaster is not an option! : )\r\nMy favourite way to make these is with cubed grilled chicken or steak, onions and three types of cheese and just a little bit of VERY mild green chiles'. Of course they're pretty good anyway you make them.I even started selling them to friends that kept bugging me to make them.Thank you so much Saddiecat for a delicious recipe and quite possibly a lucrative business!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAHCOLEMAN72",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1406663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T04:34:08.84Z",
                "reviewBody": "This recipe doesn't say what to do with the onion that cooked with the meat or the cooking liquid. Do you discard both? When you strain the chile mixture after blending what part are you throwing away? Why use a can of beef broth when you could use the cooking liquid? I have never made tamales before and I found the recipe instructions confusing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CAMMIE324",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/434636/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Real Homemade Tamales",
            "description": "There's nothing quite like authentic Mexican tamales. These are rich and satisfying.",
            "uploadDate": "2012-08-19T20:47:08.217Z",
            "duration": "PT6M13.54S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F8e1cde0f-0d56-4c22-bf5f-8a85aa2ff04e%2F30d26e6c-2d35-4e34-9b85-cc630cd03a79%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1794053210001"
        }
    }
]