[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1315/breakfast-and-brunch/cereals/oatmeal/",
                    "name": "Oatmeal Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/34815/mama-bears-porridge/",
        "name": "Mama Bear's Porridge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1024814.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2019-04-04T03:29:20.000Z",
        "description": "My Mama Bear made this for us all the time! Even oatmeal haters might like this version.  It's sweet and custardy, and keeps you full 'till lunchtime.  By the way, don't balk at the 'raw eggs' that get stirred in - the hot porridge cooks them completely. Bears prefer honey, but brown sugar can be used instead.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 cups water",
            "1 cup powdered milk",
            "1 ½ cups rolled oats",
            "½ teaspoon ground cinnamon",
            "½ cup raisins",
            "½ teaspoon vanilla extract",
            "3 eggs",
            "4 teaspoons butter",
            "1 cup milk",
            "3 tablespoons honey"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan, bring the water to a boil. Combine the powdered milk, oats and cinnamon; quickly stir into the boiling water. Return the mixture to a boil, then reduce heat and simmer for 5 to 10 minutes, or until the mixture is the desired thickness.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat and mix in the raisins and vanilla. Beat in the eggs one at a time, mixing well after each. The hot porridge will  cook the eggs completely. Divide the porridge between 4 bowls.  Top each one with a teaspoon of butter, 1/4 cup of milk , and drizzle with honey.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals",
            "Oatmeal Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BECKY M."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.53125,
            "ratingCount": 128,
            "itemReviewed": "Mama Bear's Porridge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "507.2 calories",
            "carbohydrateContent": "64.2 g",
            "cholesterolContent": "150.5 mg",
            "fatContent": "20.5 g",
            "fiberContent": "3.9 g",
            "proteinContent": "19.2 g",
            "saturatedFatContent": "10.4 g",
            "servingSize": null,
            "sodiumContent": "236.8 mg",
            "sugarContent": "39.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-14T05:01:59.217Z",
                "reviewBody": "I really love this!  I've made it several days in a row.  It's protein packed- far more than regular oatmeal, so it's a great energy boost for breakfast, and a good source of calcium with all the extra milk added.  I did leave the oatmeal on the burner for a minute or two after the eggs were added, so I was sure they'd cook.  I also omitted the honey during cooking because the first time, it burned.  My kids didn't like this (I thought I could sneak the eggs on them) but I love it. \r\n\r\nIt's a recipe you can play with too - I scaled it back to one serving and still added both eggs and it was really custardy and good.  If you like bread pudding and you like oatmeal, you'll like this. \r\n\r\nThis is also a great recipe for expectant moms like me, whose doctors recommend a very high protein breakfast and three glasses of milk a day for calcium (hard to get those in!) - this meets a LOT of those requirements into one really yummy breakfast! Thanks for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CALAMTYKEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/593605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-01T19:01:03.45Z",
                "reviewBody": "This recipe requires a little modification if you like your porridge thick instead of runny, that is why 4 stars instead of 5.  I added 2TBSP more oatmeal, and then still had to continue cooking on low after the addition of each of the eggs to reach my desired consistency.  However, at that point I was very pleased with the overall product.  I knew it wouldn't be sweet enough for my family, so I substituted 3 TBSP of brown sugar for the honey and mixed it in with the eggs. Then we sprinkled brown sugar on top... oh, and I used just a TBSP or so of half n half on top of each bowl instead of the quarter cup of milk.  Didn't have vanilla, so used a few drops of almond extract... and omitted the raisins as we don't like them.  It turned out delicious and I agree with the other reviewers, it packs an oatmeal breakfast with an extra protein punch so it sticks to your ribs!  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SPARKLER8666",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389869/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-17T01:39:58.133Z",
                "reviewBody": "My husband and I basically enjoyed this recipe but were put off somewhat by the flavor of powdered milk.  There is really no reason why powdered milk has to be used, so if I make it again I will either use regular (skim) milk or simply use water.  It would probably also be easier to beat the eggs into the liquid before heating.  Otherwise, if you aren't careful, you could end up with streaks of cooked egg throughtout your cereal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Arends Hansen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2380086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-02T22:42:37.687Z",
                "reviewBody": "When I was a kid I had to eat oatmeal for breakfast and I wasn't allowed to dress it up with sugar butter or even honey so for years the mere thought of oatmeal was enough to make me gag (I know I know Oliver Twist would've been quite pleased to eat my portion even without sugar) but when I saw that this recipe tasted \"custardy\" I had to give it a try. I'm glad I did! I used brown sugar instead of honey and I added 1/4 teaspoon salt. This will be great on cold winter mornings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAWANDMEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-03T14:26:21.17Z",
                "reviewBody": "Yum yum yum! I love this recipe! I omit the raisins and I also leave the porridge on low heat for an extra minute while I stir the egg in. I usually add extra cinnamon and sometimes nutmeg as well and at the end I add about 1/2 a chopped banana and sometimes honey or sweetener instead of the butter and milk. It comes out lovely warm and creamy and gives me energy! Thanks for a great recipe! I meant to say as well that I throw it all on the stove hop in the shower and when I come out voila - it's ready!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SESADLER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/418904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-26T15:30:13.66Z",
                "reviewBody": "This was definitely the best oatmeal I have ever eaten. I did change the recipe a little though. Since I was only making two servings I halved the recipe but used a cup of oats (I only had quick-cooking) added nutmeg and only used one egg (how are you supposed to put in half an egg??) The result was excellent and my husband liked it too. Will definitely make this many more times.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mrsknatterud",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2241218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-14T19:17:42.453Z",
                "reviewBody": "This was really good. I added more cinnamon (another 1/2 tsp) and I had to cook it a little longer to get it to a good consistency. The first time I made this I put the honey on it - it was great. Even my 3 and 5 year old boys liked it! The next time I made this I added wild blueberry preserves to my serving. It was soooo good - it tasted kinda like a blueberry muffin!! Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Yumalicious321",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3039029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-16T15:05:53.827Z",
                "reviewBody": "I have been eating this recipe every morning for about a week now. I have made so many different ways like with almondmilk with no milk at all with normal milk replacing the powdered milk with and without vanilla extract etc. The recipe is very versatile and i can change it depending on whatever I have in my fridge or feel like making. I fourth the recipe but keep the original amount of cinnamon every time. I love how creamy and delicious (esp with honey YUM) this recipe is!! I have never tasted any oatmeal quite like this!It has ton of protein which I need since I started P90x about 2 weeks ago and i love how it keeps me satisfied and full till lunchtime even if I don't eat lunch till 1 or 2.Thanks you so much Becky!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "healthnut13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6363611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-30T12:51:19Z",
                "reviewBody": "I'm eating it right now. Wonderful creamy taste. I made it wrong and it is still good I scaled it down to one and I had 2 eggs in my head so added 2 eggs instead of 3/4. So I just cooked it a little longer to make sure the egg was fully cooked. Used brown sugar instead of honey because I was out of honey. I'm sure it tastes great either way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Lynn Mehney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2535406/"
                }
            }
        ]
    }
]