[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1311/breakfast-and-brunch/cereals/granola/",
                    "name": "Granola Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/38294/sugar-free-granola/",
        "name": "Sugar Free Granola",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F344405.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:29:40.000Z",
        "description": "This granola recipe is tried and tested, I bring with me all my camping trips.  It also makes a very filling and delicious breakfast.  The only main ingredient in this recipe is the oatmeal, all the other ingredients can be substituted.  This recipe is made without adding any honey or sugar, although if you don't have any dates at of home you can always add 1/2 cup honey to the other ingredients.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "1 cup chopped dates",
            "1 cup water",
            "8 cups rolled oats",
            "½ cup chopped walnuts",
            "1 cup raisins",
            "1 cup wheat germ",
            "½ cup sunflower seeds",
            "½ cup slivered almonds",
            "2 cups shredded coconut",
            "¼ cup vegetable oil",
            "¼ cup frozen apple juice concentrate, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). In a small saucepan over medium heat, combine the dates and water. Cook stirring occasionally until the mixture forms a thick paste. Remove from heat and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the oats, walnuts, raisins, wheat germ, sunflower seeds, and coconut. Spread out in a thin layer onto a baking sheet. If your baking sheet is small, this can be done in batches.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 7 minutes in the preheated oven, or until lightly toasted. Transfer the mixture back into the bowl, and mix in the date paste, apple juice concentrate, and oil. Return to the baking sheet and bake for an additional 7 to 10 minutes, stirring occasionally until lightly browned. Granola will become more crispy as it cools. Store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals",
            "Granola Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ISADORE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.761904761904762,
            "ratingCount": 21,
            "itemReviewed": "Sugar Free Granola",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "404.8 calories",
            "carbohydrateContent": "53.3 g",
            "cholesterolContent": null,
            "fatContent": "19 g",
            "fiberContent": "9 g",
            "proteinContent": "9.9 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "10 mg",
            "sugarContent": "16.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-30T23:04:49.093Z",
                "reviewBody": "This is a tasty version of a less sweet granola.  Correct, this recipe doesn't have added sugar, therefore it could be labeled sugar free.  Correct, this recipe has plenty of natural sugar.  However it also has plenty of starch, both of which cause a blood sugar rise in a diabetic.  Diabetics, eat this granola with caution.  The recipe yielded 13 cups when I made it, as written.  I put it through a nutrient analysis and per 1/2 cup - 237 calories, 11 gms fat, 31 gms carbohydrate, 5 gms fiber.  Hope this helps, Karen, Registered Dietitian",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kalice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1233561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T08:22:31.123Z",
                "reviewBody": "This recipe based on date paste is really original. The only problem I had was with the baking time. I followed the directions carefully and my granola was soft and soggy. I had to bake it for an additiona 40 min or so stirring every 15 min and it became sufficiently crispy as it cooled. However the wheat germ also burned. I would recommend mixing the date paste mixture into the rolled oats (and nothing else) FIRST and THEN baking it at 275 degrees for about 30-45 min stirring every 1/2 hour. Then add the nuts seeds and wheat germ and bake for an additional 10-15 min. I wouldn't add the raisins until the granola has cooled completely or else the raisins may get further dehydrated and too hard and chewey. This recipe can indeed have no refined sugar if you you can find no sugar added dried fruit. For multigrain use a variety of grain flakes such as spelt oat barley triticale wheat and rye flakes. To increase the sweetness use 2 cups dried fruit (choose plump soft ones as leaving it in granola for a week or two dries it out - dried apples and pitted Deglet dates are my favorite). I also like to add flavor by mixing in vanilla extract or fresh orange zest cinnamon nutmeg cloves ginger and cardammom into the date paste. You can also replace part or all of the wheat germ with wheat bran (or other grain bran) and/or soy protein powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "berkeley girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1206564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-26T22:44:03.56Z",
                "reviewBody": "I'm not sure of what your idea of sugar free is? But this is pretty high in sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DLHARLESS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/454063/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-26T18:49:21.07Z",
                "reviewBody": "I was really excited about this granola recipe, but the results were somewhat disappointing. First of all, there was way too much oatmeal and not enough of everything else...some bites didn't taste like anything except dry oatmeal. I didn't have any sunflower seeds around, so I used another half cup of walnuts instead. Other than that, I made this exactly as written. Probably the biggest problem was that the raisins, which are put in right in the beginning, burned. They turned into little bits of hard, bitter charcoal. It wasn't tasty...I ended up picking them all out and stirring in fresh raisins. This improved the granola immensely, but it wasn't awesome. If you are going to make this, be forewarned! Decrease the amount of oats to about 6 cups, and put the raisins in while the granola is cooling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "larkspur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3097894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-09T01:01:30.327Z",
                "reviewBody": "Great recipe and although it has natural sugar it is indeed sugar free. Some may forget that coconut apple juice and dates do not contain sugar unless you buy the sweetened variety. This will definitely be something I make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JZieser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1891145/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T17:44:15.84Z",
                "reviewBody": "Delish!! This is the recipe I have been looking for. My husband and I are trying to cut out sugar- refined and things like honey syrup etc- so this recipe is perfect. Great nutty toasty flavour and just a hint of sweetness. Merci Isadore!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLEYCAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-12T21:06:20.513Z",
                "reviewBody": "I am always looking for recipes that my diabetic husband can enjoy and we both loved this one. While it has natural sugars they are not the refined type which cause spikes in his blood sugar. The dates while adding sweetness also add fiber which helps with blood sugar levels. I used no sugar added apple juice concentrate unsweetened coconut more nuts and seeds and less dried fruit. I loved that this recipes is very flexible regarding ingredients. I also baked it a bit longer than the recipes stated to achieve desired crispness. Thank you Isadore!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VJSHANER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1594742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-22T01:09:00.467Z",
                "reviewBody": "Pretty good. NOT sugar free though. Coconut has sugar in it dates bought pre-chopped generally have sugar on them and concentrate should send off little bells. I rinsed the dates really well let them sit a bit rinsed them again then made the paste out of them. For the coconut I also rinsed it until there was no sugar left on it and then toasted it seperately. For the apple juice I used apple juice not from concentrate and then added a bit of sugar substitute. Nothing I would eat plain but it's great with yogurt. I also found that I had to go through and re-bake at 3rd time to make it toasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "HJHOEGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/793759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-22T01:05:05.687Z",
                "reviewBody": "This recipe is WONDERFUL! I've been mixing it up a little... Replacing the date/water paste with a prune/apple cider paste...Adding flax seeds for more nutrition... This makes a GREAT cereal (hot or cold) served with the left over apple cider to add sweetness instead of just plain milk or water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSICALEE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1258636/"
                }
            }
        ]
    }
]