[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/150/breakfast-and-brunch/meat-and-seafood/",
                    "name": "Meat and Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2426/breakfast-and-brunch/meat-and-seafood/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45652/the-sarges-goetta-german-breakfast-treat/",
        "name": "The Sarge's Goetta - German Breakfast Treat",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F10779.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2019-04-04T03:30:26.000Z",
        "description": "This is of German origin, and I have never seen it anywhere except in the Greater Cincinnati Metro area. I typically make this once a year when winter is coming. To serve, slice into thin slices and fry like bacon.",
        "prepTime": "P0DT5H0M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT6H30M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "3 quarts water",
            "2 tablespoons salt",
            "2 teaspoons ground black pepper",
            "5 cups steel cut oats",
            "2 pounds ground beef",
            "2 pounds ground pork sausage",
            "2 large onions, finely chopped",
            "¼ cup cooking oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring water, salt, and pepper to boil in a slow cooker set to High. Stir in steel cut oats, cover, and cook 90 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix beef, pork, and onions. Stir into the oat mixture, and reduce heat to Low. Cover, and continue cooking 3 hours, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the mixture to a medium baking pan, and cool until semi-solid. Turn out onto wax paper, and chill 1 hour in the refrigerator, or until firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large, heavy skillet over medium high heat. Cut the refrigerated mixture into thin slices. Cook slices one at a time in the heated oil until evenly brown.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Meat and Seafood",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sarge"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5607476635514015,
            "ratingCount": 107,
            "itemReviewed": "The Sarge's Goetta - German Breakfast Treat",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "510.7 calories",
            "carbohydrateContent": "29 g",
            "cholesterolContent": "69.5 mg",
            "fatContent": "35.6 g",
            "fiberContent": "4.3 g",
            "proteinContent": "18 g",
            "saturatedFatContent": "12.4 g",
            "servingSize": null,
            "sodiumContent": "1036.3 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-13T16:26:24.36Z",
                "reviewBody": "Wow! this is probably more \"Cincinnati\" than Skyline Chili! Taste great fried extra crispy & served with eggs-your-way.\nIt is interesting to note that almost all larger meat-packing-cities with significant ethnic populations have come-up with some version of this dish. It is bassically a \"poor-man's sausage\", geberrally using soome knid of grain as a \"filler\" (think \"Hamburger Helper\").\nThe addidtion of cooked oats can stretch a little bit of pork & beef a long way! (originally the early immigrants would use those cuts of meat unwanted by the meat packers, i.e. neck bones, etc. \nGoetta could be fried in the morning and packed as a sandwich for the guys going out to earn a living.\n\nTry this recipe for a real authentic German/American treat!\n\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sgt.Rock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/245670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-09T14:35:47.067Z",
                "reviewBody": "Just like my mother used to make back in Cincy! I don't cook mine nearly as long as shown in the recipe. I found the oatmeal (steel cut) in the health foods section at Krogers. I have cut back on the amount of water as it gives the goetta a thicker consistency that makes it easier to fry. I also line the bread pan with wax paper that allows me to remove it from the pan and makes it easier to slice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1661170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-09T21:03:13.17Z",
                "reviewBody": "This stuff is good!  I think it might be an acquired taste though because the more I ate the better it got, and the crispier it was the better too.  Very easy to make it just takes quite a long time.  I think next time I'll probably cut back on the cooking time for the steel cut oats because I had about an inch stuck to the bottom of my crock pot when I finished the 90 minutes.  Also, it might be easier to take all the ingredients after the oats are cooked, and mix them in a large bowl before transferring them back into the crockpot because it was hard to mix all together in the crockpot.  I just went ahead and refrigerated this overnight because it took so long we went out to eat and I finished cooking the goetta the next morning.  I might consider trying to cut this recipe in half next time because it makes a ton.  I'm used to making big meals, but this was just overwhelming.  It completely fills the crockpot.  And when your only cutting thin slices to fry it goes a long way.  I'm thinking about freezing the leftovers.  I'm not sure if that will work out in the end, but it's worth a try.  If you like to cook and don't mind the time it takes, and like to try new things, especially foods from Germany, Hungary, Poland, ect. try this I think it's worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Billie Renee Stacy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-18T17:54:46.94Z",
                "reviewBody": "My husband was very skeptical when he saw how much was in the crock pot and no matter what I told him about the rave reviews this recipe receives convinced him that it would taste like his favorite (Gliers)- until he tried it the next morning!  He said it was delicious.  Since it made so much, I gave my dad a 'loaf' and he says it's the best he's ever had.  I usually don't fry my goetta in oil or butter, but rely on the fat in the product.   I'll use butter or a little bit of oil next time since the fat was absorbed by the oats.  I had little refrigerator space and it was late when the product finished cooking, so I put the mixture into a 9 x 13 pan, evened it out and let it cool off a bit at room temperature before putting it into the refrigerator.  The next morning, I turned it out onto waxed paper and cut it into 3 loaves.  I plan to freeze the 3rd- but next time, I'll cut the recipe in half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T20:15:32.843Z",
                "reviewBody": "I am a big goetta fan and this is pretty close. I added some crushed red pepper to give it a little heat without changing the taste. Another thing don't use anything other than just plain pork sausage or you will alter the true authentic taste. A lot of people commented that it would fall apart. I believe the problem is that there is no gelatin in the mix to hold it together. Recipes handed down within families call for the boiling of either a pork shoulder or butt with the bone and then using that broth for your \"steel cut\" pin oats. The boiling of the meat (bone) produces the gelatin that ultimately keeps it together. Its a little more work having the grind the meat and all but the outcome is significant.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "klecknsr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4724212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-05T23:27:41.11Z",
                "reviewBody": "This recipe is great!  It is easier, just as tasty, and has a better consistancy than our stovetop recipe.  To fit in our crockpot, we halved the recipe.  Also, we added 1 Tbsp of Mrs. Dash table blend to enhance the flavor.  (You can also sprinkle it on the finished product to see if you like it.  We highly recommend it.)  We also cooled it completely in the pan, turned it onto a cutting board, cut it into usable portions, and froze them for easy use.  Thanks for a fabulous recipe that is absolutely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hokiecook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1846657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-16T14:21:06.03Z",
                "reviewBody": "Tried this.  Worked great.  Did make a few changes.  Used only pork (meat from pork neck bones cooked for 2 hrs).  Added 1 bay leaf and 1/2 tsp. sage.  As good or better than Gliers in Cincinnati, OH.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peg V.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2207420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-22T15:44:44.95Z",
                "reviewBody": "I am from cincy also and raised om grandmas recipie. Now I am 31 and will be taking over the duty of making this time honered classic.Love the stuff and cant get enough",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LRRP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-22T17:24:23.543Z",
                "reviewBody": "My husband’s grandmother born in 1900 made the stove top Goetta well into her 90’s.  I must admit I was a little skeptical when shortly after our wedding she gave me a pan to fix for him.  I have since come to love it.  She generally used pork, but was also known to mix in beef and even chicken.  In later years she used greased aluminum mini loaf pans to cool and then freeze her goetta.  I enjoy my goetta with eggs and toast.  My husband prefers his just like his grandma, served on fresh bread drizzled with syrup.  Thank you so much for a simpler way to bring our children a little family heritage at the breakfast table.  I have introduced much of my extended family to goetta and now many of them love the stuff too.  We have even had get togethers in the fall just to make large batches of the stove top kind.  I can’t wait to share this recipe with them so they can enjoy goetta anytime.  By the way, we’re from Indiana.  I have had questions about the oats before.  We use Dorsel’s Pinhead Oatmeal.  Thank you again Sarge!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NATUREMAMA1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1460259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T20:22:29.027Z",
                "reviewBody": "I even tried using the \"mess\" for meatloaf to salvage the meat in it and it was hopeless. I have no idea how anyone can slice this. Also I halved the recipe and it's a good thing because my large crock pot was filled to the max once the oatmeal cooked. This must be an aquired taste. The texture was just horrid. Perhaps about one-fourth the quantity of oatmeal would make it better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JulieCC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/juliecc/"
                }
            }
        ]
    }
]