[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46078/smothered-beef-liver/",
        "name": "Smothered Beef Liver",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1044341.jpg",
            "width": 962,
            "height": 960
        },
        "datePublished": "2019-04-04T03:30:29.000Z",
        "description": "If you like liver, you will LOVE this way of cooking it. Easy and delicious. If you don't like liver, try this and you might learn to LIKE it.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 tablespoons vegetable oil",
            "1 large onion, sliced",
            "1 pound beef liver",
            "½ cup all-purpose flour",
            "1 teaspoon salt, or to taste",
            "¼ teaspoon ground black pepper, or to taste",
            "1 (8 ounce) can tomato sauce",
            "¼ cup water",
            "½ teaspoon dried oregano"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a large skillet over medium heat. Saute onions until soft, but not browned. Remove from pan using a slotted spoon, and set aside. Slice the liver into serving size pieces, and remove any membrane.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a shallow dish, mix together the flour, salt and pepper. Dredge the liver in the flour mixture, and place into the hot skillet. Brown the liver quickly on each side. Place reserved onions on top of liver pieces. Pour the tomato sauce and water over everything in the pan, lifting the liver pieces to let the tomato sauce coat the bottom of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle the oregano over everything, and simmer over low heat for 8 to 10 minutes, stirring occasionally. Adjust salt and pepper to taste. Be careful not to overcook, or liver will be tough. I serve this with mashed potatoes and green beans.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PATTY MAE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.313432835820896,
            "ratingCount": 67,
            "itemReviewed": "Smothered Beef Liver",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "329.8 calories",
            "carbohydrateContent": "23.1 g",
            "cholesterolContent": "312.1 mg",
            "fatContent": "14.7 g",
            "fiberContent": "2 g",
            "proteinContent": "25.9 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "955 mg",
            "sugarContent": "3.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-06-04T05:54:42.263Z",
                "reviewBody": "I made this recipe up after eating everyone else's dried out liver. This is a great way to make liver, but DON'T OVERCOOK. The recipe doesn't state to simmer with a cover on, but please do this so the sauce will not reduce very much. Also, keep the flame on low while simmering. Good luck and I hope you like this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATTY MAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-07T07:46:51.95Z",
                "reviewBody": "If you don't like beef liver, you probably have always had the moisture pan fried out of it and then topped with greasy onions.  This method is the ONLY way to eat liver: dredged in flour, browned quickly, then braised low heat briefly in liquid.  Try it with tomato soup if you don't have sauce, or season it like swiss steak.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNTHIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-25T20:33:12.683Z",
                "reviewBody": "This is soo yummy! Not to meantion easy! Instead of using regular tomato sauce I used garlic tomato sauce! Iv never had such soft liver. mmmm...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2913222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-12T20:58:56.873Z",
                "reviewBody": "I love beef liver and nothing is better then beef liver smothered. I make this once a week for breakfast or dinner. I change it a bit by using the oil in the pan after frying then add a little more flour with water to make a brown gray mix with the liver. great with rice and peas or dinner or grits and eggs for breakfast. family favorite and its a healthy meal as well. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "akblkbarbie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2290969/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-04T05:34:25.92Z",
                "reviewBody": "I try to be liberal in my reviews of recipes that turn out badly but this recipe simply has no redeeming qualities. And before you jump to conclusions yes I like liver. This recipe simply did nothing for it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIEKID",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/263147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-14T00:35:46.01Z",
                "reviewBody": "This was really good, but for liver to be really tender and lose the strong flavor it needs to be marinated in plain or nonfat MILK for at least 15 or up to 60 minutes.  This takes all the nasty strong flavor out, makes it fork tender and will be delicious any way you cook it.  I used to hate the taste of liver, but once I discovered this secret, I can now eat it just seasoned with a little garlic salt & pepper & quickly pan fried in oil oil & butter (and put into a sandwich).  Do this before any type of preparation and it will be DELISH!!  As a side note; I have even left it sitting in milk overnite because after I started to prepare it I got a last minute invite to go out, and it was still wonderful the next day!! I just put plastic over the bowl & popped into the fridge... It was So tender & Yummy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bonitadeb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5237908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-10T05:31:16.907Z",
                "reviewBody": "I am one of the rare breed who loves liver--beef and chicken. I don't eat anything pork so pork liver is not in the race; but I do like beef and chicken liver and I like variety (it is after all the spice of life). I like this recipe; but as Patty Mae pointed out the pan should be covered while simmering the sauce and liver together. Also I used butter instead of vegetable oil for sauteing the onion. Olive oil is another good choice. I avoid vegetable oil because of the GMO factor; and butter or olive oil are much healthier not to mention much tastier alternatives to vegetable oil. Liver and other organ meats are consumed for their health benefits (Vitamin A Vitamin B6 Vitamin B12 Folate Riboflavin Niacin Iron Copper Omega-6 Phosphorus Selenium Manganese and Zinc in this case) so it makes sense to use a sauteing medium that is also healthy. Butter provides selenium iodine vitamin A and other nutrients that vegetable oil does not. Butter is also a good source of good cholesterol and glycospingolipids which help protect the stomach from gastrointestinal infections. Olive oil helps to put HDL and LDL cholesterol into a healthy balance as well as being anti-inflammatory. Coconut oil is another good oil to use because of its anti-fungual properties. I also use organic tomatoes. So substituting butter olive oil or coconut oil for the vegetable oil and using organic tomatoes make this already VERY healthy recipe even healthier and tastier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlSwilling",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12361302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-11T23:21:10.903Z",
                "reviewBody": "I have never bothered to rate recipes I use. But this one deserves my opinion. I and my family are use to the old time recipe of lots of onion and bury it in gravey. This was a great change and excellent taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cindi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487755/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-22T23:32:53.54Z",
                "reviewBody": "We love the traditional Liver and Onions buried in brown gravy, but I decided to try this recipe. DELICIOUS AND SO TENDER.  I may make the traditional type of dish as a change, but this is definitely going to be my favorite way to prepare liver and onions.   I did make a few changes due to using what I had on hand:  Used can of tomato soup and 1/4 cup water (misread the recipe).  I mince/freeze 2 onions to a quart bag, so I used a bag of minced onions. Didn't have oregano, but substituted Italian seasoning and added 1/2 tsp of garlic powder.  I told my husband that we were having ITALIAN BEEF LIVER.  He also loved the flavor and tenderness of the liver.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Kerley Myers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/948920/"
                }
            }
        ]
    }
]