[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/34759/beef-tamales/",
        "name": "Beef Tamales",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F54942.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:44:12.000Z",
        "description": "These are just like the tamales my Abuelita used to make for special occasions. This recipe makes a lot, but if you're going to go to all the trouble of making tamales from scratch, you might as well have a party! You will need butchers' twine and a large pot with a steamer basket to make these. May be frozen up to 6 months in heavy-duty resealable plastic bags. To reheat, thaw in refrigerator and then steam or microwave until heated through.",
        "prepTime": "P0DT5H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT6H30M",
        "recipeYield": "6 dozen tamales",
        "recipeIngredient": [
            "4 pounds boneless chuck roast",
            "4 cloves garlic",
            "3 (8 ounce) packages dried corn husks",
            "4 dried ancho chiles",
            "2 tablespoons vegetable oil",
            "2 tablespoons all-purpose flour",
            "1 cup beef broth",
            "1 teaspoon cumin seeds",
            "1 teaspoon ground cumin",
            "2 cloves garlic, minced",
            "2 teaspoons chopped fresh oregano",
            "1 teaspoon red pepper flakes",
            "1 teaspoon white vinegar",
            "salt to taste",
            "3 cups lard",
            "1 tablespoon salt",
            "9 cups masa harina"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place beef and garlic in a large pot. Cover with cold water and bring to a boil over high heat.  As soon as water boils, reduce heat to a simmer and cover pot. Let simmer for 3 1/2 hours, until beef is tender and shreds easily. When beef is done, remove from pot, reserving 5 cups cooking liquid and discarding garlic. Allow meat to cool slightly, and shred finely with forks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, place corn husks in a large container and cover with warm water. Allow to soak for 3 hours, until soft and pliable. May need to weight down with an inverted plate and a heavy can.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Toast ancho chiles in a cast iron skillet, making sure not to burn them. Allow to cool and then remove stems and seeds. Crumble and grind in a clean coffee grinder or with a mortar and pestle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet. Mix in flour and allow to brown slightly. Pour in 1 cup beef broth and stir until smooth. Mix in ground chiles, cumin seeds, ground cumin, minced garlic, oregano, red pepper flakes, vinegar and salt. Stir shredded beef into skillet and cover. Let simmer 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place lard and salt in a large mixing bowl. Whip with an electric mixer on high speed until fluffy. Add masa harina and beat at low speed until well mixed. Pour in reserved cooking liquid a little at a time until mixture is the consistency of soft cookie dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain water from corn husks.  One at a time, flatten out each husk, with the narrow end facing you, and spread approximately 2 tablespoons masa mixture onto the top 2/3 of the husk. Spread about 1 tablespoon of meat mixture down the middle of the masa. Roll up the corn husk starting at one of the long sides. Fold the narrow end of the husk onto the rolled tamale and tie with a piece of butchers' twine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place tamales in a steamer basket.  Steam over boiling water for approximately one hour, until masa is firm and holds its shape. Make sure steamer does not run out of water. Serve immediately, allowing each person to unwrap their own tamales. Allow any leftovers (still in husks) to cool, uncovered, in the refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "jenn"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.457286432160804,
            "ratingCount": 199,
            "itemReviewed": "Beef Tamales",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "346.8 calories",
            "carbohydrateContent": "23.3 g",
            "cholesterolContent": "38 mg",
            "fatContent": "24.4 g",
            "fiberContent": "3.2 g",
            "proteinContent": "9.1 g",
            "saturatedFatContent": "9.1 g",
            "servingSize": null,
            "sodiumContent": "247.6 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-16T18:00:36.877Z",
                "reviewBody": "I have made these a few times now. This recipe is really awesome as is - but I found an easier & tastier way to do it after making it many times the way listed. I use the recipe on this site for Charley's Slow Cooker Mexican Style Meat. Its very easy to make, & makes the tamales SO much tastier! I make the meat one day in the crockpot, then refrigerate it overnight.  This makes it easier to remove any fat. Just pluck off any fat the next morning & follow the recipe for the tamale dough, although I use vegetable shortening instead of lard. Make sure to keep a little water or beef broth on hand to dip your spreading knife into to make spreading the dough onto the corn husks a little easier. If you put a can of beef broth in the stockpot with a little water while you are steaming them, it makes the dough tastier as well.\nInstead of using butchers twine, I just tear off thin strips of the corn husks & tie them with that.  \n\nThese are really good to freeze too. Place in a freezer bag, and pop in the freezer for up for 6 months.  To reheat, steam for 15-20 mins or wrap in a damp paper towel & microwave for 3-7 mins, depending on the microwave.  Steaming them will produce a moister tamale.  To reheat refrigerated tamales, wrap in a damp paper towel & microwave for about 1-2 mins.  You could also steam them for about 5 mins.  Make sure you leave the corn husk on while reheating!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsHappyHomemaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T21:40:13.56Z",
                "reviewBody": "if you have never attempted tamales, here are some important tips:  boil garlic and dried or fresh peppers in water(your favorite kind of pepper)for 30-ish minutes then cook the meat in that broth(leave peppers/garlic in) and add lots of spices.  This broth flavors the meat very well--I like spice so I use tons of peppers and garlic.  The meat should be cooked long enough that it practically crumbles to the touch--this makes it easier and faster to shred by hand--I usually cook mine 4 hours to overnigt depending on the cut of meat.  Boiling the meat is actually the only thing it needs cooking wise--but it depends on whether you boil in the meat in all the spices or add them later.  I soak my corn husks in hot/boiling water--this makes them softer faster.  Two important things to remember: masa is very bland and there is no substitute for lard!  I keep my meat juice for masa flavoring but still add other stuff--El Pato (mexican style tomato sauce)if you can find it is spectacular!  When making the tamales, the corn husks should only be about five inches across--any larger need to be sized!  (Line the meat along the edge and roll like a cigar)  If I plan on freezing I cook them only half the time--also, don't load to many in the steamer or they won't cook evenly!  When you place them in the steamer they need to be standing up as much as possible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRPTGODDESS1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/504136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-08T16:52:26.237Z",
                "reviewBody": "A little advice about mixing masa: add the lard to your dry ingredients and mix very well by hand. Begin adding your meat broth a little at a time until you get peanut butter consistancy, and to be really sure your batter is ready, drop a bit into a glass of water. If it floats to the top, it's ready.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAWNWALKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/828932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-05T19:01:35.733Z",
                "reviewBody": "A cultural note for everyone who says the tamale recipes take too long.  Traditionally a family will have a \"tamalada\"- a get together where family will work together assembling the tamales.  Making tamales is a time consuming process but when you do it this way, you will have an opportunity to visit with family and develop family bonds.  (It is great with friends too...)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZACATECAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1202413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-06T21:55:39.81Z",
                "reviewBody": "This was my first attempt at making Tamales. Instead of combining the masa lard and salt myself I went to the local Hispanic grocery store and bought a 5lb bag of prepared masa. I put 4 1/2 cups of water with the chuck roast. I had 5 cups of beef stock after the roast was cooked. I boiled the stock down to 1 1/2 cups and mixed it in with the prepared masa to get the consistency required. I used a single 8 oz. package of husks with plenty left over. This recipe was not a waste of time. I prefer a little more flavor and a lot more heat than what was in this recipe but then my wife and son would not have been able to enjoy this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SANDRASG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T17:45:09.133Z",
                "reviewBody": "This recipe is a good one but two other things should be mentioned when making Tamales, the corn husks must be very clean from the corn silk and when the Tamales are ready to be steamed they should not be standing in water or the water level should be just below the steamer rack. Also the tamales should be covered with a clean dry dish towel before the steamer lid is added. This helps keep the moisture from steeping out. I have made tamales my whole life with my mother ,grandmothers, aunts and sisters and when the steamer needs more water added we add boiling water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3596676/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-18T06:03:55.827Z",
                "reviewBody": "This is a good recipe.  It's easy, but very time consuming.  Instead of steaming the tamales by laying them down in a basket, try inverting a bowl in a large pot and standing the tamales on end around the bowl to create a funnel effect.  It's faster and easier!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/372435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-08T18:43:43.093Z",
                "reviewBody": "I loved this recipe! It was a bit time consuming but well worth the effort. Everybody who tried them loved them even those who have lived in Mexico for a couple of years. I scaled up the meat part of the recipe to use 6 lbs of rump roast (it was on sale:) and cut back the masa recipe to use 1 lb of lard and 6 cups of the corn meal masa mix. I also boiled down the water the beef cooked in so it would add more flavor to the masa when it was added. I added 2 tsp of salt to this amount of masa and 1 Tbsp to the meat mix and it turned out really well. I ended up using 1 8-0z package of corn husks all of the masa that I had made and about 1/2 of the meat for about 4 doz tamales. I have the rest of the meat frozen so it will be easier to make next time. I had a big pot and was able to fit all the tamales in (they were a little tightly packed) and steamed them for 2 hours to make sure they were done. The masa turned out nice and light and oh so tasty! Next time I think I'm going to double the amount of ancho chiles used to make them a little spicier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kajmerr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1499663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-28T02:38:01.157Z",
                "reviewBody": "Well tamales are never easy to make but this recioe made it not very complicated..thank you! What a wonderful taste to the meat. I simmered the meat in a crock pot overnight so it made the process one step better. I used more chilis and more cumin just because I prefer more heat. It turned out great. More stock is needed when making the masa harina to make it not so dry when cooked. Be sure to get friends involved in the process...it's an ALL DAY EVENT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/223541/"
                }
            }
        ]
    }
]