[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15328/main-dish/savory-pies/pasties/",
                    "name": "Pasty Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46981/pasties-ii/",
        "name": "Pasties II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4476058.jpg",
            "width": 1936,
            "height": 1937
        },
        "datePublished": "2019-04-04T03:30:35.000Z",
        "description": "A traditional Upper Peninsula of Michigan treat! Complete with rutabaga! I am from the UP and this is the real deal! Rub pasties with a little milk for a golden color.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 ½ cups all-purpose flour, sifted",
            "1 ½ teaspoons salt",
            "1 cup shortening",
            "1 cup cold water",
            "1 pound boneless round or chuck steak, cut into 1-inch cubes",
            "2 potatoes, peeled and cubed",
            "1 onion, chopped",
            "¼ rutabaga, cubed",
            "1 carrots, diced",
            "salt and pepper to taste",
            "6 tablespoons margarine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine flour and salt. Cut in shortening until mixture resembles coarse crumbs. Stir in water until mixture forms a ball. Shape into a ball. Wrap in plastic and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine meat, potatoes, onion, rutabaga and chopped carrots. Season with salt and pepper. Divide dough into six pieces, and shape into balls. On a lightly floured surface, roll each ball into a 6 inch round. Place approximately 1 cup filling on one half of each. Dot each with 1 tablespoon margarine. Draw the other half of the pastry over the filling. Crimp edges to seal in filling. Prick with a fork and place on prepared baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Pasty Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RaiderMom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.626373626373627,
            "ratingCount": 182,
            "itemReviewed": "Pasties II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "887.1 calories",
            "carbohydrateContent": "72 g",
            "cholesterolContent": "47.6 mg",
            "fatContent": "55.3 g",
            "fiberContent": "4.5 g",
            "proteinContent": "25 g",
            "saturatedFatContent": "14.3 g",
            "servingSize": null,
            "sodiumContent": "762 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-26T01:48:11.937Z",
                "reviewBody": "Pasties actually originate in Cornwall, England. This recipe is pretty close to the pasties my mom and Grandma used to make. It was a mortal sin to use carrots though. They always used Swede (Rutabaga)/ Swedish turnip. For the reviewer who has trouble with pastry, me too! I use frozen pie shells, let them get to room temp or even a litle warmer before filling one side with your ingredients. Also, we always use a peeler to scrape the potatoes and rutabaga, then it is thinner and cooks more thoroughly. We pile the ingredients on top of each other starting with potatoes, rutabaga, onions, beef and salt and pepper. Putting the beef on top allows the juices to soak into the vegetables as they cook. I love pasties!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1749239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-27T02:28:40.117Z",
                "reviewBody": "This is a great recipe. I made it exactly as is. For those who thought it was bland the beauty of pasties - they can be adjusted to your tastes by adding other meats, spices, and herbs. Many people eat them with ketchup.\nIf you have a hard time working with pie crust two pieces of cellophane can solve that problem. Roll the dough out between the two sheets. When the dough is the thickness and shape you need remove the top sheet and proceed to fill. Then use the bottom sheet of cellophane to fold over the pasty. Again great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karisma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/karisma/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-05T00:11:01.757Z",
                "reviewBody": "My dad hails from Escanaba Michigan and this is exactly how my Mom and I make them, down to the butter on top for extra moisture! Also, thanks for the tip on rubbing the tops with milk we've never tried that!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2364289/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-22T04:51:11.577Z",
                "reviewBody": "As a yooper for most of my life, I have to say that the traditional U.P. pasty is made with ground beef, usually hamburger as it adds more flavor.  When purchasing a pasty this is the usual form.  It adds much needed moisture to the pasty so it won't be too dry.  Also, I can't imagine a pasty without carrots as one viewer mentioned that they don't belong.  Some people use ground pork along with the traditional ground beef but most don't like the pork either.  The U.P. pasty, though similar to the cornish pasty, was made for the miners to take with them to work in the mines because they filled the men up and were very portable.  The best toppings for a pasty are catsup and/or mustard of course, but some use gravy which, personally, I don't care for.  My uncle used to come up from Green Bay every summer and he used to pour dill pickle juice on them.  It actually isn't too bad as long as you don't use too much.  Hope this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "yooper62",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2652729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-04T18:44:00.627Z",
                "reviewBody": "My Grandparents immigrated from Finland to the U/P in MI and I grew up eating this style of Pastie. I put meat layer on top to flavor veg's underneath as they bake. I use stew meat (diced small) season it, mix with tblsp of worchester, 2 tblsps of pepperoncini juice, a tblsp of ketchup and let it sit overnight in fridge. I dice all veggies fairly small also. I sometimes use the pre-made pie dough as a shortcut (even got my Finnish Dad to use them) and it's \"almost\" as good but not authentic. I make my pasties a bit smaller for easier handling. I don't have an issue\" w/adding minced carrots or more seasoning (although rutabega is a key component). It's the end results that matter. If you can find a small rutabega, it's easier to cut up. I add garlic & dried thyme/parsley to meat and veg layers for a little extra flavor and top it off w/butter bits. Don't \"overfill\" or your crust will tear. I make 3 slits on top and spoon small amounts of beef stock into the slits 10 - 15 minutes b4 pasties are done for added moisture. I always make extra: allow pasties to cool & freeze in individual foil wrapped portions. If your not familiar with Pasties, you may not like them. In MHO these should be eaten w/ketchup, not gravy. Hope of my thoughts helped.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MakeItWork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/makeitwork/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-05T14:41:16.607Z",
                "reviewBody": "Very good and looks beautiful.  I sprinkled the meat mixture with powdered gravy mix, added 2T of water and a generous dose of Worcestershre Sauce.  A hit with the kids so it is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SHILLABILA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/571960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-03T21:00:39.31Z",
                "reviewBody": "I have had these for years, my Dad was from Northern Minnesota.  We don't put the carrots in.  Put a couple of slabs of butter on top of the filling before putting the pie dough over and cut a couple of slits in the pie dough also.  You can also make these for breakfast with cooked sausage scrambled eggs and cheddar cheese WOW are they good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOLAN41",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1057465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-30T00:37:15.727Z",
                "reviewBody": "Extremely similar to my family's pasty recipe. They are from the \"UP\" and have passed their recipe down for at least 4 generations, that I know of. Pasties are real comfort food and quite delicious, even if they can be a bit \"heavy\" of a meal. Will make again , but I like to try different fillings too. (such as chicken and brocolli, turkey & artichoke, etc.) Pasties vary from family to family... but are delicious with or without carrots, with ground meat or cubed, with pre made crust or hand made, with or without rutabaga, etc. Just choose the fillings you like and don't forget to \"dot\" with butter before you seal them up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-20T19:55:02.98Z",
                "reviewBody": "My family went to the UP this summer for the first time. It was fabulous and so were the pasties we enjoyed there. This recipe tasted exactly like the pasties we ate while sitting on the shore of Lake Superior. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catherine Marsh Gruda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/722608/"
                }
            }
        ]
    }
]