[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/253/everyday-cooking/slow-cooker/",
                    "name": "Slow Cooker",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17253/everyday-cooking/slow-cooker/main-dishes/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1201/everyday-cooking/slow-cooker/main-dishes/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/47141/red-wine-flavored-beef/",
        "name": "Red Wine Flavored Beef",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9299993.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-04T03:30:36.000Z",
        "description": "Easy to do beef entree in a slow cooker.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup red wine",
            "1 cup water",
            "4 pounds beef roast",
            "½ (1 ounce) envelope dry onion soup mix"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the red wine, water, and beef roast in a slow cooker. Season with dry onion soup mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook 5 hours on Low.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Slow Cooker",
            "Main Dishes",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "THUNDERSTRUCK625"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.161290322580645,
            "ratingCount": 93,
            "itemReviewed": "Red Wine Flavored Beef",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "759.8 calories",
            "carbohydrateContent": "1.9 g",
            "cholesterolContent": "158.8 mg",
            "fatContent": "61.9 g",
            "fiberContent": "0.1 g",
            "proteinContent": "40.7 g",
            "saturatedFatContent": "26.5 g",
            "servingSize": null,
            "sodiumContent": "272.3 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-18T15:20:58.937Z",
                "reviewBody": "I had my doubts but this was delicious! I used cabernet sauvignon & used all wine eliminating the water & adding about half a cup of beef broth... used the whole packet of onion soup added rosemary & fresh pepper per suggestions by others. I added a a half a bag of frozen pearl onions the last hour (next time I will add a whole bag..they were GOOD) & then reduced the wine sauce w/ the drippings & thickened it w/ some cornstarch mixed in water. I mixed egg noodles w/ butter & italian seasoning put a little wine sauce on top sliced the roast & drizzled a little wine sauce on that plated the roast next to the noodles garnished w/ a bit of fresh chopped parsley & served it up w/ some glazed carrots. This made a good enough presentation to serve to company. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-04T19:46:03.687Z",
                "reviewBody": "I LOVE this mixture of flavours and I do it all the time so when I saw this recipe I thought I'd put in a good word for it. I will use the whole package of onion soup mix and perhaps double the wine (You cannot go wrong with using more wine!) and sometimes I will marinate the roast overnight in the crockpot too. (try throwing in some rosemary and black pepper too) I'll let the roast rest for a while before serving and thicken the juices after skimming the fat off and transferring to a saucepan. Leave all the tasty bits in your gravy they're so good! It doesn't get much easier than this or much tastier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOOCHIECAT5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/630073/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-08T23:31:18.47Z",
                "reviewBody": "As written this recipe would probably only be a 3 for me primarily because I think water doesn't add flavor and too much salt because of the onion soup. So with that precept and the suggestions of others I made the following changes: swapped out a can of beef broth for the water decreased the wine to 1/2 c (I used an Australian merlot) added 2 fresh bay leaves a can of sliced mushrooms (though I admit fresh would be have been better!) a can of mushroom soup 4 carrots chunked some thyme. I sifted the onion soup to separate the seasonings from the dried onions used the dried onions added more and used only half the seasoned salt. I cooked for the recommended time and I'll tell you what...this was absolutely maddeningly delicious! We loved it and can't wait to have it again!!! Thank you for a good basic recipe and great suggestions from others on which I built my own. I couldn't have done it without you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATYPI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2074840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T14:06:32.827Z",
                "reviewBody": "This turned out excellent for our family. Per other reviews I use a whole packet of onion soup mix added some rosemary and during the last hour of cooking I added some brown sugar overall which really enhanced the red wine taste. The meat was very moist and we all thought is was very flavorful! A bonus is that this recipe takes only minutes to prepare!! Thanks Katie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-12T13:42:34.153Z",
                "reviewBody": "I thought this recipe was a good basic idea but needed some more flavor added. So to the red wine & onion soup mix I added dried rosemary dried parsley celery salt worcestershire sauce and a few whole cloves of garlic. I thought it came out pretty good but my husband actually raved about it which he rarely does.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lois Lane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/571473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-18T17:32:58.92Z",
                "reviewBody": "Just OK in my book. I made it with one cup of Sangiovese wine and used one cup beef broth instead of the water based on other reviews. I also put fresh ground black pepper garlic powder and fresh chopped rosemary on both sides of the roast per other's reviews. I used the whole packet of dry soup mix I like lots of flavor and cooked it on low for about 6 hours. I did seem done at about 5 but my husband wasn't home yet and I figured it would just get softer as time went on. At the 5 hour mark I tasted it and it seemed BLAND. I couldn't believe it. It tasted like it needed some depth. I dug out a jar of beef demi glace added a few spoonfuls grabbed my jar of dehydrated slivered garlic and threw some in and dumped in a jar of sliced mushrooms. It really needed a lot of doctoring up in my opinion. The demi glace (from Williams Sonoma) really is what made it MUCH better. It did fall apart nicely I used top sirloin roast but even though it seems obvious based on the ingredients you end up with 2 cups of liquid in the pot. If you want gravy you're going to have to thicken it. I personally want my crock pot recipes to require as little effort as possible so putting the liquid in a pan and thickening it seemed like too much at that point. Maybe you should put the liquid in first with a little thickener and THEN add the meat. Anyway I served it over egg noodles and it was good but I clearly had to deviate from the original recipe thus the three stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LC23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T21:39:51.96Z",
                "reviewBody": "Wow! What great flavor. Caution!! You will be eating as you carve! I made a few modifications based on personal taste and other reviewer suggesstions. I doubled the wine swapped out the water for one can of French onion soup. I also added a fresh cleaned and \"opened\" leak to the bottom of the crock pot. I added some rosemary 2 bay leaves two cloves of garlic to qauartered onions and a whole package of the dried soup. I included 1 pkg of mushrooms during the last hour. I cooked on \"memium\" instead of high so that there was a pinkish middle. Oh yeah...add about 1/4 cup more wine (I used Chianti) right before you serve. Use the leak mushrooms and onions as your veggie all from the same pot! This was great and the meat is extremely tender. Tish",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3540858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-31T02:29:06.013Z",
                "reviewBody": "I have to say I will never go back to cooking beef roasts in the oven again after using this recipe. I had a beef roast which I'd marinated in red wine pepper and crushed garlic so I thought I would give this recipe a try. Our slow-cooker has number settings instead of low or high (it is very old). I guessed around 3-4 since the dial goes to 12. With the size roast I had it only took around 4hrs to cook on this setting to the well done mark. I added a couple of cloves of garlic and a few sprigs of rosemary as suggested by someone else. I also replaced the water with wine and doubled the dry onion soup mix (although the latter was by accident). It still turned out great even with the extra soup mix. Served with honey sesame baby carrots peas corn on the cob and potato bake with red wine gravy. No plate had a scrap of food remaining on it and the leftover meat has made great sandwiches today. Thanks Katie for a great recipe which I will definitely be using again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAY1810",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1320140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T21:48:54.39Z",
                "reviewBody": "I make this often however I also add 1-2 cans of cream of mushroom soup 1 whole garlic clove and sliced mushrooms. Served over noodles it is a hit in my house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RNYRAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778572/"
                }
            }
        ]
    }
]