[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/48931/bottom-round-roast-with-onion-gravy/",
        "name": "Bottom Round Roast with Onion Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4478698.jpg",
            "width": 3072,
            "height": 4096
        },
        "datePublished": "2019-04-04T03:30:44.000Z",
        "description": "This is the easiest roast recipe and requires little work for a lot of flavor. The vinegar sounds awful but it makes it really good. Its an easy main dish for busy moms!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT4H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 onions, sliced",
            "1 (4 pound) bottom round roast",
            "salt and pepper to taste",
            "1 bay leaf",
            "1 tablespoon white vinegar",
            "1 tablespoon all-purpose flour",
            "1 cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place sliced onions in the bottom of a Dutch oven or stock pot. Season the roast with salt and pepper, and place on top of the onions. Add the vinegar and bay leaf to the pan, and heat over high heat to get it simmering. Reduce heat to low, cover, and simmer for 3 to 4 hours. Try not to take the lid off while cooking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the roast is done, remove it from the pan to a serving platter. Mix the flour into the water, and pour into the drippings from the roast. Simmer over medium heat, stirring frequently until thickened. Carve roast, and serve with the pan gravy.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.389891696750903,
            "ratingCount": 277,
            "itemReviewed": "Bottom Round Roast with Onion Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "412.7 calories",
            "carbohydrateContent": "11.3 g",
            "cholesterolContent": "127 mg",
            "fatContent": "22.5 g",
            "fiberContent": "1.9 g",
            "proteinContent": "39.3 g",
            "saturatedFatContent": "8.5 g",
            "servingSize": null,
            "sodiumContent": "167.5 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-31T05:05:34.523Z",
                "reviewBody": "This is a very good recipe. The second time I made it, I made some changes that my entire family thought produced excellent results. I browned the Roast. Remove. Add 3 cloves of minced garlic to the onions at the beginning. Before placing the roast on the onions, I turned up the heat and deglazed the stock pot with Merlot, scraping up any brown bits. I placed the roast on the mixture to cook until done. After transferring the roast to a warm plate and tenting it with foil, I added another 1/2 cup Merlot to the pot and let it reduce by half, adding a Teaspoon of dried thyme. I then added 3/4 cup low sodium beef broth, brought it to a boil then added approximately 2 Tablespoons of roux to thicken. Pour over sliced roast. The leftovers were devoured for breakfast the next morning! Give it a try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MBROOKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/759756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T17:02:08.303Z",
                "reviewBody": "This is a very good recipe as it is.  It was intended for busy moms.  Making a whole bunch of changes just makes it take longer to make, not to mention a totally differant recipe.  Why do people insist on doing that.  Post your own recipies people.  I want to know what it was like as written, not your version of pot roast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sashasunshine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3518737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-10T17:00:20.83Z",
                "reviewBody": "I made this in my crock pot.  Cooked on high for 1st hour then on low for 3 hours.  I took some of the other peoples suggestions and did the following:  using a 3 pound roast - only 2 medium onions, cider vinegar, added 2 garlic cloves and some leftover fresh mushrooms.  I rolled the roast in a misture of rosemary, ground black pepper and a little garlic powder first, then browned on all sides in a little olive oil in a iron skillet first, turned over once while cooking.  When roast was done I took it out and added 2 TBSP flour to about 1 1/2 cups water (put in tupperware container and shook up first)then added to gravy on high, stirring occasionally, also added a beef bouillion cube for flavor (it was a little bland before adding this).  I broke up the meat and added back to crock pot once gravy was ready and served with mashed potatoes.  It was very yummy, not dry at all, and my whole (very picky) family loved it!!!!!\nI will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1534081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-12T14:18:28.123Z",
                "reviewBody": "Excellent recipe.  I used a dutch oven with lid in oven @ 300 degrees for 4 hours left if covered the entire time.  The onions were a beautiful amber color which made an excellent gravy base.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NIK23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1397558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-27T19:00:25.327Z",
                "reviewBody": "I appreciate Susan for submitting this recipe. She did say that, “This is the easiest roast recipe and requires little work.” I agree with that assessment. The instructions were clear and to the point. \r\n\r\n\r\nI had an occasion to try this recipe as a belated birthday dinner. The end result was good. It was tender and the beef had a mild bay leaf onion flavor. \r\n\r\n\r\nFor this recipe I used a seven pound plus hunk of bottom Round (tied) and eleven onions as recommended by the “Scaling and conversion” feature of this site. Vinegar? I still don’t know what part it plays in this recipe.\r\n\r\nAll in all I was impressed with the taste of the beef. It wasn’t  dried out or tasted like cardboard.\r\n\r\n\r\nBecause of the end result I decided to omit the all-purpose flour and water. I had more liquid than I expected. I tasted the liquid and I was a little disappointed.  In my opinion, it was a weak onion broth.  It was bland and needed help.  \r\n\r\nI made a Roué and incorporated the liquid to make a medium sauce and added bullion and a few others ingredients to give it some taste. I didn’t have a blender handy or I would have taken the onions and processed them to add as a thickening agent and to add flavor.\r\n\r\nMy over all impression of this recipe is good and my comments are; you may want to add herbs to improve the taste of the broth. The herbs when added at the beginning of the cooking process will infuse the roast nicely with whatever you decide to add.      \r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Iron Chef Rancho",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/954450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T22:17:26.35Z",
                "reviewBody": "This was really good, with dark, rich gravy.  I had to make some adjustments, though.  I put a tiny bit of oil under the onions, and after the meat had browned good on all sides to make the \"brown bits\", I added at least 2 cups of water for the roast to simmer in. Since it's a bottom round, I wanted to be sure it was tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "phyllis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1795001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-08T16:03:43.45Z",
                "reviewBody": "Bottom round is so lean it is not easy to have a roast that is not dry and tasteless, but this was delicious.  So was the gravy!  I browned the roast on all sides first.  I also used cider vinegar and added an extra 1/3 cup of water when I added the vinegar and bay leaf. My husband loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1844348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-26T22:53:23.97Z",
                "reviewBody": "Holy Moly I love this recipe!\nSo does my husband - this was the first roast recipe he told me I must do again.  I modified it a bit, partly on accident.  I put one cup of water, with apple cider vinegar and put the roast on top. I also only used one large sweet onion.  My extra addition that makes the gravy especially good is a couple whole sprigs of fresh rosemary (I remove when done and strain out anything big).  I puree the onions in the water to make gravy, just added a little salt and thickener (flour or cornstarch). Afterwards I have one very happy husband :)\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish1971",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2650062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-11T03:04:06.123Z",
                "reviewBody": "I used 2 onions, 3 tbls balsamic vinegar, garlic powder, salt, pepper for a 2 lb roast in a crockpot on high for 5 hours.  I made the gravy using 2 tbls flour because of extra liquid.  I sliced the beef, layered the onions over it, and spooned the gravy over it all. We ate it with rice but my family would love to try it again over egg noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NONIEGOULD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1292191/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T23:08:00.807Z",
                "reviewBody": "I cooked it in a slow cooker. My mistake was I put the frozen roast in it and turned it to high setting......roast was still tough when we were ready to eat. So I left it ovenight in low settings. It needed more flavor so I added a jar of muchroom gravy and it came out good. I think I will try it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "A pet Walker is in heaven.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/49190/"
                }
            }
        ]
    }
]