[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/50235/best-beef-dip-ever/",
        "name": "Best Beef Dip Ever",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F383793.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:30:51.000Z",
        "description": "Wow...A favorite with all my family and friends. I refuse to give any of them the recipe because it is so easy. I love it when they keep asking for it! I often throw all the ingredients into slow cooker and head to work. We all eat when ever we get in the door. The au jus is great! Add beef to lightly toasted buns, and dip away in the au jus.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H10M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "4 pounds beef chuck roast",
            "1 tablespoon minced garlic",
            "1 tablespoon dried rosemary",
            "3 bay leaves",
            "1 cup soy sauce",
            "6 cups water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place roast in slow cooker. Season with garlic and rosemary and add bay leaves. Pour in soy sauce and water. Cook on Low setting for 6 to 10 hours. Unlike most roasts, the longer it cooks, the better.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lori Anderson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.538461538461538,
            "ratingCount": 663,
            "itemReviewed": "Best Beef Dip Ever",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "289.6 calories",
            "carbohydrateContent": "2.5 g",
            "cholesterolContent": "82.5 mg",
            "fatContent": "20.4 g",
            "fiberContent": "0.4 g",
            "proteinContent": "22.8 g",
            "saturatedFatContent": "8.1 g",
            "servingSize": null,
            "sodiumContent": "1498.4 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-29T14:36:42.13Z",
                "reviewBody": "Very good recipe!  Tasty, filling and overall a great crowd pleaser.  5 star rating is for printed written recipe.  Personal taste adjustments:  reduce rosemary to 1/2 tablespoon, add 1 teaspoon peppercorns, use low sodium soy sauce, replace 4 cups of the water with 4 cups low sodium beef broth. Served with a garlic mayo (1 cup mayonnaise and 2 cloves minced garlic that married for 8+ hours).  Assembled buns with garlic mayo, roast and then topped with a selection of cheeses; manchego, provolone and horseradish (hubby liked the provolone cheese best) and broiled until cheese was bubbly.  Served with au jus and a green salad.  Divine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T17:26:03.28Z",
                "reviewBody": "If I was to review this recipe right after the initial ten hours of cooking, I would have given it 4 stars. But after everyone ate I took the leftovers shredded it, removed all visible fat, returned with juice to refrigerator.  The next afternoon I made a sandwich which my 8 year old son could not get enough of. I think it needed that time in the fridge to completely blend the flavors. I think the next time I make this, I will cook overnight, in the morning shred and put in fridge and then reheat for dinner. Delicious  Just wanted to add that the au jus makes a great base for French Onion soup",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOMMY DEAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-08T23:50:48.453Z",
                "reviewBody": "I thought this was a great recipe! Much better than I have ever had in a restaurant.  I made a few changes based on other reviews and my own personal tastes. I used 1 cup of low sodium soy sauce, 1-2 cans low sodium beef broth, 1 can Campbell’s French Onion soup (because it had a beef base rather than chicken), and 3 cups of water. I also cooked over night and put it in the fridge for the day. Put rolls in the oven with Swiss cheese and broiled for a few minutes and then topped with sautéed onions, mushrooms, and finally horseradish sauce. Served with Bleu Cheese Coleslaw from this website.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ladybug76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1659030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-11T16:54:54.28Z",
                "reviewBody": "This is a fantastic recipe. I've used it with brisket chuck roast and rump roast. Instead of water I use a can of beef broth. On crusty French or Italian garlic bread it's a symphony. I also add lots of sliced onions for topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUDYMW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/856567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-11T14:56:25.233Z",
                "reviewBody": "This is a very good recipe! I was honestly VERY hesitant of it at first because of the amount of soy sauce, but it turned out quite well. I did not have any fresh garlic on hand at the time I made this, so I used a tsp of garlic powder as a substitute. I added a little garlic powder later in the cooking, too, to offset the tang of the soy sauce, which was just a personal taste thing. I also used and extra cup of water to the broth because I let this cook for 14 hours - I had a very long day - and didn't want the meat to burn. It turned out great!! Even the guys in my family who normally never comment on anyone's cooking said they loved it. I served the shredded beef on steak rolls with swiss cheese with the au jus in bowls for dipping. I expected to have leftovers for lunch the next day, but it disappeared! The soy flavor *was* pretty intense, but the flavors mixed well and it was really, really good. I'm adding this recipe to my monthly menu rotation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-22T18:24:01.013Z",
                "reviewBody": "This was to die for. It was so good I can't say enough. I put the meat on a hoagie with a slice of cheese and sauted onions and mushroom and broiled for just a few minutes dipped in the juice and they were awesome. The meat had such great flavor!! The only modifications I made were suggestions made by other reviewers in that I used 2 cans beef broth and 2 cups water and 5 cloves of garlic. Will definitely make this again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/659242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-17T20:04:42.543Z",
                "reviewBody": "I feel honored that I am the first to review this recipe. I had my parents over the night I made this. My husband kids and parents all loved it. Only draw back no leftovers. I made it exactly as stated on the recipe...no alterations. I served it with baked beans potato salad and a salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIEB87",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-10T17:20:47.7Z",
                "reviewBody": "Great base recipe. I had 2.65 lb chuck roast that I put in the slow cooker with 4 cups of water minced garlic the bay leaves 1/3 cup soy sauce 1/3 cup Worchestshire a splash or 2 of Burgundy cooking wine and some dried thyme (because I had no dried rosemary). I forgot to toss in the minced onions but did later on and that worked out great. This au jus is freakin' awesome. We've got leftovers tonite and then I'm freezing that au jus for some future soup or something!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Hamilton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/737915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-29T03:15:43.14Z",
                "reviewBody": "This was a really great recipe. Will certainly make again. I did add 1/4 cup less soy sauce and 1/4 cup of worcestershire sauce instead. The soy sauce was a little too strong for my taste. Also we were not crazy about the texture of the dried rosemary so I strained the herbs out of the sauce before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Davis Mancil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/781300/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-29T18:51:06.237Z",
                "reviewBody": "It was okay. I used all beef broth instead of water to increase the flavour but it was still just okay. Next time I'll use some of the suggestions to bump up the taste but I'm not in a hurry to make it again the same way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mighty moose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2373970/"
                }
            }
        ]
    }
]