[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/52460/kaes-spaetzle/",
        "name": "Kaes-Spaetzle",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1975981.jpg",
            "width": 2432,
            "height": 4320
        },
        "datePublished": "2019-04-04T03:31:03.000Z",
        "description": "A traditional recipe from Bavaria and Baden-Wurtemberg, totally vegetarian, do always serve together with a salad in a sour dressing e.g. simple oil & vinegar-dressing!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 eggs",
            "1 ¾ cups all-purpose flour",
            "½ teaspoon salt",
            "1 tablespoon vegetable oil",
            "½ cup water",
            "¼ cup vegetable oil",
            "2 onions, halved and sliced",
            "3 cups shredded Swiss cheese",
            "1 tablespoon vinegar",
            "1 teaspoon chopped fresh parsley, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine eggs, flour, salt, 1 tablespoon oil, and 1/2 cup water. Mix until smooth, then let rest for 10 minutes. Meanwhile, heat 1/4 cup oil in a skillet over medium heat. Saute onion slices until golden brown; set aside. Preheat oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Place 1/3 of the dough into a spaetzle maker or coarse sieve or collander with holes about 4 millimeters in diameter. Let dough drop into boiling water. Boil until spaetzle rises to the top, then transfer to a 9 inch casserole dish with a slotted spoon. Cover with 1/3 of the cheese. Repeat layers with remaining spaetzle and cheese. Spoon fried onions over top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 15 minutes, or until cheese is thoroughly melted. Before serving, sprinkle with 1 or 2 tablespoons vinegar, and sprinkle with chopped parsley.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Schokolinda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.517241379310345,
            "ratingCount": 29,
            "itemReviewed": "Kaes-Spaetzle",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "733.2 calories",
            "carbohydrateContent": "51.5 g",
            "cholesterolContent": "214 mg",
            "fatContent": "43.9 g",
            "fiberContent": "2.4 g",
            "proteinContent": "32.8 g",
            "saturatedFatContent": "18.3 g",
            "servingSize": null,
            "sodiumContent": "502.2 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-18T10:50:00.64Z",
                "reviewBody": "Schokolinda thank you for sharing!!! This was an absolutely delightful dinner... (I even made the salad suggested.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-28T04:47:07.077Z",
                "reviewBody": "This was so awesome! I've made this dish for years and never added the vinegar or parsley. It was given to me by a friend who lived in Ulm Germany. Her Mom always fixed this for them as they were growing up because it was economical. I tried yours using the vinegar and the parsley and what a nice change! I bring this to a lot of Potluck banquets and people raved! Now they rave even more with the new twist from this receipe! Simply Awesome! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PECH5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/552032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-06T21:40:53.217Z",
                "reviewBody": "As a huge spaetzle fan I of course love this. I always have had spaetzle plain though with gravy or butter. This is like a really fancy mac and cheese but better. I made a simple cucumber salad with it ( Chopped cucumbers tomatoes and onions with a couple TB of apple cider vinagar over it) and it went wonderfully with it. Thanks for the tip.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KatieD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1546409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-24T19:14:25.467Z",
                "reviewBody": "I have made this recipe twice and there was no way it was a \"dough\" that could go in a spaetzle maker. I put it in a zip-loc bag and cut the tip to squeezed it into the water. However the flavor was very good and I will keep making it. After boiling I panfriend mine with some well cooked sauerkraut. I miss real german food since I moved back to the US and I can not find a recipe for something I used to eat and find in the stores all the time called Schumpfnudel so making this is about as close as I can come.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara Gosse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1911162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-24T07:18:23.34Z",
                "reviewBody": "This recipe is perfect. Tastes just like my grandmother's and she always prided herself on the craft of perfect spaetzle. And my father was to happy to hear how well it came out as he always seemed to think it was a little to tricky for him! Suggestion for those making this dish without the special spaetzle seive: Spoon the dough into an extra strength freezer bag and cut the tip off one corner. (xtra strong because all that squeezing of dough will break the back and you will have dumpling spaetzle. It's also nice to have extra dough to spare because I always seem to make quite a mess. I'm going to double the recipe next time! Also make sure you have some larger sized onions and caramelize them WELL. Chedder cheese worked great as a substitue and I think i omited the vinegar too. Experiment with your spaetzle.. it may become a favorite dish! My father would serve it instead of mashed potatoes and we would cover it with gravy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMURFLUVR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1024524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-26T17:17:48.457Z",
                "reviewBody": "I accidentally stumbled across this recipe and I'm so glad I did. I love spaetzle and make it certainly more frequently than the average American but I've always made it with pork roast and served with gravy. This is an excellent change of pace. If you like spaetzle invest in a spaetzle maker. Mine looks like an extra large potato ricer and has a variety of plates to choose from to vary the size of the spaetzle. It's so easy I use it when I make chicken or turkey soup. Rather than buying noodles I make spaetzle and squeeze into the soup when everything else is done cooking. I made this recipe for supper last night. Followed the recipe exactly except I grated fresh nutmeg and fresh pepper across each layer before I added the cheese. I used a bag of shredded swiss cheese since I didn't want to spend 9 on cheese when I wasn't sure if we'd like the recipe. I'm sure it would be even more delicious if you bought better quality cheese. My bag of cheese had 2 cups in it and that worked out fine although if you really want cheesy go for the whole amount. The onions on the top are so delicious. My husband asked if I added French onion soup mix. (I did not.) He said it reminded him of French onion soup. I did cook the onions in butter rather than oil. It only took 3 Tbsp. of butter. I also forgot to add the vinegar but that was okay. The thing that really made this meal was what I served with it. I made a simple salad with cucumber cherry tomatoes and red onion",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SYNEVA B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/269718/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T01:02:40.147Z",
                "reviewBody": "This recipe gets 5 stars for taste and 3 stars for preparation. I thought is was an excellent dish and even my husband a meat and potatoes man ate it right up. However I had a difficult time making it. I don't have a spaetzle maker so I used a colander with course holes. The dough was too thick (or maybe my colander holes were too thin) and did not drop into the water as it should have. I ended up dropping the dough into the water with a spoon. While the pasta did not look as it should have it didn't seem to greatly affect the rest of the meal preparation. I also found that the pasta preparation was a bit labor intensive. This might not be a problem for some cooks but with three young children crawling up my legs I wasn't able to give my full attention to making the dish as I should have. If I attempt this meal in the future I might try to cook all the pasta at the same time and then drain the pot so I don't have to remove the pasta with a spoon and to save time. However as I said earlier this is a delicious meal that I highly recommend especially for cooks who like to try new and different dishes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MARYALENE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/960634/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-27T20:49:43.547Z",
                "reviewBody": "I've been making this for years; my SIL is German. Super easy to make!! The noodles cook up really fast. It's also good with some sauteed mushrooms on top!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kauai17",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1921485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T17:59:31.64Z",
                "reviewBody": "I do not have a spaetzle maker and prefer to tip the bowl slightly over the pot you cook them in and just take a wet a knife and cut them off the lip of the bowl into the pot. They are like little dumplings. Nice reheated the next day in butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GRACIE 1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/775953/"
                }
            }
        ]
    }
]