[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/53367/chicken-with-rice-and-gravy/",
        "name": "Chicken with Rice and Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2416477.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2019-04-04T03:31:07.000Z",
        "description": "Chicken breasts are seasoned and fried, then served with rice and a creamy gravy. A family original, my family members request this all the time!!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 cups long-grain white rice",
            "4 cups water",
            "4 boneless, skinless chicken breasts",
            "3 tablespoons butter",
            "1 cup all-purpose flour",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "¼ teaspoon ground paprika",
            "¼ teaspoon dried thyme",
            "¾ cup cold water",
            "¼ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place rice in a saucepan with 4 cups of water. Bring to a boil, then reduce heat to low, cover and simmer for 20 minutes or until rice is tender. Prepare chicken while the rice is cooking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the flour, 1/2 teaspoon salt, pepper, paprika, and thyme. Use a finger to grind the thyme to a powder in the palm of your hand before adding. Coat the chicken breasts in the flour mixture. Reserve 2 tablespoons of the flour mixture for the gravy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a large skillet over medium heat. Place chicken in the skillet, and cook for about 10 minutes on each side, until the chicken is golden brown, and the juices run clear. Remove chicken from the pan, leaving the drippings and crusty bits in.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk together 3/4 cup water, 2 tablespoons of the flour mixture, and 1/4 teaspoon salt. Whisk into the skillet, scraping the browned bits from the bottom of the pan. Cook over medium heat, stirring constantly, until thick and bubbly. Add additional water 1 tablespoon at a time if the gravy is too thick. Serve chicken alongside rice topped with gravy.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ANISSA925"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.298507462686567,
            "ratingCount": 134,
            "itemReviewed": "Chicken with Rice and Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "658.5 calories",
            "carbohydrateContent": "98 g",
            "cholesterolContent": "91.3 mg",
            "fatContent": "11 g",
            "fiberContent": "2.2 g",
            "proteinContent": "37.2 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "579.5 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-28T00:35:06.03Z",
                "reviewBody": "My family absolutely loved this dish.  The only changes I made were to use chicken broth in place of the water and added more pepper.  Otherwise I feel the gravy would have been a bit bland.  Perfect quick weeknight meal!  Thanks Anissa this will be repeated!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mandy L",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1732445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-13T20:19:48.607Z",
                "reviewBody": "YUM!  I just have to say that I am HORRIBLE at #1 frying foods & #2 making gravy, however, this was a SUCCESS!  I LOVED the fact that there was no egg (lil' guy is allergic) and the whole preperation didn't trash my kitchen!  I ended up using 3 breasts & 3 leg/thigh pieces, & since I made potatoes for the kids I used potato water for the gravy, which turned out really good = the kids didn't think that I made it.  Thanks Anissa, for the tasty, simple & easy clean up meal!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-06T20:25:42.287Z",
                "reviewBody": "This is a recipe that I make often, but it would benefit from a slight change in technique. Those of you that complain about the gravy should try this: Add a few TBS of butter to the pan when the chicken is done. Stir well to get all the bits off the bottom of the pan. Add the 2 TBS flour (or maybe 3) to make a roux, and let it bubble for a few minutes while you get all the lumps out. Then, pour in chicken broth, not water, and stir while it thickens. If it is too thick, add more broth. Let it cook on lower heat for a few minutes to cook the flour taste out of it. This is a more classic way to make gravy, and I think you'll like it better this way, as it cooks the flour better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MexicoKaren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1439602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-30T06:59:23.997Z",
                "reviewBody": "Wow! I tried something new and I like it! I have never made gravy this way and it was easier than expected. The chicken tasted really juicy too. The only downside is having to wait for the chicken to cook through but that is time well spent doing the dishes and setting the table! I served this with the Garlic Fried Rice recipe from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2869422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-06T21:23:36.1Z",
                "reviewBody": "I love chicken and rice with gravy but I will and do improvise. I wanted to respond respectfully to some negativities that I see throughout this recipe site. As a cook and parent we all know our family and their preferences as far as seasoning and spices and when we respond with whatever rating to a recpie I feel in giving the recipe a rating in a sense we are paying respect to the originator of the recipe for their creation. To me it takes nothing from their creation to improvise and make it our own. In a way that is a tremendous compliment to them. That is just my feeling. I love this site and I LOVE all the diversity throughout. When people give their insight it helps me to \"make it my own\" without disrespecting the originator. Diversity is what makes the world go around. If no one took initiative to create or recreate the world would be boring. No disrespect intended to anyone just my thoughts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOJO97000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-23T02:30:20.08Z",
                "reviewBody": "Quick and easy dish to which I added carrots onions celery peas and chicken broth instead of water. Added in a few more seasonings and a small splash of Gravy Master. Comforting and good Anissa; thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-27T00:17:24.3Z",
                "reviewBody": "this recipe was freaking awesome! I didn't have thyme so i just added some parsley and garlic and onion powder. The seasoning was perfect. I used chicken tenders instead of breast and used chicken broth for the gravy and used milk to thin it out like another reviewer suggusted. Definately a keeper. UPdated i made this again and accidently use a whole cup of broth and it was the perfect amount for the gravy i didn't need to add any milk or water! I also cut up the chicken to bite size pieces for quicker cooking time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CupcakePolly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3324445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-03T01:41:05.357Z",
                "reviewBody": "I substituted white wine for the water in the gravy and it was delicious. The kids didn't like it that much but the adults loved it. It was very flavorful. One problem that I had was that when I plated the meal half of the rice was left over. Next time I will cut the rice in half. I will also divide the meat into two different pans and make one gravy with white wine and the other with water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Don Reilly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mrdon/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-31T00:17:36.61Z",
                "reviewBody": "This was fantastic! A perfect weekday meal. I listened to other reviewers and used broth for the gravy added a pinch of pepper a tablespoon of whole milk at the end to desired consistency. Yes I should have doubled the \"gravy\" perhaps quadrupled it very little. I did my breasts 10 mins/side too long but I am getting used to a new stove. However that did not affect the wonderful dinner we had last night. A nice white wine would have worked with it! I use River Rice when making dishes with a sauce. Yeah I would rename this recipe Chicken With Rice and Sauce. For such a simple recipe I was quite impressed. I am keeping this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DMM104",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/662050/"
                }
            }
        ]
    }
]