[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/725/world-cuisine/european/scandinavian/",
                    "name": "Scandinavian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/53763/the-amazing-swedish-meatball/",
        "name": "The Amazing Swedish Meatball",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5663161.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2019-04-04T03:31:10.000Z",
        "description": "Yowza! These Swedish Meatballs are fabulous! Very easy to make with such simple ingredients, and they're just delicious. This recipe has been in my family for years - friends and family wait all year to eat them.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 pound ground beef",
            "½ pound ground pork",
            "½ cup chopped onion",
            "¾ cup bread crumbs",
            "1 egg",
            "½ cup milk",
            "1 tablespoon dried parsley",
            "1 tablespoon Worcestershire sauce",
            "2 teaspoons salt",
            "1 teaspoon pepper",
            "¼ cup vegetable oil",
            "¼ cup all-purpose flour",
            "1 teaspoon paprika",
            "1 tablespoon salt",
            "1 teaspoon pepper",
            "2 cups boiling water",
            "¾ cup sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine ground beef, ground pork, chopped onion, bread crumbs, egg, and milk. Season with parsley, Worcestershire sauce, 2 teaspoons salt, and 1 teaspoon pepper. Mix well with your hands. Shape into walnut-size balls, and place on baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 minutes in preheated oven. Turn frequently so they brown evenly on all sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the sauce:  In a saucepan, combine oil, flour, paprika, 1 tablespoon salt, and 1 teaspoon pepper. Cook over medium heat until sizzling. Stir in hot water and sour cream until smooth and heated through.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When meatballs have cooked 30 minutes, pour sauce over the top, and return to the oven for 20 minutes, stirring occasionally.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Scandinavian"
        ],
        "recipeCuisine": [
            "European",
            "Scandinavian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "KANDIYOHIV"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.430327868852459,
            "ratingCount": 244,
            "itemReviewed": "The Amazing Swedish Meatball",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "559.6 calories",
            "carbohydrateContent": "18.6 g",
            "cholesterolContent": "134.1 mg",
            "fatContent": "42.7 g",
            "fiberContent": "1.4 g",
            "proteinContent": "24.6 g",
            "saturatedFatContent": "16.1 g",
            "servingSize": null,
            "sodiumContent": "2174.7 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-14T22:55:33.367Z",
                "reviewBody": "SAUCE REVIEW.  This review is for the sauce only.  I live in Sweden and needed a fast sauce to make with the meatballs that I had just made.  I thought that I had a sauce pre-made, only to find out that I was wrong.  Sheesh.... Anyway, I made this sauce, which looked strange to me, but, I was desperate.  Well, I ended up making mashed potatoes and having the meatballs with slices of cucumber instead.  A Swedish meat sauce should be brown like gravy, not creamy and definetly not like this one.  And just another comment, the IKEA sauce for the swedish meatballs is actually very close to the made from scratch sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sooki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/151678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-10T21:40:41.577Z",
                "reviewBody": "Well I wish I could write two reviews for this recipe. Good news or bad first? I'll start with the bad-we were not impressed with the sauce recipe by any means. Thankfully we all taste-tested it prior to adding the meatballs. I whipped up a white cream sauce as an emergency alternative since the other sauce was pretty much inedible. Ok on to the good part. The meatball recipe here is excellent I was very impressed with flavor and texture-they will be good with other sauces and I look forward to preparing them again. Hope others have better luck than I did with the sauce!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JENMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/137552/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T20:43:12.653Z",
                "reviewBody": "Yowza is right Kari! These were incredible to say the least. I don't normally eat red meat merely because I don't really care for it however there's always an exception to every rule and this was it! I've spent many years looking for the perfect S.M. recipe and my search has finally ended. I did make a couple of changes to suit out tastes. To the meat mixture I added more seasonings; garlic and onion powders etc. After the meatballs were cooked in the oven I took them out of the casserole dish and placed them on a separate plate. I added beef broth (not water) to the casserole dish and cooked on a low flame in order to loosen the browned bits from the bottom. I then used that to make the sauce. No matter what any recipe calls for I always double the amount of liquid. In this case I added two cans of low salt cream of mushroom soup. Again Kari I'm totally impressed with your wonderful recipe and so were my hubby and kids. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T22:21:04.333Z",
                "reviewBody": "This wound up being a great recipe but I made SIGNIFICANT changes to the sauce. I hate it when people review when they've made a lot of changes but I think the sauce recipe as written must be a mistake. I wouldn't want anyone to take the time to make this to be disappointed with the outcome. when just a few changes made a fabulous sauce. I did make the meatballs with ground turkey (since that was all I had) and they turned out quite well - other than that I made them as written. For the sauce I used butter instead of oil chicken stock instead of water (but use beef stock if you are using beef/pork for the meatballs) and just a bit of salt. I'm not afraid to use salt in my cooking but a whole tablespoon here has to be a mistake. The sauce turned out so good I made it again and served it with roasted chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Brigit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2137164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-02T22:06:29.45Z",
                "reviewBody": "Excellent with the sauce change left by another user: 2 cans cream of mushroom soup hot sauce 1/2 cup milk 1 cup sour cream or plain yogurt. Very good my husband was raving!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linnea Quam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2027920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-09T15:33:51.837Z",
                "reviewBody": "This review is for the meatballs ONLY as I used a different sauce. The mix of ground beef and ground pork is perfect for these. They were very good. I used 1/4 c. of finely chopped onion vs. 1/2 c. and upped the bread crumbs to 1 cup. I used 2 tbsp. of milk added some garlic powder and 1/4 tsp. of allspice. I baked these at 450 for 15 minutes. For the sauce I used \"Basic White Sauce\" from this site that I added dried parsley garlic worchestershire sauce dried minced onion salt pepper nutmeg and a little sour cream. I served everything over egg noodles and my husband loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-14T19:59:10.787Z",
                "reviewBody": "DO NOT USE THIS SAUCE!!!! Whomever loved this recipe I'm willing to bet they have a psychological addiction to salt. The meatballs were okay but still contained WAY too much salt. I should have known when I was adding the amount of salt they told me to add a red flag went up and I thought... this is more salt than I have ever added to any recipe of this amount of meat and/or sauce ingredients. Don't ask me how I knew it was just WRONG. I have not re-tried this recipe without the salt but I'm suggesting that if you really want to use this recipe you may try using 1/4 the pepper 1/4 the salt in both the sauce and the meatballs and then MAYBE it will be okay. I would not reccomend this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Ontheliterside",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2854691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T03:00:59.733Z",
                "reviewBody": "This was an excellent recipe but I was horrified when I read the nutritional information. I made a couple changes to make it less fattening - I used lean groud turkey instead of the beef and pork and I also used skim milk. The only other changes I made was that I added fresh garlic and other spices. It was delicious! I used a different sauce which consisted of 2 cans of cream of mushroom soup 1 cup of reduced fat sour cream skim milk pepper Worcestershire sauce and hot sauce. The recipe was incredible!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRANDSTETTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/894998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-19T07:52:59.607Z",
                "reviewBody": "One must remember to read the reviews before trying any recipe. Too much salt in the sauce. End of story. Reduce salt to 1 teaspoon and everything comes out just fine. But as written the recipe gets only one lonely star.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "WILLSONG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1165213/"
                }
            }
        ]
    }
]