[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15974/world-cuisine/asian/pakistani/",
                    "name": "Pakistani",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/54024/pakistani-lentil-curry/",
        "name": "Pakistani Lentil Curry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F440879.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:31:12.000Z",
        "description": "This cheap and very easy Pakistani meal is usually eaten with Basmati rice, tossed salad, and hot pickles. It is relatively quick to make, and tastes even better the second day.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H55M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "¾ cup dry brown lentils",
            "¼ cup dry red lentils",
            "4 cups water",
            "5 whole garlic cloves",
            "¾ teaspoon salt",
            "½ teaspoon ground coriander",
            "½ teaspoon cayenne pepper, or to taste",
            "¼ teaspoon ground turmeric",
            "2 tablespoons clarified butter",
            "¼ onion, sliced",
            "1 teaspoon ground cumin",
            "⅛ cup milk",
            "1 tablespoon minced fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak brown and red lentils in ample cool water for 1 hour to overnight. Drain and rinse.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place drained lentils into a large saucepan or Dutch oven. Pour in the water, then add garlic, salt, coriander, cayenne, and turmeric. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the lentils are tender, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the lentils cook, melt the clarified butter in a skillet over medium heat. Stir in the onions, and cook, stirring often, until they turn golden brown. Stir in the cumin, and cook until fragrant, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the onions and milk into the lentils; cook for another 6 to 8 minutes. Sprinkle with cilantro to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Pakistani"
        ],
        "recipeCuisine": [
            "Asian",
            "Pakistani"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "JERRYJAVED"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.338983050847458,
            "ratingCount": 59,
            "itemReviewed": "Pakistani Lentil Curry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "480.9 calories",
            "carbohydrateContent": "62.4 g",
            "cholesterolContent": "34 mg",
            "fatContent": "14.8 g",
            "fiberContent": "26.3 g",
            "proteinContent": "26.3 g",
            "saturatedFatContent": "8.3 g",
            "servingSize": null,
            "sodiumContent": "889.9 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-21T21:08:44.923Z",
                "reviewBody": "In constant search of cheap meal ideas, I decided to give this a try.  As written, I would have to rate this a 2 because lentils don't need to be soaked before cooking and the recipe calls for too much water-the general ratio is 2 parts water to one part lentils.  If I had followed the directions of the recipe, this would have been REALLY watery/liquidy and I think pretty gross.  Here is what I did . . .  I rinsed 2 cups of brown lentils and simmered them with 4 cups of water, adding more water as needed until they were cooked to the right texture (was doubling the recipe).  I added 5 cloves of chopped garlic and doubled the rest of the spices, except the cayenne (too spicy for my 3 yr old).  As it simmered, it smelled good but looked boring so I sauteed some shredded carrots, yellow bell pepper, and zucchini in a separate pan while I caramelized the onion (a whole one).  When the lentils were done, I added the sauteed veggies and the caramelized onions to the pot and stirred it up.  I served it over Basmati Rice, topped it with cilantro and it still needed something.  Paneer would have been great but I didn't have it so used some white crumbly Mexican cheese on the top (feta would have been great too).  The end result was amazingly delicious!  I will definitely make it again-in the future, I will add more veggies, caramelize 2 onions, cut down the lentils and use veggie broth to simmer the lentils in, plus add paneer to the top.  Thanks for the idea and great spice combinati",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNYLYN1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1352672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T20:50:03.183Z",
                "reviewBody": "Turned out great. I added about 9 curry leaves though. Used a little extra Turmeric. Also some people have been saying that they reduced the water you're not supposed to. Authentic Pakistani Dal (Lentil \"curry\") is a bit soupy. Since its eaten with Basmati rice or bread the soupyness gives it the desired consistency. Otherwise its too dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Khawer A. Khan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3474296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-07T20:27:56.757Z",
                "reviewBody": "I had to interrupt my work day and my lunch to rate this one - I am eating the leftovers for lunch today and this is by far the best lentil recipe I have ever made. I took the advice of some of the others - doubled the spices and added shredded carrots and bite-size potato chunks - and used the full amount of water which was almost completely absorbed in the cooking. I skipped the final step of adding milk but only because I forgot. DELICIOUS. Served it with flatbread and some crumbled feta the first night. Having it with wild rice today. Love it. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Natalie Hahn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3415982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-28T06:20:35.03Z",
                "reviewBody": "I followed this using freshly ground spices served over rice. I didn't bother soaking my lentils I threw them in and boiled for about 40 minutes. I forgot the milk but it was perfect anyway. I eat lentils several times a week I'm always looking for new and interesting dishes. This one quickly became my favorite. De-licious. Do taste as you cook so you can adjust spices for your preference. I like to put in diced carrots and potatoes or sweet potatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steph",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2770068/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-16T04:04:16.827Z",
                "reviewBody": "This is so tasty and full of flavor I loved it. Did not give it 5 stars due to having to adjust the recipe. I decreased the water to 2 cups(I cant imagine how soupy it would have been with 4 cups) also I doubled the coriander turmeric and cumin. I will make this again.... probably many times. I think I will try it with some Feta occasionally too. Thanks for submitting this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Skye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1753776/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-28T01:32:03.8Z",
                "reviewBody": "Excellent flavors -- aromatic spicy but (as written) mild enough even for less adventurous diners -- well balanced. Like most traditional recipes this one can be adjusted to the palettes of those you'll be serving. I do plan to increase the cayenne next time but still found it delicious. My fiance who is not picky but doesn't normally eat much cleaned his plate. I made only two small changes: first I used whole rather than ground coriander -- I think I used about two teaspoons worth -- since I had no ground coriander and didn't feel like taking time to grind it. Second I threw in a can of chick peas drained and cooked them with the lentils: not a necessary addition but they went beautifully with the lentils and spices. For accompaniment I steamed about 1/4 of a smallish green cabbage cut into four chunks on top of the lentils for the last 6 or 8 minutes. I served the curry with rice home-made flatbreads and a modified tzaziki sauce. In short Jerry Javed's Pakistani Lentil Curry is guaranteed to become a part of my regularly recipe rotation. One more caveat -- households of two such as mine may want to halve the recipe. It makes a lot! That said I'm looking forward to lentil curry for breakfast tomorrow morning!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mystif",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5627126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-13T01:03:10.12Z",
                "reviewBody": "I took the advice of some of the other reviewers and reduced the amount of water- 4 cups would indeed have been too much. However I found that 2 cups was not quite enough- by the time the water was all absorbed the lentils were still a bit tough so I would recommend 2.5-3 cups. I imagine that 3 cups would give you a bit more of a soupy consistency (great over bowls of rice). I also took the advice to increase the amount of the spices and I doubled everything except the cayenne (my husband is a bit sensitive to spicy dishes). However I would have enjoyed even more flavor so I would consider adding a bit more of the other spices too. We added a squeeze of lemon just before eating which was tasty. I have also heard that adding salt to uncooked lentils can make them tough so I waited until closer to the end of their cook time to add salt.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KNBAUER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1257842/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-15T04:23:33.92Z",
                "reviewBody": "The flavor was good but the recipe seemed to call for way to much water as my lentils became a pot of mush.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "yummjunkie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2372633/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-02T01:15:56.75Z",
                "reviewBody": "Great lentil recipe. My boyfriend and I enjoy lentils that pack a punch of flavor and I like easy clean-up - so I made a few adjustments to the original recipe. I added one carrot and two small potatoes peeled and cut into small bite sized pieces into the pot of water. I added the onion chopped to the water along with the garlic and 1 cup of lentils and about three cups of water. I doubled all of the spices except the cayenne pepper which I increased by 1/4 a teaspoon. And instead of salt I added garlic salt and onion salt. I also added the milk following the directions. Best lentils I have made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "J",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2836306/"
                }
            }
        ]
    }
]