[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/35440/enchiladas-suizas/",
        "name": "Enchiladas Suizas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1006044.jpg",
            "width": 2392,
            "height": 2392
        },
        "datePublished": "2019-04-02T06:44:14.000Z",
        "description": "This dish has a nice bite to it with lots of cheese. It is equally delicious with cooked pork or beef.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons butter",
            "⅔ cup chopped Spanish onion",
            "2 tablespoons all-purpose flour",
            "1 ½ cups chicken broth",
            "1 cup chopped green chile peppers",
            "1 clove garlic, minced",
            "¾ teaspoon salt",
            "1 dash ground cumin",
            "12 (8 inch) corn tortillas",
            "canola oil for frying",
            "1 cup shredded Monterey Jack cheese",
            "1 cup shredded mild Cheddar cheese",
            "2 cups shredded, cooked chicken breast meat",
            "1 cup heavy cream",
            "¼ cup chopped green onion",
            "½ cup sliced green olives",
            "1 pint cherry tomatoes"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare salsa verde:  Melt butter in saucepan over medium heat. Saute the onion until soft. Stir in the flour. Add the broth, then add the chiles, garlic, salt, and cumin. Simmer about 15 minutes to blend flavors, then set aside. Preheat oven to 350 degrees F (175 degrees C.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a heavy skillet, lightly fry tortillas in shallow oil, being careful not to make them too crisp to roll. Combine the cheeses and keep 1/2 cup aside for topping. Dip each tortilla in salsa verde (both sides.) Place 2 heaping tablespoons chicken and about 2 tablespoons cheese down the center of each; roll and place seam side down in a shallow dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After all the rolled tortillas are in the dish, spoon additional salsa verde over them and then cover evenly with heavy cream. Sprinkle with remaining 1/2 cup cheese mixture, and with the green onions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake uncovered in preheated oven for 20 minutes. Serve immediately, garnished with the olives, cherry tomatoes, and with additional salsa on the side.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Lisa Civitillo Blok"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.740987983978638,
            "ratingCount": 749,
            "itemReviewed": "Enchiladas Suizas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "737 calories",
            "carbohydrateContent": "42.3 g",
            "cholesterolContent": "136.1 mg",
            "fatContent": "52.1 g",
            "fiberContent": "5.1 g",
            "proteinContent": "28.5 g",
            "saturatedFatContent": "22.4 g",
            "servingSize": null,
            "sodiumContent": "977.4 mg",
            "sugarContent": "2.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-06-01T00:00:08.543Z",
                "reviewBody": "Here's how I made this recipe not so time consuming and it still tasted wonderful. Instead of frying the corn tortillas, just put them in the microwave until they are warm and soft.  They roll up easy and save time and calories. EXCELLENT RECIPE.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOTRODS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772734/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T05:22:55.687Z",
                "reviewBody": "My husband, who lived in Mexico for a couple of years and constantly craves good, authentic Mexican food, begs me to make this for him every week. Although the excellent rating speaks for itself, I just had to add our own additions to this fantastic recipe. First of all, we cook our meat in the slow cooker (usually chicken). Spray your crock pot with cooking spray, add your chicken breasts (can double and freeze left over meat), and then add your sauce on top. Now, my personal favorite added in the crock pot is a good BBQ sauce. Many popular Tex-Mex restaurants have their versions of “sweet-meat” enchiladas, but this tastes just as great in this recipe. My husband prefers just adding extra salsa verde from this recipe instead of the BBQ sauce. Cook your chicken for 3-4 hour on high or 6-8 hours on low. Remove chicken and shred with two forks. Return to crock pot and mix with juices. Use this meat with the recipe provided. We also doubled the sauce, reserving a portion for dipping in which I usually add more chilies for my husbands spicier taste. Also make sure to make your tortillas crispy enough because once you add all of the sauces, it can become mushy when cooking. We found that spooning the salsa into the tortillas is just as good as dipping and is so much easier and less messy. We also omitted the green onions and olives for personal preference. We just can't say how much we love this dish! Even my young kids ages 1, 4, and 7 love it! Thanks so much!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fmly1st",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1739058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-30T15:42:26.187Z",
                "reviewBody": "Unfortunately for others-based off their complaints/recommendations - I made this better for us!! This turned out awesome!! First, I used a can of green chiles but also chopped up a green bell pepper to make 1cup. I then added a GOOD dash of cumin, chili powder, more garlic and a couple drops of hot sauce to the mix. HMMMMM-that part alone was great!! Then, I used flour tortillas (skipped the oil part) and only dipped one side (the \"interior\") into the chili verde sauce.  I was only able to get 8 tortillas from the batch -which is more than enough. Finally, I used apprx 1/2c half & half instead of heavy cream. Bake for 25 min and placed on a bed of shredded lettuce...GREAT!!! Tastes almost like ones I order at a local mexican restaurant!! If your not afraid to play around with some spices -this is sure to turn out great for you too!! Thank you Lisa!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22503515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-06T16:00:29.983Z",
                "reviewBody": "OH.  MY.  GOSH.  If I could give this recipe 100 stars, I would.  This is one of the most delicious things I have ever tasted!  I live in California so have had my fair share of great, authentic Mexican cuisine but this by far surpasses any restaurant enchiladas I have ever had.  The only things I did differently were out of necessity due to what I had on hand.  I used a regular instead of Spanish onion, canned green chilies, and omitted the olives and tomatoes.  Everything else I did to a T and I would recommend this to anyone.  If you are going to make this, it is definitely worth the frying and dipping of the tortillas because I have found that is the key to outstanding enchiladas.  Plus, make sure everything is hot before you start assembling so you don't have to bake very long, because the longer they spend in the oven the more mushy the tortillas will be.  If you fry the tortillas, make sure all ingredients are hot, assemble quickly, and bake just until heated through, I guarantee your tortillas will not become mushy or soggy at all.  Oh, and do not be afraid of pouring the heavy cream on top.  I was scared but wanted to follow the recipe as closely as possible and I'm glad I did.  It looked like a lot of cream but it baked into the dish so perfectly.  I am going to be making this again and again and again.  My boyfriend ate literally half the pan it was so good and asked if I could make this once a week!  YUM YUM YUM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSJENAFFLECK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/885114/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-21T04:33:36.537Z",
                "reviewBody": "I can’t remember the last time I put so little effort into a dish and was so rewarded.  This was just delicious.  I did make a number of changes to simplify this but preparing the recipe as is or with the shortcuts I took will make this equally delicious.  Rather than preparing the salsa from scratch I used my favorite commercial salsa verde (it contains a higher proportion of tomatillos and dang it, I can’t find it anymore!).  I used a prepared rotisserie chicken, which not only is super convenient, but it has so much more flavor than the typical poached chicken breasts.  When it came to filling the tortillas ((I used flour tortillas because I just don’t like corn tortillas), I warmed them briefly one at a time in a skillet with a little oil, then filled them with the chicken that I had mixed with some sour cream and some of the salsa till good and creamy.  And then the cheese of course!  I measured nothing – just filled and rolled, then poured over the salsa, then the cream, until it looked right.  I topped them with more cheese during the last 5 minutes of baking and served them with MORE cheese, chopped tomatoes, black olives, chopped green onion and sour cream. Beautiful.  And so delicious you can’t help eating more than you should.  Side dishes of Maria’s Mexican Rice and Rush Hour Refried Beans, both recipes also from this site, completed the meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T18:39:20.75Z",
                "reviewBody": "AWESOME! These are some of the best enchiladas I've made so far. I took into consideration some of the reviewers comments about this being a \"time consuming\" dish. I bought a pre cooked rotisserie chicken and used that rather than cooking my own and that alone probably cut the prep time in half. I bought the 6 inch corn tortillas since that's all I could find. I also used some flour tortillas as well (which became a little soggy after a while but were still good). I went ahead and added the shredded chicken to the salsa verde and skipped the dipping part. I filled the tortillas with the mixture and to what was left over I added the cream and one can of red enchilada sauce which made this dish outstanding!! I cannot thank you enough Lisa for this terrific recipe. I will certainly be using this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-22T15:12:12.89Z",
                "reviewBody": "The first time I made this I followed the recipe closely. I substituted flour tortillas for the corn, and I used non-stick spray to fry the tortillas, since they seemed to absorb the hot oil.  I also saved time by using 2-4oz cans of chopped green chiles.  They were to die for!  Then I made it again, and increased the chicken to 3 cups and used light cream instead of the heavy cream. They were fantastic again.  Wonderful recipe!  Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWELLSVILLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-12T00:34:23.233Z",
                "reviewBody": "Wonderful! I made a few changes because I didn't have the right ingredients. I used flour tortillas canned green chili peppers and a white onion. I slashed calories by microwaving the tortillas and using (my favorite substitution)evaporated milk instead of cream. I also added a tablespoon or so of chopped jalapeno peppers. Next time I'll probably use more jalapenos for a little extra zip and I'll try evaporated skim milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa R",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/786207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-07T02:49:22.03Z",
                "reviewBody": "My husband and I have used this recipe so many times and it has become a definate family favorite!! We substitute fat free sour cream to cut on calories and just mix it with a little with of water to give it a similar consistency to the cup of heavy cream that is called for. It is an absolute delight and we will be enjoying this dish for years to come!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Celeste",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1972902/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T23:20:19.707Z",
                "reviewBody": "This had a nice, subtle flavor.  I used 1/2 c jalapenos and 1/2 c green bell just because that's what I had.  The man wanted more spice to it, so next time I'll make it with the whole cup of chili peppers.  This sauce was tasty!  I suggest doubling it; there was not enough IMHO.  I used a mexican cheese blend, a rotisserie chicken to cut down on prep time and wheat tortillas.  I did not fry the tortillas and I simply put a heaping spoonful of sauce on the inside instead of dipping them.  I greased the baking dish with Pam and used fat free half & half instead of heavy cream.  I got 5 perfectly stuffed 8\" enchiladas out of this.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DC Girly Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/172956/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Enchilada Suizas",
            "description": "An irresistible and cheesy-good Mexican dinner!",
            "uploadDate": "2017-03-14T17:38:38.969Z",
            "duration": "PT1M9.57S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F684675ce-4a54-4efe-bccf-d18d01bbfe7d%2F6ecb0c8a-57f9-4a48-beb1-84fa64a0e91c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5359156179001"
        }
    }
]