[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18417/spanakopita-greek-spinach-pie/",
        "name": "Spanakopita (Greek Spinach Pie)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2015%2F03%2F754051-Spanakopita-Photo-by-recordaras-resize.jpg",
            "width": 650,
            "height": 465,
            "caption": "Photo by recordaras"
        },
        "datePublished": "2000-04-05T21:32:50.000Z",
        "description": "This is an authentic, really rich pie stuffed with spinach, onions, cheeses and herbs that are all enfolded by crispy, flaky phyllo dough.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 9x9 inch pan",
        "recipeIngredient": [
            "3 tablespoons olive oil",
            "1 large onion, chopped",
            "1 bunch green onions, chopped",
            "2 cloves garlic, minced",
            "2 pounds spinach, rinsed and chopped",
            "½ cup chopped fresh parsley",
            "2 eggs, lightly beaten",
            "½ cup ricotta cheese",
            "1 cup crumbled feta cheese",
            "8 sheets phyllo dough",
            "¼ cup olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x9 inch square baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 3 tablespoons olive oil in a large skillet over medium heat. Saute onion, green onions and garlic, until soft and lightly browned. Stir in spinach and parsley, and continue to saute until spinach is limp, about 2 minutes. Remove from heat and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together eggs, ricotta, and feta. Stir in spinach mixture. Lay 1 sheet of phyllo dough in prepared baking pan, and brush lightly with olive oil. Lay another sheet of phyllo dough on top, brush with olive oil, and repeat process with two more sheets of phyllo. The sheets will overlap the pan. Spread spinach and cheese mixture into pan and fold overhanging dough over filling. Brush with oil, then layer remaining 4 sheets of phyllo dough, brushing each with oil. Tuck overhanging dough into pan to seal filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 to 40 minutes, until golden brown. Cut into squares and serve while hot.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SILVERWOLF"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.516393442622951,
            "ratingCount": 854,
            "itemReviewed": "Spanakopita (Greek Spinach Pie)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "494.1 calories",
            "carbohydrateContent": "31.5 g",
            "cholesterolContent": "100.3 mg",
            "fatContent": "34.7 g",
            "fiberContent": "7.4 g",
            "proteinContent": "18.2 g",
            "saturatedFatContent": "11.5 g",
            "servingSize": null,
            "sodiumContent": "893.9 mg",
            "sugarContent": "5.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-01T17:21:26.53Z",
                "reviewBody": "This is a great recipe, no doubt.  There are a few points that should be emphasized.\n\nFirst, the instructions state that the mixture should be cooled before assembly.  This should be in capital letters.  There's something about letting the mixture set-up somewhat to reduce the amount of moisture...that thing that everyone is saying to avoid.  Excess moisture kills this dish.  I spun my spinach dry before chopping it and adding it to the pan, but go to great lenghts to introduce as little extra moisture as possible.  On the subject of spinach, I think the recipe implies the dirty bunch-spinach, not the pre-washed baby spinach.  I found I lost about 1/3 weight from the bunch spinach after discarding the undesirables and destemming.  Baby spinach is more expensive, but you can take it right out of the container, chop it and throw it in the pan.  If you use bunch spinach, account for the extra time it'll take you to clean and destem the stuff...huge PITA, but much cheaper.  Also, you can't go wrong with extra phyllo.  I wouldn't layer it in the middle, because it'll just be a doughy mess between the layers of filling. But to have eight sheets on the top AND bottom would not do you wrong.\n\nFinally, I found this dish rocks coming out of the freezer and going right into the oven.  Prepare it the same just to the point it goes in the oven.  Take the whole frozen kit and caboodle right to the oven, add some extra cooking time (20-30 mins) and it turns out identical.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StewartFip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795035/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-25T02:01:05.81Z",
                "reviewBody": "In a cooking class, many years ago, I learned the trick of dry spinach to be used in a recipe.  No need for pressing in a strainer. Just place the spinach on a plate, cover it with another plate (same side up).  Holding vertically, press the two plates together, over the sink, until liquid stops flowing.  Result = VERY dry spinach!  Using this method, I have never had a sogginess problem with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SELEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-04T04:12:25.25Z",
                "reviewBody": "OMG, this was good!  Never used phyllo dough before, so relied heavily on advice from other reviewers & my own preferences:  1) sauteed onion/garlic in 2 T butter/1 T olive oil for more flavor; 2) increased green onions to 2 bunches; 3) doubled the garlic; 4) decreased the spinach (used 1 6-oz bag prewashed baby spinach + about another cup just because that was what I had); 5) decreased parsley to 1/4 cup; 6) added 2 T fresh dill to spinach/onion mixture at the end (didn't cook it; dill too fragile; just let it get warmed by rest of mixture; 7) drained spinach mixture in a fine strainer while I worked on filling & dough; 8) doubled the feta; 9) added fresh ground pepper to the filling 10) brushed phyllo dough with butter rather than olive oil (for flavor & better browning; 11) used 9x13 baking pan; 12) used 8 sheets phyllo on bottom (4 laid out flat; then 4 more overlapping the pan, with HALF of spinach/cheese/egg mixture in those last four, folded over filling, sealing it in; then 4 more phyllo sheets overlapping pan with other HALF of filling, then folding those sheets over the filling, & topping that with 4 more phyllo sheets (butter brushed on each one from bottom to top).  This was DELICIOUS; it wasn't soggy & tasted like Greek restaurant food.  PS:  I also cut it into squares BEFORE baking it!  And the 2nd time I made it, I forgot to drain the spinach mixture, and the leftovers were definitely soggy the next day!  You're amazing, Silverwolf!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-20T19:57:42.373Z",
                "reviewBody": "I love spanakopita and have been making it forever.  I use frozen spinach (make sure to squeeze all the water out), use olive oil flavored cooking spray instead of brushing, omit the green onion, and occassionally use ricotta.  I am a fan of the traditional triangular shapes so i layer 2-3 sheets of fillo per triangle.  to keep dough from becoming a sticky or dried out mess, make sure its fully thawed before use, and properly covered while working.  plastic wrap and dishtowel does the trick.  the biggest problem i have with this recipe is: THERE ARE NEVER ANY LEFTOVERS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MYSTIKCHARM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1098282/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T22:11:14.927Z",
                "reviewBody": "This was a great recipe that I have used over and over again!  MY kids love it! I add more feta and triple the garlic so there is more flavor.  My mother used to make this all the time and she gave me a great hint...Pre cut it BEFORE you bake it for the phyllo won't crack and break nearly as much...just be gentle in the cutting for the phyllo is slippery!  Oh, and fresh parley is a must, do not used dried.  Wonderful served with Greek salad and pita bread with hummus!  Thanks, Silverwolf!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kira Martin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/953591/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:38:02.927Z",
                "reviewBody": "This was an excellent recipe. I used the same amount of filling for a 9 x 13 inch pan and it was well proportioned (I added a little extra feta). I would definitely suggest straining the spinach mixture before spreading over the phyllo dough. Excellent flavor!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINDY3539",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/457217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-27T13:11:49.37Z",
                "reviewBody": "I a huge fan of spanakopita and this recipe is definitely a good one. There are a couple of items to tweak for me though to make this a 5 star recipe. Two must have items for this recipe are fresh dill and freshly grated nutmeg (I use about 1/2 nut). The dill goes wonderfully with the spinach and green onions but the nutmeg is the key; it just adds a spark to all of the flavors and pulls everything together.\n\nMy other personal preferences are melted butter for the phyllo and I actually place phyllo on bottom, middle, and top like a lasagna. I use a 9 x 13 pan and generally use at least 10 sheets for each layer. I also bake covered in foil for first 30 minutes at 350 degrees. I then remove the foil and turn heat up to about 375 for another 10 minutes or so until phyllo lightly browns.\n\nIt really is a wonderful dish if you have never tried it and again, don't forget the dill and nutmeg...you won't be sorry! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GenePA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1502922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-01T02:55:49.53Z",
                "reviewBody": "I live in Michigan ...and this taste like the pie i get from one of the Greek Town resturants. Thank you so much!!! My hubby loved it!!! and we are very picky  I used butter for my phyllo dough and I added  a little salt and pepper, dill weed and nutmeg...Very, Very, good :o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TABBIEG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/282386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-15T23:51:24.7Z",
                "reviewBody": "Very complete and user friendly recipie. I was a professional cook for 3 years at a 4 star restaurant, and know a user recipe. I made it last week, and it came out very tasty. I made it again today for a party, and this time using butter only, as the fat, i used 15 sheets of phyllo on the bottom then 1/2 the updated mixture, 10 sheets of phyllo, then the 2nd half of mixture, and topped with 15 more buttered sheets of phyllo. I used 4% cottage cheese (24 ounces) instead of ricotta, 24oz of crumbled feta, 5 cloves of fresh garlic, and 3 boxes of frozen spinach, 1 red onion diced, 2 eggs, 1/2 lemon juiced. This will make 15 servings, for it is 4\" high before baking. I used the method written in a review of squeezing the spinach between 2 plates to remove the liquid and it worked better than any other method I tried as a professional. Cheers",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "wolfy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2680138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-10T00:11:51.123Z",
                "reviewBody": "I didn't particularly enjoy this, although it was my own fault.  I have never worked with fresh spinach before and did not remove the stems before putting it into the food processor.  The stems made it bitter and stringy.  REMOVE THE STEMS AND ONLY USE THE LEAVES and I'm sure you'll enjoy this much more than I did.  It looked great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MCIPOLLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/361575/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spanakopita (Greek Spinach Pie)",
            "description": "Watch how to make this top-rated Greek spinach pie.",
            "uploadDate": "2012-10-01T18:18:31.771Z",
            "duration": "PT6M51.119S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7d0bed6f-e5ab-4111-af3f-90ba5b3bad8f%2F50347f49-dd33-4b78-9793-334a7a076339%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1871207961001"
        }
    }
]