[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/56391/cheesy-brat-stew-for-the-slow-cooker/",
        "name": "Cheesy Brat Stew for the Slow Cooker",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2824074.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2019-04-04T03:31:22.000Z",
        "description": "This is a delicious stew! Easy to make and wonderful to eat.  Great for those chilly days watching football games.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 bratwurst links, browned and cut into 1/2 inch slices",
            "4 medium potatoes, peeled and cubed",
            "1 tablespoon dried minced onion",
            "1 (15 ounce) can green beans, drained",
            "1 small red bell pepper, seeded and chopped",
            "2 cups shredded Cheddar cheese",
            "1 (10.75 ounce) can  cream of mushroom soup",
            "⅔ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the bratwurst, potatoes, minced onion, green beans, red pepper, Cheddar cheese, mushroom soup and water into a slow cooker. Cover, and cook on medium for 3 hours, or until potatoes are fork-tender.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SGUSE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.112781954887218,
            "ratingCount": 266,
            "itemReviewed": "Cheesy Brat Stew for the Slow Cooker",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "603.5 calories",
            "carbohydrateContent": "35.1 g",
            "cholesterolContent": "102.4 mg",
            "fatContent": "40.4 g",
            "fiberContent": "3.6 g",
            "proteinContent": "24.8 g",
            "saturatedFatContent": "17.2 g",
            "servingSize": null,
            "sodiumContent": "1487 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-07-31T17:24:18.42Z",
                "reviewBody": "OK...I admit that I did not make the recipe just as described, but what I made was reviewed by my husband as \"the best soup you've ever made.\"  Very high praise indeed!!  I browned fresh onions (instead of dried) and peppers first, then added the potatoes to brown as well.  To make things even easier on myself, I used half a sack of those frozen cut up potatoes that are meant to be for hash browns.  Then, instead of the brats, I used two packages of sliced Hilshire Farms smoked sausages (they are already cooked, so that speeds up the time).  The rest was cooked as indicated.  EXCELLENT FLAVOR!!!  I will definitely be making this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAULABASKET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1240287/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-25T15:50:04.613Z",
                "reviewBody": "My husband and I really enjoy this. I like to use brats that we grilled the day before because it gives the stew a wonderful smoky flavor. For those users who complain that it's too greasy: Do not stir in cheese until the end of cooking. I usually add it in the last 30 minutes and turn the crockpot to high. You can also use half cheddar and half american cheese (which melts and incorporates better). That way the cheddar flavor comes out but the stew is rich and creamy. Hope these suggestions help!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "aggiesgirl1945",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-05T18:55:21.883Z",
                "reviewBody": "I wasn't sure what to expect with all the differing reviews.  We enjoyed this, it was a bit like comfort food on a cold winter night.  My \"tweaks\" were chicken stock in place of water (only because I had a container opened already) and I added one can of cheddar cheese soup since some reviewers said there was not enough liquid.  Our stew was a touch soupy, but I prepared for that with a large hunk of crusty bread to soak up the sauce!  Please keep in mind that even after 4 hours on High, the potatoes were still a touch hard, but not enough to stop us from eating dinner then. It was nice to find a recipe for bratwurst that was different, yet tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KOALAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T16:36:32.327Z",
                "reviewBody": "i think this is great for a busy day. i omited the canned grean beans and added corn frozen and some chopped parsley and a little garlic. with good crusty rolls and a salad --this was delicious! jeanie-",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JEANIE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/335875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-07T15:32:26.11Z",
                "reviewBody": "This came out awesome! I have a fairly small slow cooker and I filled it to the very top. My mom makes a noncheese stew very similar to this but she uses sausage not brats so I did the same because I know it tastes good._____________I used 28oz of Johnsonville smoked sausage 3 potatoes fresh green beans a little bit of chopped bell pepper almost 2 cups of shredded cheddar 2 cans cream of mushroom soup 2 cans cheddar soup 1 packet onion soup mix and some garlic powder.___________I mixed the soups/cheese/spice in a bowl then I alternated pouring it and the meat/veg into the cooker just so everything would fit. Cooked overnight 10hrs on low then switched it to warm mode till dinner. I was worried it would be too cheesy but I think it came out great. It was nice and thick I didn't use any water. Will def make again thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAPTORSHARK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2991955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-03T16:41:36.013Z",
                "reviewBody": "We loved this! The only changes I made were that I left out the red peppers (didn't have any or I surely would have added them) and I used new (red) potatoes and left the skins on - yum! I didn't read the other reviews before making this or I might have used the cheese soup too (probably in addition to the cream of mushroom because I was wishing there was more sauce/liquid!). I didn't precook the potatoes as some other reviewers suggested but I did set my crock pot on low and cooked for 6-7 hours. It came out great - we will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THELBERG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thelberg/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T17:14:35.9Z",
                "reviewBody": "This sounded like a foolproof recipe, what could go wrong with brats and cheese?  Since my slowcooker only has 2 settings,  I decided to cook all the ingredients on low for 6 hours.  I fully cooked the brats and used 1/2 italian and 1/2 hot italian brats.  I drained them on paper towels to cut down on the grease. After cooking, the potatoes were not yet done, as they still had a hard-waxy texture.  The dish was also rather salty, but that may be due to all the canned ingredients.  The finished product was also very runny, I had been expecting more of a creamy soup, not a cheese broth.  A can of cheese soup or maybe nacho cheese would have really helped.  Additionally, there was just too much bratwurst in this recipe, I'd probably halve it.  Lastly, I think that some roughly chopped kale would be excellent in this.  I might try this again, but only with these changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "OTTOS2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1416836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-16T16:37:04.687Z",
                "reviewBody": "Absolutally wonderful!! I wasn't sure how it would turn out but it was great. I didn't have red peppers but turned out great without. Also I didn't measure the cheese (could have been more or less) but wonderful. Will definately make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHIPPETCRAZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/726392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-24T02:34:32.2Z",
                "reviewBody": "When I came across this recipe I thought for sure I had found a winner since we love brats cheese and potatoes. What we ended up with was far from that. The potatoes were barely done the \"sauce\" was greasy and thin and it didn't really taste anything like cheese. I'm not sure if our expectations were too high or if I am just too new to the slow cooking world and I didn't know enough secrets to fix it up like some of the reviews I read afterwards had listed but I seriously doubt I will be making this again anytime soon. Why waste perfectly good brats when we can grill out?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice Boothe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1569026/"
                }
            }
        ]
    }
]