[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/725/world-cuisine/european/scandinavian/",
                    "name": "Scandinavian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/56443/karjalan-pies/",
        "name": "Karjalan Pies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F26779.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "2019-04-04T03:31:22.000Z",
        "description": "These savory pastries were my favorite thing to eat in Finland.  Rice porridge surrounded by a rye flour crust, baked until slightly browned.  In Finland, they're often eaten at breakfast or lunch.  Delicious topped with ham, cheese, or just (real!) butter.",
        "prepTime": "P0DT0H50M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "16 pastries",
        "recipeIngredient": [
            "2 cups water",
            "1 cup uncooked white rice",
            "2 cups milk",
            "salt to taste",
            "½ cup water",
            "1 teaspoon salt",
            "1 cup rye flour",
            "¼ cup all-purpose flour, or as needed",
            "3 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine rice and water in a saucepan over medium heat. Bring to a boil, then reduce heat, cover, and simmer for 20 minutes, or until water is absorbed. Stir in milk, cover, and cook until milk is absorbed by the rice, about 20 minutes. Season with salt to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 450 degrees F (220 degrees C). In a medium bowl, stir together the salt and rye flour. Stir in water. Mix in all-purpose flour 1 tablespoon at a time until dough is just past the sticky stage. Divide the dough into 16 equal portions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, roll each piece of dough out into a thin circle 6 inches in diameter. The dough should be as thin as possible. Place about 3 tablespoons of the rice mixture in the center of each circle. Spread the mixture out to within 1 inch of the edges. Fold the edges of the dough upward, and crimp the edges so as to allow the pastries to hold their shape. Pinch the sides at each end to form a little boat. Place pastries about 3 inches apart on an ungreased baking sheet, and brush the tops with butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 15 minutes in the preheated oven, until the dough is firm, and the rice porridge is slightly browned on the top. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Scandinavian"
        ],
        "recipeCuisine": [
            "European",
            "Scandinavian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sara A"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.538461538461538,
            "ratingCount": 39,
            "itemReviewed": "Karjalan Pies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "106.2 calories",
            "carbohydrateContent": "17.1 g",
            "cholesterolContent": "8.2 mg",
            "fatContent": "3 g",
            "fiberContent": "1.1 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "174.9 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-14T06:42:14.06Z",
                "reviewBody": "This recipe is just like the recipe I got from a mummu (old Finnish grandma) who showed me how to make them before I left the country. She of course made them without a recipe and I roughly tried to copy it down into a recipe and it came out pretty much like this. FYI there are two types of rye flour: course (or regular) rye flour and fine rye flour. Use the course flour for this since you'll be mixing wheat flour in with it. Also you'll end up putting about the same amount of wheat flour in as rye flour so you don't have to do it one tablespoon at a time you can almost double it at first and then add slowly until the texture is right. You can also add egg white to the butter to brush on top and you can also brush them again while they're oven if you want them super golden brown and soft but it's hardly necessary. For the rice try to use sushi or short grain rice but if you can't find it I think Thai Jasmine rice is the next best. Also these are best with whole milk and real butter. Finns usually serve these by spreading butter on top followed by some type of cheese (usually Edam). It's very common to eat them with ham and you can really put on whatever you want (tomato lettuce etc.). A lot of work but worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ryan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-06T04:30:06.273Z",
                "reviewBody": "Good recipe, and this review comes from a Finnish girl whose Grandma and Great-Grandma used to make these by the hundreds every morning to be sold at local farmer's markets. I think the eggbutter which Karjalan Pies (Karjalan Piirakka) are traditionally served with should be part of this recipe: 3-4  hardboiled eggs, peeled and chopped (use egg slicer...slice one way and turn the egg, and slice another way), combined with easily spreadable butter (\"I can't believe it's butter light\" works great), and some salt to taste. Gently mix together and spread on top of the warm  pies for a more authentic taste.\nAlso, don't worry too much about the shape when rolling the uncooked dough...kind of an oval/circle will do just fine. Run your hand (with a little flour in it) over the rolling pin after rolling out each pie (on floured surface), this will keep it from sticking. The thinner you roll the dough, the crispier the pies (substituting some regular bread flour will make the pies softer). \nPasta machine makes the rolling part faster if you are making a large batch, 50 or so. Typical Finns make these pies much larger in size than this recipe says, this amount would only make about 7-8 pies. \nI always use Calrose rice and wait until it's still easy to stir, but all the runny fluids are absorbed. Thanks, Sara!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hooked on recipes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2922774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-19T22:23:00.937Z",
                "reviewBody": "Of course the Finns will probably flip when they read this but I didn't have any rye flour so I used regular flour and added a tsp. of italian seasoning tsp of chives and a tsp of rosemary. The pies turned out wonderfully and tasted great. I will definately try this again and see what it tastes like with rye flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NADAS6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1424565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-13T16:43:01.153Z",
                "reviewBody": "I have two Finnish daughters in law and first tasted these delicious pies in Levi in Northern Finland. We used to eat them warm with chopped hard boiled egg mixed with melted butter on top.I was thrilled to find this recipe and made them with very good results. I used sushi rice and a pasta machine to get the required thickness for the dough.One of my daughters in law is staying with me in Australia and she enjoyed the little taste of home. I made mine a little smaller than Sarah's and boy are they filling. No ski slopes here to work them off! Thanks Sarah.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "spikesmum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1600466/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-01T18:58:48.14Z",
                "reviewBody": "Exactly like I remember them from Finland. I have been looking for this recipe sine my one and only visit in 1989. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALICIA549",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673074/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-12T19:57:50.793Z",
                "reviewBody": "Time consuming but fun to make the boat shape. The dough can be sticky so dusting is important when rolling out the dough. My hubbie found this a bit confusing though because he expected sweet rice pudding wrapped in dough. Leftover made a great snack when reheated in the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kuratenko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-11T15:09:20.393Z",
                "reviewBody": "Loved this recipe! Thank you! Made me feel like I was back in Finland",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Z.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1902652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-12T02:30:51.603Z",
                "reviewBody": "This was surprisingly wonderful. After reading the reviews I saw that it is customary in Finland to top it with egg butter (melted butter and diced hard boiled eggs). Seemed weird at first but oh man...it sent it over the top. Loved this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mobrown99",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8792018/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T07:17:58.323Z",
                "reviewBody": "Mine weren't pretty and due to the grocery store being out of rye flour and me being impatient I used plain white flour. But it tastes great! I put a slice of cheese over a few when I took them out of the oven and my boyfriend and I ate them with the melted cheese. Absolutely amazing. I can't think of a better breakfast food or heavy snack. Will have to determine the best way to reheat. I hope nuking will work but I think oven will be the only way to get the right texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2261804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-03T01:01:06.427Z",
                "reviewBody": "I just failed at getting 16 of these or the ones in the photo are about the size of a quarter. I made only 6 small ones and had tons of rice left over. They are only worth the work if you are from Finland and need a taste of home or you have to make a Finnish recipe for school like we did. The combination of rice and rye (with egg butter) is yummy but could be just as good on nice toasted rye bread without all the work and mess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "4Travelers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2841355/"
                }
            }
        ]
    }
]