[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16244/main-dish/rice/beans-and-rice/",
                    "name": "Beans and Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/58211/authentic-louisiana-red-beans-and-rice/",
        "name": "Authentic Louisiana Red Beans and Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F6277719-2000.jpg",
            "width": 2000,
            "height": 1333
        },
        "datePublished": "2019-04-04T03:31:28.000Z",
        "description": "Authentic Cajun flavor! I grew up in Louisiana and love red beans and rice; these are just like I remember. Serve with Tabasco sauce for a little kick. My family loved to splash a little cider vinegar in each bowl.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT3H5M",
        "totalTime": "P0DT11H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound dry kidney beans",
            "¼ cup olive oil",
            "1 large onion, chopped",
            "1 green bell pepper, chopped",
            "2 tablespoons minced garlic",
            "2 stalks celery, chopped",
            "6 cups water",
            "2 bay leaves",
            "½ teaspoon cayenne pepper",
            "1 teaspoon dried thyme",
            "¼ teaspoon dried sage",
            "1 tablespoon dried parsley",
            "1 teaspoon Cajun seasoning",
            "1 pound andouille sausage, sliced",
            "4 cups water",
            "2 cups long grain white rice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse beans, and then soak in a large pot of water overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a skillet, heat oil over medium heat. Cook onion, bell pepper, garlic, and celery in olive oil for 3 to 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rinse beans, and transfer to a large pot with 6 cups water. Stir cooked vegetables into beans. Season with bay leaves, cayenne pepper, thyme, sage, parsley, and Cajun seasoning. Bring to a boil, and then reduce heat to medium-low. Simmer for 2 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir sausage into beans, and continue to simmer for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, prepare the rice. In a saucepan, bring water and rice to a boil. Reduce heat, cover, and simmer for 20 minutes. Serve beans over steamed white rice.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Beans and Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MIAMI BEACH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.475800446760982,
            "ratingCount": 1343,
            "itemReviewed": "Authentic Louisiana Red Beans and Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "630.4 calories",
            "carbohydrateContent": "79.1 g",
            "cholesterolContent": "32.9 mg",
            "fatContent": "24.2 g",
            "fiberContent": "10.1 g",
            "proteinContent": "24 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "603.9 mg",
            "sugarContent": "2.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-02T00:00:45.7Z",
                "reviewBody": "Cajun-country reviewer here to say this is about as authentic as it gets, though technically a Cajun home cook doesn't use recipes or measurements.  According to Louisiana tradition this would be served on a Monday -- supposedly an easy meal for laundry day because of the simmering time -- accompanied by sweet, plain, or cracklin' cornbread and a glass of iced sweet tea.  Practically speaking, it's a tasty & inexpensive any-day meal.  Oh, and, andouille is a cajun sausage made in Louisiana & pretty common in southeastern grocery stores; elsewhere, you might be able to find it in specialty stores or else ask if the manager of your grocery store can order it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cassandra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/714636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-24T21:20:14.913Z",
                "reviewBody": "The andouille is a MUST for this to be authentic, Jacob's world famous andouille ships and is worth it when you can't get it locally. Also try vegetable oil instead of olive oil, it gives a different taste and instead of cooking the garlic first, throw it in during the simmer process to avoid the 'nutty' flavor of it frying, increase the bay leaves to 4 or 5 and use oregano instead of sage & thyme.  When completely cooked the beans should be very soft with a creamy consistency, use the back of a wooden spoon to smash some of the beans against the side of the pot as you stir them. EXCELLENT, also try serving with a bottle of pickled peppers at the table, sprinkle a little of the peppers vinegar on the beans for added spice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyDiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2486062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-12T02:22:05.41Z",
                "reviewBody": "Everyone loved this.  We made it vegetarian-friendly... instead of water, I used veggie broth; instead of sausage, I used veggie sausage crumbles.  You couldn't even tell because there are so many yummy flavors in this.  I used more cajun seasoning and cayenne pepper than the recipe called for.  I also used 4 cans of kidney beans rather than dried, and just added them when I added the sausage (I simmered the veggies in the broth with spices for about 1.5 hours, than added the beans and veggie sausage for the last half an hour).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAWESA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1058499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-28T06:01:19.47Z",
                "reviewBody": "This dish was absolutely delicious and packed full of flavor.  With any recipe..you have to make it your own. A little of this and a little of that goes a long way.  Of course it needs salt..you should add that before anything else is done...Most of these recipes are base recipes..something that you can build from. It's up to you to make it worth your while. With my revisions it was the perfect consistency, perfect flavor, just the right amount of spices..I did omit the celery and garlic clove. I used dried minced garlic, red and green bell peppers, lots of cayenne, Tony's creole seasoning and chicken broth...not that store bought stuff but just regular water with better than boullion chicken base..(can be found in just about any grocery store) instead of water, I also used a little sage and cumin. I replaced the olive oil and used butter.  I seasoned my vegetables while they were carmelizing. I loved it and my fiance thought it was the best thing since white bread,,,needless to say I will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimi Lareux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2392656/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-22T16:58:31.77Z",
                "reviewBody": "A little tip from someone who was born, raised and still lives in south Louisiana... instead of oil, brown the sausage and saute the trinity in the rendered pork fat from the sausage!  You'll never use oil again!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Broussard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5617882/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-02T15:45:38.193Z",
                "reviewBody": "Awesome recipe!  Very authentic, and I'm from the south.  I decreased the oil to 2 Tbl. to cut down on the fat, decreased the cayenne pepper to 1/4 tsp. (just personal preference), and used the \"Simple Cajun Seasoning\" recipe found on this site.  I cooked everything with the lid on for the first hour to keep the water from evaporating, then cooked 1 more hour with the lid off (2 hours total was perfect).  I used turkey smoked sausage to, again, cut down on the fat (added the last 30 minutes of cooking).  After cooking, I added 1 1/2 tsp. salt.  The next time I made this, I was half asleep and used pinto beans when I should have used red beans - still came out great!  Thanks so much for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-08T18:56:28.363Z",
                "reviewBody": "I disagree that andouille is absolutely essential to an authentic red beans & rice.  By definition, Cajun and Creole cuisine is \"peasant food\" that makes use of what is on hand by people who lived off the land (e g. Cajun) and/or cooked with secondary protein sources rejected by the rich (basically, the scraps - e.g. Creole).  I think what you purists are referring to as \"authentic\" is in fact \"traditional\".\n\nIn New Orleans even, andouille isn't the only protein that can be used in an authentic red beans recipe.  You could use andouille, or tasso, or boudin.  In the bayou (e.g. Donaldsonville, etc.) and on the plantation (West Feliciana Parish, etc.) you would also see smoked turkey necks, smoked ham hocks, pig feet, pork belly, alligator meat, etc.\n\nIn fact, some of the oldest and most authentic recipes I've found for this dish contain only salt pork or pickled pork.\n\nI've even found fully vegetarian recipes that are older than the invention of andouille.  Let's not forget, this dish is all about stretching a small amount of protein into a full meal in the autumn months when meat is scarce and what meat they had was being hoarded/preserved for winter.\n\nAll that being said, I absolutely love andouille.  I just find it ludicrous to get all snooty and stuck up about what started off as the furthest thing in the world from pretentious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Russ Adams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13595896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-01T22:08:15.593Z",
                "reviewBody": "This was awesome. I thought i would never be able to duplicate grams red beans and rice! Nothing i tried came close to her cajun cookin. The only thin i did different was to smash the beans against the side of the pan once they started gettin soft. Thats how she did it and it produces a thick gravey type sauce. Smelled awesome while it was cookin. Took less than 2 hours to cook, probably cuz i used small red beans instead of large kidney beans. had to add a little more water or it would have been to thick. We also dont have andoulli in MI, ive only seen it in LA. I used eckridge smoked sausage and it still was great! This is now my new recipe! THANKS",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "April",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2290835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-03T23:17:47.25Z",
                "reviewBody": "ok, i live in metairie which is 10 minutes from new orleans and i have a recipe for red beans but i am always looking for new addition or techniques. This recipe was followed exactly.  This recipe just isn't authentic and not worth the time. sorry",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CAJUNPCS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1402224/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Authentic Louisiana Red Beans and Rice",
            "description": "Get set for some serious Cajun flavor!",
            "uploadDate": "2012-07-27T21:58:25.183Z",
            "duration": "PT5M36.192S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa13aaa0a-8484-46e2-82de-f4c4160c9854%2Ff3eb0f3d-2324-4bc6-b94b-8d39c4f6fa47%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1758146941001"
        }
    }
]