[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/58246/make-ahead-lunch-wraps/",
        "name": "Make Ahead Lunch Wraps",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1053890.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-04T03:31:28.000Z",
        "description": "These are a delicious make-ahead lunch to freeze as a handy lunch to bring to work! Just make, freeze, and then heat in the microwave for a very balanced meal.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "16 wraps",
        "recipeIngredient": [
            "2 cups uncooked brown rice",
            "4 cups water",
            "4 (15 ounce) cans black beans",
            "2 (15.5 ounce) cans pinto beans",
            "1 (10 ounce) can whole kernel corn",
            "1 (10 ounce) can diced tomatoes and green chiles",
            "16 (10 inch) flour tortillas",
            "1 pound shredded pepperjack cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine rice and water in a saucepan, and bring to a boil. Reduce heat to low, cover, and simmer for 35 to 40 minutes, or until tender. Remove from heat, and cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place black beans and pinto beans into a colander or strainer, and rinse.  Add corn and diced tomatoes with green chilies, and toss to mix. Transfer to a large bowl, and mix in rice and cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the mixture evenly among the tortillas, and roll up. Wrap individually in plastic wrap, place into a large freezer bag, and freeze. Reheat as needed in the microwave for lunch or snacks.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Melissa Pietrosanti"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.440779610194903,
            "ratingCount": 667,
            "itemReviewed": "Make Ahead Lunch Wraps",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "557.3 calories",
            "carbohydrateContent": "80.8 g",
            "cholesterolContent": "30.4 mg",
            "fatContent": "16 g",
            "fiberContent": "13.6 g",
            "proteinContent": "22.9 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "1312.1 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-08T00:51:58.343Z",
                "reviewBody": "This is a fantastic idea and a great base recipe. Now I don't know about you but when I'm pregnant I want restaurant-quality food and I'll spend the time sometimes to get it. To make these taste like high-quality fresh mexican restaurant wraps add the following to the original recipe: 1 large white onion 2 large red bell peppers Lots of olive oil 2 T brown sugar juice of one lime I carmelized the onion and bell pepper together with 2 T brown sugar. This took awhile but it was worth it. Towards the end of carmelizing add the can of corn to the pan and sautee it with the rest. Add some salt and pepper to taste. (Since we didn't use the diced tomatoes I just added one 4 oz can of green chiles to the mix towards the end of carmelizing.) Let this cool sligtly then add the cheese to the onion mixture to help it melt. Mix with the rice and beans. Add the juice of one lime to the mix. Spoon into ezekiel tortillas or whole wheat tortillas and just to make yourself feel more like a chef put a piece of dark lettuce under the burritos to serve. I cooked 1 c of quinoa to 2 c water for 15 min then let rest uncovered in place of 2 c uncooked brown rice. This comes out to about the same volume vs. 2 c rice and is a complete protein grain in itself. Rinse quinoa well before cooking if you try it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Mansfield",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1518612/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-31T23:19:25.953Z",
                "reviewBody": "Healthy, hearty, easy and cheap!  I made a half recipe which yielded 10 stuffed 10-inch tortillas.  I do recommend the following additions (based on half recipe): \r\n\r\n1) season your rice when you cook it (try salt, garlic powder, chili powder) \r\n2) substitute good fresh salsa for the canned tomatoes; my grocery store sells a decent one in the produce aisle.\r\n3) add 1/2 cup chopped fresh cillantro; in my opinion, this makes it!\r\n4) add 4 oz can diced jalapenos \r\n5) add 1T ground cumin and 1T mexican oregano to the mixture. \r\n6) use a one-cup measure to fill the tortillas",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BDIEGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/484463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-16T19:00:08.187Z",
                "reviewBody": "This recipe is great -- I've used it more times than I can count! I love having such a healthy, filling meal available whenever I need it.  When I first started making these, I followed the recipe exactly (I rated it 4 stars), but over time, I've made a couple of modifiations to make these 5 stars!! If it's available, I really like to buy a 14-oz bag of frozen southwest vegetable blend (corn, black beans, poblano chiles, red peppers, and onions).  When using this mix, I decrease the beans to 2 cans black, 1 can pinto. Not all grocery stores in my area carry it, so when it's not available, I use 3 cans black beans, 2 cans pinto, and 1 10-oz can Mexicorn (with green and red bell peppers).  I started decreasing the cheese to half a pound quite some time ago -- I don't even miss it (I also use whatever kind is on hand).  I add a packet of Taco Seasoning to the rice before blending with the rest of the ingredients, and add a can of sliced olives (yummm!).  I love to serve Macayo's Taco Sauce over top -- made as described, and these are anything but bland!!  These are a must try!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RedRobynNAU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-18T19:15:55.047Z",
                "reviewBody": "Awesome convenient & healthy! The basic recipe is a little bland but of course you can tweak & add spices to your liking. One extra step that I took and haven't seen posted is that I pulsed 1/3 of the bean mixture in the food processor before adding the rice & cheese. Then I mixed the processed beans & all other ingredients together. We liked that it held together a little better that way. Really really enjoyed this recipe! Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUEBAGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1179293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-08T16:29:52.873Z",
                "reviewBody": "wow with a few adjustments (huge thanks to everybody's reviews!) these are FANTASTIC! it's just me and my boyfriend so i halved the recipe. still we used 8\" tortillas and ended up with 15 wraps! not that we mind cuz they're so good:) we added taco seasoning to the rice after cooking it so the flavors could blend while it cooled. (i used the \"taco seasoning I\" recipe off this site) also we added cilantro (mmm...) and a 4 ounce can of chiles. i used about 3/4 cup of the mixture per wrap (remember 8\" tortillas) and they are SO filling and delicious with sour cream and salsa. thanks for a healthier yet still quick and easy alternative to \"lean pockets!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JoannaGueller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1843522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T21:02:09.187Z",
                "reviewBody": "Easy to make and very tasty. You will probably need extra tortillas though...I mixed up a half recipe and it made 10 wraps. I have found that they are best when thawed overnight in the refrigerator and heated up for about 2 minutes in the microwave.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianne Wood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873103/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T20:58:46.843Z",
                "reviewBody": "Reading the ingredients I wondered how in the world this could have been so highly rated by so many people because it seemed so ordinary. I tried it anyway and my family loved it. I cut everything in half except the tomatoes and subbed mexican style stewed toms for the tomatoes and chilies because the tomatoes and chilies are too spicy for my smaller children. They asked to have it again so I made another batch and froze them. Even my toddler ate a whole one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NITROJEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/705795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-13T00:08:16.547Z",
                "reviewBody": "These are pretty good! I prefer to take my lunch to work rather than eating greasy fast food whenever possible. After all, you never know if the person cooking your food has washed their hands after their last lavatory visit, or scratched that unmentionable itch 5 minutes ago...... Anyway, these reheat well and are even better with sour cream and salsa on the side. I'll take one or 2 of these when there's no leftovers and/or I don't have time to whip up a quick lunch. They freezer burn rather quickly though. I suggest eating them within 2 weeks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mya Cooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1508857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-21T14:28:41.937Z",
                "reviewBody": "Hate to be one of those reviewers who made changes and then rates it 5-stars but I bet this would've been 5-star without my addition of one 10oz. can of Sue's shredded cooked chicken breast. This is awesome and I have a stash in my work-freezer & my co-workers circle like vultures!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAURUSJEWEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-07T19:12:55.07Z",
                "reviewBody": "As written this is such a bland recipe. Taking the other suggestions into consideration such as the taco seasoning and cilantro this is a wonderful meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "nicolecaroline1023",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2347709/"
                }
            }
        ]
    }
]