[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18419/summer-squash-pizza-crust/",
        "name": "Summer Squash Pizza Crust",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1332550.jpg",
            "width": 2048,
            "height": 2048
        },
        "datePublished": "1999-07-26T05:12:18.000Z",
        "description": "Enjoy this frittata-type crust made with summer squash. Smother this crust with your favorite pizza toppings: tomato sauce or pesto and vegetables galore! Enjoy and be creative! Try sprinkling feta cheese or adding artichoke hearts for a Mediterranean flair.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 cups finely shredded zucchini or yellow summer squash",
            "¾ cup all-purpose flour",
            "¾ cup grated Parmesan cheese",
            "½ cup shredded mozzarella cheese",
            "2 eggs, beaten",
            "½ teaspoon ground black pepper",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once zucchini or summer squash has been shredded (I recommend a food processor) lightly salt the squash and transfer it to a strainer. Let stand 15 to 30 minutes and press all remaining liquid out of squash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium-sized mixing bowl, combine squash, flour, Parmesan cheese, mozzarella cheese, eggs, pepper and salt. Mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the mixture into a greased and floured jelly roll pan. Bake for 25 minutes in the preheated oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the crust from the oven and change the oven's temperature to broil. Brush the top of the crust with oil, and then broil the crust for 3 to 5 minutes until the top is lightly browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Allow the crust to cool slightly and slide spatula underneath all edges and under the middle. Place a large baking sheet over the top of the crust and gently flip the crust over so that the bottom of the crust is now facing upwards. Because it can be difficult to flip the crust smoothly, it may be necessary to cut the crust in half to facilitate the flipping of the crust. If you want to omit the flipping stage, that is okay, but the crust won't be as crunchy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush the top of the crust with oil and broil for another 3 to 5 minutes until the top is browned. Cover with toppings as desired.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dawn Davis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.47,
            "ratingCount": 100,
            "itemReviewed": "Summer Squash Pizza Crust",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "131.3 calories",
            "carbohydrateContent": "11.6 g",
            "cholesterolContent": "60.3 mg",
            "fatContent": "5.7 g",
            "fiberContent": "1 g",
            "proteinContent": "8.6 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "210.7 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-03T03:33:12.987Z",
                "reviewBody": "I have made this twice and it has been delicious every time. It is imperative to get the squash as dry as you can.  I use 2 1/2 pan size pans to bake this, and press it out to about 1/4 of an inch thick.  It is an irregular shape, kind of like an oval.  I also use  olive oil pan spray on my hand when pressing it out to keep it from sticking to me.  A couple of changes I made were: reduced it down to 6, but still get 8 slices. Use 2 1/2 egg whites (helps it to crisp) add garlic powder and oregano.  It browns up nicely and is the close to a hand tossed crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRIEAHN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1183163/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-28T20:08:58.327Z",
                "reviewBody": "I saw other reviewers had trouble with a soggy center -- thanks for the tip. I think I found a good trick! I let the zucchini sit in a colander, weighted down with a slightly smaller bowl and some canned veggies, in the fridge for about an hour. Then I squeezed it by hand and got rid of even more water. Used just 1 whole egg and 1 egg white, and spread the mixture pretty thin, reserving leftover for a small patty to bake. Nicely crisp, and even my very picky boyfriend loved the pizza that we made. I'll make this again, despite the extra time it takes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HOOLIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-09T17:49:45.637Z",
                "reviewBody": "This crust recipe is brilliant!!! My family had NO idea that this was made from squash. Hubby and I are low carbers and this is a keeper in my file!!! Three things make this recipe alot less labor intensive...non stick spray, to keep the dough from sticking to your hands...parchment paper makes flipping the dough a cinch...cheesecloth lets you wring almost every drop of liquid from your squash---the drier your squash is the better your end result will be---this really is the key to success with this recipe. I shredded the squash til it was almost a puree and suspended it over the sink in a cheescloth bag for most of the day, then wrung it nearly dry. I added onion and garlic powders, oregano and pepper to the dough for added flavor. I added an extra egg white for crispness. I agree that thinner is better for this crust and might leave out the mozzarella next time, subbing it for extra parm. This makes a great traditional pie with sauce and pepperoni, but would be great with any variety of toppings. I know I won't be giving away my excess squash from the garden this year! Dawn, thank you for this wonderful guilt-free recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Darkgardyner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2472732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-19T19:05:04.607Z",
                "reviewBody": "As long as you squeeze as much water out of the squash as possible this crust cooks evenly and perfectly. You do have to be sure to cook it for as long as directions say; it does get pretty brown but that's OK! I added about 1/4 cup extra flour (by accident) but it seemed to help. And my husband said this was the best pizza crust he ever ate!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAJUNSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1119952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-20T15:37:36.88Z",
                "reviewBody": "Like some others said I let the squash drain a couple hours then I really squeezed it till dry. To bake it I put parchment paper on the pan first then turning it over onto the cookie sheet was a breeze!!!! We covered it with a little ranch dressing then cooked chopped chicken sliced black olives tomatoes more ranch then shredded pizza cheese. Absolutely wonderful--even my kids who hate zucchini loved this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "family magic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/597768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-08T17:45:39.53Z",
                "reviewBody": "This is a very creative and delicious way to use squash! I'm on a modified low-carb diet (whole grains only lots of veggies) so this was perfect for me after substituting whole wheat flour. I topped this with traditional pizza toppings and it was wonderful! Definitely does not taste like squash. I used frozen grated squash from last summer's harvest. I thawed and drained it then spread it out on paper towels salted and let it stand to get out as much water as possible. I didn't have enough parmesan cheese so I used about half the amount called for and added more whole wheat flour to make up for it. When I spread it in the pan it was very sticky so I dusted it well with more whole wheat flour and rolled it out thin. It turned out very crispy and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISMITH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/103849/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-31T05:00:16.56Z",
                "reviewBody": "WONDERFUL!!! A fun and tasty way to use the overflow of squash from the garden!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BETCSTEV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/662027/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-01T23:54:45.217Z",
                "reviewBody": "Tasted good had some issues making the recipe though. Was far too wet took twice as long to bake. Maybe my fault maybe the recipe I'm not sure but next time I make it I'll be a lot more careful to fully dry the squash. Also seemed like too much for the pan too thick will be dividing the recipe for two crusts next time. I love a crispier crust. Also I added some garlic and fresh oregano to the mix gave it a really nice flavor. Would definitely recommend this with a few little changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetpea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2217323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-16T02:40:11.673Z",
                "reviewBody": "After flipping I would suggest broiling for almost 7 minutes. We'll definitely do a thinner crust next time and set out the squash on a baking pan to dry ALL DAY. We had it in a colander for at least 4 hours and the recipe was still a little moist........but OH SO YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JEJ117",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1308037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-20T22:36:00.373Z",
                "reviewBody": "While the flavor was okay it was way too salty. I only put a few shakes of salt on the squash. I can't imagine using the full measure of pepper. Just used a few dashes and it was plenty for me. Recipe was a lot of trouble for the outcome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kalice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1233561/"
                }
            }
        ]
    }
]