[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/68473/chicken-korma-ii/",
        "name": "Chicken Korma II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F42948.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2019-04-04T03:32:05.000Z",
        "description": "In this mild Northern Indian dish, chicken is simmered in a creamy fragrant sauce with onion, garlic, ginger and cashews. Serve over basmati or sticky rice. Add more chili or cayenne for more heat.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "¼ cup cashew halves",
            "¼ cup boiling water",
            "3 cloves garlic, peeled",
            "1 (1/2 inch) piece fresh ginger root, peeled and chopped",
            "3 tablespoons vegetable oil",
            "2 bay leaves, crumbled",
            "1 large onion, minced",
            "1 teaspoon ground coriander",
            "1 teaspoon garam masala",
            "1 teaspoon ground cumin",
            "1 teaspoon ground turmeric",
            "1 teaspoon chili powder",
            "3 skinless, boneless chicken breast halves - diced",
            "¼ cup tomato sauce",
            "1 cup chicken broth",
            "½ cup heavy cream",
            "½ cup plain yogurt",
            "1 teaspoon cornstarch, mixed with equal parts water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place cashews in a small bowl, and pour the boiling water over nuts.  Set aside for 15 to 20 minutes. Place garlic and ginger in food processor and blend until smooth; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in wok over medium heat. Cook the bay leaves in hot oil for 30 seconds.  Stir in onion, and cook until soft, about 3 to 5 minutes. Mix in garlic/ginger paste, and season with coriander, garam masala, cumin, turmeric, and chili powder. Stir in chicken, and cook for about 5 minutes. Pour in tomato sauce and chicken broth. Cover, reduce heat, and simmer for 15 minutes, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, place the cashews, along with the water in which they were soaked, and the cream and yogurt into food processor.  Process until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the cashew mixture into the chicken and onions. Simmer for 15 minutes, stirring occasionally. Stir in the cornstarch mixture, and continue cooking for 1 to 2 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Trina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.351170568561873,
            "ratingCount": 299,
            "itemReviewed": "Chicken Korma II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "398.6 calories",
            "carbohydrateContent": "13.5 g",
            "cholesterolContent": "95.4 mg",
            "fatContent": "27.5 g",
            "fiberContent": "2 g",
            "proteinContent": "25.4 g",
            "saturatedFatContent": "9.9 g",
            "servingSize": null,
            "sodiumContent": "527.9 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-04T05:14:48.04Z",
                "reviewBody": "I loved this recipe!  But it is much simpler and just as good if you can cut out some steps.  It is so quick and easy!  Instead of processing my own garlic and ginger paste which can be time consuming and messy, I picked up some garlic paste and ginger paste at a local Indian grocer.  I used 1/4 teaspoon garlic paste and 1/8 teaspoon ginger paste (don't use too much ginger paste because the taste can be very overpowering!).  Also, instead of boiling the water for the cashews (cutting out some steps here!), I just crushed up the cashews in a paper towel and put it in after the liquids were poured in and just let it cook.  You can also substitute the cream with low fat coconut milk and it turned out GREAT!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mikaoh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2144688/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-30T20:58:31.973Z",
                "reviewBody": "This dish was as good as any chicken Korma I have had in an Indian restaurant. Two things to note, I used fat free coconut milk in place of half and half. Also, several reviewers mentioned that it was a very mild dish. Well, Indian Chili powder is not the same as Mexican and is, in fact,very hot. It can be purchased at an Indian food store. The brand I use is Rajah. It makes a huge difference to the flavor, but use it sparingly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leonie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2440668/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-07T05:39:34.763Z",
                "reviewBody": "Very good.  After the first night, I'd originally intended to give this\nrecipe 4 stars and write, \"Nice complex flavors, but too mild for my\ntastes.  Still good, and something I wouldn't be surprised to be served at\na real Indian restaurant.\"  But the leftovers were even better!  I guess\nsitting for a day gave the flavors time to coalesce and assert themselves.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mark P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316131/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T21:43:41.86Z",
                "reviewBody": "This is a wonderful recipe! It tastes  just like what the restaurants serve. Here are my suggestions: First, I suggest that you season the chicken pieces to taste ( it really doesn’t have to be breast ) with some salt, cilantro, cumin, garam masala and ginger and leave in the fridge for about 4-6 hours. This way the flavor goes right through the meat. Second, add 1.5 times the amount  of spices(except the bay leaf) the recipe calls for when you are ready to fry in the oil This really gives it a nice spicy taste. Thirdly, people complained that the sauce was watery. I don’t understand why! The trick is to simmer the sauce to your liking. The longer you simmer, the thicker the sauce will become. Fourth, add  1 finely chopped jalapeno pepper (with about 1/4of the seeds) to the sauce to give it that extra kick. Finally  serve this rich sauce over saffron jasmine rice",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tiffany",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4260740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-17T14:15:00.187Z",
                "reviewBody": "This was good but nothing spectacular. It's not as thick and creamy as most kormas. I would highly NOT recommend crumbling the bay leaves as in the recipe... it would be better to just leave them whole and then remove them later. As it was we had to keep spitting out these little crunchy pieces. I used 2.5 tsp garam masala 1/4 tsp. cayenne 4 bay leaves and coconut milk rather than heavy cream (maybe that's why it wasn't as thick as it should be?).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "HAWESA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1058499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-04T16:39:04.75Z",
                "reviewBody": "Though it doesn't taste like the traditional Chicken Korma I'm used to ordering at Indian restaurants it is a very nice curry dish. I've made it with raw chicken or for a quicker meal I shred roasted chicken from the store and I have even replaced the chicken with potatoes peas and diced carrots and use vegetable broth for the vegetarian nieces. Easy to modify the spices for your own tastes - we always throw in a little cayenne. I do not use the bay leaves nor process the garlic and ginger but instead brown them with the onion. Following another raters advice I do occasionally add raisins and they are a nice touch. To keep the dish light I use 1 cup of plain yogurt and skip the cream. We also typically serve it over brown rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "seattlecooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1774827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-07T19:40:23.357Z",
                "reviewBody": "Really delicious and different. I subbed ground ginger and used a garlic press so there wasn't any need to process them together. I didn't have any bay leaves or turmeric but I think it was fine without. I also didn't grind up the cashews just left them chopped. I used fat-free sour cream instead of yogurt and for the heavy cream I subbed 1/3 cup skim milk and a few tablspoons of margarine. This probably made it considerably more healthy and the dish was still very creamy. At the end of the cooktime I mixed brown basmati rice right into the chicken mixture and it was delicious. My husband ate the leftovers in tortillas the next day and said it tasted even better after having time to sit. I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1147886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-07T01:09:03.58Z",
                "reviewBody": "I tripled the spices for this recipe but it still didn't have much flavor. Also it tasted more pakistani than indian to me. It was okay but wouldn't make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Faith08",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2560160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-31T17:19:14.527Z",
                "reviewBody": "I am a spice person, I want food to burn me when I'm eating it.  And, never being one to follow the rules, I did make some amendments to the spices in this recipe, and added a few extra ingredients to \"make it my own\".   I used an extra clove of garlic, a bigger piece of ginger, and \"heaped\" the dry spice measurements.  rather than using chili powder, I used 1/2 heaping tsp of chili powder, and 1 tsp of cayenne pepper to kick up the heat.  I also added some red pepper flakes and about 1 tsp of salt.  In the last 5 minutes, I added whole cashews and raisins - about 1/4 cup of each.  I garnished with fresh chopped cilantro and cashews.  Served this with Basmati rice that had been cooked with whole cloves and a cinnamon stick. My husband said that it was the best curry type dish he's ever eaten.  Great base recipe for someone like me who likes to \"tinker\". I will DEFINATELY make this again! Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kidcallous",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4121922/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Korma II",
            "description": "A Northern Indian style dish with vegetables or meat in a creamy and spicy sauce!",
            "uploadDate": "2018-05-14T20:58:42.118Z",
            "duration": "PT2M7.75S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe287a5cd-30d0-4aa1-b0ce-569c723fc109%2Fb8a304ce-ab51-4c50-b2e2-364d6865015e%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5784694840001"
        }
    }
]