[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14363/main-dish/rice/fried-rice/",
                    "name": "Fried Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/68640/fried-rice-bowl/",
        "name": "Fried Rice Bowl",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4561071.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2019-04-04T03:32:07.000Z",
        "description": "My husband is Chinese and I am Western. Between the two of us we came up with this recipe for fried rice that is actually a meal in a bowl. Now all my Chinese relatives make it this way and our Western friends have asked us to teach them how it is made. Optional ingredients include meat, salted fermented black beans, cashews, and chili oil. I can do this dish in well under half an hour, and that includes all the chopping. This dish is good for colds, depression, writer's block, stubbed toes, insomnia, heartbreak, religious crises and general crankiness. It can change your life. Yum.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 sticks dried bean curd",
            "1 tablespoon shredded black fungus",
            "7 dried black mushrooms",
            "boiling water",
            "3 ¼ cups water",
            "2 cups basmati rice",
            "1 tablespoon butter or oil",
            "4 eggs, beaten",
            "3 tablespoons vegetable oil, or as needed",
            "1 cup cubed carrots",
            "1 cup chopped yellow onion",
            "4 tablespoons minced fresh ginger root",
            "4 tablespoons minced garlic",
            "½ cup thinly sliced green onions",
            "1 cup frozen peas",
            "3 tablespoons tamari",
            "2 tablespoons sesame oil",
            "fresh ground black pepper "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the dried bean curd in a bowl, and cover with boiling water. In a smaller bowl, place the shredded black fungus and dried black mushrooms, and cover with boiling water. Allow the bean curd, black fungus, and dried black mushrooms to soak until rehydrated, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 3 1/4 cups of  water with rice in a saucepan. Bring to a boil over high heat, and let it boil hard for one minute. Cover with a lid, and turn heat to low. Cook on low for 5 minutes, then remove from heat (without lifting the lid). Let sit, covered, while you prepare the rest of the meal, or about 20 minutes.  Do not at any time lift the lid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a  non-stick skillet, melt butter over medium-high heat. Scramble eggs to the dry instead of the creamy point. Dump them into a bowl, and continue to chop them into bits with the edge of a wooden spoon. You don't have to pulverize them, go for pieces about the size of your thumbnail.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In one bowl, combine carrot, onion, garlic, and ginger.  In another bowl, green onions and frozen peas. Now drain all the water off the bean curd, fungus and mushrooms. The bean curd might need some tough bits removed, and the remainder cut into quarter-inch rings. The mushrooms only need slicing and the fungus is pre-sliced so no worries there. Combine bean curd and mushrooms in a third bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat wok over high heat; let the metal get smoking hot, about one minute. Add  three tablespoons of vegetable oil. Wait about 30 seconds, and tip in the bowl of carrot, onion, garlic, and ginger. Cook, stirring frequently.  The garlic's going to brown first because it has the highest sugar content, so keep an eye on it, and turn the flame down if necessary. Tip in the  bean curd, shredded fungus, and mushrooms, and cook and stir for one minute. Now look to see that your flame is set to maximum, and tip in the spring onion and the frozen peas. You don't need to cook them, just threaten them. Keep them moving, and mix in the rice. Stir in the eggs, and then season with generous, generous amounts of tamari and sesame oil, and a few twists of fresh black pepper.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Fried Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ELSPETHFAHEY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.589743589743589,
            "ratingCount": 39,
            "itemReviewed": "Fried Rice Bowl",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "539.3 calories",
            "carbohydrateContent": "71.7 g",
            "cholesterolContent": "129.1 mg",
            "fatContent": "19.8 g",
            "fiberContent": "5 g",
            "proteinContent": "19.9 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "612.9 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-08-15T00:07:32.183Z",
                "reviewBody": "This is a terrific recipe! It takes a trip to the Asian market to get some of the ingredients but the flavor they add are worth the trouble. I added chicken to the recipe and plan to make it again with shrimp. The quantities that I had to buy the Asian ingredients in will make the recipe at least two maybe three more times. All in all it is a very economical meal. The amount of garlic looked like too much to me so I just did 2 1/2 tbsp. but I'm sure it would have been fine with 4. The fresh ginger tastes so good in this recipe. Leftovers are just as good as fresh! I want to use this for company sometime and have all the chopping done early and throw it together when they arrive. This is a definite keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefHenry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1487912/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-28T23:23:59.6Z",
                "reviewBody": "FIRST OF ALL JUST WANTED TO LET YOU KNOW THIS RECIPE IS PROBABLY THE EASIEST MOST USER FRIENDLY RECIPE I HAVE EVER USED. NOT ONLY IS IT EASY TO UNDERSTAND IT BROUGHT A SMILE TO MY FACE THE FIRST TIME I READ IT BECAUSE EVERYTHING IS SPELLED OUT!! GREAT RECIPE - WOULDN'T CHANGE A THING! GOOD JOB...LOOKING FOR MORE OF YOUR INTERESTINGLY TASTY CREATIONS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER231",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-27T19:57:14.937Z",
                "reviewBody": "That previous review was not accurate. This recipe does not take long to cook unless you plan to get in and out of the kitchen in 5 mins. Then you might consider heating up some frozen box thing. This recipe was quick to make easy and tasted great. I would enjoy more authetic Chinese cooking tips and ingredients.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/458852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-02T16:27:06.87Z",
                "reviewBody": "I have not even made this but I just thought the recipe description was so funny it deserved 5 stars.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bao Le",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/222522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-27T17:46:08.657Z",
                "reviewBody": "First off let me just say how nice it is to see a real recipe here and not Aunt Thelma s Mayo Cheese Cake Mix Biscuits. This recipe is GREAT. This was my first successful foray into Chinese cooking at home and mostly thanks to all of the in depth technique notes (keeping the wok very very hot etc.) it came out beautifully. I made a few substitutions: I swapped the dried bean curd out for hickory smoked tofu marinated in tamari brown sugar black pepper and cayenne pepper. I also added in the highly recommended preserved black beans and they were amazing as promised. Also I did not have enough fresh ginger or garlic on hand but the recipe came out okay with 3T of garlic and 2T of ginger. All in all a great recipe my boyfriend and I loved it and there are PLENTY of leftovers! I think that next time I make it I'll want a little drizzle of sweet sauce (like a plum wine reduction or something) to set off the savory lightly caramelized flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENHERE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1405388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-08T22:57:52.78Z",
                "reviewBody": "Best set of stir-frying instructions I've ever seen. And great guidance on ingredients. We agreed that this is the most successful stir-fried dinner I've made. I added snow peas (instead of peas) and broccoli putting them in first to cook. Fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Birdo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1932109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-07T12:24:05.577Z",
                "reviewBody": "Lemme guess-English major?:o) This tasted so yummy! I unfortunately have an electric stove but it still turned out fantastic. Who would have thought I'd ever like something with bean curd in it?! Thank you for the entertaining recipe directions and thank you for the delicious dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIROO1015",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1096175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-14T21:33:05.53Z",
                "reviewBody": "I'm pre-rating this recipes because it sounds so wonderful! I'm having trouble coming up with some of the ingredients. Is Shredded Black fungus the same as Shredded black Mushroom?? Are dried bean curd sticks the same as bean threads?? Help! I'm desperately trying to make this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cristina Collas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1381483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-12T03:53:53.153Z",
                "reviewBody": "This was really really REALLY good. I made it for my boyfriend and myself and we practically ate the whole six servings at once! I have an electric stove and my wok pan was a little small but it still tasted good and BTW the directions for cooking the basmati made it come out PERFECT! The instructions are wonderful and make this a very easy recipe to follow. I found that you do use a lot of dishes but if you just make a small attempt at putting the dirty ones in the DW as you use them the kitchen is pretty clean when you are done! And I am one messy cook...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANDREADAILE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1007077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-28T01:00:36.73Z",
                "reviewBody": "My husband and I were very excited to try this recipe but felt it just wasn't the taste we were looking for. Good but not great. The recipe and directions were very well written. Thing only thing we changed was the peas we substituted edamame instead. Just not a keeper for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "rachelle221",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rachelle221/"
                }
            }
        ]
    }
]