[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
                    "name": "Flat Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70006/whole-wheat-pita-bread/",
        "name": "Whole Wheat Pita Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1029840.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2019-04-04T03:32:15.000Z",
        "description": "I came up with this recipe after a search for a whole wheat pita bread left me frustrated. I used soy flour to totally eliminate white flour. What resulted was a hearty pita with a nice nutty flavor. It tastes great with sandwich fillings, peanut butter, or dipped in hummus. This is my first recipe, so I hope you enjoy it.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H6M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 cup warm water",
            "1 (.25 ounce) package active dry yeast",
            "1 tablespoon molasses",
            "1 teaspoon salt",
            "1 ½ cups whole wheat flour",
            "1 ½ cups soy flour",
            "cooking spray",
            "cornmeal for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a bowl mix the water, yeast, molasses, and salt. Let sit 5 to 10 minutes, then gradually mix in the whole wheat flour and soy flour. Turn out onto a floured surface, and knead until smooth. Place in a large bowl lightly coated with cooking spray. Cover with a towel, and let rise in a warm place for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, and knead for 5 to 10 minutes. Divide into 6 pieces. On a lightly floured surface, flatten each piece to about 1/8 inch thick with a rolling pin. Cover with a towel, and let rise 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C). Warm a baking sheet in the preheating oven for about 2 minutes, then remove from heat and sprinkle with cornmeal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the dough rounds on the prepared baking sheet, and bake 6 minutes in the preheated oven. Remove from heat and cover the bread with a moist towel to soften. When cooled, slice in half and use a knife to cut pockets in the bread.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Flat Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Charlotte's Mom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.271844660194175,
            "ratingCount": 103,
            "itemReviewed": "Whole Wheat Pita Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "101 calories",
            "carbohydrateContent": "17.1 g",
            "cholesterolContent": null,
            "fatContent": "1.1 g",
            "fiberContent": "3.1 g",
            "proteinContent": "7.4 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "197.5 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-06T19:06:37.423Z",
                "reviewBody": "several reviews have noted that this recipe doesn't rise or doesn't form pockets.  This is because it has you add salt in the first step with the water and yeast.  SALT KILLS YEAST  Instead, mix the salt with the flours before adding it to the water, yeast, and molasses.\n\nOtherwise, a nice recipe the best whole wheat pita recipe I've come across.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2059010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-01T19:59:51.11Z",
                "reviewBody": "Some changes need to be made in order to have success.  I have made this recipe twice with my changes and is foolproof.\n\n1.  Instead of molasses I use 2T honey.\n2.  Flour - 2c WW, 1c White\n3.  DO NOT ADD SALT TO THE YEAST/WATER/HONEY.  SALT KILLS YEAST.  ADD WITH DRY INGREDIENTS.\n4.  Roll your pita's really thin and they will puff up nicely.\n5.  Only cover them with a damp towel for a few minutes.  Otherwise the pockets will seal themselves back up.\n6.  I experienced best baking success while using only one cookie sheet at a time.  Two sheets seemed to suck up too much heat and prevent the pocket from forming.\n\nThis is a really tasty recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-26T20:24:10.59Z",
                "reviewBody": "I'm really not sure how to rate this recipe.  First of all, other reviewers are correct:  do NOT put the salt in with the yeast when you proof it!  That will immediately kill the yeast.  Experienced bread bakers would know this, but if you are new to yeast baking, you may not.  Therefore, that hinders this recipe.  However, if you make it past the yeast proofing stage, this is a nice pita bread.  I didn't have soy flour and I wanted a bread that would puff/rise a bit more, so I used 1 cup ww flour and 2 cups all purpose.  Next time I may use some wheat glutin with the recipe as written to see if that helps it rise.  Bakes up beautifully, and I did have pockets in some of my bread.  Does have a nice taste with the molasses and the wheat flour, but you could always sub honey or sugar instead.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-27T02:55:26.827Z",
                "reviewBody": "These were fantastic! I used unbleached bread flour in place of the soy, otherwise followed recipe to the letter. Amazing! I'll definitely make these repeatedly. After making these, we filled them with pizza sauce, pepperoni, mushrooms and cheese and microwaved to make pizza pockets - even my 4 and 5 year olds loved them!\r\n\r\n*note* update on 4/26/05 - I made these exactly according to the recipe this weekend and they were PERFECT. The soy flour smelled a little different while forming the pitas, but the taste and texture were wonderful! I made 8 pitas out of this recipe - even used a ruler to measure them as I rolled them out to make sure they were right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Zanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/zannetastic/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-01T17:50:03.24Z",
                "reviewBody": "I found this much too heavy and I didnt understand the purpose of the molasses. if it's to add sugar so the yeast will rise I suggest using honey instead to avoid the undesirable flavour and colour that molasses gives. a note for the people whose bread didnt rise: I found that you have to roll them out to just the right thickness. the ones I rolled too thin didn't rise as well. also do not add the salt to the mixture until after the yeast has dissolved. otherwise you will kill your yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LittleCahoona",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1621669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-11T03:55:05.357Z",
                "reviewBody": "Very good! Easy to make and comes out perfectly - exactly like the pitas I get at the store. I used 2 cups wheat flour and 1 cup all-purpose. After first rise and before rolling out I refrigerated overnight due to my schedule. Still came out perfectly. I may add a bit of honey next time just to give a touch of sweetness but this recipe is awesome just as it is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIGIGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1298670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-03T15:34:09.093Z",
                "reviewBody": "This is a really great and easy recipe. I didn't think it was that time consuming either. (Compared to making tortillas!) I thought I had soy flour on hand then at the last minute discovered I didn't so I substituted rye flour and they turned out really good. I also made another batch alongside substituting bread flour for the soy. These puffed up really nicely but didn't make a pocket inside so I won't use bread flour again but even the flops tasted better than the ones from the grocery store!! Thanks for the easy recipe with simple ingredients! I have another batch going right now and I didn't even have to re-read the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cottonista",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1522318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-17T18:55:48.937Z",
                "reviewBody": "I made a few changes but they came out amazingly. I didn't have soy flour so I used 2 cups stone ground whole wheat and 1 cup all-purpose flour. I also added 1 T. honey to the beginning. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLIEKAT18",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/463055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-23T22:38:02.89Z",
                "reviewBody": "Excellent! Quick and easy! I couldn't find whole wheat pitas in the grocery store. So I came home and looked for a recipe. I found this one. I used honey instead of molasses and white instead of soy. These turned out just the way I expected. I love them. My family loves them. I will make these again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MelKnee4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2309127/"
                }
            }
        ]
    }
]