[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/249/main-dish/casseroles/",
                    "name": "Casserole Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1006/main-dish/casseroles/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70589/serbian-ground-beef-veggie-and-potato-bake/",
        "name": "Serbian Ground Beef, Veggie, and Potato Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F214025.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2019-04-04T03:32:18.000Z",
        "description": "My boyfriend lived in Serbia for 3 years and always begs me to recreate some of his favorite dishes. Based on his sketchy explanations and a little research into Eastern European spices, I concocted this hearty and slightly spicy bake with ground beef, paprika, and vegetables like celery and peppers. Great with a glass of red wine!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound ground beef",
            "1 tablespoon olive oil",
            "1 green bell pepper, chopped",
            "1 onion, chopped",
            "1 carrot, shredded",
            "2 celery stalks, chopped",
            "½ tablespoon paprika",
            "½ teaspoon salt",
            "¾ teaspoon black pepper",
            "¼ teaspoon crushed red pepper",
            "1 pinch ground cinnamon",
            "1 pinch ground cloves",
            "¼ cup water",
            "⅛ cup red wine",
            "1 cube beef bouillon",
            "2 tablespoons half-and-half",
            "2 potatoes, peeled and sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a skillet over medium heat, cook the beef until evenly brown. Remove beef from skillet, reserving juices, and set aside. Mix in the olive oil, and saute the green pepper, onion, carrot, and celery until tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return beef to the skillet, and season with paprika, salt, black pepper, red pepper, cinnamon, and cloves. Stir in the water and red wine until heated through. Dissolve the beef bouillon cube into the mixture. Remove skillet from heat, and mix in the half-and-half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Layer the bottom of the prepared casserole dish with enough potato slices to cover. Place the beef and vegetable mixture over the potatoes, and top with remaining potatoes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook, covered, 45 minutes in the preheated oven, or until the potatoes are tender.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Casserole Recipes",
            "Vegetable"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "amanda1432"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.435277382645804,
            "ratingCount": 703,
            "itemReviewed": "Serbian Ground Beef, Veggie, and Potato Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "366.6 calories",
            "carbohydrateContent": "27.2 g",
            "cholesterolContent": "71.8 mg",
            "fatContent": "18.1 g",
            "fiberContent": "5 g",
            "proteinContent": "22.7 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "566.5 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-06-11T02:20:32.12Z",
                "reviewBody": "Being from former Yugoslavia myself, I can tell you that you are on the right track with this dish - it's called a mussaka. Anyway, what you are missing is a layer of potatoes in the middle. The original dish is layered so that you first put a layer of potatoes on the bottom, than a layer of meat, a layer of potatoes in the middle, than another layer of meat, than top it off with another layer of potatoes. Otherwise, the dish would be too heavy on the meat side. Also, there is an allspice that is greatly used in that region, which adds a specific taste to the original dish. The spice is called \"vegeta\" and you can find it in many international markets.\n\nIf you make it without that spice, make sure to add some spices to the potatoes before you layer them. I usually add salt, pepper, paprika and some parsley. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "statebriga",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6513338/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-20T19:05:52.077Z",
                "reviewBody": "The taste of the meat/veggie mixture alone merits 5 stars definitely...but there was something starchy lacking in this dish. Despite layering the potatos on top & bottom, there was still an overabundance of meat. (While we all like meat, we ended up having to heat up so leftover rice to accompany the dish.) Some nice ideas might be to serve it with egg noodles, rice or to use MUCH more potato (and perhaps mix the potatos in with the meat prior to baking?) On a separate note, I would definitely recommend including the ground cloves. I'm not a huge \"clove\" fan either, but I used it anyway and the result was fantastic! (If you are still wary, try a dash instead of a pinch...trust me, your taste buds will thank you.)  Again, a thoroughly tasty dish which everyone loved...just lacking some starch accompaniment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Marlowe'sMum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1161171/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-18T02:33:14.967Z",
                "reviewBody": "Wonderful -smells at 6 stars - even better than it tastes at 5 stars.  Use very lean ground beef. Add two cloves garlic, part with the ground beef to be ground, part with the vegetables when cooked. Add 2.5 times potatoes - about 1/2 chopped in smallish cubes in the mix of ground beef and vegetables, plus bit more spices and wine. I simply pushed the ground beef to the side after browning and cooked the vegetables on the other side of the pan... YUM -This left the most wonderful taste in our mouths for over an hour afterwards and made the whole house smell good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "susancache",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2295463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-16T05:22:52.247Z",
                "reviewBody": "I REALLY liked this one! There is so much flavor to it! The only thing I left out was the celery since the poor stuff was quite wilted and sick looking in my fridge! (It did go straight into the trash by the way!!!) Anyway....I added a touch more red wine, I chooped baby carrots instead of shredding one, 4 potatoes and a little extra cinnamon. There is something so devine about mixing beef with flavors like cinnamon...I love it! Hubby is a huge meat and potatoes kind of guy and he went to town on this dish! There weren't any leftovers! This will be a regular at my house....but will be known as the garbage dish.....I had part of a pepper, part of an onion, a small amount of red wine from the night before, potatoes that needed to be used up.....and this dish used up all the leftover stuff so I didn't have to toss it! Great flavor! Thanks for sharing!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tonna Jacobson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7334589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T23:43:39.923Z",
                "reviewBody": "This recipe doesn't have that WOW factor, but it is interesting. Interesting good I would say. It is quick to make...I had it in the oven within 20 minutes. I did make a few changes. I didn't bother with the olive oil, because the dripping from the beef were sufficent to do the vegetables. I cut the black pepper down to 1/4 tspn and reduced the red pepper flakes to a pinch based on the reviews I read that the dish was spicy. Even with those reductions the dish had plenty of spice, but also stayed \"kid friendly\" for my 4 and 6 year old. I also doubled the salt and added garlic powder. The 2 tblsn of half and half cream you add at the end of preperation seemed not to really contribute any real taste or texture ( cream-like )quality to the dish, so when I make this again, I will probably omit it. Also next time I make this recipe I will add more potatos, because the ratio potatos/meat is heavily on the meat side. I think I will cube 1 or 2 potatos mixing it up with the beef and still using sliced potatos for the top and bottom.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chuck Sampson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lifetastegood/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T20:21:26.38Z",
                "reviewBody": "I am serbian. And this dish is actualy called musaka ( similar to greek mousakka) . I usually slice a lot more potato layers, to make it at least 4 layers of potato and 3 of meat mixture, potato goes on top. In the last 10 minutes of baking you add mixture of 5-6 eggs and little milk all over top and bake it for 10 more minutes. That is it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dragana76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5798269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-17T15:10:23.237Z",
                "reviewBody": "We don t mix milk w/ meet but all ingredients (minus the & ) really appealed to me & took a chance. Very glad we did. For those of you w/ the same food laws (or wish to make this a little less caloric ) we increased the wine & water by 1/4c. We sautéed all vegetable prior to browning meet. Other than the mentioned changes we followed the recipe as written. Something different using grounds meet. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "stacykr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1645403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T16:04:24.843Z",
                "reviewBody": "This was really, really good and best of all I had every thing in my pantry. It reminded me of Greek mousaka with the cinnamon, nutmeg and ground beef.  It was interesting, but in a good way.  There were a couple of things I did a little different from the original recipe.  I browned the beef and then put the veggies and seasonings in (I would have liked to have figured out how to do it in one pan, but didn't want to press my luck).  I couldn't figure out why you needed to take the beef out or add the extra oil.  It turned out just fine.  Next time I would only use one rib of celery and cut it up fine since my onion and red pepper (didn't have green) were chopped up fine.  I also didn't have any half and half, but I had sour cream and I added 2 tablespoons and it was fine.  This was fast and easy and tastey.  This is a keeper.  Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETJAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/745460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-29T02:21:45.56Z",
                "reviewBody": "This was a wonderfull treat! The recipe as presented is perfect! Being the cook that I am I added some sweet italian sausage meat garlic & mushrooms. A \"warm you inside and out\" kind of meal.. Thank you thank you thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CaptainLadyG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/captainladyg/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-21T20:46:08.117Z",
                "reviewBody": "The meat mixture is so nicely seasoned, it tasted great, however as a whole this dish was not a success for me. The potatoes needed seasoning and would have looked and tasted better if the top layer was browned towards the end of the cooking time. The casserole itself crumbled all over our plates, I think it needs something to bind it together but I'm not sure what...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RUBY2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853339/"
                }
            }
        ]
    }
]