[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/726/world-cuisine/european/spanish/",
                    "name": "Spanish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/71805/fried-empanadas/",
        "name": "Fried Empanadas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F17478.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "2019-04-04T03:32:25.000Z",
        "description": "These fried empanadas are the best! Raisins and eggs make this recipe extra delicious believe it or not!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "4 ½ cups all-purpose flour",
            "1 ½ teaspoons salt",
            "½ cup shortening",
            "1 ¼ cups water, or as needed",
            "2 tablespoons olive oil",
            "1 small onion, chopped",
            "1 ½ pounds ground beef",
            "1 pinch salt",
            "2 tablespoons paprika",
            "1 tablespoon cumin",
            "½ teaspoon ground black pepper",
            "½ cup raisins",
            "1 tablespoon white vinegar",
            "2 hard-cooked eggs, peeled and chopped",
            "1 quart oil for frying, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the flour and salt. Cut in shortening using a pastry blender, or pinching into small pieces using your fingers, until the mixture resembles coarse crumbs. Use a fork to stir in water a few tablespoons at a time, until the mixture forms a ball. Pat into a ball, and flatten slightly. Wrap in plastic wrap and refrigerate for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium heat. Add the onion and cook until tender. Crumble in the beef, and season with salt, paprika, cumin and black pepper. Cook, stirring frequently, until beef is browned. Drain excess grease, and stir in the raisins and vinegar. Refrigerate until chilled, then stir in the hard-cooked eggs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form the dough into 2 inch balls. On a floured surface, roll each ball out into a thin circle. Spoon some of the meat mixture onto the center, then fold into half-moon shapes. Seal edges by pressing with your fingers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer to 365 degrees F (180 degrees C). Place one or two pies into the fryer at a time. Cook for about 5 minutes, turning once to brown on both sides. Drain on paper towels, and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Spanish"
        ],
        "recipeCuisine": [
            "European",
            "Spanish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "CNCOOK"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5212765957446805,
            "ratingCount": 188,
            "itemReviewed": "Fried Empanadas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "527.6 calories",
            "carbohydrateContent": "21.4 g",
            "cholesterolContent": "32.7 mg",
            "fatContent": "46.2 g",
            "fiberContent": "1.1 g",
            "proteinContent": "8 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "169.2 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-24T17:42:35.587Z",
                "reviewBody": "This is the real thing! Empanadas Chilenas, I love them.  The only thing I did different was: brushed the empanadas with eggwhites diluted in water and I baked them, 350º for 15 to 20 minutes, until golden brown.  They were great! Healthy version!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lulu Mash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1024307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-20T11:17:25.55Z",
                "reviewBody": "The crust is the bomb!  Hot Pockets aint got nothing on this!  I'm mexican, so i had to spice up the flavor to make them like grandma's.  Additing chorizo is a must!  Though, before I cooked the meat, I diced two russet potatoes into very small pieces and cooked them with the onion, olive oil, and plenty of fresh crushed black pepper and garlic salt.  Once the potatoes were crispy and the onion tender, I stirred in the meat, and shortly after a whole link of chorizo.  I also added some hot chili powder and oregano.  If I really had wanted to follow grandma's recipe, I would have used finely chopped top sirloin instead of the frozen pre-ground variety.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chellip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2691371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T20:30:16.653Z",
                "reviewBody": "Oh, my God! I'm Chilean. Empanadas, are among my favorite traditional food. Chilean empanadas are unique in texture and taste. This recipe is great! You can also substitute the meat filling (\"el pino\") for Mozarella cheese, poultry, or seafood.  When you use cheese, don't use any of the ingredients for the meat one, just the cheese!  Sparkle confectioner sugar on the top of the fried cheese empanada before serving.   This recipe should've been called \"Fried Meat Empanadas\" (Empanadas Fritas de Pino). \"Pino\" is what we call the mix of all the ingredients in the meat.  For all empanadas, slide ur clean, wet index finger on the edge of the dough before folding and cooking. This prevents the filling from dripping or falling out while fryng the empanada. Poke the top of the dough with a fork about 3 times before frying so air can exit and prevent dough for exploding while frying.  Look for the recipes for all of them and try them. You and ur family will just love them all! Your guests will love them, too. Make at least a dozen of them for a family of three or four. For parties, make sure you make at least 2 per guest.  Cook time is less than 5 minutes. Two or three minutes of deep fry should be enough.  IMPORTANT: Pls, don't use supermarket dough. The dough recipe is as important as the filling to taste the true Chilean empanadas. Add spices to the filling as per your taste. Don't substitute anything! Enjoy! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soulful-Writer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4224610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-23T21:53:32.537Z",
                "reviewBody": "i LOVED these. our fryer doesn't work anymore so i just baked them in a 400 degree oven coating it with a little bit of olive oil. my whole family thought they were great. the empanadas were VERY filling but they were so good they were all gone the next day!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Destiny16",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2407378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-25T01:00:37.013Z",
                "reviewBody": "This is the only empanada recipe that I've tried and I see no reason to look further! So good that my family can hardly wait for them to cool. I think the raisins add such great flavor - I like to chop them up. This is going into my recipe box. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLYFAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/934985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-23T01:43:04.553Z",
                "reviewBody": "this is just like the Chilean empanadas that my grandma just to make. No one understands empanadas until they have one of these little pies filled with goodness. Great! Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "3RDTIMESACHARM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-03T17:29:01.833Z",
                "reviewBody": "Even if you choose not to use the filling part of this recipe you MUST try making this dough! It was incredible. I halved the dough for a pound of chicken and first of all I have to say that I was nervous about it being messy and sticky and difficult to handle - nope! It yielded 8 large empanadas and one small one with a lot less fuss than I thought (I rolled my circles out to be about 6 inches in diameter and they have to be THIN). Let me also say that it fries up flaky and perfect - just make sure your oil is hot before you slide these in. I tried these with chicken as follows: I sauteed half of a chopped onion in some olive oil and added a pound of cubed chicken breast. Added about 1 tsp. chili powder 3/4 tsp. salt 1 tsp. cumin powder 1 tsp. paprika 1/4 tsp. ground black pepper. I covered this and let it cook on medium heat stirring occasionally. When the chicken was cooked through I let it cool (omitted the raisins and vinegar) and added half a cup of chopped orange bell pepper and a tablespoon of chopped cilantro. Shredded the chicken into smaller pieces and divided into two portions; added habanero cheese to one and left the other as is. Used this to stuff the empanadas and they were fantastic! We liked both versions with and without the cheese. Good with sour cream or chimichurri sauce. Thanks for a great recipe and for taking away my apprehension about making these!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DarkAngel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/208760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-14T07:31:40.2Z",
                "reviewBody": "This dough is on point! I was in La Serena Chile earlier in the year and dined on Empanada Carisco; the best I've ever had. This dough is just as flaky and crispy. I made my own filling: 4 chorizo sausages (shredded sans wrapping) half block of shredded mozarella garlic and leftover mexican cheddar. This is so good I'm gonna make this for my Chilean friends at our next luau!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAKEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-06T15:59:52.67Z",
                "reviewBody": "These were great!!!! I did change the recipe a little. I didn't add hard boiled eggs or the raisins. I did add cheese. They were great just like the ones you would get at your favorite Mexican restaurant",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cgladney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2042865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-27T19:16:14.003Z",
                "reviewBody": "I am not sure what I did wrong. My dough was nothing like the finished product of a lot of the photos on this site. I do see some photos that look like mine did-which was pale white and very bland. The filing was bland too. I made a double amount and ended up giving them away. I spent most of the day making them too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Aisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1642822/"
                }
            }
        ]
    }
]