[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16543/main-dish/pork/pulled-pork/",
                    "name": "Pulled Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/72194/southern-pulled-pork/",
        "name": "Southern Pulled Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F116420.jpg",
            "width": 2048,
            "height": 1328
        },
        "datePublished": "2004-05-05T00:37:45.000Z",
        "description": "This recipe starts out on the stove, and ends up in the slow cooker!  Add your favorite BBQ sauce and eat plain or on a bun! Great for parties.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon butter",
            "2 pounds boneless pork roast",
            "1 tablespoon Cajun seasoning",
            "1 medium onion, chopped",
            "4 cloves garlic, crushed",
            "4 cups water",
            "1 tablespoon liquid smoke flavoring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut the pork roast into large chunks. Season generously with the Cajun seasoning. Melt butter in a large skillet over medium-high heat. Add pork, and brown on all sides. Remove from the skillet, and transfer to a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the onion and garlic to the skillet, and cook for a few minutes until tender. Stir in the water scraping the bottom to include all of the browned pork bits from the bottom of the pan, then pour the whole mixture into the slow cooker with the pork. Stir in liquid smoke flavoring.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on High for 6 hours, or until meat is falling apart when pierced with a fork. Remove pieces of pork from the slow cooker, and shred. Return to the slow cooker to keep warm while serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pulled Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brenda Laughlin Sumner"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.607011070110701,
            "ratingCount": 542,
            "itemReviewed": "Southern Pulled Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "177.5 calories",
            "carbohydrateContent": "2.9 g",
            "cholesterolContent": "58 mg",
            "fatContent": "10.1 g",
            "fiberContent": "0.5 g",
            "proteinContent": "17.9 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "282.1 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-30T17:10:16.46Z",
                "reviewBody": "As a Texas girl living in Montana, I think many reviewers missed the point of what pulled pork is supposed to be. The meat is intended to have sauce added when placed on the bun. You want the smokey flavor of the pork (not all the spices). When you smoke a pork butt (or in this case, cooking it in the crock pot)the purpose is to get the pork very tender. You dress the pulled pork after its done with sauce, Jalapeños, onions, swiss cheese, etc. This recipe is perfect for what it is intended to do--make the pork tender!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEANETTEMT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/212239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-03T18:22:28.81Z",
                "reviewBody": "This recipe was an unbelievable hit at my daughter's graduation party. I did a trial batch with Sweet Babys Rays, and my hubby and I were not impressed. They were sampling \"Cattlemen's\" BBQ sauce at Sam's and we instantly knew that it was the sauce that would make my main course a huge hit. By the third batch I didn't bother browning the pork, onions, or garlic. Just throw it all in the crockpot and cook on high for 6 hours. The meat was so tender all I had to do was press it with a fork and it fell apart. I did not use the juices in the crockpot after the meat was cooked - it sounds like some did. I stirred the pork in Cattleman's and bagged it in ziploc freezer bags and froze for the big day. I let them set out overnight to defrost. I saved a quart of the juices in the fridge just in case I needed them to revive the pork, but it was not necessary at all so I discarded it. ABSOULTELY WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Venable Curtis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/797084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-29T01:41:13.07Z",
                "reviewBody": "Overall, very good if you like pulled pork. I didn't bother browning the pork first though. I seasoned it with \"Cajun Seasoning Mix\" from this site and added it to the slow cooker along with a bit of minced garlic. I left out the onion (personal perference when it comes to pulled pork). I've done a few \"southern\" pulled pork recipes and most call for cider vinegar vs. just water so I used 2 cups of apple cider vinegar and 2 cups of water. I let that go for 5 hours on low. I removed the meat and shredded it with two forks. I drained the liquid reserving 2 cups and put that back into the crock pot along with the shredded pork and then added 2 Tbsp. of liquid smoke. I also added a little brown sugar and cayenne pepper. I let that go for another hour on low. This is great topped with your favorite bbq sauce or try \"White BBQ Sauce\" from this site along with a side of coleslaw and cornbread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-02T03:03:33.437Z",
                "reviewBody": "This was really good (granted I adjusted it to suit my own preferences)- the meat came out very tender. The meat probably isn't flavorful enough to stand on its own and so should be made into sandwiches or add barbeque sauce (eta - smokey mesquite bbq sauce will probably be your best bet with this recipe). I made a couple adjustments for this - I used olive oil instead of butter for browning the meat and cooking the vegetables - a little healthier. I used less liquid smoke and added about 2 tablespoons of worcestershire sauce to the slow cooker. I also added a couple sprigs of fresh thyme and one sprig rosemary to the slow cooker and removed it after cooking. I also used 1 can chicken broth and 2 cups water for the liquid in the slow cooker to give it a little more flavor. For cooking time I kept this in the slow cooker on high for about 2 hours and then lowered the heat for the remaining time and everything turned out really well. I used this for pulled pork sandwiches (on a kaiser roll with a little apple cider vinegar some texas pete hot sauce and topped with restaurant-style cole slaw made from the recipe on this site). The sandwiches turned out really well!! As good as any I've had in the restaurants in the south. I'm not sure that I'd make this to eat without the coleslaw and hot sauce to add flavor or some sort of BBQ sauce but it was the perfect recipe for the sandwiches.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1895117/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-15T15:30:40.69Z",
                "reviewBody": "I really think this is a 5 star recipe. I had to change it a little bit, but only because I could not find a boneless pork roast at my grocer. So I followed the recipe except that my meat was not cut up, I cooked it all on the bone. I used quite a bit more liquid smoke, also. My meat was so tender that it literally fell off of the bone and shredded by itself. lol It was pretty flavorful, but I added additional cajun seasoning and garlic to the meat after I shredded it. I served Jack Daniels BBQ sauce on the side. Great comfort food! Thanks for this recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRANDI7920",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1183990/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-04T15:06:38.363Z",
                "reviewBody": "I wouldn't dare ruin this with barbeque sauce but I did feel the liquid needed more flavoring. Instead of the water I used beer and chicken broth. I also threw in some pepperoncini peppers with it's juice. My guests couldn't get enough at our dance recital party. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-05T04:29:31.873Z",
                "reviewBody": "Delicous! Cooked 8 hours on low then added 1 bottle of gourmet BBQ sauce to cook another 2 hours. Everyone agreed as good as any BBQ restaurant! Served with Waldorf salad- perfect side with sweet creamy and crisp taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBJAPAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1428296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-09T13:22:44Z",
                "reviewBody": "Excellent recipe! Tastes as if I smoked it on a smoker all day! This dish is becoming a regular in my house. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MDHARTSFIELD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1395478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-23T01:01:20.907Z",
                "reviewBody": "It needed more flavor so I added more liquid smoke some honey & bbq sauce. It also needs to simmer longer for a better flavor",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PLAYMATE2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/637576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-06T16:13:46.823Z",
                "reviewBody": "I was really excited about making this given the reviews. However I was so disappointed. I followed the recipe exactly. I put plenty of seasoning on the meat before browning but the end result was bland shredded pork swimming in a pool of liquid. The directions said nothing about draining the liquid before returning the meat back to the crockpot after shredding it. Am I missing something?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "brandica8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3111840/"
                }
            }
        ]
    }
]