[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/72363/algerian-bouzgene-berber-bread-with-roasted-pepper-sauce/",
        "name": "Algerian Bouzgene Berber Bread with Roasted Pepper Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F447692.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:32:28.000Z",
        "description": "This traditional favorite comes from the northern mountain towns of Algeria. A humble, unleavened semolina flatbread compliments a zesty, roasted red-pepper sauce. The combination is fresh, simple and satisfying. We also like to have this with fried eggs.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "2 red bell peppers",
            "4 tomatoes",
            "1 tablespoon olive oil",
            "4 cloves garlic, chopped",
            "1 jalapeno pepper, chopped",
            "salt to taste",
            "2 pounds semolina",
            "1 ½ teaspoons salt, or to taste",
            "3 cups water, or as needed",
            "4 tablespoons olive oil",
            "6 tablespoons olive oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat your oven's broiler. Place red bell peppers and tomatoes on a baking sheet, and roast under the broiler for about 8 minutes, turning occasionally. This should blacken the skin and help it peel off more easily. Cool, then scrape the skins off of the tomatoes and peppers, and place them in a large bowl. Remove cores and seeds from the bell peppers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon of olive oil in a skillet over medium heat. Add the jalapenos and garlic, and cook until tender, stirring frequently. Remove from heat, and transfer the garlic and jalapeno to the bowl with the tomatoes and red peppers. Using two sharp steak knives (one in each hand), cut up the tomatoes and peppers to a coarse and soupy consistency. Stir, and set sauce aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the semolina in a large bowl, and stir in salt and 4 tablespoons of olive oil. Gradually add water while mixing and squeezing with your hand until the dough holds together without being sticky or dry, and molds easily with the hand. Divide into 6 pieces and form into balls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For each round, heat 1 tablespoon of olive oil in a large heavy skillet over medium heat. Roll out dough one round at a time, to no thicker than 1/4 inch. Fry in the hot skillet until dark brown spots appear on the surface, and they are crispy. Remove from the skillet, and wrap in a clean towel while preparing the remaining flat breads.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To eat the bread and sauce, break off pieces of the bread, and scoop them into the sauce. It will slide off, but just keep reaching in!\n"
            }
        ],
        "recipeCategory": [
            "Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Corey Habbas"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.714285714285714,
            "ratingCount": 7,
            "itemReviewed": "Algerian Bouzgene Berber Bread with Roasted Pepper Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "795.8 calories",
            "carbohydrateContent": "134 g",
            "cholesterolContent": null,
            "fatContent": "17.1 g",
            "fiberContent": "7.4 g",
            "proteinContent": "23.4 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "701 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-09T15:06:16.813Z",
                "reviewBody": "When I saw this recipe I was so excited because it reminds me of something Tunisian and am sure it has been carried over the Atlas Mts. in both directions with some additions along the way. I AM IN HEAVEN!!! Who can't love roasted peppers and tomatoes and garlic??? Although there are a couple of other additions in Tunisian version this was so very reminiscent of our trips. It is my favorite dish and my sister in law always has plenty of it on the table for my 'welcome dinner'. I roasted all the vegetables (including garlic) and then added 2 cloves of fresh garlic when mixing it up. I did also roast 1/2 small onion and add the other half raw. For the bread I know there are different 'grinds' of semolina and all I had on hand was something I use to make \"makrout\" so it is a grind similar to cornmeal. I think I had too course a grind of semolina flour. I measured out 2lbs. and it equals 5 cups. If one decides to try the wonderful roasted vegetable concoction and forgo the bread might want to add some salt to the vegetables. This is great served w/warm baguette or pita w/lemon slices olives and tuna for garnish. Also is very nice w/about 5 caraway seeds ground coursely and tossed in. Thanks for this and keep the North African recipes coming!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-06T21:43:37.82Z",
                "reviewBody": "Everybody in my family liked this recipe. Roasted bell pepper, tomatoes and garlic with semolina tortillas, it`s so delicious. You could make this sauce without bread and use it on anything.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DiamondGirl amanecer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2761942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-09T01:10:12.787Z",
                "reviewBody": "This was absolutely delicious! I simplified the sauce by using a jar of already roasted red peppers! My family loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "keanu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3845340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-05T23:24:00.643Z",
                "reviewBody": "This was good and although I give it 4 stars it could easily be a 5. I added a little salt to the sauce next time I will also add onions. I only used a little over 2 cups for the dough because it was getting sticky. The bread was a little heavy for me maybe next time ill try making it thinner. In all good recipe. The sauce is nice and fresh tasting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ilikefrenchies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5650033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-23T15:57:01.307Z",
                "reviewBody": "This is our first time trying African food; we made this for a school project. Depending on where you live you might have trouble finding semolina flour. I tried four different places before finding it at Earth Fare.(I was put out by the thought of paying 11.98 plus tax for 2 bags weighing 1.5lbs each and I was about to try Cream of Wheat instead but read Tunisianswifes review and thought it might not work.) Word of advice: FOLLOW THE DIRECTIONS ON GRADUALLY ADDING THE WATER WHILE MIXING WITH YOUR HAND! Otherwise you may put in too much water and end up with a gluey elastic dough which still has clumps of dry flour cannot be rolled out and will not hold its shape no matter how much you try to stretch it! (We have ADD and do not have the patience to read instructions so this is what happened to us.) We went ahead and fried up our dough after shaping it as best as we could and even though this resulted in what resembled rubbery uneven pancakes the flavors were good - no leftovers. The sauce is very refreshing as written but I can see myself adding more garlic to suit my personal tastes. This is fairly easy to make with a little practice... We also made the Malian Ginger Juice and the Shuku Shuku (Nigerian coconut balls) from this site and were quite pleased in spite of any mistakes we made due to lack of experience. Based on the results so far I am looking forward to trying more of the African dishes - they might become a new favorite in this household!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "L. Ashley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4808127/"
                }
            }
        ]
    }
]