[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/72532/mexican-style-shredded-pork/",
        "name": "Mexican Style Shredded Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8942.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-04T03:32:29.000Z",
        "description": "This is an amazing shredded pork recipe similar to what you would eat in a rice bowl (or in an enchilada) at a Mexican restaurant. It is easy to prepare and simmers in a slow cooker all day, ready to enjoy when you arrive home. I serve it over rice (laced with lime juice and fresh cilantro), Cheddar cheese, salsa, guacamole, and a dollop of sour cream. Amazing!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT7H0M",
        "totalTime": "P0DT7H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (3 pound) boneless pork loin roast, cut into 2 inch pieces",
            "½ teaspoon salt",
            "2 (4 ounce) cans diced green chile peppers",
            "3 cloves garlic, crushed",
            "¼ cup chipotle sauce",
            "3 ¼ cups water, divided",
            "1 ½ cups uncooked long grain white rice",
            "¼ cup fresh lime juice",
            "¼ cup chopped cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the roast in a slow cooker, and season with salt. Place chile peppers and garlic on top of roast. Pour in the chipotle sauce and 1/2 cup water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook 7 hours on Low.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a pot, bring remaining 2 3/4 cups water and rice to a boil. Mix in the lime juice and cilantro. Reduce heat to low, cover, and simmer 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove roast from the slow cooker, and use two forks to shred. Return pork to the slow cooker, and allow to sit 15 minutes to absorb some of the liquid. Serve over the cooked rice.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "TORA.V"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.467532467532467,
            "ratingCount": 539,
            "itemReviewed": "Mexican Style Shredded Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "520.2 calories",
            "carbohydrateContent": "43 g",
            "cholesterolContent": "107.7 mg",
            "fatContent": "19 g",
            "fiberContent": "1.2 g",
            "proteinContent": "41.1 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "802.1 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-02T02:09:15.563Z",
                "reviewBody": "**** CHIPOTLE SAUCE ****** - Look in your grocer section where the taco sauces are. I found an 8oz. bottle of Chipotle Sauce there made by Ortega. Same bottle style and look as taco sauce but labled as Chipotle Sauce.\nI cooked the meat with the stated 1/4c.\nof Chipotle Sauce. I also added a generous sprinkling of Mrs. Dash Southwest Chipotle seasoning. This stuff is great, pure flavor because it is not salt based. Once the meat was done, I put the gravy in the frig so the fat/grease would rise to the top and congeal...then removed the fat/grease. Poured the defatted gravy over the shredded meat and added the remainder of the 8 oz. bottle of Chipotle Sauce and a sprinkling more of the Mrs. Dash S-West Chiptotle seasoning. The end result tasted just like Chipotle's shredded meat - fantastic ! It had tons of flavor contrary to the complaints of other reviewers. I also salted the rice after it was done cooking. Additional suggestions for serving this: serve with black beans and corn.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Schuster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2361617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-27T18:15:40.187Z",
                "reviewBody": "This recipe was awesome!  I chopped up 1 small onion and minced a couple of cloves of garlic and added it to the crock pot.  Also, instead of the water, I used a bottle of Corona beer and squeezed 1/4 of a lime on top of the pork in the crock pot.  I simmered the meat for about 4 hours on low.  I served the meat with tacos, it came out AMAZING!  I will be using this recipe again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ali",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1274392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-05T15:35:28.52Z",
                "reviewBody": "Made this recipe for my Cinco de Mayo party. It was a huge hit with everyone,even my siste-in-law who is Mexican - she suggested that I add a little cumin after I shredded the pork and put it back in the crock pot, which I did (approx. 1 1/2 tsp) It added more taste.  This recipe is extremely easy and delicous.  A keeper for sure. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DONNAE23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1401577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-16T23:44:02.95Z",
                "reviewBody": "Very rarely - if ever - do I find myself wishing I could rate something more than 5 stars. This, however, is it!! I didn't bother with the rice, but instead added the lime juice (1 lime) and cilantro in with the chipotle sauce (I found it in the Mexican section at Meijer). I marinaded it over night, then cooked for 6 hrs on low. I added a little more chipotle sauce for a little more flavor. We had it with warm flour tortillas, guacamole, grated Cheddar, and plain white rice. Absolutely AWESOME! I would not hesitate in making this again. Thanks, Tora. V!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-04T16:23:01.473Z",
                "reviewBody": "Answering British contributor nelepope's questions, cilantro is the Spanish name for fresh coriander leaves.  It's found in the produce sections of most U.S. supermarkets.  Google \"Mexican grocery UK\" and you will find websites that sell chipotle sauce, or you can look up a Chipotle Sauce recipe right here on allrecipes.com.  Chipotle is a smoke-dried jalapeno pepper - look up wikipedia.com for excellent photos and descriptions.  The smokiness adds an awesome flavor dimension!  For both the cilantro and sauce, I would start with half the recipe amount and add more until you find the flavor profile you like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Uncle Ed's Nephew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1898838/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-03T20:46:12.077Z",
                "reviewBody": "Both the amazing taste (surprising considering it comes from so few ingredients) and the ease of the recipe earns it a five star rating from me. To give it more flavor since the people in my family like spice: double the chipolte sauce and add another can of chilies. Also: add some lime juice in with the rest of the ingredients. And if you do not want to mess with the rice: throw chopped cilantro (the more the better I think) into the pork when you shred it, then let it sit the fifteen minutes or longer afterwards. I think this recipe cannot sit in the slow cooker too long, so do not worry about that. Thanks for the fabulous addition to my recipe box! Actually making it for dinner again tonight!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2782512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-29T22:53:54.247Z",
                "reviewBody": "This was really good after I followed the recipe as it was written. I tried to make it without the Chipolte Sauce and found it was tasteless. (Made a special trip to the store and added it in at the end of the cooking time - is this why so many neg reviews? No Chipoltle sauce?). I also added the Cilantro and lime juice after the rice was cooked. Served the pork on top of the rice and layered homemade salsa guac cheese and sour cream on top. Put the bottle of Chipoltle sauce on the table for those who like it a little hotter. Definately",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "INGEBETTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1171186/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-10T13:01:57.777Z",
                "reviewBody": "This was DELICIOUS! It was a big hit in my apartment. Based on some of the other reviews and my personal taste I added: 1 tsp. cumin 1 tsp. southwest seasoning 1 extra can green chiles and an entire cup of chipotle sauce. It still wasn't too spicy for some of my friends who are sensitive to that - so if I had it to do over again I would probably throw in some jalapenos to make it spicier!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tieki rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3114158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-14T01:52:35.827Z",
                "reviewBody": "Very very good! This is a keeper! I stuck to the recipe as much as possible. I only had 1/2 of the pork needed but used the same amount of other ingredients and it turned out great! Served it over the rice along with fried flour tortilla strips. While it was cooking I thought it might be a little too spicy for my 4 year old but after trying it she loved it. My husband ate way too much! It is in my recipe box! Thanks for a good one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lh1lh2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1708785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-11T16:12:50.887Z",
                "reviewBody": "I was quite disappointed given some of the great reviews here. I followed the recipe exactly and even threw in some chopped onion and southwest chipotle seasoning for extra flavor. We had it in tacos with tomato cilantro and cheese garnish. It was extremely bland and lacking flavor. I was surprised even after using the entire bottle of chipotle sauce. I won't make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "BethAnne923",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4255056/"
                }
            }
        ]
    }
]