[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/662/meat-and-poultry/chicken/whole-chicken/",
                    "name": "Whole Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/74796/beer-roasted-lime-chicken/",
        "name": "Beer Roasted Lime Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F79273.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:32:42.000Z",
        "description": "Beer roasted chicken stuffed with limes brings a whole new dimension to chicken. It's both flavorful and juicy. This recipe is absolutely to die for!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (4 pound) whole chicken",
            "1 tablespoon salt, or to taste",
            "1 tablespoon ground black pepper, or to taste",
            "1 lime, halved",
            "½ (12 fluid ounce) can beer",
            "1 cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season the chicken inside and out with salt and pepper. Squeeze the juice from the lime over the whole chicken, then place the halves into the cavity of the chicken. Set the half full beer can in the center of a roasting pan or baking dish, and place the chicken over it in an upright position with the beer inserted into the cavity. Pour water into the bottom of the pan. Cover the chicken with aluminum foil, and place roasting pan and all into the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast the chicken for about 1 1/2 hours in the preheated oven, removing foil during the last 20 minutes. Baste occasionally with the drippings. When finished, the internal temperature of the chicken should be 180 degrees F (80 degrees C) when taken in the meatiest part of the thigh. Let the chicken rest for about 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Whole Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LAQUINNA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.213235294117647,
            "ratingCount": 136,
            "itemReviewed": "Beer Roasted Lime Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "398.5 calories",
            "carbohydrateContent": "2.9 g",
            "cholesterolContent": "129.4 mg",
            "fatContent": "22.9 g",
            "fiberContent": "0.6 g",
            "proteinContent": "41.1 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "1288.9 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-27T21:25:17.73Z",
                "reviewBody": "You cannot go wrong with a beer butt chicken. I make this about once every 2 weeks and my family never grows tired of it. I usually use about 2-3 limes and stuff one of them (or an onion) in the top to keep the steam in the chicken. I also season the beer (you can use sprite or 7-up as well) with some lime juice garlic salt and chopped onions. I have never covered the chicken with foil or basted it and it always comes out nice and golden brown on the outside and juicy on the inside. I have also made gravy out of the drippings and it was amazingly good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mandi 'Bates' Snyder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/981316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-20T14:06:21.077Z",
                "reviewBody": "I decided to make this meal and then as I started to prepapre to cook I thought I realised I did not know what I should do with the chicken or beer can.  After looking at the reviews and no one else raised this question I thought I was left out of a very special cooks secret. So for all those in the dark as I was you place the can in your required baking dish/tin, opened ease the chickens bottom (sounded better than my first choice) over the opened can, resulting in the chicken facing the skies whilst resting on a can of beer. I am going to give this one tops marks although my chicken really had very little citrus flavour the meat was so very moist that with adjustments in flavouring not only the inside of the chicken but also under and on the skin this could be great. Good luck",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jade",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1569386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-27T03:07:23.89Z",
                "reviewBody": "We've made a number of beer-can chickens so I spiced this one up a bit. It turned out great and was probably the best one we've ever done. I made a basic barbecue rub (paprika salt pepper brown sugar onion and garlic etc.) and added a bit of chile powder and cumin to the rub as I thought the Mexican spices would go well with the lime juice. I loosened the chicken skin (just dig your fingers in) put the rub under the skin and on the skin and poured the lime juice under the skin and into the cavity. I stuffed the lime skins in the cavity as directed. I let it sit in the refrigerator for an hour to let it soak up the rub. I opened a can of Really Cheap Beer poured some out added some of the rub to it and lowered the chicken onto it. (We have one of those handy beer can holders from Bed Bath and Beyond or Linens and Things. They really make the whole process a lot easier.) Instead of putting it in the oven I put it on our gas grill set for indirect cooking and cooked it until it reached 180 degrees--about 2 hours. The skin looked really dry but the inside was very moist and tender. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jennyg/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-13T15:09:27.02Z",
                "reviewBody": "Many of the previous reviews for this recipe indicate that there is not much flavor. I have been doing Beer can Chicken for a number of years. I use Montreal Steak seasoning. Mix 3 Tbsp. Montreal Steak seasoning and 1 Tbsp. Brown Sugar. Rub the outside of the chicken with butter (I have also sprayed it with cooking spray) Then use about a third of the seasoning mix and rub it all around the INTERIOR of the chicken. Rub the remaining seasoning over the outside of the chicken.\"Sit\" the chicken down over the half can of beer. On the grill heat the grill then turn one side off.Set at medium heat. Place the chicken \"sitting up\" on the side that is off (you can use the legs to form a sort of tripod to keep it up) Close the cover and leave it to cook for 1 1/2 hours. It may need a bit more time. But no more than 2 hours! Remove the sitting chicken from the heat let it sit 10 minutes then remove it from the can and cut up. This is THE BEST chicken we've ever had!! It is ALWAYS moist and very flavorful! I have made it in the oven as well. You can use soda in the can but the taste is a little different than with beer. I heard someone say that it is the hops in the beer that infuse the chicken with some of the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "armsavage",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2051742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-23T23:55:55.14Z",
                "reviewBody": "VERY GOOD! I like most made a couple of modifications to the original recipe. I squeezed a couple of teaspoons of lime juice into the beer and dropped two cloves of garlic in the can as well. I rubbed the inside and outside of the skin with salt pepper and garlic powder and a little Tony's (cajun seasoning). I did not cover with foil because I LOVE crispy skin! It was moist tender and delicious. I also made an awesome gravy with the drippings; great with mashed potatoes. I will definitely use this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Victoria.Qualls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2342787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-29T23:23:04.7Z",
                "reviewBody": "Out of this world! Also put the lime under the skin and used a brown sugar and garlic rub. Family couldn't get enough!! Chicken fell out the bone. So moist and delicious! Thank you for this wonderful recipe!!! It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WINTERBLUE71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1577402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-05T20:39:04.467Z",
                "reviewBody": "Any recipe that starts with me drinking 1/2 a beer is OK in my book. We already had a beer chicken holder so we used that ( 2 at the grocery store). The chicken was incredibly moist and flavorful. Great recipe. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DELANIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1112700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-26T18:56:43.047Z",
                "reviewBody": "This chicken came out fantastic amazingly tender meat fell right off the bone. Only modifications I made were: using 2 limes one halved as directed other cut into wedges and placed under skin along with several pats of butter. For seasoning I used Adobo as well as some garlic sea salt. This combination came out incredible and I will definitely be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jwelch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1873142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-11T17:20:16.693Z",
                "reviewBody": "this was great! a big hit I added cilantro garlic 1/4 purple onion and lemons and it was fabulous! I also put lime wedges in the beer... excellent recipe and super easy!!I will definately make again!! thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "susanhope",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2282072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-05T16:43:24.967Z",
                "reviewBody": "I followed the directions perfectly and my chicken didn't taste anymore like lime than it did when it started out:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JEDIRACHAEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/146127/"
                }
            }
        ]
    }
]