[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76012/whits-chicken-enchiladas/",
        "name": "Whit's Chicken Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F394247.jpg",
            "width": 3296,
            "height": 2472
        },
        "datePublished": "2019-04-04T03:32:49.000Z",
        "description": "Wonderful, cheesy chicken enchiladas that are easy to prepare. Everyone I have made these for loved them! These are great with a little salsa, guacamole and sour cream on top!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 bone-in chicken breast halves",
            "2 tablespoons olive oil",
            "1 (4 ounce) can diced green chile peppers, drained",
            "1 jalapeno pepper, chopped",
            "1 clove garlic, minced",
            "1 (8 ounce) package cream cheese",
            "2 cups shredded Monterey Jack cheese, divided",
            "½ cup water",
            "8 (10 inch) flour tortillas",
            "1 cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken breast halves into a saucepan, and fill with enough water to cover. Bring to a boil, and cook until the chicken is cooked through, about 20 minutes. Remove from the water, and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Remove the chicken meat from the breasts, and discard the skin and bones. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large skillet over medium heat. Add the green chilies, jalapeno and garlic. Cook and stir for a few minutes, until fragrant, then stir in the cream cheese and half of the Monterey Jack. As the cheese begins to melt, gradually stir in the water. Chop the chicken meat, and stir into the skillet. Remove from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon the chicken mixture into tortillas, and roll up. Place the rolls seam side down in a 9x13 inch baking dish. Sprinkle the remaining Monterey Jack cheese over the top, then pour cream over all.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 minutes in the preheated oven, or until the enchiladas are golden brown on the top.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "WMONROE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.656023222060958,
            "ratingCount": 689,
            "itemReviewed": "Whit's Chicken Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "706.5 calories",
            "carbohydrateContent": "38.7 g",
            "cholesterolContent": "160 mg",
            "fatContent": "44 g",
            "fiberContent": "2.4 g",
            "proteinContent": "38.1 g",
            "saturatedFatContent": "21.8 g",
            "servingSize": null,
            "sodiumContent": "908.7 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-07-11T16:57:55.91Z",
                "reviewBody": "HELPFUL TIPS NOT MENTIONED: My husband is extremely picky about his Mexican food due to where he grew up, so I tried each of the enchilada recipes that rank higher than this 1st.  He was sadly disappointed w/each as was I since I like to impress him w/my cooking, but then I tried this w/much hesitation due to how easy it was & what do you know ...simplicity was the winner!  1. put green or red enchilada sauce on the bottom (enough to ONLY lightly cover the bottom) but PAM works too 2. Change it up by/adding chopped green peppers or mushroom in the mix, and sliced olives ON TOP after adding heavy cream.  3. use 1 pkg of tysons/oscar meyer already made fajita or grilled chicken to save time (1 heaping cup) 4.make in the morning BUT add heavy cream JUST before baking it! I still add a little taco seasoning to the chicken for added spice BUT NOT necessary.  5 Bake until it looks golden all over with a little crispy look from the heavy cream so it's not soggy inside. I eye the amount of heavy cream for this reason too ...just drizzle enough for the amount I want & I use a smaller glass dish (making 6) since that's how many we will eat but makes (8-9 heaping amounts).  My husband likes soft enchiladas and not crispy like me, so we put foil over it while baking if he's eating.  Eat with \"Best Spanish Rice!\" So easy & with ingred. always on hand, not to mention better than complex recipes!  Again, simplicity proves to be the best!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T03:44:23.013Z",
                "reviewBody": "LOVED this recipe!  Made it exactly per directions the first time, then experimented the 2nd, 3rd and 4th times!  I used canned chicken broth to cook the breasts in, plus added 1/2 envelope taco seasoning mix as the chk was boiling.  Also, I threw in some boneless, skinless chicken thighs to add some flavor.  I also sauteed 1/2 large onion and 1/2 green pepper chopped with the garlic/jalapeno (seeded)/chilies mix.  To the cheese mix, I used Jack/Colby/Cheddar cheeses; 3/4 c. salsa and 1/2 small can red enchilada sauce.  I also added the chk broth to the mix instead of water (and used almost 1 c.).  Finally, I poured the rest of the red enchilada sauce on top of the enchiladas after I used the heavy cream.  Perfect, perfect, perfect!!!  Thank you, Whit for this fabulous base recipe!  I never would have thought to make these at home and now have a blast trying out new add-ins!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELE311",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742383/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-12T01:38:49.967Z",
                "reviewBody": "I made this for my in-laws with some of the suggested changes and everyone loved it!  I used chicken broth when  water was called for (even to boil the chicken), added a packet of taco seasoning and some onion to the jalepenos (canned) and chiles.  I shredded the chicken, dipped the tortillas in the leftover broth before filling them.  After filling them  and putting them in a sprayed dish I sprinkled the cheese on top(I used Pepper Jack), poured the cream over that and then a can of enchilada sauce.  I covered them for 30 minutes then uncovered them for 10 minutes.  Waiting 5 minutes to serve helps it set.  Thanks for posting this recipe and for all the recommended changes.  I will be making this again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spiff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2221717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-05T21:52:01.82Z",
                "reviewBody": "I had to improvise on this a little but not enough to really change the recipe. Shredded rotisserie chicken made this super easy and since I had no jalapeno peppers or green chiles Pepper Jack cheese made a fine substitute. I spread a thin layer of tomatillo sauce on the bottom of the baking dish before placing the enchiladas and put a little in the enchiladas when filling them as well. Just before serving I topped them with some chopped tomato and a dollop of sour cream. The final result was okay but in my view needed more sauce (cream) than was called for and would have been very dull without the addition of the tomatillo sauce and sour cream. If I make these again I'll know they'll be better with some embellishment. As written these are just so-so and a little boring.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-14T20:59:43.517Z",
                "reviewBody": "Although the basic recipe seemed workable, I approached it with some reservations because of other posted comments. A few changes seemed to help. I sauteed a small onion (finely diced) with the peppers and garlic. The filling was still a bit bland so I added a handful of fresh chopped cilantro, salt, pepper and a good squeeze of lime juice. I also substituted heavy cream for the water. I then added an extra step that takes a few minutes but, in my opinion, improves the texture. Pour some of the cream in a shallow dish. Heat a small amount of oil in a skillet. Quickly fry the tortillas, flipping over after a few seconds. Dip each fried tortilla into the cream - then proceed with filling and rolling. Then use the cream as stated in the recipe (I increased the amount to 1-1/2 cups to minimize the chance of this drying out). I covered the dish with foil and baked it for 15 minutes, then removed the foil for the remainder of the baking time. Pretty good overall, with the suggested changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "springfield70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1483244/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-28T00:04:41.467Z",
                "reviewBody": "I would actually give this 4 1/2 stars - it's really tasty and easy! I used pepper jack cheese instead of plain montery jack and it was very good. I bet you could add in anything from onions mushrooms and black olives to give it even more zip. I will make this again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/406482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-28T23:38:12.567Z",
                "reviewBody": "This was a delicious recipe! The enchiladas are very creamy and cheesy so they are fairly rich. As far as being spicy they were mild-to-medium. We'd recommend adding more peppers if you like dishes more spicy. Definitely will make them again- perhaps next time with some low-fat or fat-free ingredients to lower the fat content.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-06T21:20:24.023Z",
                "reviewBody": "This is our favorite base recipe for enchiladas! My kids absolutely love it! We experiment every time with different ingredients here and there. Pepper-jack cheese is definitely a favorite here. Sometimes when I've had a long day and don't feel like making enchiladas I'll use this recipe and just layer it like a lasagna...it's excellent like that too! I cook extra boneless/skinless chicken breasts and freeze them to make putting this dinner together faster.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kellie Callihan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1671540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-23T15:38:30.123Z",
                "reviewBody": "While I personally don't like chicken enchiladas, I made this for an office luncheon and everyone loved them! I used corn tortillas instead of flour and added one package of Schilling/McCormick chicken taco seasoning to the cheese mixture. Every last bite was eaten!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CASADESCARLETT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1088009/"
                }
            }
        ]
    }
]