[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
                    "name": "Fish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/426/seafood/fish/catfish/",
                    "name": "Catfish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/38107/barlows-blackened-catfish/",
        "name": "Barlow's Blackened Catfish",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F425659.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2019-04-02T06:44:22.000Z",
        "description": "Cajun catfish served up with just the right touch of spices and flavor. This entree is perfect for a quick, excellent way to taste the unique flavor of catfish mixed with the traditional method of down south cooking, just without all the fat. Serve on top of white rice.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 teaspoons cayenne pepper",
            "2 teaspoons lemon pepper",
            "2 teaspoons garlic powder",
            "2 teaspoons salt",
            "2 teaspoons pepper",
            "1 pound catfish fillets",
            "2 tablespoons butter",
            "1 cup Italian-style salad dressing"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a shallow, medium bowl, mix cayenne pepper, lemon pepper, garlic powder, salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush both sides of catfish fillets with butter. Rub fillets with the cayenne pepper mixture on both sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large heavy skillet over medium-high heat until really hot. Add fillets, and fry approximately 2 minutes on each side, until slightly blackened.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange blackened fillets in a single layer in the prepared baking dish, and coat with Italian-style salad dressing. Bake 30 to 35 minutes in the preheated oven, until fish is easily flaked with a fork.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Fish",
            "Catfish"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "INDIANABARLOW"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.387795275590551,
            "ratingCount": 508,
            "itemReviewed": "Barlow's Blackened Catfish",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "368 calories",
            "carbohydrateContent": "8.5 g",
            "cholesterolContent": "72 mg",
            "fatContent": "29.8 g",
            "fiberContent": "0.7 g",
            "proteinContent": "17.4 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "2478.2 mg",
            "sugarContent": "5.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-31T21:15:04.53Z",
                "reviewBody": "Although good, I had to make some modifications to the dish (thank goodness I read the reviews first!).  First, I used only  half of the cayenne pepper called for and 1/4 tsp of salt (thought that was still almost too much considering other additions that I made).  I added 1.5 tsp of Old Bay, 1 tsp paprika, 1/2 tsp of creole seasoning, 1 dash of seasoned salt, 1/2 tsp of Blackened Seasoning, and 2 tsp onion powder.  I used olive oil to coat the fillets instead of butter and used just enough italian dressing to lightly coat the fillets (maybe a teaspoon for each fillet, it helps to keep the fish from drying out.)\n\nMake sure that you open the windows during the blackening process, as stated in earlier reviews!  Even the dog left me in the kitchen when the smoke got thick!\n\nI served it on top of some old-fashioned dirty rice, and my boyfriend really enjoyed it.  He had the rest for lunch and it was even hotter the next day!  He claimed that he had to sit on a wet towel to cool off!\n\nOverall, the recipe is a great starting point for blackened catfish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cerissa Hamilton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1733177/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-10T22:37:19.53Z",
                "reviewBody": "This was a fantastic recipe, but fairly spicy, and I even decreased the amount of cayenne pepper by 1/2 teaspoon. If you can't handle really spicy food, I'd suggest using about 3/4 teaspoon total cayenne pepper. After reading reviews, I also only used a dash of salt and black pepper instead of the full amount called for, and seared the fillets in olive oil instead of butter. NOTE: Make sure that when you do the blackening part, you do it in a well ventilated area. There is a lot of smoke and strong vapors from the pepper, so be careful.\r\n\r\nI served this with corn on the cob, hush puppies, and honey roasted red potatoes (recipe found on this site). Absolutely delicious, will definitely be making this one again. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "calizen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/808386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-17T04:28:20.39Z",
                "reviewBody": "My husband does not like fish, but he cleans his plate every time I make this!  I have tried this with several other kinds of fish (cod, tilapia), but the catfish tastes the best.  I follow the recipe exactly, except I never have lemon pepper, so I squeeze fresh lemon over the filets.  I also brush the filets with dijon mustard after I coat them with salad dressing.  It adds a delicious zing.  Also, if you don't like things really spicy, you can cut the cayenne pepper in half and just use a little more garlic powder to make up for it.  I usually serve this with a tossed salad and some Zatarin's jumbalaya rice with diced kielbasa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MRONUFRAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/932446/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-10T01:12:32.88Z",
                "reviewBody": "This is my first try at blackened anything. I had a bad experience years ago when it first became popular but I had a taste of my niece's at a restaurant lately and have been wanting to have more ever since. I used Zatarins Blackened Seasoning and added the garlic powder. I also used the fresh lemon juice. I used a combo of olive oil and butter to sear the fillets and didn't use the salad dressing at all. It made a delicious sauce as it baked and it only needed 15 minutes to bake. They were almost done after the hot searing. I served it over plain rice with steamed carrots on the side. My husband who is picky about seafood loved it. Thanks a lot for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Norma Macks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1231856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-09T07:55:47.697Z",
                "reviewBody": "I figured this recipe could use a review that wasn't written almost 10 years ago, so here it goes.\n\nI made minimal modifications and it turned out amazing. First, I only used 1 tsp of salt and it was plenty. Also, if you don't like spicy that much, only use 1 tsp of cayenne. I love spicy stuff, and this recipe had my ears burning and my nose sniffling.\n\nUSE THE ITALIAN DRESSING. I almost didn't, but I was glad I did. Like another user said, the dressing mellows out some of the saltiness. If you're worried your fish is going to be too salty after trying a bit after searing, chances are after using the dressing, it will be fine. Also, I only drizzled some over the fish. 1 cup is way too much.\n\nDO NOT BAKE FOR 30 MINUTES. I only baked for 15 and it came out perfect. It was juicy, tender, and flaky but not dried out. For a side, I fried some green beans in the same skillet that I used for the fish. \n\nI had a lemon that I needed to use so I squeezed some juice onto both the green beans and the fish and it added a nice, fresh zing. My boyfriend and I both loved it. Make this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fox_ebooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10901327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-13T15:23:50.327Z",
                "reviewBody": "Wonderful! The only modification I would make is only to add only 1 tsp of salt. Also I saw one reviewer below that made a comment of this being too salty but she used garlic salt - make sure to use garlic \"powder\". We like it spicy so the spice was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHILLIE72",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/620211/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-10T04:05:58.327Z",
                "reviewBody": "I read the reviews prior to using this recipe. On previous attempts I used the spice sold by that famous New Orleans chef for blackened fish but found it blah. I followed this recipe to the letter on Halibut (I couldn t get catfish) and found it absolutely excellent. So simple but the combination of spices brought out the beautiful spicy flavor associated with blackened fish. Don t change a thing. Use as directed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "falkeko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1689995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-20T11:13:10.57Z",
                "reviewBody": "This is one spicy dish but we love spicy food so that was fine. Well at least I love it and Jeanne puts up with it. First I think for one pound of fish you could cut the spices in half one teaspoon of each should be plenty. I use two and had a lot left over and I really coated the fish. Second as someone else mentioned watch out for the fumes when frying. Open the windows and turn on the exhust fan you are going to need it. The secret to this recipe is of course the Italian dressing. It seems to take away some of the heat but still leaves a nice bite and great flavor. I will be doing this one again perhaps with a differant fish next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JIMJEANNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1340686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-17T23:50:15.333Z",
                "reviewBody": "Simple and could be tasty - but WAY TOO MUCH SALT! If I make again I will eliminate the 2 teaspoons salt since lemon pepper and the dressing is already salty. Also 1 cup of Italian dressing is wasteful I believe a simple drizzle over the fillets would suffice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "WOODBUTC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/513331/"
                }
            }
        ]
    }
]