[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77169/dumpling-soup/",
        "name": "Dumpling Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8122877.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-04T03:32:59.000Z",
        "description": "My mom always made this soup on washday as it was quick to make and very satisfying.  It's still a favorite today for lunch. Pepper may be added at the table.  Serve with fresh bread and butter.  This is a very hearty soup, if served as supper, it is a complete meal.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 teaspoon salt",
            "1 tablespoon vegetable oil",
            "1 egg",
            "¾ cup water, or as needed",
            "6 medium potatoes - peeled and cubed",
            "1 teaspoon salt",
            "8 cups water",
            "2 tablespoons butter or margarine",
            "4 ounces sliced bacon, diced",
            "1 large onion, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the flour, baking powder and salt. Crack the egg into a measuring cup, and add enough water to equal 1 cup. Whisk with a fork. Gradually stir the egg-water and oil into the flour mixture with the fork until a soft dough is formed. Use your hands to mix the dough until is smooth and no longer sticky, adding more flour or water as needed. Cover the bowl, and set aside until the potatoes are ready.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place potatoes in a large pot with the salt and water, and bring to a boil. Cook for 10 to 15 minutes, until potatoes are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt the butter in a skillet over medium heat. Add the bacon and onion; cook and stir until onions are golden and bacon is cooked. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the potatoes are cooked, pinch off small pieces of the dough, and drop them into the boiling potato water. Turning the dough in your hand will help keep it from sticking to your fingers. Once all of the dumplings have been added, you can stir in the bacon and onions. Ladle some of the water from the soup into the skillet, and swish it around to clean out all of the tasty bits and juices. Pour back into the soup. Turn off the soup, and let stand for a few minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KB COUNTRYGIRL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.202247191011236,
            "ratingCount": 89,
            "itemReviewed": "Dumpling Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.8 calories",
            "carbohydrateContent": "63.8 g",
            "cholesterolContent": "54.1 mg",
            "fatContent": "16 g",
            "fiberContent": "6 g",
            "proteinContent": "11.1 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "1077.8 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-08-29T20:54:53.297Z",
                "reviewBody": "This was an AWESOME recipe! After finishing one bowl of this my boyfriend almost got down on one knee and proposed - seriously! When I make this recipe I always add frozen veggies just to make me feel a little less guilty about diving in. I also add shredded chicken. When making the dumplings I don't add as much flour as the recipe calls for so that they are a little more moist (the batter will be sticky when adding to soup). A!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TexanChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1504388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-21T06:28:33.217Z",
                "reviewBody": "This is an excellent comfort soup. Let the Nebraska blizzard rage on and give me another bowl of soup! Excellent. Here's what I discovered: 1) The soup thickens drastically with the addition of the dumplings presumably because of the cumulative residue effect of all the flour from the dumplings... so one can certainly make this soup last longer by adding more water or chicken stock 2) I followed the lead of another reviewer in adding chicken stock. Do note that this will make the soup taste saltier so in using chicken stock adding salt may not be necessary 3) Most soup recipes end up with more servings. With all the labor involved I wish there had been more so it would have lasted longer 4) I forgot that dumplings increase in size as they cook so my first dumplings were a little too big and 5) Rolling the dumplings can be fun but takes a long time if they are kept small. I'm a soup fanatic and this one's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-25T15:45:28.77Z",
                "reviewBody": "Don't get me wrong, the basic recipe tastes great, but all it needs is some chicken to be perfect. Instead of making the dumplings I just opened up a 10oz can of ready-to-make biscuits, rolled it up into TINY balls (the dumplings swell up  a lot after they hit the water) and dropped them in. One bowl and I was stuffed. Will be making again...with chicken",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TheDormChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2773711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-11T14:22:41.273Z",
                "reviewBody": "I LOVED this!  The first time I made it I followed receipe to a T and it was fantastic!!!  Definetly worth 5 stars.  The second time I added a bit of spice to \"heat\" it up (sprinkle of red pepper flakes to the potatos).\n\nI have to add also...why do people change the receipe the first time they make it then give it a low rating?  I could understand if you didn't like it as it was was but to change it then rate it low???  You didn't use the recipe...just saying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sailaway83",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1625540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-29T23:12:47.2Z",
                "reviewBody": "My son in law was a bit reluctant to eat this as he is not a big fan of potato soup. But he liked it so well he went back for seconds and thirds. I did use 1/2 pound of bacon 3 stalks of celery and 1 large diced onion. I cooked the bacon and onion together and boiled the potatoes and celery together. Did not drain off the water but then added chicken broth and one can of evaporated milk and milk in place of water. I put in 1/2 cup of shredded cheddar cheese to my dumpling dough. I had some left over smoked keilbasa sausage and diced it up and placed it into the soup as well. This helped out with in the meat eaters in our family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nanabear56",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2711537/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-22T19:36:57.5Z",
                "reviewBody": "Despite the rather simple ingredient list, I found this to be a very good recipe. Hearty, simple, and inexpensive... an excellent winter dish. I would make the following points and additions, however:\n\n-Make sure that the bacon used is high quality and flavorful. I used plain old supermarket bacon, and in retrospect I should have splurged for the specialty stuff.\n-Substituting broth for water, while unnecessary, will net a fuller-bodied taste in the long run. \n-The dumpling process took a long time for me; if one likes firm potatoes, I would recommend starting the process of cooking the dumplings 5-7 minutes earlier than instructed in the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "daikaisho",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1563225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-18T22:08:41.863Z",
                "reviewBody": "This was great! My husband are it up like crazy. I did make quite a few changes though. Alterations I made: I used red potatoes Added about 5 stalks of celery 1 can of Corn Substituted the 1 teaspoon of salt added with potatoes for 4 teaspoons of chicken bullion seasoning Added the whole package of bacon While frying up the onion and bacon I added the celery to that. I cooked all this up until everything was caramelized and very crispy. It's best to make sure that it's crispy otherwise it will be too limp and soggy when added to the soup. And while the potatoes were boiling I adding the chicken bullion seasoning. Near the end I added the corn. It took about an 45 minutes after the soup was done cooking for the soup to get nice and thick and more flavorful. The leftovers were great!! 4 stars because I added more to it to make it just right but overall this is a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "moonkissed503",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2543751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-28T23:21:43.7Z",
                "reviewBody": "Easy inexpensive tasty. Made mine with chicken broth instead of soup veggie sausages cut up instead of bacon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DAYOFSUN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1362317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-23T22:10:47.883Z",
                "reviewBody": "I agree with other users who commented on the dumplings. Yikes! I will definitely be altering the dumplings with my bisquick dumpling recipe next time I make the soup because the dumplings were not what I wanted!! However the soup part was really delicous we ended up sifting through the dumplings and just eating the soup. I also added quite a bit more chicken broth to the recipe as other users suggested. Two stars only since the dumplings failed and since I had to alter the recipe. Good to use as a recipe base.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Lacey Belen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/laceylovesbaking/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Dumpling Soup",
            "description": "Comforting potato soup with homemade dumplings!",
            "uploadDate": "2016-04-01T21:49:19.120Z",
            "duration": "PT1M56.183S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa355b053-61f6-4ae8-87b8-41126cd02e5d%2F01f802d8-eed2-4faf-b0e7-cedda4006c84%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4827312194001"
        }
    }
]