[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83549/angelas-awesome-enchiladas/",
        "name": "Angela's Awesome Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F683438.jpg",
            "width": 2288,
            "height": 1712
        },
        "datePublished": "2005-03-04T03:33:57.000Z",
        "description": "The secret is in the seasonings!  I whipped these up on my own using stuff I had on hand. Shredding the chicken is the most time-consuming step, but it's worth it in the end. Give these babies a try! Serve with sour cream and a side of Spanish rice.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "5 enchiladas",
        "recipeIngredient": [
            "2 pounds skinless, boneless chicken breast meat - cut into chunks",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "1 ¼ cups sour cream",
            "¼ teaspoon chili powder",
            "1 tablespoon butter",
            "1 small onion, chopped",
            "1 (4 ounce) can chopped green chilies, drained",
            "1 (1.25 ounce) package mild taco seasoning mix",
            "1 bunch green onions, chopped, divided",
            "1 cup water",
            "1 teaspoon lime juice",
            "½ teaspoon onion powder",
            "½ teaspoon garlic powder",
            "5 (12 inch) flour tortillas",
            "3 cups Cheddar cheese, shredded, divided",
            "1 (10 ounce) can enchilada sauce",
            "1 (6 ounce) can sliced black olives"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken in a large pot and add water to cover. Bring to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the chicken pieces are no longer pink, about 10 minutes. Shred chicken by placing two forks back to back and pulling meat apart. Set the shredded chicken aside. Meanwhile, combine the cream of chicken soup, sour cream, and chili powder in a saucepan. Bring to a simmer over low heat, stirring occasionally, then turn off the heat and cover to keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the shredded chicken, chopped green chilies, taco seasoning, half of the bunch of chopped green onion, and water. Allow to simmer for 10 minutes. Stir in the lime juice, onion powder, and garlic powder; simmer for an additional 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Stir 1 cup of the soup mixture into the skillet with the chicken mixture. Spread the remaining soup mixture on the bottom of a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill each tortilla with chicken mixture. Sprinkle Cheddar cheese over the chicken filling before folding the tortillas, reserving half of the shredded cheese for topping the enchiladas.  Fold tortillas over the filling and place seam-side down in the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour enchilada sauce evenly over the enchiladas. Cover with the remaining 1 1/2 cups of Cheddar cheese. Sprinkle the reserved chopped green onions and the sliced olives on top of the cheese. Bake in the preheated oven until filling is heated through and the cheese is melted and bubbling, about 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MomSavedbyGrace"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.721852204249921,
            "ratingCount": 3153,
            "itemReviewed": "Angela's Awesome Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "709.5 calories",
            "carbohydrateContent": "52.5 g",
            "cholesterolContent": "125.7 mg",
            "fatContent": "36.3 g",
            "fiberContent": "4.4 g",
            "proteinContent": "42.2 g",
            "saturatedFatContent": "17.6 g",
            "servingSize": null,
            "sodiumContent": "1764.5 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-17T15:34:30.763Z",
                "reviewBody": "I love this recipe! I have made some changes that make it easier for me on a weeknight: I put the chicken (sometimes I even use frozen-solid breasts or thighs) in a crockpot with the taco seasoning, garlic powder, onion powder, chili powder, chopped onion + a little water in the morning.  Then when I get home from work the chicken is easily shredded and I add the other filling ingredients to the crock pot and stir it up. Then I just assemble per the directions.  I also use green sauce instead of red. This way it only takes 15min to get them in the oven and the meat tastes great from simmering all day in the spices.  Thanks Angela!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Uhrlaub",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1944300/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-30T21:38:59.61Z",
                "reviewBody": "I don't care for the rating system on this site. There are so many bad recipes that get 2 or 3 stars, that the 5 star rating doesn't due this recipe justice. These are the best enchiladas I have ever tasted, and my entire family agrees. I have used over 100 recipes from this site, and this is one of the few that is a true 5 star recipe. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KCKings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2677250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-08T20:55:18.953Z",
                "reviewBody": "These are  without a doubt THE BEST Chicken Enchiladas I have ever eaten.It makes a HUGE batch. My only suggestion is to keep the breasts whole while simmering in water (it makes them easier to shred).This is the only enchilada recipe I will ever use .Thanks Angela!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Vilhauer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3254892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-24T16:46:07.717Z",
                "reviewBody": "This was very good, as is. But with a few minor changes, you can make this in  a LOT less time (and less dishes!). As another reviewer mentioned, I placed the frozen chicken breasts in a crock pot on low with chili powder, onion, taco seasoning, garlic powder and onion powder. That evening I shredded the chicken inside the crock pot in under 2 minutes, added the green chilies, and lime juice. In a separate bowl I mixed the cream of chicken, sour cream and more chili powder. I omitted the butter all together saving calories, and it won't be missed. Then I layered half the cream sauce on the bottom of the 9x13 inch pan and mixed the rest into the chicken mixture still in the crock pot. Then I placed a layer of tortillas (I used corn) in the pan, followed by the entire chicken mixture, cheese, another layer of tortillas, enchilada sauce, cheese, and olives. Prep time for the entire meal was 10 minutes. Trust me, you won't be disappointed! Next time I will use green enchilada sauce (personal preference for chicken.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyndee Spilker-Jacobson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2059769/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-16T14:55:47.27Z",
                "reviewBody": "This was incredible...everyone loved it! \n\nOh, and I realized when I got home from the store that I forgot cream of chicken soup....so I consulted the interwebs and ended up with a great recipe to remedy that exact problem: \n\nI put three tablespoons of butter in a small pan, let it get nice and hot, whisked into it one or one and a half tablespoons of flour until it formed a nice roux....then I whisked in a half cup of chicken broth and a half cup of milk...and this made, to my surprise...an EXACT replica (except better) of campbells cream of chicken soup. It was so good, that I can honestly say I will quickly whip that together any time I find a recipe that calls for cream of chicken soup.\n\nThese enchiladas were super, super good. I LOVE enchiladas and these totally hit the spot and were exactly what you think of in your head, when you say to yourself \"man, I'd love some enchiladas!\"...GO FOR IT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kitchengal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4393504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-16T21:43:17.127Z",
                "reviewBody": "Very good recipe - I would suggest grilling the chicken breasts on the gas grill instead of poaching them to give them a deeper flavor.  I also added about 1/2 teaspoon of ground cumin and 1/2 cup of salsa to the chicken mixture to take it up a notch.  If you have a gas stove, place the tortillas on the burner of the stove for about 20 seconds to gently char them before filling and rolling them.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chuck Wesserling",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3078086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-01T16:25:18.247Z",
                "reviewBody": "Really, really good!  You may THINK you don't have enough liquid while the mixture is simmering, but you will be wrong.  These were addictive.  Hint:  If you want to save time, you can pick apart a rotisserie chicken instead of shredding breasts, but shredding the meat really isn't as time-consuming as I thought it would be (about 10 minutes).  I also used double the enchilada sauce because I like to have extra, that was personal preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenaca Hobson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2448824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-08T21:38:47.4Z",
                "reviewBody": "The enchilada filling was outstanding!!! But, make sure you use a good enchilada sauce, otherwise it will overpower the delicate chicken flavors. All in all, a great dish! UPDATE: I made just the filling (without the sour cream/cream of chicken soup/chili powder) for burritos, and they were AMAZING!!! Quick way to get the great flavor of this dish without having to go through all the steps of enchiladas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "happywife05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-05T17:17:27.31Z",
                "reviewBody": "Very good!  I made a lower fat version by using non-fat sour cream and reduced fat cream of chicken soup.  Also, I added some salsa, extra lime juice, and garlic powder to the soup/sour cream mixture.  I like mine extra saucy so I also made sure to double the soup/sour cream mixture.  Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Drosemon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3474473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-03T20:17:54.137Z",
                "reviewBody": "This has been in my box for months and I finally made them yesterday.  It is a good recipe in many respects.  However, for the time it takes it doesn't deliver enough on flavor.  I followed others' advice and did the chicken in the crock with taco seasoning and with a 1/4 cup of jarred jalapenos in juice to up the flavor of the chicken which was excellent advice.  When simmering the chicken in the skillet, I replaced the water with a 16 oz jar of fire-roasted salsa and tossed in a can of corn for color and texture.  Given the amount of work that goes into it, we were expecting some knock-your-socks-off Mexican flavor.   Even with the onions, the chilies, all the seasonings, the salsa and the enchilada sauce, we all found it a little bland.   It was pleasant and I'm sure kids and those who don't like spice/heat would love it.  But if you're looking for a good solid spicy enchilada, you'll probably be a bit disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Dutchgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3180618/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Angela's Awesome Enchiladas",
            "description": "The secret to these savory chicken enchiladas is the seasoning.",
            "uploadDate": "2013-04-17T00:09:21.631Z",
            "duration": "PT5M9.850999999999999S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fbfc88236-643f-4d0e-b28b-33ce52b33185%2F097fe074-4235-4fb6-8a16-c11f0fd4ef51%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2306014276001"
        }
    }
]