[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16233/meat-and-poultry/turkey/legs/",
                    "name": "Legs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/84456/roasted-turkey-legs/",
        "name": "Roasted Turkey Legs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6034573.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2019-04-04T03:33:42.000Z",
        "description": "This is a great way to have a small scale turkey dinner anytime of the year. Serve with rice, noodles, or dressing. This recipe can also be increased very easily.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "3 servings",
        "recipeIngredient": [
            "3 stalks celery stalks, cut in thirds",
            "3 turkey legs",
            "6 tablespoons butter",
            "salt to taste",
            "½ cup water, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Rinse the turkey legs and pat dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stand the turkey legs upright (as if the turkey were standing). Press a knife downward into the deep tissue, creating 2 or 3 long pockets. Press a piece of celery into each opening. Pull back the skin on the legs, rub with butter, and season with a little salt. Put the skin back into place, rub with more butter, and season lightly with salt. Lay the legs in a roasting pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast uncovered for 1 1/2 to 2 hours, until the legs are golden brown and the internal temperature is 180 degrees F (82 degrees C) when taken with a meat thermometer. Add more water if needed while roasting, and baste occasionally with the juices or butter.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Legs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KERYNE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.426086956521739,
            "ratingCount": 115,
            "itemReviewed": "Roasted Turkey Legs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "643.1 calories",
            "carbohydrateContent": "1.2 g",
            "cholesterolContent": "239.4 mg",
            "fatContent": "36.9 g",
            "fiberContent": "0.6 g",
            "proteinContent": "73.1 g",
            "saturatedFatContent": "18.9 g",
            "servingSize": null,
            "sodiumContent": "399.4 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-27T20:38:50.66Z",
                "reviewBody": "Good basic recipe. I added a few extra steps:\nI brined the legs with water & salt in fridge the night before. Rinsed the turkey legs. Added onions instead of celery into the legs. Mixed butter with sage, thyme, rosemary and bit of salt/ black pepper and put that between the meat/skin. I placed the legs in the pan, and sprinkled black pepper on top of skin. Poured 1 can of chicken broth in the pan and added baby carrots in the pan on the outside (love the taste), loosely cover with foil. And baked at 400 degrees instead of 350 (since I was using a small toaster oven - not the big oven, I was afraid that it wouldn't be hot enough) for 2 hours. About 1 hr 10 later, took out the foil and basted them occassionally. 30 min before taking it out, I sucked out a lot of the broth (using the baster) and used that for the gravy. This allowed for the skin to brown and crisp up. Served with potatoes, gravy and corn. It turned out good, meat broke off the bone cleanly and the skin was nicely brown and crispy. Next time I would probably keep the foil on there a bit longer and take it out a bit earlier probably 1 45 min instead of the full 2 hrs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ink",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-21T03:30:19.35Z",
                "reviewBody": "Yum. Great, easy recipe. I'm a huge onion fan, so I sliced up a white onion and inserted the pieces into slices throughout the drumsticks. It worked really well. \n\nI roasted them for about 45 minutes covered, basting regularly, then uncovered them and turned every 20 minutes afterwards. Total time was about an hour and 45 minutes.\n\nThanks for the post!\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1974401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-04T12:31:17.85Z",
                "reviewBody": "This is a great recipe for those who love dark meat and don't want to be bothered cooking a whole turkey! I use broth instead of water. I also then half way through the cooking time surround the turkey legs with savoury stuffing. I keep a lid on the roasting pan until the last little while as well. It keeps the meat juicier, and then I just brown it toward the end.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan Blumenthal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1706490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-28T00:16:21.067Z",
                "reviewBody": "Use a variation of this recipe, time and time again.  I usually have to refer to this for the baking temperature.  I foil-line a cookie sheet and rinse the turkey legs off and pat dry.  I melt a little butter in a bowl in the microwave and brush it all over the legs and swipe some on the foil to prevent sticking.  I then salt the legs, sprinkle thyme, then pepper them lightly, flip to the other side and repeat, reapplying the butter if it looks like it needs it.  We prefer thyme on our turkey as opposed to other herbs like rosemary, as it can overpower the taste sometimes and we usually like something a little basic, but with flavor.  Generally, this finishes before the 2 hour mark in the oven and I always make my special mashed potatoes with it.  I remove the legs from the pan and scrape the drippings off the foil and put them into a pan, add about 1/2 cup (i don't measure) of milk and heat until the drippings blend well with the milk, THEN I add about a tablespoon of flour and simmer until blended and desired thickness (usually a minute or 2).  Turkey drippings make THE best gravy, no seasonings needed, it's already there.  Serve with another side like green beans or whatever I have on hand.  AWESOME.  Simple & fool-proof.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "celerygeneral",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7125211/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T22:59:14.807Z",
                "reviewBody": "Very EASY, Simple recipe.  You can't go wrong.  I have tried this recipe twice and both times, I must say, they came out DEE-LISH-US!  The first time I did not have any celery so I used slivered onions instead (very tasty).  But last Sunday when I did have some celery I tried it again and OMG!  The flavor those stalks put out was superb!  I thought that the celery would be mushy and it was not.  If was soft yet still had a firm feel when eaten.  I seasoned my turkey with salt, pepper, garlic powder and a little parsley (for color).  My meat was tender, juicy and fell right off the bone!  We had with greens (with turkey necks), mac-n-cheese and cornbread (I uploaded a pic.  I had to stop eating in order to actually take the picture. LOL).  I will DEFINITELY cook my turkey legs this way from now on.  I've shared with friends and they too enjoyed the recipe.  Reminds me of the food my grandmother would cook everyday.  Thanks for sharing Keryne!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Veda'sCookingDinner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/52564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-17T13:53:20.327Z",
                "reviewBody": "This was very easy to get together! I am not a fan of celery so I used onion instead and served this with brown rice in golden mushroom sauce. Yummmm",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KIRSTIBUG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1400611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-29T20:13:23.817Z",
                "reviewBody": "I could never get my turkey legs juicy and tender...and as tasty. Quick easy delicious! I also seasoned them with my own spices...GREAT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3005121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-28T03:24:55.42Z",
                "reviewBody": "This was super easy and it turned out absolutely fantastic! I did add a brush of BBQ sauce when it was done and served hot to the table. I will certainly make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAMBRIA913",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1022620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-28T23:49:23.893Z",
                "reviewBody": "I totally agree this is the greatest dish. I added carrots and potatoes that I had pre-boiled for the last hour. I also added half a pear prior to that after the legs had roasted maybe half an hour. I also didn't put butter under the skin but just added it to the roast and occasionally basted and I used no spices or herbs just salt and pepper. In my 54 years of eating other people's good cooking (my Mom sisters etc.) I have to say this is about the best turkey the best potatoes and the best carrots I've ever had (and I made it still can't believe it). Thankyou so much for this. And it took 15 minutes of shopping and 15 minutes of prep time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Savory",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4252146/"
                }
            }
        ]
    }
]