[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
                    "name": "Pasta and Noodles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/494/pasta-and-noodles/homemade-pasta/",
                    "name": "Homemade Pasta Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18465/gnocchi-i/",
        "name": "Gnocchi I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F01%2F1070416.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-06-03T13:51:07.000Z",
        "description": "This simple potato, flour, and egg recipe is one my family has used for generations.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 potatoes",
            "2 cups all-purpose flour",
            "1 egg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of salted water to a boil. Peel potatoes and add to pot.  Cook until tender but still firm, about 15 minutes. Drain, cool and mash with a fork or potato masher.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1 cup mashed potato, flour and egg in a large bowl.  Knead until dough forms a ball.  Shape small portions of the dough into long \"snakes\".  On a floured surface, cut snakes into half-inch pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Drop in gnocchi and cook for 3 to 5 minutes or until gnocchi have risen to the top; drain and serve.\n"
            }
        ],
        "recipeCategory": [
            "Pasta and Noodles",
            "Homemade Pasta Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Anna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.287301587301587,
            "ratingCount": 630,
            "itemReviewed": "Gnocchi I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "329.2 calories",
            "carbohydrateContent": "67 g",
            "cholesterolContent": "53 mg",
            "fatContent": "2 g",
            "fiberContent": "3.4 g",
            "proteinContent": "9.7 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "21.5 mg",
            "sugarContent": "1.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-21T04:20:01.683Z",
                "reviewBody": "A great, basic gnocchi recipe.  I like this served with a simple garlic butter sauce and some oregano, basil, and black pepper.  \n\nI might have an idea about why reviewers have disagreed on how much flour this recipe needs:  It depends on how much water the potatoes absorb during cooking.  If you boil them whole, they'll absorb a fair bit of water; if you boil them in chunks, they'll absorb even more.  If you steam them, they'll absorb less, and if you microwave them, they'll absorb none at all.  My suggestion:  Start with one cup of flour and add more to the potato mixture as you knead it until the dough is dry to the touch (but not so dry that it crumbles).  My experience is that two pounds of potatoes will take about a cup and a half of flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EVERYWHERE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1266463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T14:59:24.073Z",
                "reviewBody": "Great recipe - a few gnocchi tips: Work with pounds of potatoes since the sizes can vary so much. I boil the potatoes whole in salted water and them peel after cooling slightly to limit water intake.  Press the potatoes thru a ricer for finer texture.  When working with the flour start with 1/2 cup per 2 lbs of potatoes, gradually adding more until you reach the \"right\" consistency too much flour will they are stiff and chewy, too little soft and mushy.  After cutting roll the individual pieces down a fork to create ridges and a dented center to pick  up sauce. They should curl slightly as they are pressed gently down the fork.  My Grandma added parmesan or romano to the mix for more flavor depending on the sauce used.  They take practice but are worth it!  Reivsed **NOTE..gnocchi is inherently 'bland'.  The idea is to serve with a fabulous sauce (tomato based or garlic tomato basil oil, endless possibilities).  I can't see stuffing a gnocchi..lol...wow no stuffing them.  Vary flavor with salt and/or cheese but dont go crazy cuz then its not gnocchi. Good tip: let the gnocchi sit in the sauce for a bit before serving to infuse the flavors. Tip 2 - the dough will absorb moisture while sitting so you need to work quickly and reesstablish consistency with each 'rope' before rolling and cutting by kneading in a bit more flour til it is resilient to a light touch.  LAST -  Ignore any ratings below 5 :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sugarg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sugarjo/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-30T14:01:32.7Z",
                "reviewBody": "I have a tip for anyone who thinks the recipe takes too long - after I knead the dough, I put it in an icing bag, squeeze it straight into the boiling water, cutting it into 1-inch pieces as I squeeze.  Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAEPLI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/711826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-03T22:04:39.56Z",
                "reviewBody": "Okay, I've never eaten a gnocchi before in my life, but from what I understand, the potatoes should be really finely mashed (by using a ricer or whatnot), and I have a suggestion to anyone wishing to get finely mashed spuds: Use a mixer! I'm using a stand mixer but I've used hand mixers in the past to make whipped potatoes (I never had mashed potatoes growing up, they were always whipped with a mixer). I cooked 6 medium-large unpeeled potatoes in the microwave in batches of 3 for 7 minutes per batch (turning halfway through), and then I let them cool slightly and peeled them (accomplished more easily with some napkins and towels, the skins just sloughed off). Put them in my mixer bowl, added 3 TBS butter, some salt, pepper, garlic powder, and nutmeg. Let them fully cool, then I added 2 eggs and mixed them in slightly with the beaters. By hand, I mixed and kneaded in the flour. I only used 3/4 cup, and it seemed good, so I cooked a dozen little gnocchi up. They were way too squishy, so I kneaded about another ½ cup or so of flour into the remaining dough. I snaked them out, cut them, and put them on a wax paper-lined baking sheet. I then put the sheet in the freezer. Once frozen, into a freezer bag! I cooked some frozen ones up to make sure they're great, and they were pretty good with a mushroom pasta sauce! Thanks for a fun recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Duckball",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241884/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-01T17:56:53.483Z",
                "reviewBody": "help! what did i do wrong? i followed the directions exactly and the dough was very mealy and dry and i finally threw it out. has anyone had this problem?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "TMARIE39",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/551079/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T06:35:34.38Z",
                "reviewBody": "Excellent fresh recipe - it may be noted that it's best not to knead the ingredients like you would bread. If you pull the ingredients together quickly and then roll in a \"snake\" it will give you a lighter gnocchi . . . this recipe is great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DAWNELAINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276322/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T19:56:42.093Z",
                "reviewBody": "12 years ago, I turned frozen gnocchi into a pot of gooey mush.  So I was a little skeered to try this recipe.  Turns out that was unnecessary - this was crazy easy!  Based on the reviews, I steamed 3 medium potatos in the microwave, so they absorbed no water.  Once cooled I peeled and mashed them finely with a fork, then added the egg and just 1/2 cup of flour.  Then I added 1/2 more.  Then I dumped it on a floured counter and probably worked in another 1/4 cup total, rolling them.  (I tried rolling them down the tines of a fork for the grooves... but that was not as successful.  I ruined the shape without getting many grooves.  A skill that requires practice, perhaps?)  They were done in under three minutes, were light and just barely chewy.  I made a pan sauce with 2 tbsp butter, 1 tbsp flour, 1/4 very thinly sliced onion, 1 mushroom buillion with 1 cup water, and some rubbed sage & salt to taste.  Honestly, I'm already craving them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "moxie & mirth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3148162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T06:35:59.083Z",
                "reviewBody": "The recipe says to boil the potatoes until they are tender but still firm and \r\nI think that may be a little misleading for us first-timers.  I thought my potatoes\r\nwere like that, but  they didn't blend very well into the flour mixture.  Because of \r\nthis, I couldn't form the dough \"snakes\" very well.  But it still tasted good in the end.  \r\nI think that I'll just boil the potatoes much longer next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Doucette Legge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/165035/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-31T19:11:50.903Z",
                "reviewBody": "Great Recipe!  Simple and complete!  The trick I found helped me was to work in enough flour so that the dough hardly \"moves\" when you stop kneading for a second.  Once that was accomplished I rolled it into 1/2 to 3/4 inch ropes, chopped in one inch chunks, rolled it down the tines of a floured fork and boiled them in salted water 'til they floated for a minute or two!  Great with Alfredo Sauce & grilled chicken or your favorite Spaghetti sauce!  Thanks for sharing your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DARLENE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/31622/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Gnocchi I",
            "description": "See how to make amazing potato gnocchi.",
            "uploadDate": "2012-11-30T22:40:27.205Z",
            "duration": "PT5M19.903S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6b7c8cac-65ac-4af1-9545-2ea3ffb0e34c%2F1cb3fc68-10a3-4b34-ac7e-8162c04f2a0a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2000867727001"
        }
    }
]