[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17614/appetizers-and-snacks/pickled-eggs/",
                    "name": "Pickled Egg Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/92433/emilys-pickled-eggs/",
        "name": "Emily's Pickled Eggs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1752492.jpg",
            "width": 2358,
            "height": 2358
        },
        "datePublished": "2019-04-04T03:34:24.000Z",
        "description": "This wonderful picked egg recipe is quick and easy.  Perfect for a nice gift, or just to have on hand for entertaining.  Plan ahead though, they need to be refrigerated for at least 3 days before they're ready for eating.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P3DT0H35M",
        "recipeYield": "12 eggs",
        "recipeIngredient": [
            "12 eggs",
            "1 cup white vinegar",
            "½ cup water",
            "2 tablespoons coarse salt",
            "2 tablespoons pickling spice",
            "1 onion, sliced",
            "5 black peppercorns"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place eggs in a  large pot and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool and peel. Place the eggs into a 1 quart wide mouth jar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan, combine the vinegar, water, salt, pickling spice, most of the onion (reserve a couple of slices), and black peppercorns. Bring to a rolling boil; pour over the eggs in the jar. Place a couple of slices of onion on top and seal the jars. Cool to room temperature, then refrigerate for 3 days before serving.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Pickled Egg Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cheryl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.491803278688525,
            "ratingCount": 122,
            "itemReviewed": "Emily's Pickled Eggs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "78.2 calories",
            "carbohydrateContent": "1.8 g",
            "cholesterolContent": "186 mg",
            "fatContent": "5 g",
            "fiberContent": "0.3 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "1030.8 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-10T17:54:32.16Z",
                "reviewBody": "To those of you who are getting brown eggs and an off flavor, you need a different pickling spice. DO NOT use a pickling spice that contains clove or the eggs will turn brown and the clove will overpower the eggs. The most common spice company is McCormick's and they have an inordinate amount of clove in their pickling mix. If you are not sure what is in your mix, clove will be slightly larger than a black peppercorn and float in water. If it is in there, take it out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Benny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6289775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-19T16:46:51.773Z",
                "reviewBody": "I hate to be the voice of dissent, but these did not work for me.  I was certain this was a \"sure thing\" given the simple ingredients and instructions, and the fact that it's about the only recipe I've ever seen with all 5* reviews.    I made these are Thursday, and I followed the measurements & instructions EXACTLY. By the end of the first day, the eggs were all a mottled brown color... very unappetizing.   When I tried one tonight, it was awful.  I've never made pickled eggs before, but when I buy them, they retain a bright white color.  I am so disappointed that 1 dozen eggs were wasted.  Given the spectacular results others have had, I would like to try again.  *Update: Thanks for your feedback, the answer is no, I did not use balsamic vinegar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahxbee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2188473/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-18T05:35:00.52Z",
                "reviewBody": "This recipe rules.\nI made these alongside the Pennsylvania version (the one with beets) to see which kind I liked better. I had a tough time deciding and leaned a little towards these, but most people like the Pennsylvania version better. This was at a party of guests who hadn't had pickled eggs before (same verdict when I made them both for my family). \nThese are delicious, easy, and cheap. My roomate likes to slice them up to add to sandwiches.\nA couple times I've run out of pickling spice and had to make do with just bay leaves, pepper, and cloves. It came out fine.\nI also haven't noticed a difference between leaving them over night and eating them or leaving them for 3 days and eating them. The heat is enough to soak the marinade through the egg white.\nAlso, for those who don't have pickling jars and are using a bowl you should at least double the marinade in order to completely cover the eggs and onions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aidan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3392412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-04T14:21:27.923Z",
                "reviewBody": "I've made these a couple times now and they are great. I do have to increase the brine to cover the eggs. I also add a couple garlic cloves a red chili pepper and mustard and dill seeds (approx 1t each). I also substitute part of the white vinegar for rice vinegar. I find this adds a touch of sweetness. I usually marinate for at least a week. For the person who's eggs turned brown - maybe you used balsamic vinegar? It isn't the same as white vinegar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Iceblink",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3770643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T03:57:45.43Z",
                "reviewBody": "Good tasting basic pickled egg..... the only thing I might consider changing is removing the clove from the pickling spice... that might be the overwhelming flavor I taste... I should have listened to the other reviewer who suggested that... also I am considering adding a little garlic, some red pepper, and some sugar... also I will leave a few more onions uncooked (because I just love them).. but otherwise this recipe seem to work well for me... no troubles at all... they are disappearing fast which is always a good sign...\n\nUPDATE: The last time I made these I made the following changes... used only 1 Tablespoon salt... removed most of the cloves from the pickling spice... added 4 cloves worth of minced garlic.... 1 tablespoon sugar... and 1/8 teaspoon of crushed red pepper... Also I love pickled onions so I layered a few extra slices of raw ones with the eggs.. My family said the liked the changed recipe better... I will stick with my changes next time I make it... I definately like eating the extra onion I added...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefScharny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3837544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-22T16:53:53.9Z",
                "reviewBody": "These are sooo GOOD! I make them all the time...my father loves them too. BEST PICKELED EGGS EVER!!!(but i do add a bay leaf to mine)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ilovetocook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2885915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-07T21:40:50.953Z",
                "reviewBody": "These were good but a bit mild for my taste.  Whenever I finish a jar of pickled beets or jalapeno rings I pack it with eggs.  The jalapeno ring juice makes great, snappy ones but the ones made in the beet juice are great too.  No heating required.  Ready in about four or five days.  Easy and, except for the eggs, free.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "William Gerrells",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mnbill/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-29T13:11:16.16Z",
                "reviewBody": "Very simple to make & these are some of the best. I love the onions & am going to make a jar of pickled onions using this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "T.L. McCary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1937844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T17:42:53.733Z",
                "reviewBody": "This was my first time making and eating pickled eggs but it was easy and pretty tasty. I bought a 1 quart jar but only 10 eggs fit (and even then they were squished to make fit) and only about half the onions and liquid could fit in the jar. The only pickling spice I could find at our grocer was McCormick's and it contains cloves. I pulled out the cloves because people complained they made the eggs brown and over-powered the flavor. I could still taste the cloves in the eggs so I must not have gotten them all or else they infused the rest of the spices. I also added a tablespoon of minced garlic and some mustard seed but I cut out the peppercorns after reading the other reviews. In all I wasn't too pleased with the taste of the pickling spice. It tasted like ginger bread or something. I'd prefer a stronger vinegar and garlic taste. I think I might skip the pickling spice next time and add a dozen garlic cloves instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WHIRLEDPEAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whirledpeas/"
                }
            }
        ]
    }
]