[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/261/main-dish/ribs/",
                    "name": "Rib Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/98539/vegetarian-ribs/",
        "name": "Vegetarian Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5253917.jpg",
            "width": 3874,
            "height": 2906
        },
        "datePublished": "2019-04-04T03:34:38.000Z",
        "description": "These ribs may be made with some pretty odd ingredients, but they really taste great!  They are not difficult to make, and are very forgiving.  However, it takes a certain amount of trust to make them.  Even if your mix looks and feels like a huge mistake, keep on going, and bake it.  The first time I made these, I did everything wrong, and they were still delicious.  Even my excessively carnivorous husband liked them.  These are great comfort food, and really stick to your ribs!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 cups gluten",
            "⅓ cup nutritional yeast",
            "2 tablespoons paprika",
            "1 tablespoon salt",
            "2 cups water",
            "½ cup smooth peanut butter",
            "1 large onion, minced",
            "½ cup olive oil",
            "2 cups barbeque sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the gluten, yeast, paprika and salt. Pour in the water all at once and quickly mix with a sturdy spoon. Additional water may be necessary to moisten all of the dry gluten. Don't worry that the ball is rather solid, it is supposed to be. Pour off any excess water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If you want your ribs chewy, leave the ball just as it is. If you want it slightly less chewy, remove it from the bowl and knead for 1 to 2 minutes on a clean surface. Return it to the bowl, and coat with smooth peanut butter. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a skillet over medium heat. Add onion; cook and stir until golden brown. Remove from the heat. Pour the onion and oil over the ball of gluten. Poke a few times with a chopstick, knife or even a fork, allowing the oil to soak into the ball. Let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the ball is just warm enough to be manageable, use your hands to mix the oil and onions in. There will be a lot of oil that will not mix in and tiny pieces of gluten that will not stay attached. That's okay. The oil mainly helps the gluten absorb the spice. Just mix as much as you can.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Break off good sized handfuls of dough and shape them into strips by pulling and twisting. You want them to be about 4 inches long and 1/2 inch thick. Don't try cutting these, or rolling them out, as that will make them behave more like bread and change the texture appreciably. Place the strips on a greased baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 40 minutes in the preheated oven. Remove from the oven and coat each piece liberally with barbeque sauce. Return to the oven for another 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rib Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laura J"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.142857142857143,
            "ratingCount": 98,
            "itemReviewed": "Vegetarian Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "939.4 calories",
            "carbohydrateContent": "82.9 g",
            "cholesterolContent": null,
            "fatContent": "44.5 g",
            "fiberContent": "7.3 g",
            "proteinContent": "52.4 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "3297 mg",
            "sugarContent": "38.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-25T15:44:54.297Z",
                "reviewBody": "I love these things. I just read the reviews and had to respond to a few things. You don't/can't activate nutritional yeast, it's just not that kind of yeast. You can make your own gluten easily, though slowly, by mixing half all purpose white flour, and half wheat flour into a stiff ball (for 2 cups gluten, use 4 cups flour total) nthen cover with cold water and let rest an hour. then knead until REALLY cloudy, change water let rest, etc. until kneading leaves almost clear water. tada, gluten!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scurl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2486262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-18T01:09:41.853Z",
                "reviewBody": "EXPERIENCED BBQ'er  ...hi everyone.  If you are having ANY trouble with this recipe, please contact me and I'll be glad to troubleshoot.  This recipes comes from The Farm Vegetarian Cookbook and I have been making this recipe since the early 1980's and have it down pat!!!!  Please write with your questions and I'll be more than happy to answer.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Penny Foster Carey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2815092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-17T14:58:04.743Z",
                "reviewBody": "This is a good recipe ingredient wise, but the instructions make it more complicated than necessary. Try this instead - mix all ingredients in a large bowl, except the wheat gluten, till smooth. Then add gluten to the bowl and mix with a spoon till most of the gluten is moist. Then you can knead for a minute or two. Now your ready to break into chunks, shape and bake. I also found the bake time to be a bit long- try 10 minutes less.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alysia C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2148691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T15:44:47.7Z",
                "reviewBody": "Awesome! served this to a bunch of carnivores, vegetarians and vegans alike (check your  bbq sauce carefully, could have fish in it). This is AWESOME -- these are not supposed to rise, the nutritional yeast gives flavor, and is not a leavening agent. You can get Gluten at a Health food store usually called \"Wheat Gluten\" or \"Vital Wheat Gluten\". It sometimes comes in bulk sections, or in specialty flour sections (even in our 'natural food section' of our regular grocery).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kwehking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2088619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-24T06:45:38.747Z",
                "reviewBody": "These were very tasty.  I notice that the recipe has been edited since the last time I made these, the water being reduced to 2 cups. I added onion powder to the dry mix and used Bragg's Liquid Aminos instead of salt. Heated peanut butter in microwave so it would spread easier.  Reduced the oil to 1/3 cup & realized I'd cut the onions too chunky -  pureed them in the blender after they cooked.  The dough mixed up much nicer and looked and tasted like something I'd serve to company. Baked on parchment paper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tacy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-22T17:08:56.317Z",
                "reviewBody": "I haven't eaten meat in eleven years, and ribs are the only thing I miss.  I happen to be very forgiving of any vegetarian \"meat\" substitutes; because it's been so long, I can hardly tell anymore that veggie burgers don't taste exactly like the real thing.  So I had high hopes for these, especially given all the positive reviews.  Unfortunately, they're not to my liking.  I wish I had something to compare them to, but the texture isn't like anything I've ever had before or ever care to try again.  Despite the attempts of the paprika and onion to add flavor, these taste like some kind of bland, chewy blob soaked in barbeque sauce.  Which makes me like barbeque sauce less, since it's meant to enhance flavor, not BE the only flavor.  I had some amazing vegetarian ribs at B. Smith's when I was visiting a friend in DC, but unfortunately I live in Milwaukee... and they were $19.  So I will continue searching for a recipe that calls for carmelized sweet potatoes, in the hope that it will be closer, since that's what those were made of.  If you're going to try these, I suggest cutting the recipe in half the first time, since it is a huge waste of a lot of expensive ingredients if it turns out you don't like them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "spordelia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5085931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-19T03:34:40.24Z",
                "reviewBody": "Great flavor! I followed this recipe to a \"T\" but I did have some issues with my gluten dough. I think the water really should be cut down to 2 cups instead of 3 cups. My dough was very wet and never once resembled the \"ball\" the recipe talks about. I had to drain a LOT of water and I felt like all my paprika was being washed down the drain! When I went to make the \"ribs\" there was no pulling or twisting going on with the dough...it was more like slopping it into the pan and hoping that it would dry out in the oven! I would also cut the amount of BBQ sauce to 1 or 1 1/2 cups...2 cups was way too much. Other than too-wet dough the flavor was really quite delicious and the texture would be better if I used less liquid. I will definitely give this one another try! Good luck....stick with it even if it seems like all hope is lost. They are very tasy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fordbeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-12T20:03:53.19Z",
                "reviewBody": "Just made my first batch. As others have suggested the recipe needs tweeking to make it simpler. 1. Saute onions in 1/4 c oil. 2. Add all spices seasonings and PB to cooked onions. 3. I also added 1 T liquid smoke and 3 T Braggs. 4. Add 1 1/2 c. water( you could use a broth here) to onion mix. 5. Now add the Vital Gluten and mix just to moisten all ingredients. Knead if you like. 6. Ready to break off chunks and bake. And YES reduce the baking time by at least 10 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dietary Dan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6327809/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-22T05:20:01.997Z",
                "reviewBody": "My children absolutely loved these even though they looked nothing like they were supposed to. I think a few more details in the recipe would have made this easier e.g. the recipe probably should have specified \"warm\" water to help activate the yeast. My \"ribs\" came out flat like hamburgers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Banneker_Fan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2037657/"
                }
            }
        ]
    }
]