[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/131/drinks/beer/",
                    "name": "Beer",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/101923/snail-pale/",
        "name": "Snail Pale",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Snail Pale"
        },
        "datePublished": "2019-04-04T03:34:47.000Z",
        "description": "Making your own beer at home is a great hobby for the beer enthusiast. This recipe makes enough for a party, or just keep to you supplied with delicious pale ale of excellent quality.",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P21DT20H2M",
        "recipeYield": "5 gallons",
        "recipeIngredient": [
            "3 gallons water",
            "8 ounces crystal malt 60L in a grain bag",
            "½ gallon water",
            "8 pounds liquid malt extract",
            "3 ounces Perle hops",
            "2 ounces Willamette hops",
            "1 teaspoon Irish moss (carrageen)",
            "1 (.25 ounce) envelope instant ale yeast",
            "1 ½ gallons water",
            "4 ounces corn sugar (dextrose)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour 3 gallons of water into a large stainless steel pot. Heat to 150 degrees F (65 degrees C). This works best using an outdoor propane burner from a turkey fryer, but you can also use your stove. When the water reaches temperature, place the crystal malt in its nylon bag into the water. Steep for 30 minutes, maintaining the same temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After the 30 minutes are up, remove the bag from the water and place in a separate pot to drain. Rinse the crystal malt with about a half gallon of water that is at least 150 degrees F (65 degrees C). Pour the water from the grain bag into the main pot and bring to a boil. As soon as the water is boiling, remove from the heat and stir in the malt extract. You do not want to do this over the heat because the malt extract will settle to the bottom and possibly burn.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return the pot to the heat and bring to a boil once again. Add the Perle hops and stir. Set a timer for 30 minutes. This is now wort. Continue to stir occasionally and watch for boil overs. After 45 minutes, add the Willamette hops and Irish moss to the pot and continue to boil until the timer goes off.\n"
            },
            {
                "@type": "HowToStep",
                "text": "About the same time as you add the Irish moss and final hops, prepare an ice bath by filling a sink, large tub or cooler with ice. When the time is up, remove the pot from the heat, cover and place in the ice bath. Be careful not to drop anything into the pot that is not sterilized, including spoons. Cool your wort to 80 degrees F (25 degrees C). You can swirl around the ice bath to help it cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, sprinkle the yeast over 1 cup of warm water (80 degrees F) and let it stand until ready to use. This will help to keep from shocking your yeast and ensure a faster start of the fermentation.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the wort into a sterile fermenter (carbuoy) and add the yeast. Add enough bottled or boiled and cooled water to reach the 5 gallon mark, about 1 1/2 more gallons. Seal with a cap and shake or rotate to mix in the yeast. Replace the cap on the fermenter with an airlock and place in a cool dry place where the temperature remains consistently below 70 degrees F (21 degrees C). Ferment for 5 days or until it stops foaming.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a siphon hose to transfer the beer to a secondary fermenter. Cap with the airlock and ferment for 1 to 4 weeks, until the specific gravity has dropped to 1.005 when tested using a hydrometer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize your bottles for bottling. Pour the beer into a new bucket and stir in the corn sugar until dissolved. Siphon into bottles and cap. Let the beer prime in the bottle for at least 7 days in a place where the temperature stays below 70 degrees F (21 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes",
            "Beer"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "davy73"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4,
            "ratingCount": 1,
            "itemReviewed": "Snail Pale",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "320.4 calories",
            "carbohydrateContent": "72 g",
            "cholesterolContent": "0 mg",
            "fatContent": "0.1 g",
            "fiberContent": "0 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "0 g",
            "servingSize": null,
            "sodiumContent": "50.6 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-08T21:05:40.79Z",
                "reviewBody": "very good easy recipe. this beer has a little bit higher alcohol content due to the higher amount of malt extract. I will be brewing this again and will probably dry hop it in the secondary fermenter to balance out the maltiness and higher alcohol. a very nice beer on its own.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "onejdn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3127627/"
                }
            }
        ]
    }
]