[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/131/drinks/beer/",
                    "name": "Beer",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/102126/irish-chocolate-stout/",
        "name": "Irish Chocolate Stout",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Irish Chocolate Stout"
        },
        "datePublished": "2019-04-04T03:34:48.000Z",
        "description": "A very good traditional Irish stout made with chocolate malt.",
        "prepTime": "P0DT2H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "5 gallons",
        "recipeIngredient": [
            "3 gallons water",
            "2 teaspoons gypsum, divided",
            "5 pounds English 2-row pale malt",
            "1 pound chocolate malt (dry)",
            "4 ounces roasted barley",
            "6 ounces black patent malt",
            "3 pounds dry malt extract",
            "2 ounces Fuggles hops",
            "1 ounce Willamette hops",
            "1 (.4 ounce) packet Irish ale yeast",
            "1 ounce Irish moss",
            "5 ounces corn sugar (dextrose)",
            "1 ½ gallons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour 3 gallons of water into a large stainless steel pot. Heat to 130 degrees F (55 degrees C). This works best using an outdoor propane burner from a turkey fryer, but you can also use your stove. Add 1 teaspoon gypsum, English malt, chocolate malt, roasted barley and black patent malt in a nylon steeping bag. Steep for 30 minutes, maintaining the temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After 30 minutes, increase the heat to 152 degrees F (65 degrees C). Steep for 60 minutes, maintaining a constant temperature. Remove grains to a separate pot to drain and bring the wort to a boil. Rinse the grains with water of the same temperature and pour the liquid into the pot. Stir in the dry malt extract and 1 teaspoon of gypsum. Return to a boil and add the Fuggles hops; set a timer for 60 minutes. When there are 15 minutes left, add the Irish moss. When 10 minutes are left, add the Willamette hops.\n"
            },
            {
                "@type": "HowToStep",
                "text": "About the same time as you add the Irish moss and final hops, prepare an ice bath by filling a sink, large tub or cooler with ice. When the time is up, remove the pot from the heat, cover and place in the ice bath. Be careful not to drop anything into the pot that is not sterilized, including spoons. Cool your wort to 68 degrees F (20 degrees C). You can swirl around the ice bath to help it cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, dissolve the yeast in 1 cup of water (70 degrees F) and let it stand until ready to use. This will help to keep from shocking your yeast and ensure a faster start of the fermentation.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain the wort into a sterile fermenter (carboy) and add the yeast. Add enough bottled or boiled and cooled water to reach the 5  1/2 gallon mark, about 1 1/2 more gallons. Seal with a cap and shake or rotate to mix in the yeast. Replace the cap on the fermenter with an airlock and place in a cool dry place where the temperature remains consistently below 70 degrees F (21 degrees C). Ferment for 7 days or until it stops foaming.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a sterile siphon hose to transfer the beer to a secondary fermenter. Set in a place where the temperature is 64 degrees F (17 degrees C). Cap with the airlock and ferment for 14 days, or until the specific gravity has dropped to 1.005 when tested using a hydrometer or does not change for several days.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize your bottles for bottling. Pour the beer into a new sterile 5 gallon bucket and stir in the corn sugar until dissolved. Siphon into sterile bottles and cap. Let the beer prime in the bottle for at least 14 days in a place where the temperature stays below 70 degrees F (21 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes",
            "Beer"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ctgravier"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 3,
            "itemReviewed": "Irish Chocolate Stout",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "307.7 calories",
            "carbohydrateContent": "68.4 g",
            "cholesterolContent": "0 mg",
            "fatContent": "1.3 g",
            "fiberContent": "3.5 g",
            "proteinContent": "9.8 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "13.7 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-12T21:56:33.853Z",
                "reviewBody": "I can't wait to try this recipe! I use Young's Chocolate Stout when making corned beef and cabbage in my crock pot. YUM! I also grow hops and now have my neighbor addicted to making his own beer so will run a copy of this over to him. Thanks for posting!:).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "terriyaki2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1563293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-14T00:52:07.91Z",
                "reviewBody": "This was an excellent recipe! I normally don't use recipes for beer or cider from recipes sites like this (usually get them from forums or friends) but I happened across this and liked the combination of ingredients. I just cracked open a bottle now and am very happy with the flavor. It's a nicely rounded beer that if made with a dark extract is very dark and pleasantly \"roasty.\" The hops don't make it as bitter as an India Pale Ale it's just shy of that but the bitterness is just right. It's perfect for a cool fall day here in New England- a good dark and roasty tasting beer. I imagine it would be good too if made to be a lager. Thanks for posting this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Clayton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7858372/"
                }
            }
        ]
    }
]