[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/42176/all-american-roast-beef/",
        "name": "All American Roast Beef",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F21%2Fallamericanroastbeef1.png",
            "width": 844,
            "height": 842
        },
        "datePublished": "2019-04-02T06:44:33.000Z",
        "description": "This is your basic everyday eye round roast beef.  Simply cooked to perfection. Serve it to family or company. The secret is in the time cooked. 20 minutes per pound at 375 degrees.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 pounds beef eye of round roast",
            "½ teaspoon kosher salt",
            "½ teaspoon garlic powder",
            "¼ teaspoon freshly ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). If roast is untied, tie at 3 inch intervals with cotton twine. Place roast in pan, and season with salt, garlic powder, and pepper. Add more or less seasonings to taste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in oven for 60 minutes (20 minutes per pound). Remove from oven, cover loosely with foil, and let rest for 15 to 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RCP80"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.498046875,
            "ratingCount": 512,
            "itemReviewed": "All American Roast Beef",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "484.1 calories",
            "carbohydrateContent": "0.2 g",
            "cholesterolContent": "138.3 mg",
            "fatContent": "32.4 g",
            "fiberContent": null,
            "proteinContent": "44.8 g",
            "saturatedFatContent": "12.9 g",
            "servingSize": null,
            "sodiumContent": "271.2 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-22T14:55:50.95Z",
                "reviewBody": "I have been making my roast beef this way forever! It is perfection, IF you heed these basic tips: No other cut of meat will produce a REAL roast beef, but the eye roast!...Every oven is different, so know your ovens well. A three pound roast will cook faster in a new oven than it would in a twenty year old oven...INVEST IN A MEAT THERMOMETER, this is the best thing you can have when roasting a beef...Be mindful that when a roast comes out of the oven it will cook in its own heat and the temp will rise. Not everyone likes a bloody roast. WE DO, and I take mine out at 120, let it stand and it is about 130-135 when time to cut...ANOTHER IMPORTANT TIP: BEFORE COOKING LET YOUR ROAST SIT OUT ON THE COUNTER UNTIL IT REACHES ROOM TEMP. IT WILL MAKE FOR EVEN COOKING. So, their you have it, my advice to all of you bad reviewers. Roasting a beef is not an exact science nor are the cooking times exact...keep trying! This is the best roast beef!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACYCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-12T17:56:33.333Z",
                "reviewBody": "This was wonderful. Please don't pass this up because of reviews saying cooking this way will result in a tough dinner - they surely didn't try it. As others have suggested, make sure your oven temp is accurate, a meat thermometer is a plus and the REAL secret is allowing the meat to rest, covered, for 15 or so minutes while you prepare the rest of your meal. (take the meat out before it reaches the desired temperature, as it cooks a bit more while it rests) Eye of round is a nice lean cut of meat - and it does NOT benefit from boiling it as some would suggest. You will not get a fall apart shreddy kind of roast - this will be a nice moist firm roast that slices nicely, and there is no waste. Stick to the recipe, use the right cut of meat and follow the directions and you won't be disappointed. And you'll have flavorful juice all over your cutting board to moisten the meat after you cut it. I added a bit of thyme to the seasoning mix, as my family loves beef with thyme, but i would not suggest any liquids be added. YUM!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill815",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1626319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-02T22:09:33.733Z",
                "reviewBody": "The roast tasted really good, and we thoroughly enjoyed it.  However, because the roast is not cooking in any liquid, it was a little tough (though it wasn't too bad).  I would recommend adding some water to the bottom of the pan while it is in the oven to make it a little more tender.  This roast, however, will not produce any gravy.  Also, I would suggest adding some onion to the top while it cooks for a little flavoring.  This is a great recipe for anyone who wants a simple pot roast that isn't too much work and doesn't have to cook too long, but if you are wanting a more tender and more flavorful one, i suggest trying a different recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MYKYETHECOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/762597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T16:38:05.45Z",
                "reviewBody": "This is a very simple and good recipe. GRRRR. For those who say you must cook moist, or that this is dry, then I feel sorry that you have never experienced real roast beef. Ladies and gentlemen, there are (at a minimum) two distinctly different ways of cooking a beef roast and (surprise!) they come out differently and are used for different purposes. First, \"Roast Beef\" (this recipe) and second \"Pot Roast.\" If your mother did not make the distinction clear, or did not know herself, I will clarify. --------- Roast beef is cooked dry. This is what you are served at the buffet where the chef cuts thin slices for you, plates, and ladles on some juice. This is what you need to make Roast Beef Manhattan. This is what you need for a French Dip. This, (with more seasonings and a few post-roasting steps) is the start of \"Italian Beef 'sangwich'.\" ---------- OTOH, Pot roast is cooked moist, in a pot. The pot may be in the oven, on the stove, or a slow cooker. Vegetables, typically carrots and potatoes, frequently some onion, are cooked in water, broth, or tomato sauce. This produces a \"one pot meal\" and is often passed on a platter. Each diner takes vegetables and a chunk of coarsely cut meat. The moist heat causes the meat to be very tender (yet because of large cut may be fibrous), pieces may be pulled off with the fork and a knife is often not needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nurse_sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6027504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:07:29.56Z",
                "reviewBody": "This is an awful way to cook a roast.  The seasonings are fine, but this rapid cooking without any liquid produces a tough, dry result.  Liquid and slower cooking are essential if people are actually going to enjoy this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "dagny21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-02T16:23:34.957Z",
                "reviewBody": "I was making roast beef fot the first time looking for guidance, and this was helpful, but flawed in my opinion. I used the cut suggested, eye of round, which I had to special order from my butcher but it was worth it. It's a nice, fairly inexpensive cut for feeding a crowd, and the simple seasoning used here is perfect. However, the oven temp and cooking time didn't work for me. I started my room-temp 5.5 lb roast at 375 as directed, and because I used a probe thermometer and watched the temp, I found it was cooking faster than I'd anticipated. I quickly lowered the heat to 300, then 200, and still it was done much earlier than I expected, the entire cooking time was under 90 mins. I think 375 at 20 mins/lb would produce a very well done piece of meat, so if that's what you like, go for it. But if you like your meat closer to medium-rare, I agree with the reviewer who said USE A MEAT THERMOMETER. Throw out your timer, watch the temp instead. Take your roast out of the oven when it's 10 degrees cooler than your desired final temp. Let it rest for 20 minutes before cutting it, it will cook that last 10 degrees on the counter while it rests. I'd use a lower oven temp than this recipe calls for, 300 or even 200, cook it slow and low. But the cut and seasonings in this recipe are great. I don't think any liquid is needed, just use a roasting pan with a rack so the meat is raised over the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "dre88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1797763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-12T23:43:44.88Z",
                "reviewBody": "Helpful hint--Most likely everybody is getting a different temp reading after the same cooking time because of how cold the roast was when you put it in the oven. I always let my roasts sit for 45 minutes on the counter before putting them in the oven. It eliminates guess work thermometers and hot/cold spots in the roast. Great recipe by the way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2398077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-16T19:37:22.647Z",
                "reviewBody": "This is a very good basic guideline for the perfect roast. I agree with reviewer tracycook that the oven temp has lots to do with the final result.Invest in a good meat thermometer and follow it. For those who like gravy, simply add a can of beef broth to the bottom of the pan while cooking.Pan drippings will combine with it and make a delicious gravy.My persoanl preference, I would use twice the garlic powder with the addition of some fresh minced garlic, as well. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:07:30.95Z",
                "reviewBody": "I made the All American Roast Beef tonight and thought it gave a fabulous flavor. I used table salt because I didn't have Kosher salt.  It was moist and cooked great at 375. Definitely I will make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOLLER52894",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769576/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "All-American Roast Beef",
            "description": "Tying the roast, and cooking at high heat, ensure even roasting.",
            "uploadDate": "2012-06-21T00:08:02.320Z",
            "duration": "PT2M51.63S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc1403105-d1c4-4831-8571-cb111be8b461%2F0a1fba9e-0cc1-4d14-9d09-7846cda2a352%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1699321758001"
        }
    }
]