[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/112764/chefs-steak-sauce/",
        "name": "Chef's Steak Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F967274.jpg",
            "width": 1940,
            "height": 1936
        },
        "datePublished": "2019-04-04T03:35:40.000Z",
        "description": "Recently on vacation we ate at a wonderful restaurant. The steak I ordered had a magnificent sauce poured over it. I ordered it two nights in a row it was so good. I asked the waiter if he knew what was in it and was shocked when he came back 5 minutes later with the recipe. I have had to scale it down due to the fact that the original recipe make about 4 gallons! I freeze left leftovers in additional containers.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "2 quarts",
        "recipeIngredient": [
            "2 quarts apple juice",
            "1 ½ cups distilled white vinegar",
            "1 ½ cups soy sauce",
            "1 ½ cups molasses",
            "2 cups water",
            "1 ½ lemons, juiced",
            "2 ½ teaspoons minced fresh ginger root",
            "⅛ teaspoon cayenne pepper",
            "¾ teaspoon ground mustard",
            "½ teaspoon ground cloves",
            "1 jalapeno, halved",
            "1 onion, quartered",
            "1 tablespoon whole black peppercorns",
            "¼ cup garlic cloves",
            "1 tablespoon prepared horseradish",
            "2 bay leaves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the apple juice, vinegar, soy sauce, molasses, water, and lemon juice into a large pot. Add the ginger, cayenne pepper, mustard, cloves, jalapeno, onion, peppercorns, garlic, horseradish, and bay leaves. Bring to a boil over high heat, then reduce heat to medium-low. Simmer, stirring occasionally until the sauce has reduced to half its original volume, about 2 hours. Strain through a fine sieve and cool before serving.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen Dean Covington"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.647058823529412,
            "ratingCount": 17,
            "itemReviewed": "Chef's Steak Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "42.8 calories",
            "carbohydrateContent": "10.5 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "343.1 mg",
            "sugarContent": "7.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-18T21:16:10.7Z",
                "reviewBody": "A superb sauce (& marinade), which would rival Worcestershire & A-1 steak sauces. It is slightly sweet, infused with the complexity of cloves, ginger, bay leaves & more. Do know that the sauce will be the consistency of a reduced balsamic or thin maple syrup. I marinated pork chops in 2 Tblsp., then served the sauce over the grilled chops; truly delicious. I will also try this on steaks (as intended) & chicken, as I have 1 cup left after making the recipe for 12 servings. (AR's \"Recalculate\" feature is VERY useful! Plug in any # of servings you want, to make a smaller quantity.) And when I have finished this batch (which I think will keep well in the refrigerator), I will make more! ***UPDATE:*** I originally made the sauce in April 2009.  In Feb. 2010 the sauce is still excellent (having been in a clean bottle & in the fridge all this time). I've since used it on grilled steaks ~ superb, of course! I highly recommend this. Do not let the long ingredients list keep you away ~ it is very simple to put all the ingredients into a pot & simmer it. And it will keep refrigerated for a very, very long time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-03T18:10:14.567Z",
                "reviewBody": "Wonderful sauce! I made this with grilled tenderloins and sauteed mushrooms - added a little of the sauce to the mushrooms while they were cooking but only seasoned the beef with a little salt and pepper. The sauce will thicken slightly when it reduces but is meant to be thin - like the consistency of thin maple syrup or good balsamic (I was able to find the recipe submitter on the Recipe Exchange to ask her what the proper consistency would be). I imagine you could add corn starch near the end if you like your sauce thicker but this was perfect for me as is. The flavor is familiar like something I may have had in a restaurant - but not like anything you can buy. Excellent! Thanks KORIEKISS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-27T18:26:14.663Z",
                "reviewBody": "This sauce is FABULOUS! I made the recipe to serve 16 and wish I had done 32 servings. That would have given me 2 cups of sauce. I forgot to take into account that it would reduce to half it's volume. I skipped the cayenne pepper and jalapeno and used a couple drops of Tabasco instead. I let it sit overnight and served with steak the next day. This recipe allows us to have a steak sauce with the heat toned down. I plan to always have this sauce on hand. Thank you so much for sharing this recipe Korikiss!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHORECOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shorecook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-31T15:21:09.39Z",
                "reviewBody": "Fabulous! So much better than anything you can purchase in a bottle in the grocery store and outrageously easy to make. I actually had everything on hand. Sweet tart tangy spicy savory - all at the same time. I was thinking I might like to thicken it a bit but ended up not straying from the recipe and it was just fantastic as is. I adjusted to six servings to try out but next time I'll make a full recipe so I'll have some to keep on hand. I feel like a gourmet chef making my own steak sauce!;) Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-26T01:48:29.44Z",
                "reviewBody": "I kinda hate to be the one to break the streak but honestly this was okay. It wasn't bad it has actually a really nifty and unique flavor but it didn't nearly rock my world as much as it did for the other reviewers. I'd have been better off with the store-brand B-2 knockoff: equally tasty and much less work. Tasty yes worth the effort notsomuch. I followed the halved recipe to the letter minus the cloves (which I didn't realize I didn't have). If anyone wants to try to convince me that that would have made all the difference I may be willing to try it again but otherwise I'll stick with the bottle. (In all fairness I really really like the bottled stuff.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sjpatrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2439343/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-24T23:01:07.34Z",
                "reviewBody": "The taste is very upscale and can transform a cheaper cut of meat into something nice. I am excited though to try it on a nice steak. I cut this in half because there are only two of us. It was nice to sit back and let it cook. You do need to make sure the temperature is closer to Medium than low to get it to reduce. I ended up with maybe 1 1/4 cup of sauce. That was reduced down from 3 cups of apple juice 1/2 cup soy and molasses. I did use canned jalapeno peppers instead of fresh but the heat was still there but in a pleasant way if you don't like spicy things don't be afraid of it being spicy it was very pleasant. I've frozen about a 1/2 cup can't wait to use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Wilson Martin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2135049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-09T21:36:52.323Z",
                "reviewBody": "This steak sauce was an involved recipe that will serve itself again and again and is held in the fridge for future use. I appreciated the intricate flavors of this sauce and can't wait to use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "San Diego Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3369502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-04T20:57:00.767Z",
                "reviewBody": "I hate to be the one to break the streak but i just made this and served it with my husbands birthday dinner. We both were agreed that it was good but that we liked the bottled stuff better. It was fun to make though but i do not think that i will be making again. Thanks for the most though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mommietotwo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mommietotwo/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-13T18:14:26.717Z",
                "reviewBody": "Absolutely wonderful and delicious. Only changes I made was to scale down the recipe so I ended up with 3 1/2 cups sauce after reduction. I added the lemon juice at the end of reduction and I thickened it slightly using xanthum gum. It took about 1 1/2 hours on medium to medium-low heat to reduce by half. It came out as smooth as silk. Possibilities for the use of this incredible sauce (or glaze) are endless.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10067023/"
                }
            }
        ]
    }
]