[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/967/desserts/specialty-desserts/caramel-apples/",
                    "name": "Caramel Apple Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/125866/rocky-road-caramel-apples/",
        "name": "Rocky Road Caramel Apples",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F907337.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:41:54.000Z",
        "description": "Caramel apples are taken down a rocky road by rolling in marshmallows and pecans. A dark chocolate drizzle finishes them off.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 apples",
        "recipeIngredient": [
            "6 Granny Smith apples",
            "6 wooden sticks",
            "1 (14 ounce) package individually wrapped caramels, unwrapped",
            "2 tablespoons water",
            "½ teaspoon vanilla extract",
            "1 ½ cups miniature marshmallows",
            "1 ½ cups chopped pecans, toasted",
            "1 cup semisweet chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Insert wooden sticks 3/4 of the way into the stem end of each apple. Place apples on a cookie sheet covered with lightly greased aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine caramels and water in a saucepan over low heat.  Cook, stirring often, until caramel melts and is smooth. Stir in the vanilla. Dip each apple into the caramel and gently run apples around insides of saucepan to scrape off some of the caramel.  Scrape excess caramel from the apple bottoms using the side of the saucepan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the miniature marshmallows and pecans on a dinner plate. Roll the apples in the mixture to coat. Place on the aluminum foil and chill.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Put the chocolate chips in a microwave-safe bowl. Cook in the microwave for 30 second intervals, stirring between each, until melted and smooth. Drizzle over the apples and return them to the refrigerator until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Caramel Apple Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.115384615384615,
            "ratingCount": 26,
            "itemReviewed": "Rocky Road Caramel Apples",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "695.7 calories",
            "carbohydrateContent": "99.5 g",
            "cholesterolContent": "4.6 mg",
            "fatContent": "35.1 g",
            "fiberContent": "7.1 g",
            "proteinContent": "7.3 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "180.3 mg",
            "sugarContent": "80.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-20T17:32:31.44Z",
                "reviewBody": "This is a great recipe. One thing to remember: Apples may have a waxy coating on them that keeps the caramel from sticking very well. Rolling your apples in boiling water very quickly will melt that waxy residue and the caramel sticks to the apple! How bout that?:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rhondarella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2144797/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-11T15:03:11.263Z",
                "reviewBody": "I had to make some changes to get the toppings to stay put. I referred to the caramel apple recipe submitted by Suzie. First use chilled apples. Then melt your caramels with 2 tbsp. milk in the microwave for 2 minutes stirring halfway through. I let my melted caramels sit for about a minute before dipping the apples. The toppings stayed perfectly in place. I hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CrysNBoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1863257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-17T13:33:37.803Z",
                "reviewBody": "I made these a couple of times and had the same problem with the caramel sliding down to the bottom of the apple. The taste was good but they looked awful. I wondered if it had something to do with the caramel so I did a search and found this recipe for homemade caramel: http://allrecipes.com/Recipe/Chewy-Caramel/Detail.aspx Sure enough the caramel stayed on fine -no sliding off the apple. The caramel is also unbelievably delicious! My family has not stopped talking about them and my younger sister keeps asking me to make them again (I've made them 2x now). It's so easy I'm happy to oblige! In terms of time it doesn't take any longer to make homemade caramel than it does using individually wrapped caramels. I originally made a double recipe and it must have taken me a good 20 minutes just to unwrap all those caramels.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JLeigh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1700971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-17T20:49:53.6Z",
                "reviewBody": "PLEASE NOTE! The caramel slides down the apple because it is coated in wax. You need to dip the apple into a pan of boiled water for 10 seconds or so and then wipe the wax off with a paper towel. You may notice some of the white wax while you are wiping. If you fail to do this the caramel will indeed slide off. If you want to drizzle chocolate on these I suggest getting a plastic Wilton candymaking bottle they are usually only 1- 2. Melt the chocolate in the bottle or put the already melted chocolate into it and you will have more control of the chocolate. Good recipe but I prefer mine with different coatings/toppings. I hope this helps. The caramel sliding off is not the recipes fault so I don't think it is fair to rate this recipe according to that problem.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "House of Aqua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/houseofaqua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-30T14:30:08.857Z",
                "reviewBody": "These tasted great and get 4.5 stars for that. however they didn't look pretty. after i dipped my apples in the caramel and got the excess caramel off i rolled it in the nuts but once i sat them down. the caramel and nuts slid to the bottom of the apple. so i ended up with a pile of caramel nut goo around the bottom. I was planning on giving these to co-workers for halloween but not now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "apedawn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1650590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-14T00:58:09.663Z",
                "reviewBody": "I haven't eaten them yet but they look great. Let me make a suggestion please. Having never made caramel apples before I didn't realize this but I'm glad I learned and can share with others. When you drop the apples in the boiling water ever so briefly you really have to dry them immediately. Here is what happened to me. I dropped an apple at a time into the boiling water. Then I pulled each one out and let it sit on the towel. However by the time I went to dry all 6 (after all were dipped) the wax was still there. So I put them all back in and made the mistake of leaving them in too long. The boiling water changed the color and consistency. It started the cooking process very quickly. Be careful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "msr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3859066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-07T07:07:14.43Z",
                "reviewBody": "I converted the recipe to make 16 apples & found that by adding only about 1/2 the water called for to the chewy caramel candies really seemed to help. The toppings still began to slide towards the bottom of the apple but not nearly so much as it appears to have done for others using this recipe. I also found that by only doing a few at a time & then putting them immediately into the fridge seemed to help the caramel & toppings hold their place. As for the chocolate drizzle I melted semisweet chocolate chips with a bit of whole milk to thin out the chocolate slightly & waited for it to cool a little. Then I put it into a thick ziploc freezer bag snipped a tiny hole in the corner & piped it back & forth after the rolled apples had already chilled in the fridge. I was able to take these to work & got a number of rave reviews everybody seemed to really enjoy them & it was a great project for my young son to help with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "westcoastcravings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1563659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-02T23:55:47.62Z",
                "reviewBody": "I had my son make these with explicit instructions to pop the apples in boiling water to remove wax as pr previous reviews. Well he forgot this step and they were an absolute disaster with the caramel in a giant puddle underneath the apples. So I scrubbed off the caramel and started again. I dipped the apples in boiling water for ten seconds and dried them well. Then I placed them in the freezer so they were chilled. I remade the caramel using the chewy caramel recipe from this site easier than all that unwrapping. I made sure the temperature was around 200 when I dipped the apples. They could not have been more perfect and everyone loved them. Moral of the story read the reviews before you make a new recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bitch'n kitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/814231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-05T17:52:04.55Z",
                "reviewBody": "Good but I had problems with the caramel and toppings sliding off the apples too. I found this tip on the internet that says to melt the caramel in a 4 cup glass measuring cup in the microwave then let it cool to about 170 degrees. Place a folded dish towel in a skillet and place the glass measuring cup on top of the towel place the skillet on a burner set on low. This keeps it at the correct temperature while dipping. Dip an apple turn in upside down for a few seconds to help set the caramel. Immediately roll it in the toppings. Works great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SLN1999",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1227435/"
                }
            }
        ]
    }
]