[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/153/breakfast-and-brunch/eggs/quiche/",
                    "name": "Quiche",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/42710/tomato-and-basil-quiche/",
        "name": "Tomato and Basil Quiche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F28584.jpg",
            "width": 2816,
            "height": 2112
        },
        "datePublished": "2019-04-02T06:44:34.000Z",
        "description": "This is a mix of a couple of recipes that I've made before. It's easy to prepare, and looks and tastes like you spent all day in the kitchen!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 (9 inch) pie",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "1 onion, sliced",
            "2 tomatoes, peeled and sliced",
            "2 tablespoons all-purpose flour",
            "2 teaspoons dried basil",
            "3 eggs, beaten",
            "½ cup milk",
            "salt and pepper to taste",
            "1 (9 inch) unbaked deep dish pie crust",
            "1 ½ cups shredded Colby-Monterey Jack cheese, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Bake pie shell in preheated oven for 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, heat olive oil in a large skillet over medium heat. Saute onion until soft; remove from skillet. Sprinkle tomato slices with flour and basil, then saute 1 minute on each side. In a small bowl, whisk together eggs and milk. season with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread 1 cup shredded cheese in the bottom of pie crust. Layer onions over cheese, and top with tomatoes. Cover with egg mixture. sprinkle top with remaining 1/2 cup shredded cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 10 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake for 15 to 20 minutes, or until filling is puffed and golden brown. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs",
            "Quiche"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen Griffin"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.495798319327731,
            "ratingCount": 238,
            "itemReviewed": "Tomato and Basil Quiche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "378.5 calories",
            "carbohydrateContent": "23 g",
            "cholesterolContent": "127.3 mg",
            "fatContent": "26.1 g",
            "fiberContent": "1.3 g",
            "proteinContent": "13.7 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "697.5 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-02T20:21:44.203Z",
                "reviewBody": "I made this by the recipe last week. My husband thought it was great, and I enjoyed it also, but thought I'd like it better with a few changes. I made it today for a baby shower at work. It got lots of oohs and ahhs and recipe requests. I followed the suggestions of previous reviewers and used heavy cream instead of milk, chopped the onions instead of slicing -(when sliced, the long strings/rings can make it tricky to slice/serve/eat). I also cooked the onions until they were very browned and carmelized. \nMy additional changes: 2 cups of colby/jac cheese, and one cup of freshly grated parmesean, 8 tsp of chopped fresh basil instead of 2 tsp dried. I did not peel the tomatoes this time, and before I sliced them, I cut the top off, and \"squeezed \" most of the seeds/juice out. I sprinkled with italian seasoned bread crumbs instead of four. I added a little garlic powder along with salt and pepper to the egg mixture. I baked 10 min at 400, then 35 min at 350. It will slice beautifully if you allow it to set for an hour or longer after it finishes baking. Garnish with a few fresh basil leaves. Delicious and pretty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ULTRAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1105805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-14T17:05:44.533Z",
                "reviewBody": "UBER YUMMY!! The floured, fried tomatoes were so good, I could have eaten a plate of them straight. However, once they're baked into the quiche, it's dubious how necessary the frying step is. By the time they're cooked in the quiche, their light, crispy exteriors have dissipated. So the time and mess used to fry them doesn't serve much useful purpose. To eliminate that step, simply place the peeled, sliced tomatoes on paper towels, sprinkle lightly with salt on both sides, then allow to sit undisturbed for at least 20 minutes to draw out the excess moisture, sprinkle liberally with basil, then add to the quiche as directed. Carmelizing the onions (sauteeing until a deep, golden color) eliminates the sharp, in-your-face taste that can overwhelm the delicate flavor of the tomatoes, and tames it down to make it a delectable \"team player.\" You can vary the flavor of this quiche simply by using any cheeses, in any combination, that you happen to like. I used brie with rinds removed, Jarlsberg and Asiago. The flavor was sensational. Even using only skim milk, the taste was sumptuous, the texture ethereal. Most excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-10T21:53:44.937Z",
                "reviewBody": "Amazing!  I only made a couple changes to the recipe.  I used 2 cups of cheese (amount came in package) and after the quiche was in the oven for 10 minutes I sprinkled nutmeg on the top.  The flavor was great and I enjoyed everything about this recipe.  My only suggestion is to add some more olive oil prior to sauteeing the tomatoes because they tended to stick to the pan.  Great recipe and highly recommended.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RogueOnion8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-19T16:37:14.483Z",
                "reviewBody": "This was great, but I did make a few changes. I diced the tomatoes rather than slicing them, and I did not peel them (I used sweet grape tomatoes). I also minced the onion instead of slicing it and added a few cloves of minced garlic. It turned out great. I served it at a bridal shower, and everyone loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRENDA STRICKLAND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/806350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-15T14:07:37.983Z",
                "reviewBody": "GREAT! What a great quiche! I added another 1T of oil to saute the floured tomatoes after removing the onions - there was nothing left in the pan and they started to stick. I used oat flour (I'm wheat intolerant) and you simply can't detect it. I doubled the flour-basil mix and dredged each tomato slice, fully coating it. After trying to turn them over, they fell a part, which was okay - made it easier to get into the quiche. (Next time I'll use diced tomatoes and shake the flour-basil mix with the tomatoes in a bag.) I used heavy cream for the milk portion, added 1cup diced cooked chicken to the onions, and doubled the amount of cheese (what can I say - we LOVE cheese!). I wrapped the crust edge with foil to prevent harsh browning, and sprinkled the top of the quiche with nutmeg before baking. I cooked the whole thing at 350 and let it bake for 40 minutes because I had to tend to some other things. This was simply fantastic! I also made some in a custard cup (sprayed with PAM) so it was crust-less for me! It slippped right out of the cup and looked very nice! Served with a side salad! EXCELLENT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONARCH38",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1047736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-04T20:53:10.75Z",
                "reviewBody": "It was divine and easy to make.  The changes I made were as follow:  I used half skim milk and half heavy cream, added mushrooms to the onion and sauteed them together, then sprinkled the flour over the tomatoes and basil, and sauteed THEM with the onions and mushrooms. The smell was luscious and I added a dash more olive oil to make up for the flour drying out the pan.  I used a mixture of sharp cheddar and parmegiano-reggiano and used it sparingly on the bottom and top of the quiche. It smelled wonderful while baking and came out terrific.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "vanessajbaca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2110824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T05:25:50.43Z",
                "reviewBody": "So easy and yummy...except that I can't follow a recipe perfectly so I removed the onions added 1 cup chopped steamed spinach and sauteed mushrooms plus a tiny dash of nutmeg in the egg mixture....Excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FRECKLES42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/382280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-01T02:37:26.53Z",
                "reviewBody": "The intense flavor that the tomatoes get from the quick pan fry makes this dish sublime! My 17 month old little girl loved this! Very kid friendly just add a salad and you've got a great meal! Update!! Forgot to pick up a store bought pie crust and used a puff pastry that I had in the freezer....man you gotta try it!! It is WONDERFUL! I so love this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tamara Grimes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/148571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T05:26:11.677Z",
                "reviewBody": "great recipe! i tried both as is and then added shrimp. the shrimp tomato and basil combination are great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "retcop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/500497/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-22T16:57:45.543Z",
                "reviewBody": "I made these with sundried tomatoes (8 of them). It wasn't bad but I felt it was lacking flavor a little. I like the spinach quiche recipe on here better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2608275/"
                }
            }
        ]
    }
]