[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/128968/italian-vegetarian-patties/",
        "name": "Italian Vegetarian Patties",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2655052.jpg",
            "width": 1274,
            "height": 1490
        },
        "datePublished": "2019-04-04T03:42:26.000Z",
        "description": "This is my original recipe. My teenage vegetarian daughter devours these patties as snacks or when made into a sandwich topped with sauce and provolone cheese. We also use them for chicken Parmesana, or form them into meatballs. They freeze well, too.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT0H40M",
        "recipeYield": "32 patties",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "¾ cup uncooked brown rice",
            "1 ½ cups red lentils",
            "6 cups water",
            "1 teaspoon salt",
            "2 eggs",
            "2 ½ cups dry bread crumbs",
            "1 ½ cups grated Parmesan cheese",
            "2 teaspoons dried basil",
            "1 ½ teaspoons garlic powder",
            "3 tablespoons vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons oil in a large saucepan. Stir in the brown rice, and cook until golden brown. Add the lentils, water, and salt; bring to a boil. Reduce heat to low, cover, and cook until the rice is tender and the water is absorbed, about 40 minutes. Add additional water if needed; mixture should be very thick. Remove from heat and let cool slightly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cooked rice mixture in a food processor along with the eggs, bread crumbs, Parmesan cheese, basil, and garlic powder. Process until well combined, and the texture of ground meat. Form into 1/4 to 1/2 inch thick patties, using about 3 tablespoons mixture for each.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 3 tablespoons oil in a large skillet. In batches, fry patties until browned, about 2 to 3 minutes per side. Drain on paper towels; cool. Fry remaining patties in the same manner. Store in airtight containers in the refrigerator or freezer.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHECOOKS2"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.338709677419355,
            "ratingCount": 62,
            "itemReviewed": "Italian Vegetarian Patties",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "241.7 calories",
            "carbohydrateContent": "30.3 g",
            "cholesterolContent": "27.1 mg",
            "fatContent": "8.3 g",
            "fiberContent": "6.6 g",
            "proteinContent": "11.2 g",
            "saturatedFatContent": "2.3 g",
            "servingSize": null,
            "sodiumContent": "395.5 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-17T17:56:27.04Z",
                "reviewBody": "I love, love, love these patties! The only changes I made were, 1) adding about 1/2 cup of chopped onions to the hot oil and rice, and 2) to use a light-flavored olive oil rather than vegetable oil, in keeping with my efforts to make healthier food choices. I didn't have to alter the amount of water, or change the recipe in any other way. Not sure why onions would not be included in the recipe, though. To me, onions are the backbone of flavorful, savory cooking. I love how these patties were not dry or cardboard-like, as so many vegetarian \"meat\" recipes can be. Thank you for this recipe, SHECOOKS2. It is a keeper! Even my meat-and-potatoes husband liked them. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Patsy Shipman Weidenbach",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1675895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-07T19:22:12.5Z",
                "reviewBody": "I cooked this as written minus the cheese. After 40 minutes the rice/lentils still had a lot of water so I just took the lid off and let it simmer until it thickened up. My food processor was too small to fit it all in so I just did the lentils and rice in there and then threw it all in my stand mixer. That worked fine. I don't love that they are fried but they are soooo tasty. What a treat! I can't wait to try them as \"meatballs\" or as a lettuce wrap. I have one in the oven to see how they bake up and it looks good so far. Update....I have made this several times now...all very tasty. My favorite way is to freeze them uncooked individually packaged and I just thaw them as needed. I cook them in an iron skillet with a little oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mareseatoats",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4767824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-13T20:34:06.223Z",
                "reviewBody": "Excellent.  I'm not a vegetarian, just a lady lookin' for a recipe to use up some lentils.  I made this as written, with the exception of throwing in about a 1/4 finely diced onion. I made small patties, like sliders. I served them on little buns with mustard & ketchup. I never said a word to my husband about what they \"really\" were. He loved them.  Still thinks he  was eatin' a burger!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINDY3539",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/457217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-14T05:29:01.6Z",
                "reviewBody": "I have made these three times now, and this time I did not put the grains in the food processor as I found the consistency is too much like mashed potatoes.  Tonight, they were great!  When I browned the uncooked rice, I added a medium chopped onion and two chopped stalks of celery along with three cloves of garlic.  I used Lundberg's rice blend of red, brown and wild rice. When the grains were cooked, I simply stirred them into the bread crumb & egg mixture, added 1/2 tsp pepper and 1 TBSP Italian seasoning, and fried the patties in olive oil.  The texture is way better when you don't use a food processor.  Don't mash the grains at all, as they are mushy enough!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Georgia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4899209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-09T16:23:15.387Z",
                "reviewBody": "I followed the recipe exactly and I liked what I got but it wasn't what I thought I was going to get! the 6 cups of water was way too much for me I don't think I ever got it quite thick enough. so when I went to make the patties I couldn't for the life of me get them to keep their shape even after cooling completely. so instead I used my cookie scoop to make about 80 meatless balls... I baked them for 30 minutes at 400 and they were delicious! the other thing I must have gotten wrong was the processing because these had no semblance of meat texture and of course they didn't taste like meat so I don't think I will be able to pass them off as meatballs. they taste like mashed potato actually. but they are really tasty and my 2 little kids gobbled them up so I can't complain! I will start with less water next time and try processing them less to get a better texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIAJOHNSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-12T16:34:13.617Z",
                "reviewBody": "These are very good! I didn't have any rice on hand, so I used quinoa. It worked perfectly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brittmichelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6854893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-09T23:44:01.62Z",
                "reviewBody": "One of my favorite veggie burger recipes. I froze some and took it with me on my vacation. They might take a while to make but are well worth the effort thanks for the recipe. Edit: I tried making them into \"meatballs\" today and they were excellent. This is definitely a staple for me now:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nour",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3822588/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T14:40:27.693Z",
                "reviewBody": "Absolutely wonderful. I added some fresh thyme and Tabasco sauce for extra flavour. I didn't have any Parmesan cheese but added 1 1/2 cups grated tofu for extra protein. I also chilled the mixture in the fridge for 1/2 hour to make it easier to form the patties.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3073906/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-05T16:25:17.51Z",
                "reviewBody": "Excellent! The best Vegie Patties EVER!! Bake 350F 20 minutes then flip and bake 20 minutes more. I make bean patties all the time. They are good fast food. I slip 2 of 'em in a baggie and pop 'em in my purse. They are great right after the gym.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BevKat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5068637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-04T01:08:14.13Z",
                "reviewBody": "I'm rating this dish compared to all foods not just veggie patties. I'm not a connoisseur of veggie patties but I would guess as far as those go it is probably pretty darn good. I would recommend these to vegetarians; however I'd be hesitant to recommend them to others - it didn't wow me. I followed the recipe as is. In order to get a really thick consistency as required it took me significantly longer to cook than directed. I ended up cooking them on low without the cover at the end. This recipe makes a lot! It wouldn't all fit in my food processor. Some of it I just stirred by hand and the consistency was fine. The patties cooked up nicely (give them some time to cool so they aren't too sticky) by just using cooking spray. I cooked them on medium-high heat until browned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CatLauren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4661748/"
                }
            }
        ]
    }
]