[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/42932/ma-po-tofu/",
        "name": "Ma Po Tofu",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F386652.jpg",
            "width": 2126,
            "height": 2126
        },
        "datePublished": "2019-04-02T06:44:35.000Z",
        "description": "This is a great Chinese recipe. I love this dish - you can control the spice by varying the cayenne. I hope you like it as much as I do.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 ounces ground pork",
            "2 tablespoons dry sherry",
            "1 teaspoon cornstarch",
            "½ tablespoon fermented black beans, rinsed and mashed",
            "½ tablespoon chili paste with garlic",
            "1 teaspoon cayenne pepper",
            "2 tablespoons soy sauce",
            "3 cloves garlic, crushed",
            "½ teaspoon minced fresh ginger",
            "1 (14 ounce) package tofu, drained and cut into cubes",
            "1 cup frozen green peas",
            "½ cup chicken broth",
            "1 tablespoon cornstarch, mixed with equal parts water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine ground pork, sherry and 1 teaspoon cornstarch; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate small bowl, combine black beans, chile paste, cayenne pepper, soy sauce, garlic, and ginger; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium heat. If pork is lean, add 1 tablespoon oil. Cook pork until evenly browned. Stir in black bean mixture, tofu, and peas. Pour in chicken broth, and bring to a boil. Stir in dissolved cornstarch, and cook until thickened.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Linda Johnson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.522123893805309,
            "ratingCount": 113,
            "itemReviewed": "Ma Po Tofu",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "211.6 calories",
            "carbohydrateContent": "13.5 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "11.3 g",
            "fiberContent": "2.1 g",
            "proteinContent": "15.6 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "577.9 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-04T00:09:02.27Z",
                "reviewBody": "This recipe is excellent and I make it often:-) For those who claim not to like tofu I think this dish gives tofu to stand on its own not just be a substitute for meat. If you're a vegtarian I'd advise using slightly more tofu adding more Asian vegetables and scaling up the amount of sauce by 50%. You also might want to add 1 to 1-1/2 Tbsp of sesame oil to replace the flavor the pork gives it. Here are some other comments: 1. As written this recipe is quite spicy. For the fainter of heart I would recommend starting with 1/2 tsp of cayenne. Less if you're really spice-phobic. 2. To make the texture more interesting I put the tofu cubes on parchment on a baking sheet and put them under the broiler (second rack down) for about 10-15 minutes so the outside gets crispy. You could also fry it for a similar effect but the broiling approach is lower fat. 3. I always put in a teaspoon of sesame oil into the black bean mixture. It only adds 5g of fat total to the dish and rounds out the flavor a bit more. 4. I don't think the 1 Tbsp of corn starch is enough to thicken the gravy sufficiently. I usually end up using 1 1/2 - 2 Tbsp. 5. For more different textures adding some bamboo shoots or water chestnuts is a tasty alteration. If you add a lot more stuff though make sure you scale up the black bean sauce to coat everything sufficiently.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JACKMONSTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/737289/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-22T02:19:50.4Z",
                "reviewBody": "There is nothing wrong with this recipe, but be forewarned: It is NOT a recipe for Ma Po Tofu.  First of all, Ma Po Tofu's main flavor is the Sichuan peppercorn.  Seriously, this is the main flavor of the dish... yet it doesn't appear in the list of ingredients.  It's like someone who doesn't know how to cook chinese food ordered it once, and tried to copy it without having any knowledge of Sichuan cuisine.  Many of the other ingredients do correspond to the ingredients of the original dish, but dry sherry, green peas and cayenne pepper would never appear in the restaurant version.  Thus, I have provided a 3* review not because the dish is particularly bad, but because it might mislead someone into thinking that the dish they were making would turn out to taste like Ma Po Tofu -- it will not, and you will be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "hawkwing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7375750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T03:40:22.17Z",
                "reviewBody": "My husband and I have traveled throughout Asia and Ma Po Tofu is one of our favorites - we have ordered it wherever available. THIS recipe is by far the best Ma Po Tofu we have ever eaten! I am amazed and absolutely thrilled to have found it. Thank you Linda! I have used a couple of tiny variations due to supplies on hand: added two thinly sliced green onions used \"hot\" chili garlic sauce and 1/2 tsp pepper while leaving out the cayenne used black bean garlic sauce without rinsing (because it is a sauce) and substituted extra-lean ground turkey for the pork. My husband said it tasted exactly like pork which he loves. Oh and I added a little more chicken broth as it cooked down a bit. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "zernike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/zernike/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-22T15:02:41.14Z",
                "reviewBody": "Hi I live in China and Love Sichuan food \"Ma Po Tofu\" and \"Shui Jiu Niu Rou\" are two of my favorites. Sichuan food is known for not just the \"la\" what we call \"spicy hot\" but also \"ma la\" which is the no-so-hot but mouth numbing tingling feeling you can only get from Sichuan peppercorns. They have an amazing flavor- I am Addicted. If you go to a Chinese grocery store ask for \"hua jiao\" \"flower pepper.\" It is little and round black/brown sometimes green or other colors. Both syllables are pronounced in the first tone high and flat. good luck- it is worth it.... just watch out! try grinding it a little or just fry them in oil and throw them in- THE AROMA...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "missliss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1311450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T16:44:51.2Z",
                "reviewBody": "This was great! I used beef instead of pork like my local noodle-house does. I also added a finely chopped half-onion and added a bit of white pepper and a dab of sesame oil. I probably used a whole thumbs-length of fresh ginger finely chopped. I served it over rice with broccoli on the side. I'd never sliced soft tofu before - it's so easy! two cuts horizontally then slice as on a grid. Very nice texture - creamy and soft. I tried not to stir the mixture too much as it heated so some of the tofu would retain its shape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kuldunia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/156560/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-23T21:45:11.997Z",
                "reviewBody": "Delicious. I've made this dish many times and the BF (who is not normally a tofu fan) and I always gobble it up. For those of you have trouble finding fermented black beans - the black bean paste/sauce that comes in a jar works great (you should be able to find it at the Ethinc Food isle at your grocery store). I serve this plain white rice and I like to double the sauce b/c love having it over my rice. I also use sliced waterchestnuts instead of peas for some extra crunch (and b/c the BF doesn't like peas but loves waterchestnuts). Another tip - I once subbed beef broth for the chicken broth b/c I'd ran out of the latter and it tasted great as well - richer in fact. So when you feel like having a richer tofu dish use beef broth. Otherwise chicken broth is just fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tiffany Pugh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2805140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-18T19:02:44.39Z",
                "reviewBody": "I was looking for this receipe \"FOR TOFU\" that my husband could cook without gagging!!! & I find that this receipe is the one!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/444419/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-08T20:27:26.23Z",
                "reviewBody": "This is a great dish for those just coming into the tofu world! Thank you for sharing it! It's a super hit and often cooked! I too add 1 tsp of sesame oil to the pork/meat section and to sauce mixture. We like things really spicy so I've increased the chili sauce and the cayenne pepper by 50% and used Chili Bean Sauce instead of the fermented black beans. I've served it with nasi goreng (Indonesian fried rice) and with yellow rice and both were a hit. Many thanks again for this great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FDSTRAMPHER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1346210/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-12T21:40:06.31Z",
                "reviewBody": "I will definitely make this again. I added a few drops of sesame oil and 2 green onions as well and used black bean sauce instead of the beans. Served over rice it made a very good hearty meal. I dare you not to like tofu after this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AngieItaliano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2967880/"
                }
            }
        ]
    }
]