[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/43334/asparagus-lasagna/",
        "name": "Asparagus Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F04%2F02%2F43334_AsparagusLasagna_002_MFS.jpg",
            "width": 956,
            "height": 956
        },
        "datePublished": "2019-04-02T06:44:36.000Z",
        "description": "This dish has a nice flavor and is fairly easy to make.  Ham, asparagus spears, mozzarella and a wonderful garlic and thyme white sauce make this lasagna different than any you have ever tasted.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "5 wide lasagna noodles",
            "2 tablespoons margarine",
            "2 cloves garlic, chopped",
            "2 tablespoons all-purpose flour",
            "1 ½ cups milk",
            "½ teaspoon dried thyme",
            "1 (15 ounce) can asparagus, drained",
            "1 cup julienned fully cooked ham",
            "1 cup shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes, or until al dente. Drain, and cut noodles in half crosswise.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt margarine in a skillet over medium heat. Saute garlic just until fragrant. Stir in the flour until no lumps remain. Gradually mix in milk, and season with thyme. Simmer sauce gently until thick. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease a 9x9 inch glass baking dish. Layer noodles, sauce, asparagus, ham, and mozzarella cheese in three layers, each starting with noodles, and ending with shredded cheese on the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover the dish, and cook in the microwave on HIGH for 9 to 10 minutes, or until cheese is melted and bubbly. Time may vary depending on the oven used. Let stand for 5 to 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Wendy Hansen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.313131313131313,
            "ratingCount": 99,
            "itemReviewed": "Asparagus Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "388 calories",
            "carbohydrateContent": "33.2 g",
            "cholesterolContent": "44.3 mg",
            "fatContent": "18.8 g",
            "fiberContent": "2.3 g",
            "proteinContent": "22.6 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "1008 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-06T04:05:46.423Z",
                "reviewBody": "Wonderful, imaginative recipe. A few minor tweaks, however, improved it. Used butter in place of margarine for flavor, then sauteed the garlic a little longer, until golden. Since some other reviewers thought the sauce too bland, I made a simple change which helped a lot in the flavor department. I used only half the milk, and replaced the other half with concentrated chicken stock and a couple of tablespoons of dry white wine. Simmered the sauce until the vapors from the wine ceased to tingle the nose, in order to be sure all the alcohol was burned off.  When sauce was finished, I stirred in some freshly grated Asiago and Parmesan. Used fresh, peeled asparagus, lightly pre-cooked by boiling 2 minutes then shocking, cut into bite-sized pieces. Layered with a mixture of cheeses, including Jarlsberg, Parmesan and Gruyere in addition to some mozzarella. The type of cheese isn't so much of consequence as getting in some more flavorful types - mozzarella used alone doesn't have a high degree of discernible taste. You could combine it with Swiss, Gouda, Laughing Cow, Monterey Jack, or Brie, as well, or anything else that happened to be in your fridge. So spread your wings and try some combinations. Sumptuous!!! It received rave reviews. Be sure to allow sufficient time for all the various steps. This isn't a quick, easy recipe, but can be assembled up to 3 days before, then finished in the microwave when you want it. Some preparation at your convenience yields stellar results later",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T00:35:14.233Z",
                "reviewBody": "My friends and I really liked my adaptation of this...even my friend who doesn't like asparagus! I didn't measure anything exactly except the (skim) milk. I used real asparagus (I think canned asparagus sounds absolutely disgusting) about 3 times the cheese corn starch (instead of flour - mixed it with a bit of the milk) and medium egg noodles (instead of lasagne noodles which were too much work for that meal and I needed to stretch it a bit) and mixed everything together except for about 2 cups of the cheese. I also used a larger pan and baked it in the oven at 450 adding the cheese I didn't mix in near the end of the baking time. It made plenty for 4 adults who don't eat tiny portions. I'll definitely make this again!!!!!! I also think paprika might be a tasty addition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IronChefMidwest",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/447483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-10T02:42:36Z",
                "reviewBody": "My husband and I loved this lasagna!  I made a few changes. I used fresh asparagus which I cooked a little before cutting up. I also used a pound of ricotta cheese, to which I mixed in 1 beaten egg, some fresh parsley, about 3 tablespoons of grated pecorino romano cheese, and about 1/2 cup of shredded asiago cheese. I layered on the ricotta mixture first, then the ham, asparagus, sauce, and cheese as the recipe specified. I substituted asiago cheese for the mozzarella between layers, and since I mixed cheese into the ricotta, I only sprinkled a little on top of the layers.  I ended up with ony two layers and sprinkled shredded mozzarella cheese on top (about 1/3 cup).  Then I baked it in the oven for about 35 minutes at 400 degrees (because I was in a hurry!).  I never thought it would be so delicious and can't wait to make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rambunc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1706412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-10T17:43:06.787Z",
                "reviewBody": "Thin asparagus, par boiled 1 minute and placed in ice water would improve the taste and texture of this recipe tremendously. \n\nAnother tip regarding the sauce. When making sauces or graves that require thickening agents such as flour, corn starch, etc., place half your liquid in a small jar or other lid tight container, put in your thickener, tighten lid and shake for about 10-15 seconds. Stir into heated liquid. This method assures no lumps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Miles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T04:46:46.2Z",
                "reviewBody": "My husband and I liked this. I used fresh asparagus and skimmed milk instead and covered it and baked it in the oven for about 30 minutes on 350 degrees.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGQUEEN75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T04:46:45.687Z",
                "reviewBody": "This is a great dish. The sauce is surprisingly substantial and flavorful even when made with skim milk. The combination of ham asparagus and cheese is terrific. It makes a satisfying and interesting dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLMORRI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/634163/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-01T03:47:18.78Z",
                "reviewBody": "I have made this recipe twice using fresh asparagus and broccoli. Be sure to parboil them first. I also used leftover honey baked ham. We really do like this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMMMSWIMMER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/157185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-15T17:45:51.25Z",
                "reviewBody": "This recipie was good. I doubled it and put it in a bigger pan but next time I will use more asparagus and will make more sauce. Other than that it was really good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hilly1026",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2036857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-17T15:55:12.327Z",
                "reviewBody": "I have made this recipe for years! It is a family favorite. When I use the no-cook lasagna noodles I make these changes: I make the cream sauce thinner by adding more milk. After assembled I cover the pan with foil and bake in my conventional oven until the noodles are done. Then I uncover it and sprinkle the last of the cheese on top and return to the oven to melt and brown a little. The cooking time is longer than the microwave version but then again; you save the time of boiling and dealing with the noodles. It is easier to assemble. Made either way it's a wonderfully different lasagna. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PatLI53",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1722892/"
                }
            }
        ]
    }
]