[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17501/everyday-cooking/more-meal-ideas/",
                    "name": "More Meal Ideas",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1951/everyday-cooking/more-meal-ideas/pet-food/",
                    "name": "Pet Food Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/139453/lucky-and-rippys-favorite-dog-food/",
        "name": "Lucky and Rippy's Favorite Dog Food",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1989164.jpg",
            "width": 4608,
            "height": 3072
        },
        "datePublished": "2019-04-04T03:43:53.000Z",
        "description": "Due to the pet food recall I decided to submit this recipe for other dog owners looking for a soft pet food alternative. This has been reviewed by my vet and approved. This is a great healthy recipe for dogs and can be cut in half for smaller dogs. Combined with a kibble this recipe lasts about 4-5 days for 2 large Golden retrievers. Be sure that your vegetable mix contains no garlic or onions!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "12 cups",
        "recipeIngredient": [
            "3 pounds minced chicken meat",
            "2 ½ cups frozen vegetable blend (no garlic or onions), minced",
            "4 cups rice",
            "6 ½ cups water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken, vegetables, and rice into a large saucepan or Dutch oven. Stir in water until the mixture is smooth. Place over medium-high heat and bring to a boil, stirring constantly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce heat to medium-low, cover, and simmer until the rice is tender and all of the liquid has been absorbed, about 25 minutes. Cool completely before serving; store covered in the refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "More Meal Ideas",
            "Pet Food Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LUVSNOW17"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.583333333333333,
            "ratingCount": 72,
            "itemReviewed": "Lucky and Rippy's Favorite Dog Food",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "371.8 calories",
            "carbohydrateContent": "53.9 g",
            "cholesterolContent": "65.9 mg",
            "fatContent": "2 g",
            "fiberContent": "2.2 g",
            "proteinContent": "31.8 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "96.7 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-28T19:51:02.187Z",
                "reviewBody": "While this recipe is a good base, it is not nutritionally sound. As a holistic nutritionist, I have formally studied pet nutrition. Your recipe needs variety and necessary additions. Try rotating protein sources (chicken, beef, fish,... and once a week supplementing with organs) and adding an omega-3 rich egg (cook the white, serve the yolk raw) at least once per day. You might vary your grains with rolled oats (which I first process to make into a flour, then simply add to food w/ warm broth before serving my dogs' meals), alternated with enriched white rice, long grain brown rice, and medium grain brown rice (cooked LONGER than for human consumption!). Also, add fresh vegetables lightly steamed and mashed such as carrots, squash, sweet potato, yam, peas, etc., and even apples once in awhile. Most importantly, you really should be adding cottage cheese or plain yogurt with every meal. Use a calcium supplement (at least 300 mg daily) and a multi. Adding alfalfa powder or other greens is necessary for cleansing the blood and immune health. Finally, if only one supplement is to be used, a good enzyme for dogs is imperatve. I use a great multi complex by \"Only Natural Pet,\" calcium, alfalfa powder, an Omega 3-6-9 capsule, acidophilus (or other probiotic), and occasionally an enzyme. My dogs are athletes, their health and nutrition are very important!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2877297/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-13T00:56:12.08Z",
                "reviewBody": "This is on the right track, but you're leaving out calcium requirements and also the fact that ALOT of dry foods have been affected by this recall. I have my dog on an all natural diet. She 'basically\" eats healthy foods that we eat. Everyone that is in the know is aware not to feed certain foods to dogs. I recommend a book by Carol Boyle on natural food for dogs. I have used this way of feeding my dog for two weeks and I can already see a positive difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "doggymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1091133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-13T12:41:57.94Z",
                "reviewBody": "I use this same recipe to feed both of my dogs except that I add three ground Tums to the mixture after it has cooled, per my vet (I believe it has something to do with dogs needing phosphorous???). I have a 7-yr old border collie and a 14-yr old australian shepherd with Cushings disease and they love this.  I often will use ground beef if I don't have ground chicken - but be sure your dog can handle the extra fat without any accidents in the house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carla H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2325318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-10T04:12:09.773Z",
                "reviewBody": "I've used a variation of this recipe for my three dogs.  As other people have commented, it should not be used on a consistent basis.  I have several recipes that I use to mix things up to ensure my dogs get a well rounded diet and nutritional support with vitamin supplaments.  I got most of my recipes from www.wendynanrees.com.  She hosts the Wild Life Talk Radio and is excellent to deal with.  With all the pet food recalls it is a good feeling to know we are feeding our furry friends safe food.  So why not make it balanced as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee66",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2368628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-13T03:14:11.147Z",
                "reviewBody": "Congratulations on thinking about our \"furry kids\". My two bichons love this diet. They've been on the exact same thing for 6 years.Sometimes I change it around with turkey or beef liver. At the suggestion of our Vet, I sprinkle in the garlic from one capsule I buy at the health food store. Its just enough to keep the fleas away but won't hurt the \"furry kids\". Also, to protect joints a bit of bonemeal after the cooking process. I steam the rice and boil the chicken separately. I use a frozen veggie mix with corn, green beans, carrots and peas. Broccoli, brussel sprouts and cauliflower should not be used because it can cause gas in dogs. Thanks for sharing this with everyone LuvsNow17",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-03T15:24:21.823Z",
                "reviewBody": "This is a great, simple recipe.  I changed it a little.  I used ground turkey for the meat (ground chicken would also work), brown rice for the rice (will have to cook a little longer), frozen peas and carrots for the veggies and added 1TBL of bone meal (can get at health food store)for calcium supplement.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cjeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2365489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-16T14:09:14.557Z",
                "reviewBody": "This recipe is so good and very similar to what I cook for my dog every evening. You can add wheat germ to this recipe and substitute the chicken with ground round (or other very lean cut of beef) or fish (either farm raised catfish or talapia). My dog loves this rice meat veggies meal. Try Wacky Mac noodles instead of rice (or tri-color rotini) for a change. If you are worried your doggy is not getting enough nutrients buy some pet tabs and give along with meals. My dog eats a small amount of broccoli in the vegetable mix he gets but he has never had detectable gas. I throw it all into an iron skillet thinly coated with olive oil and cook for about 12 or so minutes. Capi says 'Yum'!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CallyOop53",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2348038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-26T18:56:54.777Z",
                "reviewBody": "Very good recipe I also put some canned pumpkin in for fiber per the vet and the dogs and cats both love it. However I am afraid to give a supplement to my pets because of the numerous recalls. How do we know if they are made in America with American processed ingredients? Is there a human grade supplement to give them?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Ostlund",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1791542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-13T14:11:37.783Z",
                "reviewBody": "The recipe is great for a supplemental meal. However I hope the submitter does not mean it for a steady diet because there are vitamins and minerals that dog's require and are not in the recipe. This fact has been stated on the news when they are talking about the Pet Food Recall. However, like I previously stated it is good for a change of pace/treat meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SHOJI74",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shoji74/"
                }
            }
        ]
    }
]