[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17501/everyday-cooking/more-meal-ideas/",
                    "name": "More Meal Ideas",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1951/everyday-cooking/more-meal-ideas/pet-food/",
                    "name": "Pet Food Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/140286/homemade-dog-food/",
        "name": "Homemade Dog Food",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F27%2FHomemade-Dog-Food-2000.jpg",
            "width": 2000,
            "height": 1210,
            "caption": "Homemade Dog Food"
        },
        "datePublished": "2019-04-04T03:43:58.000Z",
        "description": "I have made dog food ever since my dogs  were puppies - 4 years now! They are very healthy and have never had any problems. You can also add it to their kibble. They love it! My dogs are large breed so they get 2 cups in the a.m. and p.m.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "10 cups",
        "recipeIngredient": [
            "6 cups water",
            "1 pound ground turkey",
            "2 cups brown rice",
            "1 teaspoon dried rosemary",
            "½ (16 ounce) package frozen broccoli, carrots and cauliflower combination"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the water, ground turkey, rice, and rosemary into a large Dutch oven. Stir until the ground turkey is broken up and evenly distributed throughout the mixture; bring to a boil over high heat, then reduce heat to low and simmer for 20 minutes. Add the frozen vegetables, and cook for an additional 5 minutes. Remove from heat and cool. Refrigerate until using.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "More Meal Ideas",
            "Pet Food Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "redgirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.544117647058823,
            "ratingCount": 272,
            "itemReviewed": "Homemade Dog Food",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.1 calories",
            "carbohydrateContent": "64.1 g",
            "cholesterolContent": "71.7 mg",
            "fatContent": "9.8 g",
            "fiberContent": "4.5 g",
            "proteinContent": "23.1 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "118.3 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-30T03:16:20.14Z",
                "reviewBody": "just wanted to make a comment.  I am a \"natural\" feeder as well and make all my own foods.  One VERY important thing to remember here is dogs do not chew their food 100 times before swallowing, therefore, it is extremely important to ensure veggies have been ground fine to ensure nutrients can be absorbed by their bodies. When swallowed in whole form, nutrients are locked in and will not release.  Also important to note many nutrients, minerals and vitamins come from different sources, therefore ensuring you alternate between ground and root vegetables, adding ground/powdered egg shells for calcium and different oils for the omega fatty acids is a must. Our dogs may look great now, but it is when they hit their older years we will see the affects of what we fed now. Also, soft foods will not promote healthy gums and teeth.  Therefore, feeding RAW (and I stress RAW) meating bones are also mandatory.  Cooked bones splinter.  Raw bones are what wolves and coyotes have been feeding from for thousands of years.  Good luck!  It is well worth the research and effort to know your dog is getting only the best.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2703330/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-04T21:17:09.23Z",
                "reviewBody": "I think this is a great basic recipe to add to.  I ususally double this recipe and make the following changes.  First I vary the meat each week, sometimes turkey, chicken, beef and occasionally some liver added.  I used 2 1/2 pounds of meat which is just a little more than the recipe calls for, but I also add 6 beaten eggs which I whirl into the boiling mix as it cooks.  I think variety is very important so I also change grains with each week.  I have used lentils, barley, brown rice or even oatmeal.  Make sure your garlic is cooked as raw garlic can make your dog sick, and never use onions as a vegetable as onions make them sick as well.  I use a variety of vegetables and mix and match them in each batch.  I don't use the gassy veggies like brocoli or cauliflower as my guys have tender tummies and all the gas just wouldn't be good.  I do use a mix of fresh and frozen veggies usually carrots, peas, green beans and squash.  It is very important to cook your grains well and also to whirl the veggies up in the blender since dogs have short intestinal tracks and can not digest these carbohydrates easily and won't get the nutrition that they need from them if they are left whole.  Make sure they get their calcium!  I save all my egg shells and rinse them out.  I bake them for 10 minutes in a 300 degree oven to get them nice and brittle, then blend them until they are powder.  I put a spoon of eggshell powder and a spoon of Omega supplement on each feeding.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2521435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-01T15:11:10.35Z",
                "reviewBody": "Actually it IS a very healthy recipe.  No where does it say this is all your dog can eat. Like humans, we need different foods.I just spent hours this morning researching healthy foods to feed dogs.  This one pretty much sums it up. Again, not the ONLY thing to feed your pet.  But this won't hurt them either. It may be a little too much garlic.....a little garlic is very good, but not a lot. Vegetables are great but need to be pureed for the dog to be able to digest them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shortstack2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1531303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T01:00:44.447Z",
                "reviewBody": "This is a pretty good start, but you should add 1/2 Tablespoon kelp powder to it (unless your dog has hyperthyroidism), as well as 1-2 Tablespoons finely chopped garlic (yes, be sure to cook it). I just began cooking for my dog and have done a ton of research on it. And, as other reviewers have mentioned, it is critical to very the meat, grains, and veggies. (CORN IS NOT A VEGGIE AND SHOULD NOT BE USED AS YOUR GRAIN, EITHER.) Also, it is best to use ground meats sparingly. Using whole, fresh meats (with bones and skin) to be deboned after cooking is best that your dog can get some of its calcium, glucosamine, and chondroitin from the bones. As other reviewers have mentioned, the broccoli and cauliflower may cause gas in some dogs. Root vegetables (yams as well as carrots) are very important as well. Finally, definitely throw this is the blender! Use within 3-4 days. If you're looking for more info on cooking for your pet, get the book \"The Whole Pet Diet\" by Andi Brown and/or visit the website.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "¡Kate!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3414066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-15T14:01:05.633Z",
                "reviewBody": "This is not a bad basic recipe, but there are a few things not addressed. I have been making my own pet foods for several years now, and while the protein to carbohydrate ratio in this is not bad, there are no organ meats to provide added essential nutrients (I would throw in a couple of chicken hearts and livers), there is no calcium source (a couple of tums with calcium would do), and no table salt to add iodine. Also, dogs do not chew as humans do, and their bodies will not break down vegetable matter as well as ours can, so all vegetables should be well pureed so that your dog can get the maximum nutritional value from it. It should also be noted that while many well cooked, pureed veggies are fine for your dog, onions, raisins, garlic, grapes, and even tomatoes should be avoided, because they contain naturally occurring ingredients that can cause various health problems in your pet.  I would also prefer to see a little more fat in this recipe for a normal weight dog, their bodies need more fat than ours do. My dog is on a 35% meat, 15% fat, 40% grain (always rice, corn and wheat are allergens) and about 10% vegetable matter diet, and he does very well. This recipe is good in principle, it just needs a few things added :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "fawn adkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1702761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-22T00:57:13.457Z",
                "reviewBody": "My dog loved this!  I made very few changes. Instead of mixed veggies I used a couple of carrots that I grated and a half a bag of frozen french cut green beans that I minced.  I used 1/2 tsp garlic powder and added 1 tbsp milk.  I boiled everything together uncovered until it nearly all the moisture was out.  I also added about 1/2 cup of leftover shredded chicken from our dinner last night!  I plan to make this often and change up the ingredients along with adding some bone meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Missyf107",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4183395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-09T16:11:13.457Z",
                "reviewBody": "I have a dachshund who has Cushing's and is also gluten intolerant so this is great due to the brown rice.  I don't add the rosemary but do add a 1/4 to 1/2 tsp. turmeric since it is a natural anti-inflammatory.  I agree with other reviewers, its a good idea to puree your veggies - also real important to give some natural uncooked bones for healthy teeth and gums.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cooking42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-10T03:45:34.373Z",
                "reviewBody": "I have to say that this is what I have been feeding my guys for about a year,  and thankfully you are using a complex slow burning carbohydrate with the potential for a lower glycemic impact.  My one guy was a rescue and he is diabetic and allergic to almost every dog food there is.  I will say that the best veggies to use are chopped broccoli and various other chopped versions.  If I know what will happen with my guys they will chuck the other veggies on the floor first then go back so I chop even the most basic veggies.  Thanks for the great recipe.  I never though to add the seasoning till now n they both love me more for the garlic",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dessie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3194873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-03T15:38:38.66Z",
                "reviewBody": "I have 4 Chihuahuas and have made this recipe for them since there was a problem with commercial dog food containing melamine from China so it has been a long time.. I had started with a high quality dog food but did not want to risk feeding my babies something that would hurt them. My four are 12,10 and two at 8 years old and they love this. For convenience I buy rolls of frozen ground turkey, bags of frozen peas and carrots, brown rice and all bran cereal. I make sure I cook the ground turkey thoroughly and I blend the peas and carrots plus the cooked ground turkey in my food processor. I cook the brown rice in my rice cooker and then mix the meat and veggie mix together with the brown rice and all bran cereal. They each have 1/3 cup for breakfast and 1/3 cup for dinner.When they finish they get one chunk of a dental dog food I buy at the vets to help clean the soft food off their teeth. I do add a small spoon of a nutritional supplement to their evening meal that supplies any possible missed nutrients plus glucosmine. They are thriving and love this mix. Currently  I use three cups of rice to one pound of turkey but next time I plan on changing the ratio to two cups of rice to one pound of ground turkey.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tridon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5674762/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Homemade Dog Food",
            "description": "See how to make dog food from scratch using turkey, rice, and veggies.",
            "uploadDate": "2012-10-24T02:00:24.752Z",
            "duration": "PT1M46.44S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F8ba430fb-9448-4852-9705-fa9bea6ef7d2%2Fae7b3c71-67f4-459e-a997-3336e3f5d658%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1920526592001"
        }
    }
]