[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/104/appetizers-and-snacks/cheese/",
                    "name": "Cheese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/143617/pupusas-de-queso-cheese-stuffed-tortillas/",
        "name": "Pupusas de Queso (Cheese-Stuffed Tortillas)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2747116.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2019-04-04T03:44:22.000Z",
        "description": "An El Salvadoran treat, these homemade tortillas stuffed with cheese are great with a traditional coleslaw called curtido. To serve, slice open one side of a pupusa, and spoon curtido into the opening. Farmer's cheese or mozzarella can be substituted for queso blanco.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 cups masa harina",
            "1 cup water",
            "1 cup queso fresco, crumbled"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir the masa harina and water together in a mixing bowl until smooth; knead well. Cover bowl, and let the dough rest 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape the dough into eight, 2 inch diameter balls. On a lightly floured surface, roll out each ball into 6 inch diameter round. Sprinkle 1/4 cup queso fresco over each round. Place a second tortilla over the cheese, and pinch the edges together to seal in the cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat ungreased skillet over medium-high heat. Place one tortilla into the skillet at a time, and cook until cheese melts and tortillas are lightly browned, about 2 minutes on each side.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Cheese"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jenny"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8035714285714284,
            "ratingCount": 56,
            "itemReviewed": "Pupusas de Queso (Cheese-Stuffed Tortillas)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "297.4 calories",
            "carbohydrateContent": "46.8 g",
            "cholesterolContent": "19.9 mg",
            "fatContent": "7.3 g",
            "fiberContent": "7.6 g",
            "proteinContent": "12.7 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "85.3 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-01T22:38:22.733Z",
                "reviewBody": "The ingredients for the recipe are authentic but the method is not. You'll get the same results but if you can master the authentic way of prepare them, you'll be able to make them much faster.  You can take a golf ball sized piece of the dough, roll into a ball before patting back and forth between your hands. (Using a dusting of Maseca on your hands or a little water alternately to keep it from sticking to your palms or from becoming too dry.) Once you have a round disc about the size of your hand, place a good sized pinch of the cheese in the middle. Bring the edges of the dough up around it and pinch to seal. Now you will have a dough ball with cheese in the middle. Now repeat the process of clapping it back and forth between your palms to flatten into a (now slightly fatter) disc once more - and then it's ready to cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "T.L",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/468527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-04T20:12:44.77Z",
                "reviewBody": "This is a good basic pupusa recipe.  Pupusas can be difficult to make at first but if you're patient they can be restaurant-quality. Just to clarify, \"masa harina\" is commonly sold as the brand name \"Maseca.\"  This will recreate similar tastes to what you've tried before. Do not use regular flour or corn flour, stick to the flour used to make tortillas.  Most authentic pupusas are made by folding the circular dough in on itself around the cheese, rather than covering it with a second one and crimping it.  Slap a palm-sized ball of cheese onto the center of the flattened ball of dough and compress it, then fold the edges of the dough disk up around the cheese to form a ball.  Crimp off excess dough at the top and then flatten the ball into a pupusa. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "socalstudent",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2655966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-22T16:30:54.32Z",
                "reviewBody": "Both parents are from El Salvador and my mom traditional shapes it by hand and inserts the cheese into it and flattens it back up.  She doesn't layer it with cheese in between.  The cheese will occasionally brown as it comes out of the tortilla, but it's a wonderful salty flavor, especially fabulous with the curtido, which is onion, coleslaw, carrots and vinegar (think there's a bit of sugar she throws in too--not much).  It sits for a few days and softens up and is wonderful with the pupusa.  Traditionally, I believe adding refried beans is common, as well as something similar to bacon bits.  I don't have the technique down with my hands making it perfectly round, something my mom can do, but if you can master it, it's a great treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "S Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2738454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-05T06:53:14.78Z",
                "reviewBody": "My mom's friend owns and operates a pupuseria in L.A. She shared with us that to keep the pupusas from drying out or being too dry she adds one tablespoon of baking powder to the masa harina before adding the water. She adds a little salt as well.  I have to say, adding baking powder made a HUGE difference in the consistency of the masa. I used cooking spray on the skillet before cooking and they turned out fantastic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GABESGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-08T00:30:54.077Z",
                "reviewBody": "This gave me a good idea about what to do with the large amount of masa harina and queso fresco I happen to have. I found the proportion of flour and water off and it is completely different from the instructions on the masa harina's package. On the package it's recommended mixing 1 cup of masa harina with 1.5 cup of water. I followed that after finding out 1 cup of water is way not adequate for 2 cups of flour. Regarding the techniques I am used to making similar items in my native cuisine using the traditional method so I didn't follow the recipe at all. Instead I formed a ball of dough in my palm made a large indentation in the middle by cupping my hand. I then added cheese in the indentation and pinched the edges together to close the cheese in and form a ball. I flattened the ball into more or less a disk before putting it on the skillet. I cooked mine for much longer than 2 minutes per side because I wasn't sure if it was done. But the results are very good nevertheless. For whatever reason I find these pupusas very mild yet surprisingly comforting. That's interesting since I didn't grow up eating it. I like to pop a leftover piece in the microwave to heat it slightly and snack on it. Will definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "qj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1629399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-22T10:34:42.61Z",
                "reviewBody": "This gave me the idea for the base of what a pupusa is but the proportions don't work and the technique leaves you with a too-thick pupusa that doesn't cook all the way through without burning (especially given that the preferred stove setting is \"medium high heat\"). The first time I tried this recipe the dough was just too dry -- it kept cracking when I rolled it out and couldn't hold its shape. It also burnt when I tried to cook it due in great part to its dryness. I made some changes that made it work a lot better. I added almost an entire cup of extra water to what is called for in the recipe. I also had to add about a quarter cup of canola oil to it to achieve a more workable consistency and to justify not having to grease the skillet. Salt brings out the flavor of food so I added 1/4 teaspoon of salt to the dough as well. As a few people have mentioned the way to \"seal\" the cheese in the middle shouldn't be like making an empanada where you have to pinch edges together to seal the filling. As long as your dough is moist enough it does work to create a disc from a golf-sized ball of dough on the palm of your hand insert a ball of crumbled or shredded cheese in the middle (and other fillings of your choice) close the dough around the filling and flatten it down into about a half-inch thickness. These are delicious with curtido and a side of beans and rice. Mmmm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "elttaes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2955972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-16T02:18:34.657Z",
                "reviewBody": "It is also traditional to use harina de arroz (rice flour) to make your dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie Carter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3364838/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-23T18:59:51.413Z",
                "reviewBody": "Added salt to the masa as well as some oil(next time I'm thinking manteca de puerco instead). The first few came out pretty dry(why we added the oil). Used queso cotija as one of the fillings & another mixture of beans and chicharrones.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rude Nun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/789885/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-28T18:40:36.57Z",
                "reviewBody": "My husband is El Salvadoran the first half of his life so I am not. I wanted to make something near and dear to his heart and this worked. Thank you so much. BTW I used fresh mozzarella and he said it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "josioradio",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5003121/"
                }
            }
        ]
    }
]