[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
                    "name": "Raspberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/44735/raspberry-and-white-chocolate-roll/",
        "name": "Raspberry and White Chocolate Roll",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1925181.jpg",
            "width": 1851,
            "height": 1851
        },
        "datePublished": "2019-04-02T06:44:40.000Z",
        "description": "A delicious white chocolate cream cheese filling is topped with raspberries and rolled up in a meringue crust to create this easy yet delicious dessert. Can be served with raspberry sauce. (Be prepared to leave this in the refrigerator for a few hours.)",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "7 servings",
        "recipeIngredient": [
            "4 egg whites",
            "¾ cup superfine sugar",
            "4 (1 ounce) squares white chocolate, chopped",
            "4 ounces cream cheese, softened",
            "¾ cup sour cream",
            "1 cup fresh raspberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line a 10x12 inch baking pan with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add sugar, continuing to beat until stiff peaks form. Spread batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 10 minutes, or until lightly browned. Carefully turn onto a sheet of parchment paper that has been sprinkled with superfine sugar. Remove paper from bottom. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt white chocolate, and set aside to cool to room temperature. In a medium bowl, beat cream cheese and sour cream until smooth. Blend in melted white chocolate. Spread over meringue sheet, leaving 1/2 inch border. Sprinkle evenly with raspberries. Carefully roll up the meringue from a short end, using the paper as a guide. Wrap securely in the paper and plastic wrap, and chill until firm. Cut into slices to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Raspberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rowena Jackson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.888888888888889,
            "ratingCount": 18,
            "itemReviewed": "Raspberry and White Chocolate Roll",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "296.2 calories",
            "carbohydrateContent": "34.5 g",
            "cholesterolContent": "32 mg",
            "fatContent": "16 g",
            "fiberContent": "1.2 g",
            "proteinContent": "5.2 g",
            "saturatedFatContent": "9.9 g",
            "servingSize": null,
            "sodiumContent": "107.3 mg",
            "sugarContent": "31.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-26T13:52:41.763Z",
                "reviewBody": "OK first thing I need to caution y'all about is the chill time. This will need to chill in the refrigerator overnight...it's not something you can chill for a couple of hours & then slice & serve for dessert. Second I am pretty sure that the meringue should be spread out on a jelly roll pan (sometimes thought of as a cookie sheet but it has a rim on all 4 sides). Mine was too thick & didn't firm properly because it was too thick. I also think that the sour cream needs to be decreased to lessen the runniness of the filling (it seeped out a lot!) either that or it needs to be chilled for a bit after spreading the filling but before rolling (which may aid in firming up the meringue as well..I am going to try that next time). I used frozen rapsberries & took the suggestion of the raspberry jelly (adding a bit of raspberry liquer to thin it some) which probably contributed to my problem w/ a runny filling. Even w/ the problems this dessert was sooo good (couldn't have it for dessert because it hadn't set but I did have some for breakfast) that I will keep working on the recipe until I get it down. It just tastes that good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-25T19:45:10.827Z",
                "reviewBody": "This is a very good dessert. The flavor combinations are outstanding! A few notes though: Waxed paper -- instead of the parchment paper -- does not work on this recipe. I didn't have any parchment paper. So the meringue layer then stuck to the waxed paper making it impossible to roll. I was hesitant about using sour cream -- was going to use Cool Whip instead -- but was very pleased with the sour cream. Mixed with the white chocolate and cream cheese its delicious. In addition to the raspberries on top I used some raspberry jelly which I stirred to make it spreadable. Since I wasn't able to roll the dessert I literally just served it \"as is\" -- right on the waxed paper! The presentation wasn't the best -- but the family didn't mind. We all loved the dessert -- delicious! I will try again this time with parchment paper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMAJEM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/893969/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-18T01:57:07.983Z",
                "reviewBody": "My husband actually made this because I was at work. I talked him through the recipe and told him what the other reviews had said. He baked the meringue in a jelly roll pan (10x15). I suspect that Rowena had a typo in her instructions and that it should read 10x15 instead of 10x12. He had a little trouble peeling the parchment paper off the meringue after flipping it onto the parchment paper with sugar. One corner broke off but he just use that as the start of the roll so no one knew the difference. I had advised him to let his cream cheese sit out until it reached room temperature before mixing with the sour cream so that the filling would stay smooth. He said that he had no problems rolling it up. I think his success was mostly due to the use of the jelly roll pan and baking it exactly 10 minutes. My guess is that if he had over baked it it would have crumbled when trying to roll it because the edges which were the most done crumbled a little. Plus we followed the advice of another reviewer who said to use parchment paper not wax paper. Since we ate it several hours after he made it he didn't wrap it in plastic wrap. Instead he put it in a 9x13 pan that has a tall lid. Then he chilled it in the freezer for about an hour and then moved it to the fridge until it was served. This is a delicious dessert! We will definitely make this again. I think I will try other berries or mixing berries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYMACBETH7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/782942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T04:33:24.06Z",
                "reviewBody": "I'd like to see Rowena to do this dessert mine was almost disaster. The only solution not to loose it completely was to put it in triffle dish and serve it so. The same happened to my doughter-i-law. What did we do wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "IVANA UNGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/599054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T04:33:19.343Z",
                "reviewBody": "Loved the filling the meringue was difficult to work with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "J2HAYNES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/587136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T04:33:23.78Z",
                "reviewBody": "This is delicious! Definately worth the trouble involved in rolling up the meringue. If rolled properly it looks great iswell. I garnished mine with whipped cream and chocolate shavings and everyone loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LITTLESUZIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648962/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T04:33:24.17Z",
                "reviewBody": "I was a bit worried about making this for company based on some of the previous reviews so I tested it on my family first and it worked out perfectly. It looked good and tasted even better especially the filling. I am making again for company tonight and cant wait to serve it to them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KUKL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/792443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T04:33:23.187Z",
                "reviewBody": "Tasted delicious but I had a hard time getting the meringue firm enough to roll good. I will attempt this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISE1963",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633073/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-21T03:46:22.247Z",
                "reviewBody": "we substituded whipped cream for the sour cream and it was oneof the BEST desserts i have everhad!!! Excellent",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ahess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1528123/"
                }
            }
        ]
    }
]