[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
                    "name": "Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/154851/rock-salt-encrusted-prime-rib/",
        "name": "Rock Salt Encrusted Prime Rib",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1872821.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-04T03:45:27.000Z",
        "description": "This is one of the absolute best ways to taste what a real prime rib tastes like, and it's NOT like plain old roast beef!! This method also makes an extremely cool presentation that fascinates people with its looks. A big plus is that this method makes it easier to remove the rock salt from your roast. The only drawback I've found is that you can't really use the drippings for au jus or gravy because it's way too salty, so make that separately. Enjoy!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H15M",
        "totalTime": "P0DT4H35M",
        "recipeYield": "15 servings",
        "recipeIngredient": [
            "20 pounds standing rib roast (weight with bones), top fat trimmed",
            "2 (1 ounce) packages dry onion soup mix",
            "2 tablespoons freshly ground black pepper",
            "8 cups rock salt",
            "8 cups all-purpose flour",
            "2 tablespoons crushed dried rosemary",
            "2 cups water, or more if needed",
            "1 (4 ounce) jar prepared horseradish, for serving",
            "3 (1 ounce) packages au jus gravy mix, for serving"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rinse the roast and pat dry with paper towels. Mix the onion soup mix and pepper together in a small bowl. Rub the pepper mixture generously over all sides of the roast. Place the roast on a clean, dry baking sheet, and rest 30 to 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, mix the rock salt, flour, rosemary together in a bowl. Gradually pour in the water and mix by hand (wear gloves if desired) to make a thick, sticky batter or paste. Add more water if necessary. Spread the salt batter into the bottom of a roasting pan to make a layer 1/2 to 3/4 inch thick., reserving 1 to 2 cups. Place the roast, bones facing down, in the middle of the batter in the pan. Pull the batter up and around the roast to completely cover the meat. Pat on extra batter if necessary. Insert meat thermometer into the roast with its gauge positioned to be visible from the front of the oven (or use a regular meat thermometer).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook in preheated oven for 15 to 20 minutes. Remove, and use remaining salt batter to patch any holes or breaks in the coating.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, prepare au jus according to package directions leaving out 1/4 cup water to boost flavor, and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return roast to the oven, and cook until internal temperature reaches 130 degrees F (54 degrees C), or to desired doneness. Remove roast, and rest 20 to 30 minutes until internal temperature reaches 140 degrees F (60 degrees C). Chip off the crust and discard and then slice to serve. Serve garnished with horseradish and au jus.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chuck Dagel"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.741935483870968,
            "ratingCount": 93,
            "itemReviewed": "Rock Salt Encrusted Prime Rib",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "2071.3 calories",
            "carbohydrateContent": "55.7 g",
            "cholesterolContent": "424.1 mg",
            "fatContent": "153.2 g",
            "fiberContent": "2.7 g",
            "proteinContent": "109.3 g",
            "saturatedFatContent": "62.6 g",
            "servingSize": null,
            "sodiumContent": "60362.5 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-19T17:10:12.46Z",
                "reviewBody": "I was very determine to find the BEST prime rib recipe and I found it. I've tried many prime rib recipes and this is by far THE BEST.  I used 5 1/2 pounds and it asked for 2 1/2 cups of Rock Salt.  The outside came out a little bit on the salty side.  I would probably recommend 2 cups instead.  I also added EXTRA Rosemary.  I also did what one of the viewer did, cook 450 degree for 30 minutes and then turned down to 325 degree and cook the remaining 1 hour and 15 minutes.  Removed the meat at 130 degree and let the meat sit for 15 minutes.  The meat came out medium rare... PERFECT!  Thank you for sharing and this recipe belong to a 10 stars!!!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "locopups",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2817740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T16:50:30.33Z",
                "reviewBody": "This turned out awesome! The only thing I did wrong (was not thinking at all) was that I used my clay pot. Not a good idea. I would not only recommend but insist on using a disposable pan to ensure cleanup. That's all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2720314/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-20T19:40:33.83Z",
                "reviewBody": "I have been making prime rib for several years but this is now my favorite recipe. Be brave and try it...it was well worth it! I did use kosher salt instead of rock salt. It worked fine. I also used a tuscan herb mix that I found at Costco instead of the onion soup and rosemary. I used about 1/3 or so of a cup of the seasoning. It smelled so good and I was surprised that the meat took on the perfert amount of seasoning even though it was tossed out after cooking with the salt/flour crust. It smelled so good that I used this mix in my mashed potatoes too! I put the crust on my rib while it was on my counter instead of in the pan as in the instructions. I used a bone-in rib and cooked it on my roasting rack. I completely covered the meat (bones and all) in the crust. It was very easy to work with and went together very well. Then I cooked it on my rack and had no trouble with the crust sticking to the pan. I also changed up the temp a bit. I cooked a 17 lb rib for 1/2 hour at 425 and then reduced to 325 for the remaining 3 hours. I used a meat therm. and took it out of the oven at 115 degrees and then let it rest for 1/2 hour. It was perfect. Tip: if you have a George Forman grill it is really helpful for your guests who like their prime rib more well than medium rare. You can pop a rare piece on the GF grill and in seconds have it more well done. It was really fun to serve my friends a great piece of prime rib that was like something they would get at a very",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2552784/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T22:41:26.087Z",
                "reviewBody": "This recipe is the greatest! I have always cooked Prime Rib for Christmas. and this is the BEST. I did have to modify-ingred. down size to 5lbs and adjusted the temp I cooked at 450 for 30 min then 325 about 1hour 15min(elevation) 3900 feet. not to mention the comments on the volcanic looking thing.which everyone had to touch. and Grandaughter (8)explained to everyone that she wasn't going to eat that!!Well she did and everyone LOVE IT.I enjoy checking out allrecipes.com Thanks Ronda in Utah",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Grandma_C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2138283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-02T01:15:19.033Z",
                "reviewBody": "I used this recipie for my New Year's Eve dinner and it was absolutely fabulous! I did a 7lb prime rib roast roasted it first for 30 min then cooked it for an additional 1 hr 40 min rest for 30 min. At first I was quite hesitant cooking a prime rib roast with a rock-salt crust and which took less time that any of the other recipies I had researched. Since the crust covers the entire roast you don't see what's happening on the outside. So during the entire cooking time I was praying to the food God's that I did not mess up on this expensive piece of meat. (Please note that I am a novice cook so I don't have the experience yet to know what works or not.) However once it was done and I removed the crust it was like a gift sent from heaven! I think that it turned out better than any other rib roast that I had tasted. I followed all the directions and added all the recommended ingredients with the exception of sticking some garlic cloves into the roast and roasting it initially for 30 min instead of the recommended 20 min (as suggested by some members thanks guys!) but other than that it turned out to be a hit. My brother who is the biggest food critique said that this was the best prime rib roast he has ever tasted!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Czarina Amian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3434934/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-30T04:54:16.607Z",
                "reviewBody": "This was the most awesomely delicous prime rib I have ever tasted and what is even more thrilling is the fact that I was able to make it! The only different thing I did was instead of a 20 lb Prime roast I uses a 5.5 lb prime roast. Instead of cutting the ingredients by 1/4 I cut it by 1/2 so that it would be really tasty and also so that I would have a little more of the rock salt dough that was required (since it was the first time I did this). I'm glad I did that because it can be messy and I took the suggestion of using plastic baggy gloves which really helped. I ended up using all the rock salt dough and it came out beautiful! I am no longer afraid to purchase this expensive roast for fear of serving a mediocre dish. Thank you so much for sharing this easy and wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leialohadm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/693858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-06T17:26:35.04Z",
                "reviewBody": "This was the best prime rib I have ever cooked. I have always used rock salt to cook a prime rib but it doesn't stick to the meat. This year I used the recipe listed here for the rock salt case. It worked perfectly! Normally I don't modify recipes but I did modify the seasonings on the meat to what I like and I changed the cooking temperature. I cooked the meat at 450 degrees for 30 minutes as per the recipe then I lowered the temperature to 250 degrees for 4 hours (until it reacher 135 degrees) for a 12 lb prime rib. The meat was butter tender flavorful and perfectly medium. WOnderful recipe that I definately recommend!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ranchwife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ranchwife/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T17:58:35.69Z",
                "reviewBody": "I made this for New Years and it turned out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BuffalosMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6125470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-26T18:05:17.027Z",
                "reviewBody": "Only way to cook a prime rib! My husband s idea to fix this Christmas Day wanted something rather than turkey. OH WOW it was fabulous. Seasoned the outside of the prime rib with rosemary garlic Cajun seasonings. Next time we will inject some au jus in it. Other thing we did different put it in at the high temperature of 475 for 30 minutes so the outer layer would sear quickly. After that the temperature went to 325. We also put a layer of rock salt on the bottom and on all sides of the roaster. Just excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cajun Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cajungirl/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T20:02:38.14Z",
                "reviewBody": "While the rock salt kept the beef moist it was very hard to remove (you need a hammer) and spots of the prime rib were really salty! Won't do it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "hiptyhp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3017375/"
                }
            }
        ]
    }
]