[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15855/bread/quick-bread/tortillas/",
                    "name": "Tortilla Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/157642/homemade-flour-tortillas/",
        "name": "Homemade Flour Tortillas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F663757.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-04T03:45:34.000Z",
        "description": "Traditional flour tortillas - homemade and much better than store bought. Do not substitute vegetable oil or shortening for the lard.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "2 dozen",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "1 teaspoon salt",
            "2 teaspoons baking powder",
            "2 tablespoons lard",
            "1 ½ cups water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk the flour, salt, and baking powder together in a mixing bowl. Mix in the lard with your fingers until the flour resembles cornmeal. Add the water and mix until the dough comes together; place on a lightly floured surface and knead a few minutes until smooth and elastic. Divide the dough into 24 equal pieces and roll each piece into a ball.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat a large skillet over medium-high heat. Use a well-floured rolling pin to roll a dough ball into a thin, round tortilla. Place into the hot skillet, and cook until bubbly and golden; flip and continue cooking until golden on the other side. Place the cooked tortilla in a tortilla warmer; continue rolling and cooking the remaining dough.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Tortilla Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LaDonna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5465587044534415,
            "ratingCount": 1482,
            "itemReviewed": "Homemade Flour Tortillas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "85.7 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "1 mg",
            "fatContent": "1.3 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "138.4 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-05-11T16:37:48.73Z",
                "reviewBody": "I wish I could give this recipe more stars! I've been using Tortillas I from this site and thought it was the best one I had found ... until this one came along. I love the fact that you don't have to use boiled water, and that you don't have to let it rest for 10 minutes. This was fast and easy to make. I halved the recipe and divided the dough in 8 golf-size balls and rolled out as thin as I could (about the width of a dime). It felt like I was rolling pizza dough instead. I lightly floured my rolling pin and surface when it was a bit sticky, and rolled from the center out, rotating the dough 90 degrees ever so often. I got smooth edges, but if the edges are jagged then too much lard/shortening was added. I cooked each tortilla for 10-20 seconds on the first side and a little less on the second size. The I wrapped them in a clean dishtowel and stored them in a shopping bag. THE BEST PART OF ABOUT THIS RECIPE IS THAT THE TORTILLAS ARE PLIABLE! Thanks for sharing this wonderful recipe, LaDonna!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rosabela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2659423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T21:30:06.053Z",
                "reviewBody": "If you cant eat lard, you can insted use margarine, they taste the same.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Francis Tsoukalos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3692389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-21T17:59:25.123Z",
                "reviewBody": "I wanted to make quesadillas, but didn't have tortillas, and didn't feel like running to the store for some.  I 1/2ed this recipe because I didn't need very many.  My husband LOVED them!!!  And I was wondering how he'd react, as he's very picky.  He thinks these really are so much better than store bought.  I did substitute shortening for lard, and used hot water.  The dough is nice and stretchy, and I could roll them very thin with a wooden roller.  So delicious.  I was surprised though, especially with my baking experience, that 1/2 the recipe made only 4, 8-10 inch tortillas.  I guess 2 cups of flour doesn't go far in this recipe, but there really aren't any other ingredients so I guess that's it.  So good though.  You won't regret using this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2396308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-02T18:35:47.807Z",
                "reviewBody": "I've been trying to make tortillas since being taught by a Spanish family about 15 years ago - without a recipe.  They always turned out like thick roadmaps.  THESE DO NOT.  What I learned from reading reviews and my Spanish family lessons:  First of all, only use this recipe then...1.  Shortening works as a great substitute, lard is best  2.  Use your mixer with a dough hook if you have one.  3.  Should be smooth as a baby's hiney when done kneading, no stretch/tear marks when you form a ball with the whole recipe.  (Seriously.  Pat the ball like you're giving a love pat.  Should be the same.)  4.  Do let the 24 balls rest under a damp cloth if you can. (10-20 min) They will not stretch back and become thick  5.  Use light dusting of flour on your board and pin 6. VERY IMPORTANT:  pick up and turn 90 degrees every time you roll to get a round tortilla!  6.  Use a dry, extremely hot cast iron skillet.  7.  Roll to dime width for large thin wraps, quarter for thin tortillas  8.  Once cooked, stack wrapped in a damp towel or the 1st side cooked will stay crunchy.  9.  Refrigerate leftovers or they will mold in a couple of days.  10. I like to make ahead and re-heat in foil in the oven @ 350@.  HOPE THAT HELPS!  Thank you LaDonna for the perfect ratio of ingredients that should be so simple but it's not and only the Grandma's know!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "prttimecook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1717419/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-19T19:22:24.127Z",
                "reviewBody": "This recipe turned out great! It was easy. I didn't have lard, shortening or even margarine so I used butter. The tortillas turned out fine, but I couldn't get them as thin as the ones you buy at the store they were a bit bready. I liked them like that. I made half the recipe and I did get 12 tortillas. I had left overs so the next morning I warmed them up and spread some butter and sprinkled a little cinnamon sugar over them. It was delicious with a cup of coffee. I will be making these again using shortening. Thanks for the recipe LaDonna!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MYRA25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/810016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-26T17:57:46.81Z",
                "reviewBody": "This recipe is so simple and easy! I only made half the recipe and used vegetable shortening since I had no lard on hand.  Like another reviewer I also used hot water.  The dough was very easy to handle and roll very thin(although I've never really managed to roll out an actual circle, just oblongs-oh well!).  The dough is on the sticky side, so I was very generous with the flour while rolling out each tortilla, but this didn't affect the final result.  Best tortillas ever, including restaurants!  My husband is from Texas and is pretty  snotty about Tex-Mex food, and he could NOT believe how great these were, still talked about it the next day.  My 3-yr old daughter told me again and again how good they were.  So it's a keeper!  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "imelda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460580/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-17T02:14:36.69Z",
                "reviewBody": "You must use HOT WATER!  It makes a big difference. I used 3 3/4 cups of flour, 2 tsp. of baking powder, 1 tsp. salt and 1/3 cup of Crisco Shortening.  Pulsed about 6 times on food processor, then added 1 1/3 cups of HOT WATER.  Pulsed till came to a nice ball.  Took out of processor and hand kneaded 5-6 times. Dough is soft and easy to handle and roll out.  Rested dough 10-15 minutes. Then made into 13 balls.  Rolled out and placed on med. high griddle. Cooked about 15  or so seconds, flipped to other side to cook for same amount of time. then flipped 1 more time. Placed cooked tortilla in paper toweled tortilla warmer. The tortillas came out soft, beautiful and delicious. I did not have to flour the rolling pin or the dough to roll out.  Perfect dough. This is my go to recipe. YOU CAN ALSO DEEP FRY INSTEAD FOR SOPAPILLAS. BUT BE SURE TO PRICK WITH FORK BEFORE ADDING TO HOT OIL IN FRYING PAN.  LET COOK FOR A FEW SECONDS, FLIP AND FRY UNTIL LIGHT GOLDEN BROWN. DRAIN ON PAPER TOWELS, AND IMMEDIATELY TOP WITH CINNAMON/SUGAR.  THESE ARE DELICIOUS!!!!  ENJOY.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cecilia Martinez Guerra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4486879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-07T17:30:34.713Z",
                "reviewBody": "Yes, these are way better than the tortillas in a bag. However, if you separate them into 24 balls, like the recipes says, you get such small tortillas. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KATEFOODFUN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1466506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-01T18:49:00.21Z",
                "reviewBody": "Great, simple recipe. I used 1/2 white and 1/2 whole wheat flour and shortening instead of lard. They turned out tender and yummy. The only thing I will change next time is extra salt. The WW flour needs just a bit more salt I think.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "barefootpixie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1848599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-22T00:57:47.120Z",
                "reviewBody": "To be a really chewy, soft tortilla, these need much more lard/shortening - at least 1/2 cup. Following, this recipe exactly I ended up with very brittle, tasteless tortillas that didn't bubble up well in the pan. I did a bit more research and found a video recipe by Food Wishes - it's the money!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "melodyanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1630038/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Homemade Flour Tortillas",
            "description": "See how easy it is to make your own homemade flour tortillas.",
            "uploadDate": "2012-08-23T00:42:13.728Z",
            "duration": "PT4M3.702S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb4f25a04-3286-457d-ac07-f1db6041c428%2F39bb9ab5-262e-4ee2-bedc-3d1be576ed35%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1799636735001"
        }
    }
]