[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/220/side-dish/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/157854/buffys-refried-beans/",
        "name": "Buffy's Refried Beans",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5433486.jpg",
            "width": 2787,
            "height": 2787
        },
        "datePublished": "2019-04-04T03:45:35.000Z",
        "description": "These smooth and creamy beans make a tasty side for any Mexican dish.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ cup lard",
            "3 (15 ounce) cans pinto beans, rinsed and drained",
            "salt to taste",
            "1 cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt the lard in a deep, heavy pot over medium-high heat; when the lard is hot, add the beans. Stir constantly while cooking until the beans reach a paste-like consistency. Season with salt. Reduce heat to low and stir in the water. Simmer and stir until the beans cook down to your desired consistency.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Beans and Peas"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Buffy Ehlers Whitney"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.574257425742574,
            "ratingCount": 101,
            "itemReviewed": "Buffy's Refried Beans",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "282.2 calories",
            "carbohydrateContent": "22.7 g",
            "cholesterolContent": "16.2 mg",
            "fatContent": "18.3 g",
            "fiberContent": "6.9 g",
            "proteinContent": "7.2 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "439.2 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-16T23:26:44.203Z",
                "reviewBody": "I am sure many other reviewers will mention the various ways to cut the fat, but lard is the deal-breaker that makes authentic refried beans in Tucson, AZ. I have used this recipe before and I like it, although I also add wads of fresh chopped garlic and 1 tablespoon of cumin once the beans cook down a bit. Big deal: make sure you slowly add HOT water (better yet: HOT chicken broth) when cooking beans; it significantly cuts down on the potential starchy-bland flavor that can occur (got that advice from a Mexican cooking pro). Finally, for you sodium watchers...as this recipe cooks down, the salty taste will become more prominent. Add salt in 1/4 teaspoon increments near the end of cooking; let it \"meld\" and taste often. Cook as slow as possible. This is not a recipe that you throw together, as simple as it looks. But if you are wanting authentic tasting frijoles, without soaking (and slow-cooking) dried pinto beans for hours...this is darned close to the real thing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ellie may",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3578288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-10T15:39:30.97Z",
                "reviewBody": "I used the general guidlines from this recipe to make refried beans from fresh cooked pinto beans that we had for dinner tonight. I used 45 oz of fresh cooked beans without broth (I cook my pinto beans in chicken broth with a ham bone for flavor). I ran them through my food processor to make them smooth and mixed them in with the 1/2 cup of butter (instead of lard). I cooked them to the paste consistency as stated, added the salt and then mixed in 1 cup of broth from the beans (still warm from cooking them). I then cooked it down to the desired consistency and froze them in 8 oz portions for later use.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2999743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-25T15:32:32.78Z",
                "reviewBody": "This is a good simple recipe that holds true to refried beans. I didn't have lard on hand so I used butter.  I've watched women make refried beans in the villages of Mexico with just plain old vegetable oil, so that is an option in a pinch too.  When I cooked these I mashed them with the back of the spoon to expedite the process.  Super easy & tasty!  To give them a little more flavor without adding texture, I added a couple spoons of the watery juice from some salsa. **update** I tried again with lard, like the butter version better. Also, a pinch of episote helps to make it a little more authentic tasting.  Salt IS important. I made Texas style baked beans for my DDs B-day one year and all the neighbor kids thought the silly gringa mixed up the sugar with the salt, LOL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rolling Alaskans",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2333558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-29T19:01:09.837Z",
                "reviewBody": "These are the best homemade refried beans ever!  I happened to be cooking bacon for another use, so I used half butter, half bacon grease (no lard on hand).  And, I used the liquid from the beans instead of water.  Very few dishes in my kitchen escape without garlic, so a good heaping Tbsp. of minced garlic and a small can of diced green chiles sauteed in the bacon grease before adding the beans worked perfectly.  And, I topped the beans with grated Pepper Jack cheese.  Mmmm....  My family is still shocked that they are getting real refried beans, not out of a can, at home!  We even like these better than our favorite Mexican restaurant's.  Thank you Buffy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DECAFinNW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/decafinnw_kahleia-n-cyrusgrammie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-10T19:22:43.863Z",
                "reviewBody": "Hurray for lard! This recipe is awesome--exactly what i was looking for in the middle of a blizzard when my pantry was nearly bare. The only thing i suggest is to start with dry beans. Soak overnight and slow-cook until soft then use in place of the canned beans. You'll need a bit more salt or other seasoning but you'll save yourself some money as well as unnecessary preservatives.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hippie_mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3020643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T19:45:50.853Z",
                "reviewBody": "I have made this a few times now. Started with the basic recipe and in the end have made a couple of changes. The first is to replace the water with chicken broth. Added 1/2 teaspoon each of garlic powder cumin and chili powder. I serve it topped with shreaded mexican blend cheese a little taco sauce and diced green onions. I will not buy canned refried beans again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3470727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-11T08:19:23.453Z",
                "reviewBody": "I love refried beans.  I tried making them from scratch with dried beans from another recipe on this site.  They took all day and they tasted nothing like the ones from the restarants.  This tastes JUST LIKE the beans in the Mexican restaurants.  With that being said.  I scaled the recipe down to just me.  With one can of pinto beans.  I also used oil and not lard like a lot of posts listed.  And, I used about a tablespoon or so. I heated the oil.  While heating I opened and drained the can of pinto beans.  Then I mashed the beans once I added them to the hot oil.  With the oil you will not need any water.  If you add it do it a teaspoon at a time.  And, with the beans even drained they are loaded with salt, so it is not even needed.  Only 5 minutes to restarant beans. Nice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-30T18:19:04.343Z",
                "reviewBody": "This is how I have made home made refried beans for 30+ years except I ALWAYS use saved bacon fat instead of lard even though they are the same thing. Yes it's ok to use rendered pork fat of some sort. I use 2 lbs of dried pinto beans soaked over night and cooked the next day with the desired Latin spices added to the cooking water. When mashing them I use some of the cooking liquid as needed to get them to the desired consistency. After mashing they go into a large cast iron skillet with the bacon fat melted and very hot. It takes 2 batches to do 2 lbs of beans but worth the time. After stirring several times I adjust seasonings for flavor, turn off the heat, let them cool and portion them into zip top bags for freezing. This way I always have ready made refried beans on hand and don't have to use canned ones.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "slo_cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2767931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-01T18:29:02.93Z",
                "reviewBody": "This is IT! I won't try any other refried recipes I am a happy girl. Soaked 3 cups dried pintos overnight then drained & cooked this morning for 1.5 hours with half an onion in it. Tossed the onion drained beans & reserved the liquid and followed the directions including lard. This is exactly like the authentic Mexican restaurants in the area... I kept sneaking back for tastes of it! I did add 1/4 tsp garlic pwd 1/2 tsp each cumin & chili pwd and 1 tsp chicken bouillon added to my bean liquid. As others say go easy on the salt you can always add a bit more at the end. With the bouillon I only needed 1 tsp salt and could have maybe used a tad less. For those who didn't use lard you really should buy some. It gives it a much better flavor than just veggie oil. It's called Manteca and you can usually find a white & green container of it in the Mexican aisle at Walmart or ask about it at your grocery store.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stargrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3764705/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-09T14:37:06.613Z",
                "reviewBody": "A little too muc lard for me will cut that back next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce Adkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8489827/"
                }
            }
        ]
    }
]