[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/159432/puff-pastry/",
        "name": "Puff Pastry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4498562.jpg",
            "width": 5312,
            "height": 2988
        },
        "datePublished": "2019-04-04T03:45:41.000Z",
        "description": "If you've ever wanted to make authentic puff pastry from scratch, this is the recipe. Puff pastry puffs into thin delicate layers as it bakes, making it perfect for breakfast pastries, beef wellington and tempting appetizers.",
        "prepTime": "P0DT1H40M",
        "cookTime": null,
        "totalTime": "P0DT1H40M",
        "recipeYield": "3 1/2 pounds",
        "recipeIngredient": [
            "5 cups bread flour",
            "2 ½ teaspoons salt",
            "2 cups water, or as needed",
            "2 cups unsalted butter, at room temperature "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix the flour and salt together in a large bowl or in the bowl of a stand mixer that is fitted with a dough hook. Gradually stir in water until the dough holds together enough to clean the sides of the bowl. You may not need the full amount of water. Shape into a flat ball, and allow to rest for at least 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the butter between two pieces of plastic wrap and pound into a flat disc using a rolling pin or other heavy object. Refrigerate until firm, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, roll out the dough into a large rectangle about 1/2 inch thick. Place the disc of chilled butter in the center and fold the two ends over it so that it is completely encased in dough. Roll out the dough again, taking care not to let the butter break through the dough, to about 1/2 inch thickness. Fold into thirds. This is the first ''turn''.  Rotate the dough 90 degrees and roll out into a rectangle again. Fold into thirds. By this time the butter is starting to warm up. Place the dough on a baking sheet and mark it with two pokes from your finger (two turns). Wrap in plastic and refrigerate for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Repeat this rolling, folding and turning two more times, then refrigerate until firm. Repeat two more times for a total of 6 ''turns''. Wrap and refrigerate. The dough is now ready to roll out and use in any recipe calling for puff pastry. Roll the dough out as thin as 1/4 inch to make pastries. Bake in a preheated oven of at least 400 degrees F (200 degrees C) to get the maximum puff from your pastry.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "your mom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2272727272727275,
            "ratingCount": 88,
            "itemReviewed": "Puff Pastry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "135.6 calories",
            "carbohydrateContent": null,
            "cholesterolContent": "40.7 mg",
            "fatContent": "15.3 g",
            "fiberContent": null,
            "proteinContent": "0.2 g",
            "saturatedFatContent": "9.7 g",
            "servingSize": null,
            "sodiumContent": "244.9 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-27T03:08:24.97Z",
                "reviewBody": "This is a great recipe for puff pastry.  I agree that the butter can be cut by 6 tablespoons per 2 cups of flour.  Also, putting the dough in the freezer for 10-15mins. between turns made the process quicker and easier, esp. if you are cooking in the kitchen which adds for additional heat.  Another tip is to put the rolling pin and cutting board in the freezer between turns.  Finally I worked the dough on parchment paper so I could just wrap it in the paper and place it in the freezer.  This cut the entire process down to about an hour with amazing results. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Monica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3336189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-24T19:18:52.31Z",
                "reviewBody": "Great recipe, but you must follow it exactly to get the desired result.  Because you have to refrigerate the dough between turns, the recipe takes time and you must allow for that.  If you decide that the recipe is too time consuming, try a butter-based pie crust recipe.  Avoid the vast majority of frozen and refrigerated puff pastry because they are usually made with cheap hydrogenated fats instead of butter, and this makes a HUGE difference in taste and texture, which is what puff pastry is all about.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AlliePeacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alliepeacock/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-30T02:28:06.453Z",
                "reviewBody": "This was the closest that I could find to my old recipe. Keeping the butter ice cold is extremely important. The butter melting while baking is what puffs it up. My hands are always hot so I only do a turn at a time, then place in the freezer for 10 minutes. I also keep a frozen bag of peas that we use for an ice pack on the table between turns to keep it cold as well. Great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitty Johnson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2403508/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-23T03:43:25.77Z",
                "reviewBody": "revision (2/22/10): one tip that i've discovered is to make the butter disc pretty thin (1/2\") so that when you wrap it with the dough it's easier to roll out. refridgerating helps a lot with the butter breaking through... i used a pie edge cutter to trim the edges and it made the end result even prettier. Original (1/10/10): i've made this recipe twice now and both times it has been very easy to follow with great results. there are a few reviewers who have said that it needs to be followed exactly -- well i have to disagree because i've been lucky to have it look amazing without having the success of rolling out the dough expertly. the butter kept breaking through the flour mixture and i forgot to refridgerate it but it's puffed up like a star! clearly beginner pastry chefs should start here:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lynnyo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4292433/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-15T23:55:16.147Z",
                "reviewBody": "I made this recipe 2 weeks ago for use in a recipe that called for puff pastry.  It came out AWESOME, seriously, INCREDIBLE!  I totally looked like a gourmet pastry chef and everyone asked for the recipe!  I had found my new \"signature\" recipe.  Since then, I have attempted to make it again, and not once has it come out as well. I'm giving the recipe 5 stars because I know it is great when it works, and that it is \"operator error\" on my other attempts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kirnicko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3732162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-17T18:40:02.35Z",
                "reviewBody": "I tried this yesterday the hardest part I found was the rolling out if you have bad arthritis in hands or wrist stay away from this recipe and go to your local store. The recipe does not indicate how many \"sheets\" it makes. So by doing some investigative work it should produce 6ish sheets. So I cut my big chunk of pastry into smaller peices and froze them. I did use small amt for testing it is ok but think I really prefer the store packages it saves me alot of work and pain! I did as exactly as recipe said and changed nothing. As I was a bit skeptical about this I did a youtube search to make sure I did the turns and rolls properly. I don't mind hard work on recipes or even things that are a bit time consuming but personally with my RA I think it is easier on me to buy it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cdnshaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1951050/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-27T22:48:22.16Z",
                "reviewBody": "It is a good recipe I made some kind of \"hot pocket\" things with the dough and they have served me well for lunch food so far. Will make again but I might try to add some herbs to the dough just to flavor it up a bit more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gabriel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2831721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-25T17:09:17.21Z",
                "reviewBody": "This was much more authentic than the other puff pastry recipe that called for sour cream. However I thought it used too much butter. 1 1/2 might be plenty. I used this in the puff pastry salmon recipe and blackcurrent pastry tart recipe on this site and they were great. Gave a really gourmet presentation too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mcmeg12",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2492014/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-19T17:58:58.63Z",
                "reviewBody": "A lot of work but altogether simpler than I expected. I followed the suggestions of others and used the freeezer instead of the fridge for the cooling part of the process but otherwise stuck to the recipe. Maybe I screwed up some of my first \"turns\" because when it baked up it only puffed a little even though I had turned it about 8 times or so. I think I may have forgotten the \"turning\" part and just done a bunch of folding at first or something silly like rolling the wrong direction in relation to the folds... Oh well! The presentation was professional looking and the texture and flavor were also spot-on for my expectations of deliciousness. An awesome recipe my go-to for anything involving puff pastry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rob's Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4277914/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-16T20:37:04.007Z",
                "reviewBody": "mine turned out tough... It was also hard to keep the butter inside...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "kellie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7307413/"
                }
            }
        ]
    }
]