[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/226/world-cuisine/african/",
                    "name": "African",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/160087/upside-down-maqluba/",
        "name": "Upside Down (Maqluba)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F285455.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:45:44.000Z",
        "description": "This perfect meal features all four food groups. It is inspired by the Arabic dish called 'Maqluba,' which translates to 'upside down.' When the meal has finished cooking, you take the pot and flip it upside down onto a large serving platter, and everybody helps themselves.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "7 cups water",
            "2 onions, chopped",
            "1 tablespoon chopped garlic",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground turmeric",
            "2 teaspoons garam masala",
            "1 pinch salt and ground black pepper to taste",
            "2 cups cooking oil",
            "2 cups lamb meat, cut into small pieces",
            "1 large eggplant, cut into 3/4-inch slices",
            "2 zucchini, cut into 1/4-inch slices",
            "1 cup broccoli",
            "1 cup cauliflower",
            "1 ½ cups jasmine rice",
            "1 (16 ounce) container plain yogurt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring to a boil the water, onion, garlic, cinnamon, turmeric, garam masala, salt, and pepper in a large pot. Add the lamb; reduce the heat to low and simmer 15 to 20 minutes. Separate the lamb from the liquid and set aside. Transfer the liquid to a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the lamb mixture simmers, heat the oil in a large, deep skillet over medium heat. Fry the eggplant slices in the hot oil, assuring the pieces do not touch, until brown on both sides; remove to a plate lined with paper towels to drain. Use the same procedure to fry the zucchini and the cauliflower. Cook the broccoli in the oil until hot and remove to a paper towel-lined plate to drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Layer the lamb into the bottom of the large pot. Arrange the eggplant, zucchini, broccoli, and cauliflower on top of the lamb in layers. Pour the rice over the meat and vegetables, shaking the pot gently to allow the rice to settle into the dish. Pour the reserved cooking liquid from the lamb over the mixture until it is completely covered. Add water if needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover the pot and simmer over low heat until the rice is soft and the liquid is absorbed, 30 to 45 minutes. Remove the lid from the pot. Place a large platter over the pot and flip the pot so the dish is \"upside down\" on the platter. Serve with yogurt on the side.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "African"
        ],
        "recipeCuisine": [
            "African"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "JustCallMeD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.25,
            "ratingCount": 16,
            "itemReviewed": "Upside Down (Maqluba)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1018.6 calories",
            "carbohydrateContent": "58.3 g",
            "cholesterolContent": "50 mg",
            "fatContent": "78.1 g",
            "fiberContent": "6.8 g",
            "proteinContent": "24.3 g",
            "saturatedFatContent": "13.6 g",
            "servingSize": null,
            "sodiumContent": "152.4 mg",
            "sugarContent": "10.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-06-05T16:58:04.397Z",
                "reviewBody": "I am the author of this recipe and it has been radically 'modified' from what I submitted. First I believe you only need about 5 cups of water but \"may\" need to add an extra cup or so - depending on whether or not the rice is covered when you go to place it on the stove to simmer. Also chicken is a great substitute for the lamb - as is veal. When frying the eggplant it's best not to overlap them - but it really doesn't matter too much in the end. Some reviewer's commented that the cooking time is too long. I use jasmin rice and it cooks in about 30 minutes. But if you've got a favourite rice you use often you would have a better guess as to when it would be done. The prep time is longer than other dishes but certainly not more difficult. And certainly worth it every time! =) P.S. What I use to speed up the prep time is frozen vegetables!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JustCallMeD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2783194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-30T22:38:41.683Z",
                "reviewBody": "Years ago I ate this dish at a friends house her mom was of Arabic heritage and I have been wondering what it was called or how it was made ever since:) I understand that this particular recipe was only inspired by the original dish still I couldn't help omitting the cauliflower and broccoli as they are not usually part of the middle eastern cooking. Even though looking for authentic I made some changes to match this dish to our liking for example didn't fry the veggies in oil but merely sauteed them in 1 tablespoon of butter. If you choose to do so as well I recommend doing the zucchini first and then adding a little more butter/oil to your pan and sauteing the eggplant second as it has the ability to absorb crazy amounts of oil (probably why another reviewer found it very soggy). I used basmati rice and it does cook a little faster still like the original poster commented 7 cups of water is way too much even with 5 cups you will have to let it simmer with an open lid for at least 10 minutes so I would recommend not using more than 3-4 if your rice cooks faster. For the dish to hold form the rice should absorb all the water. Even with these changes we simply loved this dish I garnished with cayenne and dried mint as I found these would compliment this dish the most. Thank you:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "fakeymcfake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3715062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-01T02:48:09.73Z",
                "reviewBody": "My husband is middle eastern and we make this frequently.  We only use the eggplant and cauliflower though.  After frying the vegetables you need to salt them prior to layering them with the rice.  We use basmati rice which we soak for 20 minutes in hot water to soften it.  Drain the rice and mix with salt and the same spices used to make the meat-this combined with the soup from the meat should give the dish enough flavor for those saying there is not enough salt. I have made this with lamb and with chicken...both are delicious.  We also saute pine nuts or almonds and sprinkle over the top once it has been flipped along with some fresh chopped parsley",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jadedgurl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6514428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-26T03:50:55.533Z",
                "reviewBody": "This is an awesome dish. My husband is from Jordan and he loved it. I must admit it did take some work but it was well worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie Lopez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2894551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-27T17:29:57.5Z",
                "reviewBody": "I added all the reserve liquid - I should have known it was too much. By the time it simmered off my rice wasn't a grain anymore - more like mush. I will definitely start with less liquid next time to spike the flavor and save the texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christa Morse-Haggard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/964904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-10T21:24:01.953Z",
                "reviewBody": "I am so happy I found this recipe! My Jordanian mother in law makes this (and all sorts of variations...uses chicken and cauliflower only sometimes lamb). She tried to tell me how to make it (sounds exactly like this) but had no idea the amounts. I can't wait to make this - it is yummy! I especially like when you just use chicken and cauliflower since I'm not a lamb fan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nova",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-22T00:43:12.603Z",
                "reviewBody": "It is an interesting recipe! Our family seemed to enjoy it: even my 14-years old sister who does not like eggplant or zucchini or broccoli asked for seconds. However I thought the recipe was a bit bland. If anything it needed a lot more salt. When I cooked it I substituted mushrooms for the cauliflower and used sour cream instead of yogurt. I didn't need all of the liquid in fact I had a bit to drain before I flipped it. I'm looking forward to see if the leftovers are tastier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Povareshka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2493526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-31T19:00:52.33Z",
                "reviewBody": "Great recipe!! everyone loved it. I only used eggplant and zucchini left out the other veggie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.Khan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5269957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-16T17:52:15.053Z",
                "reviewBody": "It was ok but not that tasty. If I were to make it again I'd have to spice it up a lot more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2786139/"
                }
            }
        ]
    }
]