[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/160890/pierogi-from-granny/",
        "name": "Pierogi from Granny",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1113870.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-04T03:45:49.000Z",
        "description": "This is a recipe my Polish grandmother used to make. Although I don't like a lot of Polish food, this is a family favorite I love. It is a lot easier and faster if two people make it together.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "50 pierogi",
        "recipeIngredient": [
            "3 large potatoes - peeled and cubed",
            "2 tablespoons butter",
            "3 slices bacon, finely chopped",
            "3 onions, finely chopped",
            "1 ½ pounds ground beef",
            "½ pound ground pork",
            "1 (8 ounce) package mushrooms, minced",
            "1 tablespoon chicken bouillon granules",
            "salt and pepper to taste",
            "1 tablespoon chopped fresh dill",
            "3 ⅔ cups all-purpose flour",
            "1 cup self-rising flour",
            "2 eggs, lightly beaten",
            "1 pinch salt",
            "1 cup water, or as needed",
            "1 egg, beaten",
            "¼ cup butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place potatoes into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two, then mash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt 2 tablespoons butter in a large pot over medium-high heat. Add the bacon, and cook until the fat begins to render, and the bacon begins to brown, about 5 minutes. Stir in the onion, and continue cooking until the onion softens and turns translucent, about 5 minutes. Stir in the ground beef and ground pork; continue cooking until crumbly and no longer pink, about 10 minutes. Finally, stir in the minced mushrooms, chicken bouillon, salt, pepper, and dill. Cover and cook until the mushrooms soften, about 5 minutes more. Stir in the mashed potatoes, then set the filling aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk the all-purpose flour and self-rising flour together in a large bowl, and make a well in the center. Add the 2 beaten eggs, salt, and enough water to form a soft dough. Knead on a well floured work surface until smooth and pliable. Roll the dough to 1/8 inch thick, then cut into 5 inch circles.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon the filling onto one side of each of the dough rounds, then moisten the edges with the remaining beaten egg, and fold to create half circles. Press the edges together firmly to seal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Drop the pierogi in a few at a time, and boil until they float to the surface, about 2 minutes. Once the pierogi have cooked, remove with a slotted spoon, and rinse until cold; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the remaining 1/4 cup of butter in a large skillet over medium-high heat. Add the boiled pierogi, and cook on both sides until hot and golden brown, about 5 minutes. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "silkdiver"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6923076923076925,
            "ratingCount": 13,
            "itemReviewed": "Pierogi from Granny",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "115.6 calories",
            "carbohydrateContent": "13.5 g",
            "cholesterolContent": "26.2 mg",
            "fatContent": "4.3 g",
            "fiberContent": "1 g",
            "proteinContent": "5.5 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "72.3 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-24T17:57:21.817Z",
                "reviewBody": "The \"ready time\" for this recipe is more like 3 hours. That's if you have little experience working with dough and are doing this by yourself. But it's totally worth it. I made these because it's a tradition in my husband's polish family to have perogi with Christmas dinner. Some tips for handling the dough. Make sure you use really cold water adding a little at a time as you really work the dough with your hands turning and squeezing. I used just under a cup of water. I snaked it like another reviewer suggested. Kneed the dough like directed then roll it out into a long snake about 2-2&1/2 inches thick. Then with a knife make a slight indent in the center of the snake then 2 more on each side of the mark an equal distance from the ends and center and repeat. Just under half inch is about the right width to make 50 pierogi. Then cut a piece lightly flour on each side flour your rolling pin and roll out flipping the dough to create a circle. Mine were slightly smaller than 5 inches but that made for a firmer pierogi. Then continue following the recipe's directions. I ended up with half the filling left over so I plan on making another batch the day after Christmas just for us. I ate one of the pierogi's tonight (have to make sure they're good since I didn't follow the family recipe) and they're delicious! We always eat our perogi's with pan fried onions and bacon and sour cream on the side.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FieldGreens",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/165545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-11T17:55:56.48Z",
                "reviewBody": "Awesome!  My Stepdad's mom was Polish and I loved her dearly She was 101 when she passed and eating these makes me think of her & her wonderful kithchen - she made the best and this is the closest to her's.  I pretty much think its common sense to break up the meat when its going to be stuffed in dough, but thats just me :) - I find that the dough works best for me when I form a long snake shape, slice rounds from it and then flatten further into nice circles, a touch of the rolling pin and wallah! Sometimes I add a bit of seasoning to the dough too - A recipe is a guide, not a rigid unbending law - after all everyone has different tastes, stoves and probably hubbys that are picky,picky, picky! (he loves these pierogi's though) thanks silkdiver :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sheila",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sheilac/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-29T01:38:08.737Z",
                "reviewBody": "This is great! I read the reviews before and wanted to clarify being that I am polish that these reminded me the most of my busha making pierogi. The dough is ment to be a pasta dough which does make it more difficult to work with but I think most of us that make pierogi are looking for replicating something from our childhood this comes so close! thank you silkdiver!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LizN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4122592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-20T17:30:08.93Z",
                "reviewBody": "The filling was delicious though a bit heavy and it is important to really break up the meat. I did not like the dough at all. More like a pasta dough and difficult to roll out. I did not like having to boil them and then fry them in lots of butter to brown them. I found another recipe for a yeasted dough that is baked that worked much better (Pike Place Market cookbook pg.21)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "EdiEats",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2949638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-14T17:01:11.97Z",
                "reviewBody": "I am not Polish. The first time I ever heard of a pierogi was on the food network. I have eaten the frozen pierogis that you buy already made in the freezer section of the supermarket. Wow! This was fantastic! I used beef boullion instead of chicken. I had no mushrooms so I omitted them and added cheese instead. This is really a flexible great recipe. Do not hesitate to use this recipe as a formula or outline You are in for a fantastic satisfying comfort food.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BroBro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4985423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-24T04:38:58.063Z",
                "reviewBody": "This recipe was awesome! I had never made pierogi's before and found this recipe easy to follow. All good things take time. I cut the prep time into two sessions by making the filling in the morning and refrigerating it until closer to dinner time making the whole thing seem easier than it is. I uploaded some needed pictures. Thanks Granny I made this only because it was a recipe from Granny.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tastygood!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13367182/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-27T20:40:39.6Z",
                "reviewBody": "This was wonderful! Since moving to the UK I haven't had a pierogi and I was telling my Scottish husband about them I ran across this recipe and it did not disappoint. I didn't have ground pork or mushrooms and I had made mashed potato with truffle oil the night before so I used that and a full packet of smoky bacon. I served it with hollandaise sauce and a poached egg with mushy peas very good very filling I already have requests to make more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ladybug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4145193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-07-30T00:48:33.937Z",
                "reviewBody": "I've tried several different recipes for pierogies and this one takes the cake. The dough is perfect and holds up to the boiling and frying, the mix is hearty and filling, you can alter the filling as you please, and no instruction is left out. They may take a while but that is what it takes to make the best pierogi. I hope to find more recipes from \"Granny\" because if they're half as good as this one, they'll be some of my favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rikki Sharbaugh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7771414/"
                }
            }
        ]
    }
]