[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
                    "name": "Dips and Spreads Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17192/appetizers-and-snacks/dips-and-spreads/cheese-dips-and-spreads/",
                    "name": "Cheese Dips and Spreads Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45657/best-formula-three-cheese-fondue/",
        "name": "Best Formula Three-Cheese Fondue",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4881109.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T06:44:45.000Z",
        "description": "We tried a couple of recipes; this was voted the best!  The Gruyere gives a very sweet and nutty flavour to the fondue, the sharp Cheddar makes it tangy, and the Emmentaler blends it all.  Cooking the flour first helps the mixture not to be so pasty and powdery.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "1 cup white wine",
            "1 tablespoon butter",
            "1 tablespoon all-purpose flour",
            "7 ounces Gruyere cheese, cubed",
            "7 ounces sharp Cheddar cheese, cubed",
            "7 ounces Emmentaler cheese, cubed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring the wine to a boil in a small saucepan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt the butter in a medium saucepan over medium low heat. Whisk in the flour, and cook  for about 5 minutes, stirring constantly to avoid sticking and burning.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the flour is cooked, stir the wine into the flour mixture slowly.  Use a whisk to smooth the mixture. Slowly add cubes of Gruyere, Cheddar, and Emmentaler cheese; stir until cheese is melted. Transfer cheese mixture to fondue pot. Keep warm over low flame.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Dips and Spreads Recipes",
            "Cheese Dips and Spreads Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AhLimP"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.404,
            "ratingCount": 250,
            "itemReviewed": "Best Formula Three-Cheese Fondue",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "112.9 calories",
            "carbohydrateContent": "0.7 g",
            "cholesterolContent": "26.6 mg",
            "fatContent": "8.3 g",
            "fiberContent": null,
            "proteinContent": "6.9 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "119.8 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-19T05:44:32.67Z",
                "reviewBody": "While the ingredients made a great flavored fondue, the recipe itself is vague at the most. After following the recipe to a T and spending nearly 17 bucks on good imported cheeses, the fondue failed. I searched around online to see what went wrong and found that:\r\n\r\n1.) Wine should never be boiled-simmer it instead.\r\n\r\n2.) The right wine makes all the difference. Fondue needs a wine with high acic levels to break down the proteins in cheese. Chardonay is bad Sauvignon is good. You can fix a failed fondue by heating it up again and adding lemonjuice. The acids in the lemon juice break down the cheese and makes it more melty.\r\n\r\n3.) Cubes? What, 1\" cubes? 3\" cubes? Tiny, tiny, might-as-well-be-shredded cubes? Just shred your cheese.\r\n\r\n\r\n\r\nI fixed the \"voted best\" fondue recipe with lemon juice. I'm guessing whatever made this recipe work for others probably had something to do with the quality of their cheeses (more emulsifiers melt easier), or the type of wine they used, or they're \"ghost writers\" related to the author.\r\n\r\nI'm giving this recipe a single star based on it's lack of informaton and clarity.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "QWERTYCAKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1030859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-20T19:42:05.55Z",
                "reviewBody": "As you sift through the reviews here, you should chuckle at the ones which ding the recipe review and at the same time tell you all the changes they made to the formula to make it cheaper, more kid friendly, or less authentic.  This recipe gives you what you need for a good fondue foundation, which is the most important thing.  Here are a few of my tweaks to make it even better...for adults.  Foodies, hopefully.  First of all, don't use a heavily oaked white wine, like most CA or Aussie chardonnays.  Use something like a sauvignon blanc, a Portugese vinho verde, or a light dry riesling.  The lower the alcohol and drier the better for this recipe.  Some reviewers mentioned shredding the cheese instead of cubing it and I heartily concur.  And DO mix the flour into the shreds as it both blends the stuff well and it keeps the cheese from clumping.  I use a little more flour than posted here but that doesn't seem to be much of an issue.  On the cheeses, just make sure you don't skimp on the Gruyere as it makes the flavor correct.  If you are cutting back on one of the cheeses versus the others, make it the cheddar, not the more elegant Swiss cheeses.  I don't care if kids don't like it - folks, we're serving an adult dish made with wine here.  If you want Cheez-Whiz in a pot, melt some Velveeta into some orange soda.  If you really want good authentic flavors, do grill/caramelize a couple of garlic cloves into the fondue pot before you add the wine & cheese.  Sprinkle in a half a ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "john",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3477771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-11T19:42:01.403Z",
                "reviewBody": "I made this for my husband and he loved it!  I do have a few suggestions - First, DO use a Sauvignon Blanc for the wine. Second, SHRED the cheeses and toss the tablespoon (or so) of flour in with the shredded cheeses instead of cooking with the wine.  Using a double boiler or Fondue pot typically used for chocolate will also help keep this from clumping and/or burning.  Last, I omitted the butter and rubbed the pot with a garlic clove before simmering the wine.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kchristen.co",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-29T01:10:15.277Z",
                "reviewBody": "I'm rating this four only because of the changes I made. First... don't use cubed cheese - use shredded. Second make sure you pick the right wine. I decided \"white wine\" was WAY too vague. I used a very dry Riesling and it turned out beautifully. Also toss your shredded cheeses with the flour before putting into the pot. Lastly if you enjoy garlic rub a clove inside the fondue pot. Delish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bethy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1853237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-23T22:13:45.423Z",
                "reviewBody": "With only two of us, we halved the amount of cheese. We also doubled the wine, so our recipe was 4 oz of each cheese, grated, and 1 cup of wine (sauvignon blanc). We followed the comment of using 3 Tblsps of cornstarch (1 1/2 here) and eliminating the butter. We have an electric fondue pot so we just put the wine right in the fondue pot, heated it and added the cheese to the pot after mixing the cornstarch into the cheese. It turned out terrific!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pecos41",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2274493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-25T14:25:22.17Z",
                "reviewBody": "This fondue was absolutely fabulous, I've been thinking about it ever since we had it three days ago!  We couldn't find Emmentaler, so we used Edam, and we also added some fresh herbs: chives and a little cilantro, that added some great flavor.  Afterwards I also heard on a cooking show that if you add a bit of lemon juice to the cheese fondue it keeps it from getting stringy.  I highly recommend this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSANADELIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1222801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-11T16:40:25.39Z",
                "reviewBody": "I made this for a christmas fondue party on the 22nd. It was fabulous! The cheeses blended easily the wine and chedder added just the right tang. I'll make it again for New Year's! (I ended up using 8oz of each cheese as they were available in half pound blocks from my grocer).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/147320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-19T17:55:50.717Z",
                "reviewBody": "This recipe was a big hit with my family. It was delicious with apples and french bread. Grating the cheese did help to make it melt faster and a few drops of lemon juice took care of the clumping problem. We had to fight over the last drops at the bottom of the fondue pot! Next time I will make more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1628900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T14:28:39.83Z",
                "reviewBody": "Really good fondue! I used a half pound of each cheese (which I shredded and added to the pot a handful at a time till melted) a New Zealand sauvignon blanc and served with veggies granny smith apples bosc pears and a crunchy loaf of bread from a specialty bakery. I had no problems with stringiness. It was a smooth creamy fondue that everyone loved. In fact we were using the bread to mop up the remaining drops in the fondue pot. Thanks for sharing the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DKBECK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1439594/"
                }
            }
        ]
    }
]