[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/230/world-cuisine/latin-american/caribbean/",
                    "name": "Caribbean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/163866/cuban-picadillo/",
        "name": "Cuban Picadillo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1401830.jpg",
            "width": 1536,
            "height": 1536
        },
        "datePublished": "2019-04-04T03:46:00.000Z",
        "description": "I received this wonderful recipe of beef, olives, and sweet peppers from my son's Cuban grandmother. We serve it over black beans and rice with fried plantain on the side, it's amazing!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 pounds ground beef",
            "½ onion, chopped",
            "2 tablespoons garlic, minced",
            "1 red bell pepper, chopped",
            "1 green bell pepper, chopped",
            "2 cups raisins",
            "2 (8 ounce) jars green olives, drained and chopped",
            "2 (6 ounce) cans tomato paste",
            "½ cup water",
            "½ bunch cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Brown the ground beef in a Dutch oven or large pot over medium-high heat until crumbly and no longer pink, about 10 minutes. Pour off any excess grease, then stir in the onion and garlic; cook for 2 minutes before adding the red pepper, green pepper, raisins, olives, tomato paste, water, and cilantro. Bring the mixture to a simmer, then reduce heat to medium-low, cover, and simmer 10 minutes, or until the peppers have cooked to your liking.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Caribbean"
        ],
        "recipeCuisine": [
            "Latin American",
            "Caribbean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "booghierbaby"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.465909090909091,
            "ratingCount": 88,
            "itemReviewed": "Cuban Picadillo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "539.3 calories",
            "carbohydrateContent": "44.5 g",
            "cholesterolContent": "103.4 mg",
            "fatContent": "27.6 g",
            "fiberContent": "4.6 g",
            "proteinContent": "32.9 g",
            "saturatedFatContent": "8.7 g",
            "servingSize": null,
            "sodiumContent": "1786.2 mg",
            "sugarContent": "31.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-08T14:57:34.047Z",
                "reviewBody": "This recipe is very close to what Cuban Picadillo should be, but it was missing a few steps.\n\nI was pleased to see that all the ingredients were included, some people can't see why olives and raisins should co-exist in the same dish... try it, delicious.\n\nWhat I saw was missing was the beginning step. Picadillo, and practically all Cuban bean dishes are cooked into a \"sofrito\". A sofrito consists of a can of tomato sauce, an equal amount of water, garlic, onions, salt, and whatever herbs you prefer (typical cuban food uses a lot of oregano and I like to add cumin and a laurel leaf to my picadillo). Simmer the sofrito so that the garlic and onions start to cook and reduce the liquid to about 75%. Then add the beef to brown in the sofrito. Add the olives and raisins in as well so that the flavors incorporate with the rest of the pot. Add everything else in until the picadillo is cooked and the sauce is in the consistency you desire.\n\nServe with white rice or a side of Frijoles Negros, some Cuban bread, tostones, and a salad... and you'll be a HAPPY CUBAN FOODIE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mimosa1028",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3017789/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-29T23:26:04.687Z",
                "reviewBody": "being cuban ive eaten picadillo all my life at family get-togethers or restaurants and never, not once, have i had it with cilantro. traditional picadillo does not call for cilantro, so if you want to try picadillo at its utmost authenticity, omit the cilantro. it will be fabulously seasoned with the raisins and olives without the pungent odor or taste of cilantro. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cbncutie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3514619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-25T00:47:18.403Z",
                "reviewBody": "I have been looking for a good picadillo recipe since I grew up in Miami and this type of cuisine is common. I love the sweet/salty flavors of the raisins (I used golden raisins as I've never seen it served with black raisins in Miami) and olives. I'm not a big olive fan per say but the flavors meld nicely that you don't go \"hey this has olives eww..\":) Almost all of the ingredients are there but I switched up the order. I started with the traditional Sofrito before I even cooked the beef. (Saute onions garlic in olive oil until clear then add cumin oregano red pepper two 8 oz cans of Goya tomato sauce and red and green bell peppers then letting liquid reduce/thicken) To this I added the remainder of the ingredients and then let the liquid cook down into the ground beef. Don't worry if it seems like you're not actually \"browning\" the ground beef with all the liquid present as the sauce eventually evaporates and makes the beef very flavorful. I served this with white rice and tradionally seasoned black beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Shippee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2786284/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-09T01:01:56.477Z",
                "reviewBody": "Made this twice..this is what Ive learned. Instead of tomato sauce...Sofrioto (similar to tom sauce but has lots of herbs blended that really add to flavor) it is made by Goya can be found in the ethnic food isle (WalMart). The first time I made this I used Sofrito but the 2nd time I used tomato paste...big difference in taste. I invited my Cuban grandmother over for dinner and she said \"Its good...but you need to use Sofrito and wheres the capers and bay leaf?\" She uses bayleave in everything and she is a 90yr old Cuban who can cook her tail off. Next time...I will follow diections but modify it a bit using only Sofrito 1/2 the raisins 2oz capers and don't forget grandmas bay leaf! TIP: this tatses great but its the best 2-3 days after its made when the olives seem to really add even more flavor. I LUV IT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda Garcia Glass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2784547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-01T14:32:42.857Z",
                "reviewBody": "I am cuban and I have never used cilantro in my picadillo. Also,use diced tomato not paste and add dry sherry and let it simmer.That's the way my family always made it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2215694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-05T13:02:36.12Z",
                "reviewBody": "this is a tasty recipe very close to a dear cuban mother of a friend of mine with a couple additions as another reviewer mentioned. do not leave out raisins and olives. i also add chopped tomatoes cumin a bay leaf and a dash of red pepper flakes and stock instead of water. one of the tastiest ground beef recipes up their with spaghetti sauce!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "whiteorchidbloom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1477352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-26T02:13:52.31Z",
                "reviewBody": "I absolutely loved this recipe. I have been cooking Cuban and Mexican food for the past few years now. This is my first attempt at Picadillo. I did make the recipe in a smaller amount (for 2) but there was still enough for leftovers! I did improvise and modify a few ingredients however. I omitted the cilantro as no Picadillo recipe I have ever had has had Cilantro in it. It's got a strong flavor when used in a big amount like this recipe calls for. First things first though I made some homemade Sofrito as per reccomendation of some other reviews. It really made the meat flavorful for sure. Also make sure to cook/brown the meat IN the Sofrito as it adds so much flavor. If you get extra lean ground beef you don't have to worry about fat or grease. And I added capers about 2 tbsp worth for a meal for 2. I also used 3/4 of the raisins it called for as well as the olives. I rinsed the olives before adding to get rid of excess salt. I seasoned my meat with Oregano and Cumin before adding to the Sofrito. I let it sit and kind of marinate in the herbs before cooking. I also let the whole mixture marry in the pan for about an hour to get the extra flavor out of all the vegetables. Most importantly I added 2 bay leaves. I think this made a huge difference. I let the Sofrito cook down a bit and reduce before adding the meat also. It came out perfect with all of the modifications I made! Give it a try and I'm sure your family will absolutely love it. I let my kids try it - A",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah McCormick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5071526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-08T23:48:43.937Z",
                "reviewBody": "Great recipe! Very close to authenic!! Just made a few changes added a little salt and used half if the green olives.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "alleyezonjay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2907441/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T22:32:33.927Z",
                "reviewBody": "What a delightful dish! Ok I did make some changes after reading the reviews. I made half a recipe. I sauted the onions and garlic then made the sofrito by adding to pot 16 oz. of tomato sauce an equal amount of water the chopped sweet red pepper 1 tsp. oregano 1 tsp. cumin 1 tsp. coriander 3/4 cup raisins 1-5oz. jar of green olives sliced in half a half jar of the olive brine 1/8 tsp. hot pepper sauce 1/8 tsp. red pepper flakes. I brought this to a boil added the uncooked ground beef and let it all cook down. It tastes fantastic! The hot sauce and red pepper flakes did not make it hot just mellow. I am serving it over brown rice. I was going to make coconut rice as another reviewer did but decided the raisins made it sweet enough. I have not had much Cuban food in my lifetime and this is a real treat! Thanks to the other reviewers for their good comments and thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookin'gal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4046777/"
                }
            }
        ]
    }
]