[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17046/soups-stews-and-chili/stews/goulash/",
                    "name": "Goulash Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/182157/smoked-paprika-goulash-for-the-slow-cooker/",
        "name": "Smoked Paprika Goulash for the Slow Cooker",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F221228.jpg",
            "width": 3296,
            "height": 2472
        },
        "datePublished": "2019-04-04T03:47:13.000Z",
        "description": "This is a very rich and flavorful beef dish with a thick, red, smoky tasting sauce. Great for making a day ahead and reheating. Instead of noodles, you can serve over rice or potatoes.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "3 onions, sliced",
            "3 cloves garlic, chopped",
            "¼ cup smoked Spanish paprika",
            "2 teaspoons kosher salt",
            "1 teaspoon coarsely ground black pepper",
            "3 pounds lean <a href=\"https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/\" aria-label=\"beef stew\">beef stew</a> meat, cut into 1-inch cubes",
            "3 tablespoons vegetable oil, divided",
            "1 ½ cups water",
            "1 (6 ounce) can tomato paste",
            "1 (10 ounce) package egg noodles",
            "½ cup sour cream",
            "8 sprigs fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon oil in a large skillet over medium-high heat. Cook and stir onions until they soften and begin to brown at the edges, 8 to 10 minutes. Add the garlic and cook for one minute. Transfer mixture to a slow cooker. Cover and set cooker to Low.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together paprika, salt, and pepper in a large bowl. Toss the meat cubes in the paprika mixture until evenly coated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat one tablespoon of the oil in the skillet over medium-high heat. Put a third of the beef cubes into the skillet and cook until nicely browned on all sides. Transfer to the slow cooker. Pour 2 tablespoons of water into the skillet and scrape the browned bits from the pan; pour liquid into the slow cooker. This prevents the paprika from burning when you brown the next batches of beef. Add another tablespoon of oil to the skillet and cook the next batch the same way; repeat for the third batch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the tomato paste and the rest of the water into the slow cooker; cover. Cook on High for 4 to 5 hours (or on Low for 6 to 9 hours).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the egg noodles, and cook  uncovered, stirring occasionally, until the noodles have cooked through, but are still firm to the bite, about 5 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Serve goulash over noodles with a dollop of sour cream and a sprig of parsley.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Goulash Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tara Jill Emerson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.102739726027397,
            "ratingCount": 146,
            "itemReviewed": "Smoked Paprika Goulash for the Slow Cooker",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "642.5 calories",
            "carbohydrateContent": "38 g",
            "cholesterolContent": "182.4 mg",
            "fatContent": "28 g",
            "fiberContent": "4.5 g",
            "proteinContent": "59.1 g",
            "saturatedFatContent": "9.5 g",
            "servingSize": null,
            "sodiumContent": "795.3 mg",
            "sugarContent": "5.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-03-05T04:04:04.83Z",
                "reviewBody": "Other than braising this on the stove-top in a Dutch oven (four hours – three was not long enough) because I started it too late for the slow cooker, I made this as is – and I can’t imagine anything could be done differently that would have improved this.  I was a little gun shy using all smoked paprika and had briefly considered playing it on the “safe” side by using it half and half with sweet paprika.  I thought about substituting wine or broth for the water.  I entertained the idea of adding mushrooms.  In the end, however, I decided against all those changes I thought might make this “better” and in so doing we had a 5-star dinner resulting in clean plates and no leftovers.  The meat is fork tender and the beautiful gravy thick, rich and boldly flavored.  Different paprika, broth or wine rather than water, additions such as mushrooms – all unnecessary.  There was enough depth and character to the dish with the onions, tomato paste and, of course, the smoky paprika.  An absolutely delicious and satisfying cold weather dish with good old-fashioned charm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T22:50:53.097Z",
                "reviewBody": "The amount of salt in this recipe was corrected by the Staff on 2/18/2009.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the allrecipes staff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-21T00:42:42.04Z",
                "reviewBody": "My family really really enjoyed this. I thought it tasted great. Funny hubby said more salt and zing other then that he'd like me to make it again....Me and the kids thought it was excellent. I ate it with out the noodles while everyone ate it with the noodles. Thanks for the recipe. It's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T16:28:30.527Z",
                "reviewBody": "This was an awesome dish! I only used 2 lbs of beef stew meat and cut the salt down to less than 1 tsp 2 tsp is way too much. In place of the water I used low sodium beef broth which was even more of reason to keep the salt to a minimum. One large vidalia onion was plenty of onion for this dish. My last modification was that I used sweet Hungarian paprika in place of the smoked as my store was fresh out of smoked paprika. I always use sweet Hungarian paprika in all my goulashes and paprikash type dishes anyway although I would love to try this with the smoked next time. I served this over egg noodles with a spoon full of sour cream on each dish. I used a large saute pan and was able to brown all my paprika covered meat at the same time however I only used 2 lbs so that is probably why. Do try this it is great!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erika Rekelhoff Fogarty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/536050/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-04T16:15:40.59Z",
                "reviewBody": "This recipe is fantastic but it is NOT goulash! Goulash is a soup. However this is so very tasty that I have to remember that people call things by different names. This is actually closer to Paprikas which is very good also. The key is to use SMOKED paprika. Sometimes it is very hard to find. Regular paprika does not have the same flavor. You want to try and find Pimenton dulce as that is the sweet smoke paprika. Excellent recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marty Courtney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1941980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T23:58:19.923Z",
                "reviewBody": "Very good.  I cooked on the stove top instead of a slow cooker for about 4 hours or so on very low.  This makes a tasty gravy.  I used half beef broth and half red wine instead of water (why add water when you can add flavor?) and bacon drippings to saute the beef but otherwise kept the ingredients the same.  I did not sprinkle the meat with the paprika while browning; I sprinkled as it came out of the pan.  We'll make this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "wisweetp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sogirl_2/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-27T20:51:07.73Z",
                "reviewBody": "So tasty! I modified this to cook on the stovetop since I didn't have 4-5 hours to make it as written. Smoky rich and flavorful sauce that my daughter and husband raved about - next time I will plan ahead add green bell peppers tomatoes potatoes and carrots and use my crock pot. Maybe I'll challenge my mother-in-law to a goulash cook-off!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SandyMC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2456104/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T22:23:41.01Z",
                "reviewBody": "There are few things worse than too much salt in a dish. Perhaps the measurement should be in teaspoons instead of tablespoons. It's a shame because otherwise I think this would have been pretty good. Seriously the goulash was so salty that it was inedible. I tried the usual remedies to no avail. I followed the recipe to the letter. I think this recipe is worth trying just for the smoked paprika.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2720575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-16T20:05:08.927Z",
                "reviewBody": "This was one of the best crockpot dishes I've ever had the pleasure of making as well as eating! After reading several reviews I did alter the recipe quite a bit. First off my supermarket had a special on pork stew meat so I ended up using three pounds of that. I couldn't find smoked paprika anywhere so I ended up using regular. I also used a rub from \"Grill Masters\" which was called \"Sweet and Smoky Rub\" which tasted phenominal! It did have smoked paprika as well as a hint of cinnamon and also chitpolte powder. I also cut down the onion to one large one and added two red peppers because I've heard paprikash should always contain red peppers! I also used one package of fresh baby Portabella mushrooms. I also added one can of chopped tomatoes as well as the tomato paste. I did cook it for about 5 hours on low yesterday and when it was cool I refrigerated overnight. Tonight I threw it back in the crockpot for about three hours on low and I did serve it over egg noodles. I had some dinner guests this evening and they could not stop talking about how wonderful it was! I would definately make it to serve the next day as the taste and the texture of the meat was meltingly tender. All in all....an awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mek48",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4533788/"
                }
            }
        ]
    }
]