[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15510/bread/yeast-bread/egg/",
                    "name": "Egg",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14742/bread/yeast-bread/egg/challah/",
                    "name": "Challah Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/181046/irresistible-whole-wheat-challah/",
        "name": "Irresistible Whole Wheat Challah",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1515332.jpg",
            "width": 2260,
            "height": 1735
        },
        "datePublished": "2008-11-07T01:05:39.000Z",
        "description": "Warm and light, fresh out of the oven with butter and salt sprinkled on top, it is a delicious gift or dessert for any occasion. Best with whole wheat, but just white flour or a mixture works. It is easy and fun, but takes all day. Trust me, it is so worth it!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "4 cups whole wheat flour",
            "1 teaspoon salt",
            "2 ¼ teaspoons active dry yeast",
            "2 tablespoons vital wheat gluten",
            "½ cup honey",
            "½ cup olive oil",
            "1 cup warm water",
            "2 eggs",
            "¼ cup raisins, to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour, salt, yeast, and vital wheat gluten until well mixed. In another bowl, stir together the honey, olive oil, water, eggs, and raisins. Pour the liquid mixture into the flour mixture, and stir until it forms a dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough out onto a floured surface, and knead until smooth and elastic, about 10 minutes. Form the dough into a round shape. Lightly oil a bowl, place the dough in the bowl, and turn the dough over a few times to oil the surface. Cover the bowl with a cloth, and let rise in a warm, draft-free place until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough, knead it a few times to remove some of the bubbles, and cut it into 2 equal-sized pieces. Set 1 piece of dough aside under a cloth to prevent drying out while you shape or braid the first loaf as desired.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working on a floured surface, roll the small dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Repeat for the other loaf, place the braided loaves on a baking sheet lined with parchment paper, and let rise in a warm place until doubled, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown, about 30 minutes. Serve warm for best flavor.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Egg",
            "Challah Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HopelessFanatic"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.54320987654321,
            "ratingCount": 81,
            "itemReviewed": "Irresistible Whole Wheat Challah",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "215.1 calories",
            "carbohydrateContent": "32.9 g",
            "cholesterolContent": "23.3 mg",
            "fatContent": "8 g",
            "fiberContent": "3.9 g",
            "proteinContent": "5.8 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "157.1 mg",
            "sugarContent": "10.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-15T20:07:46.883Z",
                "reviewBody": "I made a half recipe, just in case I wasn't crazy about it, and took it to my synagogue this morning (Saturday) for our small Sabbath service (our big one is Friday night).  Everyone went CRAZY when they tasted this!  It is super good, moist, very flavorful, with a nice chewiness to it.  They asked me to make it again, and often!!  I make challah for my husband (and me) every week, and he told me I could switch to this one!  I did use the wheat gluten, and I didn't use raisins, since I knew there would be people this morning who don't like raisins.  I will make it next Friday for our home challah WITH raisins, since my husband loves them.  Thanks so much for this!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marsha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1566483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-23T19:51:09.75Z",
                "reviewBody": "This was absolutely delicious! By far the best and sweetest whole wheat Challah I've made! I'll definitely stick with this recipe.... I didn't use the vital wheat gluten or raisins.... It also didn't rise out of the oven much, and took longer than 30 mins in the oven but it came out to be lighter and sweeter than most whole wheat breads! Thank you! UPDATE: If you first proof yeast with water and then add it when you mix both dry and wet ingredients, It rises much more..... I make this every week for shabbat dinner and have gotten many many requests for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kosher tx cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4161488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-02T18:47:20.173Z",
                "reviewBody": "I had been looking for a whole wheat bread machine challah recipe for a while.  I tried various recipes, without much luck.  Finally, I decided to look for a regular whole wheat challah recipe and make the dough in my bread machine -- I tried this recipe, and it turned out great!  I substituted agave for the honey and left out the wheat gluten and raisins.  The bottoms of my loaves ended up a little dark; I might reduce the baking time a little.  I know I will make this over and over again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "miriyummy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3684984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-19T17:16:37.897Z",
                "reviewBody": "We tried many different challah recipes trying to get something close to a whole wheat version of Cheryl Ann's challah in Boston. Everything else was too dry but this is very moist. I double the recipe and make 4 loaves at a time and freeze what I don't use. I do all the mixing and kneading in my kitchen aid mixer. I have made a few minor changes from a direct doubling of ingredients. I use 1/2 cup honey and 1/2 cup sugar 1 tablespoon salt and 5 eggs instead of 4. I also proof the yeast in 1 cup warm water in a 2 cup measuring cup until it's bubbling near the top and add it as a liquid ingredient. I use the wheat gluten even though it's listed as optional but not the raisins. I cut the total water to 1.5 cups instead of 2. I also typically need more rise time than the recipe calls for and gt a better result if I can make the time to lunch down the dough and give it a second rise before I braid it. Overall this recipe is a winner even among people who don't usually eat whole wheat. For the Cheryl Ann's fans out there this is less sweat than Cheryl Ann's but just as moist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Rosenblum Lichtenstein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5236094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-23T23:40:03.923Z",
                "reviewBody": "This is a delicious recipe! I've made it twice now and noticed a big difference in rising/texture when I let it rise in a warm place as instructed. The warmth really helps make it light and airy. I'm new to making my own bread and even mine came out great! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy Grey Chipriano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2741379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-08T16:24:27.31Z",
                "reviewBody": "Excellent recipe. The texture is very moist for a whole wheat challah. Many people assume that in order to make a good whole wheat bread you must combine white flour and whole wheat here's a recipe that proves that theory wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jenni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1051805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T22:22:03.41Z",
                "reviewBody": "This challah is the best whole wheat challah I've ever made. However the method is not fool proof because you don't proof the yeast first. So I had a batch that didn't rise. Annoying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rharris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1503925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-06T21:51:06.667Z",
                "reviewBody": "This recipe is fantastic! 5 stars however many bakers may find that they need to add a little more flour because the dough is too sticky. My recommendation is to only add 1 tablespoon at a time until the dough is very tacky but not sticking to your hands. The flour takes time to absorb all the water and the dough will become less sticky after the last rise. You do not want to add too much flour. Dry dough = dry bread. I let my dough rise a total of 3 times for lighter loaf. After kneeding let the dough rise for 20 minutes Punch down. Let rise for 60 min (2nd rise) Punch down. Shape into a braid. Let rise 45-60 minutes (3rd rise) Then bake in a preheated 350 degree oven for 30 minutes as the recipe directions specify turning the pan once too ensure even browning. I highly recommend the most fantastic Challah Braiding tutorial from utube user from \"Titli Nihaan The Bread Kitchen\" It's the best braiding video that I have found yet! I'll add it below. It's very easy to follow and shows you how to braid with multiple strands. it has examples of 3 4 5 6 7 8 or 9 strand braids. Amazing! You can stop and start the video at your will and rewind again and again until you master the art good luck! https//www.youtube.com/watch? V=RP6j7esQyjk",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth Kessler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2484876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-30T18:24:58.757Z",
                "reviewBody": "Very nice bread! I braided one half of it and used the rest of it for a regular loaf. I put it at 375 which works best for my oven for about 35-40 minutes and they both came out perfect. This isn't really a heavy wheat bread even though it's all ww. I used the vital wheat gluten so I wouldn't have to wait for it to rise for 2 hours and made the dough itself in the breadmaker then went from there. Very nice--thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-04T18:05:54.567Z",
                "reviewBody": "Test",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Golightly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/golightly/"
                }
            }
        ]
    }
]