[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2417/desserts/frostings-and-icings/fondant/",
                    "name": "Fondant Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/191275/marshmallow-fondant/",
        "name": "Marshmallow Fondant",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F06%2F24%2F665354_original.jpg",
            "width": 1024,
            "height": 651
        },
        "datePublished": "2009-02-18T21:40:07.000Z",
        "description": "This is a very easy (and a little sticky at times) way to make a delicious fondant. It's great on cakes, cookies, or just for your little ones to play with! Leftovers will save in a tightly sealed container for a few weeks.",
        "prepTime": "P0DT0H29M",
        "cookTime": "P0DT0H1M",
        "totalTime": "P0DT8H30M",
        "recipeYield": "2 1/4 pounds of fondant",
        "recipeIngredient": [
            "¼ cup butter",
            "1 (16 ounce) package miniature marshmallows",
            "¼ cup water",
            "1 teaspoon vanilla extract",
            "2 pounds confectioners' sugar, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the butter in a shallow bowl, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the marshmallows in a large microwave-safe bowl, and microwave on High for 30 seconds to 1 minute to start melting the marshmallows. Carefully stir the water and vanilla extract into the hot marshmallows, and stir until the mixture is smooth. Slowly beat in the confectioners' sugar, a cup at a time, until you have a sticky dough. Reserve 1 cup of powdered sugar for kneading. The dough will be very stiff.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Rub your hands thoroughly with butter, and begin kneading the sticky dough. As you knead, the dough will become workable and pliable. Turn the dough out onto a working surface dusted with confectioners' sugar and continue kneading until the fondant is smooth and no longer sticky to the touch, 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form the fondant into a ball, wrap it tightly in plastic wrap, and refrigerate overnight. To use, allow the fondant to come to room temperature, and roll it out onto a flat surface dusted with confectioners' sugar.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "Fondant Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kiele Briscoe"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.588976377952756,
            "ratingCount": 1270,
            "itemReviewed": "Marshmallow Fondant",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "555.1 calories",
            "carbohydrateContent": "127.3 g",
            "cholesterolContent": "12.2 mg",
            "fatContent": "4.7 g",
            "fiberContent": null,
            "proteinContent": null,
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "89.8 mg",
            "sugarContent": "114.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-06-15T14:16:08.407Z",
                "reviewBody": "I made this with MARSHMALLOW FLUFF!!!! I definitely recommend to do it this way! Based on the previous reviews of saying to wait till the melted marshmallows cooled, I skipped the melting the marshmallows and water step and I placed a whole container of marshmallow fluff into the refrigerator over night. The next morning, I sprayed my kitchen aid very well with PAM, dumped the whole container of Marshmallow fluff into the KA and food coloring and confectioner/powdered sugar as needed. This really was not that difficult or messy at all. When the fondant was at a good consistency, I placed it into plastic wrap and into the freezer for about a 1/2 hour. I then rolled it out and it rolled really nicely. I used this fondant to cover a barbie doll cake than I made for my daughter's birthday! I spread a very thin layer of regular frosting onto the cakes surface to make sure the fondant would stick to the cake. It came out great! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef4Six",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2646978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T16:13:58.037Z",
                "reviewBody": "I've used a very similar version of this recipe for years. It is WORLDS better than any prepackaged fondant you can buy, in ease of use, in taste, and especially economically. I've never added the extra vanilla, though I've occasionally added different flavoring oils. I've also never used the butter in this recipe, with no problems. A tip: If you need colored fondant, add the color to the hot marshmallow mixture before you start adding sugar. Otherwise you'll have to knead in the color later, which will result in technicolor hands and a potentially off texture. **Edit: Yesterday I used this recipe to make chocolate fondant. I added Americolor chocolate brown color to the melted marshmallows, and I also kneaded in about 1/2 cup sifted cocoa with the confectioner's sugar. After coating with shortening, wrapping in plastic and allowing to sit overnight, it was a bit dry, but water didn't help; I had to knead in some extra shortening to get it to a good texture (which didn't take long). Instead of dusting the countertop with confectioner's sugar when rolling it out, I just greased it with a little bit of shortening - it prevented sticking and gave the fondant a nice shine. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "campagnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-04T23:32:54.697Z",
                "reviewBody": "For all you skeptics/\"I'm not good enough\"/\"I can't do it\"/doubters out there, YOU CAN DO THIS!  It is soooooooo easy.  I'm VERY new to cake/cupcake baking/decorating (just started playing around for fun in Oct 08).    I made this last night for a legal pad sheet cake (11X15, my very first sheet cake) and it was super easy.  I melted the marshmallows and added the water and vanilla...then panicked because I couldn't get it smooth.  No prob, just kept nuking at 30 sec intervals.  AT THIS POINT, I ADDED GEL FOOD COLORING to get my desired color (soooo much easier than adding at the kneading stage like I did the other time!).  I added as much 10X sugar as I could w/a spoon, then turned it onto my HEAVILY GREASED (I use Crisco) counter to knead the rest in.    I am impatient, so I attempted to roll it out and use it the same night I made it.  Didn't work (however, it would have worked if I'd been using it for cut outs/decorations, just not for covering an entire cake).   I put it back in a ball, rubbed some more shortening on it, then wrapped it in plastic wrap and put it in the frig til morning.  After letting it warm, I rolled it on a cutting board sprinkled w/corn starch and had no problem getting it on the cake (I simply inverted the cutting board over the cake!).  I want to also add that it was INCREDIBLY HUMID when I made this and it STILL worked super well.  I'm telling you, give this a try; people will think you are a baking ROCK STAR for very minimal effort!  TY for post",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-26T18:27:44.047Z",
                "reviewBody": "EDIT!!!!!! Don't use butter!  Use Crisco... And yes it is hard to work with until you get the right consistency, just keep adding the powered sugar and it will work.....   I found this recipe on-line last year and have been using it ever since.  I use it on my sugar cookies and everyone always asks me what kind of frosting I used then never believe me when I tell them it is just marshmallows.  Defiantly a keeper for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kiele Briscoe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2099998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-10T23:39:18.743Z",
                "reviewBody": "I've been wondering where this recipe was...couldn't believe it wasn't on AR yet. I have used this a couple times and just love it. It is so easy and tastes sooo much better than the store bought fondant. The only thing I do differently is that I use vegetable shortening (Crisco) instead of melted butter to coat my hands and the counter when working with it works wonders. Also this recipe comes out more ivory than white...so if you want a white fondant you can get the Wilton's Icing Color White-White (comes in a small 2 oz. bottle) to add to your fondant. Works wonders!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NEgirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2366917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-27T15:18:48.427Z",
                "reviewBody": "This was fun & easy. Adult PLAY-DOUGH! I made this fondant for first time - ever - & it turned out very nicely! Do increase the melting in microwave as much as needed in 30 second intervals (remember the water!) stirring in between. Stir in some of powdered sugar plop the rest of the sugar on top & then dump it onto a very well-greased surface. Expect to knead in most of the sugar - it's easier than stirring! Give fondant a film of butter/shortening before wrapping it to rest in fridge. To roll out instead of powdered sugar I sifted a small amount of cornstarch on counter & then top rubbing each in. If it cracks then knead in a 1/2 teaspoon of water. Your environment's humidity & temperature may require incrementally adding 2-3 teaspoons water. I used Wilton's \"Icing Colors\" which is a gel and also tried Tree of India's all-natural liquid coloring. (T of I's yellow - from turmeric - is brilliant their blue -from red cabbage - makes a deep purple & their red - from beets - makes a flesh color!) This tastes exactly like its ingredients. Do not be intimidated; give your creative being the chance to play!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T17:56:45.217Z",
                "reviewBody": "I'm reviewing the making process only as I have my fondant in the fridge now and I'll update it after I've used it. I found this very easy to make for my first time fondant making! For those who aren't sure how many cups to use: 16oz bag marshmallows =10 cups; 2lb icing sugar =8 cups. I needed smaller amounts of colored fondant and divided this into 5 batches, making each separately. (perfect for accent colors on your cake or cupcakes). Use 2 cups marshmallows, 2.5tsp water, 1/4 tsp vanilla and 1.5cups of icing sugar for each batch. the butter, I just put a little on my fingers when first kneading. I added the color in while mixing, and it worked great! Cant wait to make my jungle cupcakes with this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Littldot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/413885/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-22T15:32:07.83Z",
                "reviewBody": "I use this recipe for my business. and let me tell you! its idiot proof. i used the metal bowl that comes with all kitchen aid appliance and i melted the marshmallows in that bowl. you place the bowl over a pot of boiling water.....let it steam until all the marshmallow is melted. than place the bowl on your mixer with the dough hook attachment. follow the recipe by adding the powder sugar slowly",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefjbaker85",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2251637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-15T14:40:39.147Z",
                "reviewBody": "Hallelujah, it worked!  This is the 3rd marshmallow fondant recipe I've tried in 3 days.  Both of the others were huge flops.  I'm making a cake for my parent's anniversary party and was desperate to find a good recipe for the fondant and this was it.  It's PERFECT!  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2321602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-06T17:21:27.54Z",
                "reviewBody": "I love this recipe but leave out the vanilla and use additional powdered sugar instead of butter to get a nice cermic type look instead of a shiny greasy one. If it's a dry daY I have to add another tablespoon of water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BreeAnn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1722640/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Marshmallow Fondant",
            "description": "This easy fondant makes fancy cake decorating a snap.",
            "uploadDate": "2012-07-10T19:08:16.569Z",
            "duration": "PT3M24.037S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F21786539-007a-4ea7-bd42-c50ead3a00f2%2F42efc06a-990f-4947-90de-80fb57e32c36%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729110792001"
        }
    }
]