[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/200620/milk-braised-pork-loin/",
        "name": "Milk Braised Pork Loin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F632127.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:47:38.000Z",
        "description": "So simple but amazingly good.  The pork comes out very tender and juicy while the milk reduces down to create a savory brown sauce.  All this in 1 pot.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT1H55M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (2 1/2 pound) boneless pork loin roast, rolled and tied",
            "1 teaspoon salt",
            "½ teaspoon black pepper",
            "2 tablespoons vegetable oil",
            "2 tablespoons butter",
            "3 cups whole milk",
            "1 teaspoon chopped fresh rosemary",
            "1 clove garlic, minced",
            "3 tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season pork loin with salt and pepper. Heat oil and butter in a large pot over medium-high heat and brown pork loin on all sides. Slowly pour the milk in with the pork. Stir in the rosemary and garlic. Allow the milk to come to boil, then lower the heat to medium-low. Partially cover with the lid and cook until the pork is no longer pink in the center, about 1 hour and 45 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Remove pork and set aside to rest.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If the milk is not already a nutty brown color, increase the heat until the milk beings to brown. Spoon off any additional fat. Pour the water into the pan, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Slice the pork and serve with the milk sauce.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ken from CA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.441558441558442,
            "ratingCount": 77,
            "itemReviewed": "Milk Braised Pork Loin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312.5 calories",
            "carbohydrateContent": "4.4 g",
            "cholesterolContent": "84.1 mg",
            "fatContent": "20.7 g",
            "fiberContent": "0.1 g",
            "proteinContent": "25.9 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "388.4 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-14T15:01:17.76Z",
                "reviewBody": "A perfect recipe, fulfilling every criteria of a 5-star rating--thanks, Ken from CA!  The ingredient list is accurate & the instructions clear. If anything, this underpromises & overdelivers. (Three times, my normally-quiet husband said, “My God, this is good.”)  Specifics:   (1) PREPARATION.  Easy! This is a restaurant-quality dish, which puzzled our dinner guests, who asked if my schedule had changed since it seemed I’d been cooking all afternoon. (2) RELIABILITY.  Follow the instructions & there’s no way to mess this up.  (I made a couple of mistakes—the phone rang while I brought the milk to a boil; no problem—just skim the overboil and add more milk. I also set my gas burner too high, allowing the milk to boil down too quickly; adding more milk was an instant fix.)  (3) FLEXIBILITY.  Don’t hesitate if you have a smaller loin, or maybe a larger one (as in our case). Substitute garlic salt for regular, if you wish.  Etc.  (4) PLATING. Carving‘s a pleasure because the pork’s just-right tender and manageable.  (5) SERVICE. There are a variety of options. Since the finished pork and gravy looked scrumptious, I decided to carve at the table, thus set the whole loin on an oblong serving dish, surrounding it with sliced tomatoes and mixed lettuce leaves. (6) BONUS. The gravy makes itself! * DO* COOK DOWN THE MILK TILL IT’S THICK, CURDLED AND GOLDEN BROWN. THE SAVORY KERNELS WILL POP IN YOUR MOUTH.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "INDEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/724579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-29T03:31:14.94Z",
                "reviewBody": "Any pork loin will work for this.  Tying it just helps maintain its shape.  And my recipe didn't call for it to be trimmed.  Actually, you want some fat on it.  Fat is flavor.  If you cover this completely, it will overcook.  The lid should be about 3/4 on so it can vent over a nice simmer.  I think people are covering this or cooking over too high a heat, because this is one of the most foolproof ways to cook pork LOIN (not tenderloin).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ken from CA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2410985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-22T23:23:51.407Z",
                "reviewBody": "When i was preparing this recipe, i thought i must be doing something wrong because it looked weird and how could curdled milk possibly taste good. Well, don't be fooled, although it does not have the prettiest presentation, the flavor is amazing. Highly recommend and im sure any pork roast would work fine",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cheryl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2877796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-16T17:20:01.507Z",
                "reviewBody": "This is to die for. You need to try it! I'm going to cut the salt in half next time though -- we could only eat tiny portions of the wonderful brown kernel sauce because the salt was just too much for us. We do tend to be low-sodium kinda people, though, I guess the low sodium diet has finally succeeded in changing our tastebuds! This smells so divine and looks like you slaved for hours, when really, you just prepped it and left it for a few hours! Thanks for the recipe, Ken, I'm sure we'll have this again! (To those who wound up with dry meat -- you need to use a deep pot, so that the meat is swimming in as deep a milk mixture as you can get. I also turned my roast (using tongs!) halfway through to keep the top from getting too dry.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JARRIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jarrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-14T16:57:39.813Z",
                "reviewBody": "This is a recipe that I had saved almost from the day it was published and never got around to making until tonight. I had some pork medallions that were in my freezer needing to be used. I decided that if this recipe was intended for a roast then it would also be fine with what I had and right I was. Followed the recipe exactly only I did up the garlic to two cloves and used dried rosemary. I do think it's essential that a heavy bottomed dutch oven be used. It produces a nice even heat distribution for even cooking and no problem with recreating the sauce to look like it was intended. Great job Ken and thanks for thinking outside the \"box\" with this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-19T13:27:53.8Z",
                "reviewBody": "Delicious. A very tender moist pork loin. Tying I did not do and had no problem with it. I asked Ken in the exchange if I had done the sauce right. He said it should have been cooked longer til it turned more brown. Albeit it wasn't a nutty brown it was still very very good. Thanks for the recipe Ken!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wannabe chefette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2147660/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T19:50:48.66Z",
                "reviewBody": "I am glad I tried this recipe but found that it just wasn't for me. It was too salty and the meat turned out dry. I did like the 'milk curds' but again...too saltly. I prefer more seasonings. Interesting recipe though...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jilly Bean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4877790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-22T20:43:39.37Z",
                "reviewBody": "OMG! This is amazing! Thank YOU KEN! My Hubby thinks I can cook a little now! The meat was tender the milk browned perfectly into little chunks and were delicious. I served with mashed potatoes and mixed veggies. Hubby took a bite and \"Mmmmm! See what happens when you follow a recipe?!\" lol And I learned a new technique! Thank you for your personal assistance and confidence in me (or was it the recipe?:D) and thank you as well as for this recipe and for teaching me that I too can do a gourmet meal! And it was easy! Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sparkytoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/glutenfree4life/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-02T19:14:35.05Z",
                "reviewBody": "I used 2% milk and this turned out great - don't over salt your pork or the sauce will be salty (I didn't measure the salt and it was a tad salty but not too much). Since I didn't allow my picky kids to eat this with ketchup they tried the sauce and all but the 3 year old liked it. Thanks Ken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soifua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/soifua/"
                }
            }
        ]
    }
]