[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/249/main-dish/casseroles/",
                    "name": "Casserole Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1006/main-dish/casseroles/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46813/jeannies-famous-potato-hamburger-casserole/",
        "name": "Jeannie's Famous Potato Hamburger Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1787659.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-02T06:44:51.000Z",
        "description": "This is something I made up that my family loves. When making it for just my hubby and I, I will add bell peppers and some banana hot peppers to it - really yummy then, but the boys don't like it that way.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H45M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "1 yellow onion, thinly sliced",
            "1 pound ground beef",
            "¼ cup butter",
            "¼ cup all-purpose flour",
            "3 cups milk",
            "1 pint heavy cream",
            "salt and pepper to taste",
            "5 potatoes, sliced",
            "2 cups shredded Cheddar cheese",
            "2 cups shredded Monterey Jack cheese",
            "1 cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large heavy skillet over medium heat. Cook and stir onions until translucent; set aside. Cook ground beef until evenly brown. Drain excess fat, and set beef aside. Melt butter in the skillet. Add flour, and stir with a whisk for 5 minutes. Gradually whisk in 3 cups milk, then the cream. Simmer, stirring frequently, over medium-low heat for 10 minutes until the sauce has thickened and is smooth. Season with salt and pepper, and remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread a small amount of sauce in the bottom of a 9x13 inch casserole dish. Alternate layers of potatoes, onions, ground beef, cheese and sauce, with 2 to 3 layers of each. Reserve some cheese to sprinkle on top. If you run short of sauce, press down on all layers, and add milk as needed. Sprinkle remaining cheese on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 45 to 55 minutes, or until potatoes are soft.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Casserole Recipes",
            "Vegetable"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JEANNIE DUCKWORTH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.10738255033557,
            "ratingCount": 149,
            "itemReviewed": "Jeannie's Famous Potato Hamburger Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "849.4 calories",
            "carbohydrateContent": "35.4 g",
            "cholesterolContent": "209.6 mg",
            "fatContent": "65 g",
            "fiberContent": "3.3 g",
            "proteinContent": "31.9 g",
            "saturatedFatContent": "36.6 g",
            "servingSize": null,
            "sodiumContent": "487.6 mg",
            "sugarContent": "7.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-20T18:37:14.853Z",
                "reviewBody": "I found this recipe looking for some real comfort food for dinner tonight with ingredient that I had.  I'd like to start off by saying that I am not a calorie-counter--  never, ever actually, but happened to see the calorie count in the nutrition info and was shocked at the calories and fat in this dish!  852 calories and 64.8 gms of fat in one serving! Holey Moley!  I made some substitutions for taste and to lower the cal/fat.  I parboiled my potatoes, but I won't bother next time.  An hour in the oven will be fine as long as you slice them relatively thin (1/8 inch).  I added a few dashes of Worcestershire sauce and some chopped banana peppers (with the extra juice squeezed out) to the ground beef.  For the sauce I substituted 1.5 cups of 2% milk and 1.5 cups of light chicken stock for the 3 cups of milk.  Instead of a cup of heavy cream I used 1/2 cup of sour cream that I had on hand.  I was going to add a full cup but the sauce was rich enough with only 1/2 cup .  These substitutions cut the fat and calories by half!  I also added an additional 1 tbl. of flour to the roux because some other reviewers complained of runniness.  I browned-up the roux to  make the sauce a little more robust.  Be sure to keep the flame low and keep stirring.  \n\nI used 2 cups of cheese instead of 4, which seemed like overkill:  I used 1 cup of a jack, cheddar, asadero blend and 1 cup of shredded mozz.\n\nI cooked it for an hour in a large cast-iron skillet and it was perfectly done: crisp and bro",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Boomer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2819421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-13T04:01:10.437Z",
                "reviewBody": "This is SOOO good!The only changes I made were a can of evaporated milk in place of the cream,and cut down the amount of potatoes to 4.I also chopped the onion instead of slices.\nVery hearty and very tastee!\nMy husband and son loved it,and I have saved this recipe for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LACE CAKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-08T22:08:08.75Z",
                "reviewBody": "What a wonderful flavor. After reading some reviews about not being able to get the potatoes fully cooked I just boiled them before slicing them. (brought them to a boil turned them off and covered them for ten minutes then I bathed them in cold water till I was ready to slice them) The result was a slightly under cooked potato that finished off nicely in the casserole. It turned out great. The next day I put the left overs in an augratin dish over a bed of frozen peas. I added a tbls of heavy cream to the peas and topped it all with a little more cheese. Again great result.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PBFITZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/118857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-06T21:08:18.28Z",
                "reviewBody": "I'm usually a good cook and most recipes I try turn out great. I don't know what if anything I did wrong with this recipe but it turned out terrible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sheocon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-15T22:54:59.42Z",
                "reviewBody": "This was great loved it. The only changes I made was I increased the hamburger to two pounds and used a 2 pound bag of Ore-Ida Southern style hash browns in place of the potatoes. Next time I'll use a bigger baking dish as it barely all fit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BURNSCHRISTAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1273230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-27T20:00:28.99Z",
                "reviewBody": "This recipe (with a few of my adjustments and adjustments made by other reviewers) was SOOOO GOOD! First instead of cooking the onions which I didn't have I started right with cooking the ground beef. I seasoned extra lean ground beef with plenty of onion powder and garlic powder some Adobo seasoning steak seasoning garlic salt 1/2 small can of chopped green chilies (suggested by reviewers from New Mexico) and black pepper. I then added a scoop of sour cream to the cooled meat and about 1TB. of Worcestershire sauce. Next for the Au Gratin potato portion I made the roux like directed (no problems here for me) and then mixed in about 2 tsp. of chicken bouillon and about 2 cups of 1% milk. When this mixture thickened up I turned off the heat and added 2 cups of grated sharp cheddar cheese the rest of the can of chopped green chilies another 1 TB. of Worcestershire sauce and about 1/2C. of sour cream. To the sauce I added my thin cut potato slices (I used 3 large red potatoes that I had boiled until tender then peeled and sliced). Lastly I layered my potato mixture with ground beef in a buttered baking dish (potatoes beef potatoes beef ending with potatoes). I baked dish covered at 350 degrees for 45 minutes. And then uncovered dish added some green onions (chives) to the top and cooked for an additional 10 minutes. For the last 5 minutes I broiled the dish in order to get a bubbly and toasty top. My husband loved the dish!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chaneenie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2429324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-25T15:38:40.923Z",
                "reviewBody": "Awesome! My husband loves it so much that he could eat the whole pan by himself! The only thing I did differently was used tater tots instead of potatoes to save time on chopping. If you do this make sure you bake them in the oven for about 20 min (while meat is browning) before you layer them or else the casserole will take FOREVER to cook! Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "L. Gradney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2233944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-25T19:24:45.28Z",
                "reviewBody": "I followed the recipe exactly and my family absolutely loved it. I will hang on to this one. I would bake it an hour so the potatoes are softer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINNWORTH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-02T15:20:27.313Z",
                "reviewBody": "I cut back on the potatoes and cooked them before I mixed them in...if onions are too potent...saute them before browning the hamburger...garlic and onion powder...extra cheese",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MamaDigger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1896268/"
                }
            }
        ]
    }
]