[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46960/barbeque-tempeh-sandwiches/",
        "name": "Barbeque Tempeh Sandwiches",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F178682.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2019-04-02T06:44:52.000Z",
        "description": "I hate tofu but love tempeh and this sandwich is tangy and tasty. My boyfriend and I eat this all the time.  It's great because it's vegan for him and I still like it (even though I'm not a vegetarian).",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 cup barbecue sauce, your choice",
            "1 (8 ounce) package tempeh, crumbled",
            "1 tablespoon vegetable oil",
            "1 red bell pepper, seeded and chopped",
            "1 green bell pepper, seeded and chopped",
            "1 medium onion, chopped",
            "4 kaiser rolls, split and toasted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the barbeque sauce into a medium bowl. Crumble the tempeh into the sauce, and let it marinate a little, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a skillet over medium heat. Add the red and green peppers, and the onion. Cook, stirring frequently until tender. Stir in the tempeh and barbeque sauce, and heat through.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon the tempeh mixture onto kaiser rolls, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JENNX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.245398773006135,
            "ratingCount": 163,
            "itemReviewed": "Barbeque Tempeh Sandwiches",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "375.3 calories",
            "carbohydrateContent": "54.7 g",
            "cholesterolContent": null,
            "fatContent": "11.5 g",
            "fiberContent": "2.9 g",
            "proteinContent": "15.2 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "925.2 mg",
            "sugarContent": "20.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-04T10:27:44.34Z",
                "reviewBody": "I want to share an important note on preparing tempeh (which I used to hate because of the bitter taste but now I love!). Remove the tempeh from the package cut it in half & put it into a small pot of simmering vegetable broth - bring to a boil then reduce to a simmer for 30 mins. (I use vegetarian/vegan bouillon cubes about 2.50 or so for a package of 8 cubes (each cube makes 2 cups - delicious & cost effective for this purpose soups sauce base whatever). Rapunzel is a great organic brand but Knorr also makes a decent \"mainstream\" version. I made this recipe using olive oil instead of vegetable - and added a clove of garlic to the sauteed veggies. I used the recommendation for a \"smoky\" barbecue sauce and this sandwich rocked! I've also made it by pan-frying the crumbled tempeh to brown it (after it comes out of the broth) and adding a small splash of tamari to the pan right at the end stirring to mix - then continuing with the rest of the recipe. Simple and yummy! Thanks for this easy recipe:O)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHERIBEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1340495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-30T15:06:22.763Z",
                "reviewBody": "This is really good but I can see how this recipe could fail if you use bad ingredients. The sauce is what will make or break this one. I added garlic and a splash of hot sauce to mine. I used the organic 3 grain tempeh which I like better than straight soy. This is a good start for people who have never had tempeh before. All in all very good. I will be making this regularly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JTWILES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1451580/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-05T22:40:10.61Z",
                "reviewBody": "I have had a craving for barbeque something for a while but I don't eat meat or fake meat products made out of soy so I didn't know what to make. This totally satisfied me! What a great recipe. I found this recipe a half hour ago and have already enjoyed a delicious sandwich. I like this because it is easy to cut down the recipe for just one person. I used hamburger buns instead of kaiser rolls. This makes four small sandwiches. Thanks for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LLSWEET22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/378639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-11T16:00:38.423Z",
                "reviewBody": "The best comment I can hear at dinner is \"make this again!\" My 9 year old son who is skeptical about our new vegetarian lifestyle really loved these and asked for seconds. I grew up in the South so I added coleslaw as a side or to top the sandwich with and this was fantastic. Re: an earlier comment about boiling the tempeh prior: I researched this on other websites and it is not necessary. You can rinse with water and it was fine no bitterness detected. I used a five grain tempeh and the texture was terrific. I'll be looking for a healthier barbeque sauce most are loaded with high fructose corn syrup. Thanks for this great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2896066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-22T02:39:58.357Z",
                "reviewBody": "Well...I hate to be the sour grape in this bunch but I just finished eating this for dinner and it was aweful. My husband took one bite and began to scream about the aweful aftertaste. He refused to eat this for dinner and went to get sushi. I didn't taste the aftertaste - for me it was the during taste. Now there is a reason I gave this two stars instead of one. First I think I chose a bad BBQ sauce. It is one of our absolute favorites but was too sweet for this recipe. I highly reccommend going for a smokey sauce for this recipe. Second we have never had tempeh before and frankly won't ever again but if you already know you like tempeh this may work for you. I really wish I could offer more on how to repair this one but it was that bad. There have been lots of vegan recipes that I have loved - try Vegan Casserole I Black Bean Soup or Vegan Split Pea soup (all from All Recipes and all fabulous).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "IMATD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/205038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-16T00:59:53.48Z",
                "reviewBody": "Do yourself a favor and make your own red or yellow barbeque sauce. Add an extra cup of water or vegetable broth (I use homemade pastes) and simmer in a slow cooker until the water evaporates. The vinegar does something to break down the firm and sometimes rubbery texture of the tempeh. This comes out much like a shredded/pulled pork barbeque sandwich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Parran",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1714720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-27T00:31:52.447Z",
                "reviewBody": "I tried this recipe when my sister and her family were visiting - her oldest daughter is a vegetarian and her husband is a meat-and-potatoes guy. The only thing I changed was adding a couple of cloves of minced garlic to the vegetables and used 2 green peppers instead of 1 green 1 red... and EVERYONE my brother-in-law included ate this right up and wanted more! What a terrific easy recipe and it turned out to be such a crowd pleaser! This is one of those good ol' standby recipes for me now I make it as often as possible. It's pretty handy too for a single person because the sandwich filling keeps very well in the refrigerator and reheats very well too. Thanks for a terrific quick easy meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VeggieCarrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3031797/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-24T01:04:33.32Z",
                "reviewBody": "Used wild rice tempeh and homemade BBQ sauce. Excellent. Used a very good Italian Roll for the bun. Note to those who don't like tempeh. Not all Tempeh is created equal. I don't like Soy Tempeh but love multi grain 3 grain 7 grain 12 grain tempeh and Wild Rice Tempeh. However there are even more flavors available. Brands also differ. If you don't like one you might like another.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "philocrates",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/philocrates/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-20T17:56:34.95Z",
                "reviewBody": "I love tempeh and my homemake bbq sauce so this recipe was great! Only one other reviewer mentioned cooking the tempeh first- it is a must! Tempeh in an uncooked food and heating it up in bbq sauce is not sufficiently cooking it. It must be simmered first or it is hard to digest.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen Ruppenstein Dunegan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/176557/"
                }
            }
        ]
    }
]