[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1315/breakfast-and-brunch/cereals/oatmeal/",
                    "name": "Oatmeal Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/208390/slow-cooker-fruit-nuts-and-spice-oatmeal/",
        "name": "Slow Cooker Fruit, Nuts, and Spice Oatmeal",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1881859.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2009-09-15T12:34:20.000Z",
        "description": "A delicious, creamy oatmeal that's slow-cooked overnight with apples, cinnamon, cranberries, almonds, and pecans.  A great way to wake up in the morning!  Serve with brown sugar and milk. Enjoy.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 cups steel cut oats",
            "2 cups diced apple",
            "1 cup dried cranberries",
            "½ cup slivered almonds",
            "½ cup chopped pecans",
            "3 cups water",
            "1 cup milk",
            "1 tablespoon ground cinnamon",
            "1 teaspoon pumpkin pie spice",
            "2 teaspoons butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the oats, apple, cranberries, almonds, pecans, water, milk, cinnamon, pumpkin pie spice, and butter in a slow cooker. Cook on Low overnight or 8 hours.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals",
            "Oatmeal Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Life Coach Julie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6923076923076925,
            "ratingCount": 169,
            "itemReviewed": "Slow Cooker Fruit, Nuts, and Spice Oatmeal",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "326.4 calories",
            "carbohydrateContent": "48.2 g",
            "cholesterolContent": "5.1 mg",
            "fatContent": "12.5 g",
            "fiberContent": "7.3 g",
            "proteinContent": "8.2 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "23.6 mg",
            "sugarContent": "16 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-28T23:58:07.817Z",
                "reviewBody": "Very, very good. Instead of water, I used apple cider and I used whole milk. The whole family devoured this. Quite the nice breakfast to wake up to, smelling all wonderful and cheery. I'll make this again. NOTE: I used a steel cut oatmeal for this recipe. Very important to know that you'll get different results if you use a different type. Next time, I'll add the nuts right before serving, so it dosen't get all cooked in with the oatmeal. I'd like a little crunch. I should clarify, I used the \"warm\" setting on my Crockpot. Mine's an old 70's version that has one of those. I didn't have any issue with mine burning. I do go to bed really late so mine probably went into the crockpot closer to midnight so mine wasn't cooking any longer than six hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-01T18:19:12.73Z",
                "reviewBody": "I've used a similar recipe many, many times.  First time it burnt to the pot. My basic-as-be Crock Pot tends to run hot, so I use tried the Keep Warm setting.  Also, lay a dishtowel over the pot before you out the lid on to absorb condensation and keep it from dripping back in to make oatmeal \"soggy mush\".  You will be pleasantly surprised in the AM.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mattswife1123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3759626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T20:24:09.813Z",
                "reviewBody": "After making many, many dishes from this wonderful website, this is my first total failure.  I even read other reviews first for slow cooker oatmeal, and was forewarned about it turning to mush and burning the crock pot.  I sprayed the crock with Pam, and being the eternal optimist, I thought that would not happen to me...  :(   No such luck.  I do have a crock pot that runs \"hot.\"  One reviewer said hers was the same and she cooked it on the \"warm\" setting.  I should have listened.  I will try this again, but during the day when I am awake to monitor it. Well, off to scrub my crock pot...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "lynnmt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/765456/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T16:13:26.373Z",
                "reviewBody": "The number of negative reviews makes me suspect some user error because my turned out perfect.  No one has mentioned 'steel cut oats' which are VERY different from whole oats or quick oats and likely part of the issue with those who had failures.  Additionally, you SHOULD NOT be checking it.  It's important that the water remains IN the pot not being lost to the air or a towel!  That is why you can use a lesser amount of water than what is called for on the package.  Once you put the ingredients in the slow cooker, it is a good idea to stir everything but if the instructions are followed and the ingredients are correct and the crockpot isn't faulty (and it's set on low) - this should be impossible to mess up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DivineComedy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4343772/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-06T00:56:24.003Z",
                "reviewBody": "I liked this a lot. The fruit made it naturally sweet and yummy. I did add about 3 extra cups of liquid as I noticed the steel cut oats package called for over a 3 to 1 ratio vs. the 2 to 1 in this recipe. It cooked overnight for 8.5 hours and no burning.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chantel Gardner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3268019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-29T15:22:20.167Z",
                "reviewBody": "Excellent! Followed recipe exactly and it actually ended up cooking for nearly 9 hours at which time it seemed like it was just about to start burning so in the future I'll make sure to check it before then. Flavor and texture are both great and I look forward to trying it with other dried fruits! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-02T18:29:29.787Z",
                "reviewBody": "This recipe was super easy! I did not know you could cook oatmeal in a crockpot. Did leave the setting on warm since I read it may burn turned out perfect in 8 hours. Delicious & can use whatever you have on hand for the extras. Thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonnie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1659714/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T21:55:46.837Z",
                "reviewBody": "I also had the issue that a previous reviewer mentioned and when I woke up after exactly eight hours I was disappointed to find that the recipe had burned to the pot.  I own a totally standard, no frills, Crock Pot brand pot but I use it regularly for recipes on this site with very good results.  Despite the burning, I was able to salvage about 50% of the oatmeal.  It didn't taste \"burned\" and what remained was tasty, if not exceptional.  I may try this recipe again but I'll wait to see what other reviewers have to say in coming weeks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Hock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3400015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-15T16:07:51.59Z",
                "reviewBody": "i was really excited to try this recipe! i made it for a staff meeting breakfast at work and it went over really well. so make sure you are using steel cut oats-you can't buy them at many mainstream grocery stores you need to go to a whole foods or wegmans (or whatever natural food grocery store is near you). this is critical to avoid mushy or burned oatmeal. i also increased the milk by 1c. i added my nuts at the end which gave it a nice texture and crunch but if you prefer just the flavor of the nuts and don't want them crunchy then i'd follow recipe. if i were to make this again i would definitely cut my apples smaller - they weren't quite mushy enough for me and i picked most of mine out when i was eating it. i did significantly increase the cinnamon and pumpkin pie spice (doubled at least). i also added about a cup of brown sugar in the morning as it was far too bland for my taste. as i read other reviews i had debated about what heat to cook it at because my slow cooker is a beast...but i was afraid about it being undercooked if i only put it on warm (and i figured i could buy something else in the AM if i needed to if it burned!) so i did it on low and it was fine! the extra liquid helped i think & it was not burned or dried out. wow this is a long review but i hope it helps someone! dont' be scared of this recipe by its so-so reviews!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BECCAP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1405774/"
                }
            }
        ]
    }
]