[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/211116/kale-and-spinach-saag/",
        "name": "Kale and Spinach Saag",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6929634.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-04T03:48:05.000Z",
        "description": "I've been experimenting with saag recipes for a while now, and have finally concocted what I believe to be the best version so far. This recipe is for plain saag. Add lamb, chicken, paneer, or other deliciousness. Serve warm with rice or naan.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (1 inch) piece fresh ginger, peeled and coarsely chopped",
            "6 cloves garlic",
            "¼ cup water, or more as needed",
            "½ teaspoon garam masala",
            "1 (10 ounce) bag fresh spinach, chopped",
            "10 ounces fresh kale, chopped",
            "1 cup milk",
            "1 cup cottage cheese",
            "1 pinch salt",
            "1 pinch ground nutmeg",
            "2 teaspoons ghee (clarified butter)",
            "2 onions, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the ginger and garlic in a blender with 1/4 cup of water, and blend to a smooth paste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet with a lid over medium-low heat, and scoop the ginger-garlic paste into the skillet. Sprinkle with garam masala, and stir to combine. Reduce heat to low, cover, and simmer the paste for about 15 minutes, checking to see that it hasn't cooked dry. Add more water if the mixture gets dried out. Stir in the spinach and kale, and cook, stirring occasionally, until the greens are bright green and limp, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the milk and cottage cheese into the blender, and blend until smooth. Add a pinch of salt and nutmeg to the blender, and pulse again just to mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the ghee in a skillet over medium heat, and cook and stir the onions until they are translucent, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the cottage cheese mixture and the cooked onions into the skillet with the greens until well combined, let cool slightly, and place about half the saag into the blender. Pulse until smooth, return the blended mixture to the skillet, and stir well.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "dasunrisin"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.05,
            "ratingCount": 20,
            "itemReviewed": "Kale and Spinach Saag",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "191.1 calories",
            "carbohydrateContent": "21.2 g",
            "cholesterolContent": "18.8 mg",
            "fatContent": "6.9 g",
            "fiberContent": "4.2 g",
            "proteinContent": "14.4 g",
            "saturatedFatContent": "3.9 g",
            "servingSize": null,
            "sodiumContent": "343.7 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-25T23:28:07.83Z",
                "reviewBody": "I wanted to write just to provide some linguistic clarity. \"Saag\" is both the name for the dish and the Punjabi/Hindi word for mustard greens which are the main component of the dish. If there are no mustard greens it is not \"saag\". This could be a \"palak\" dish (palak means spinach). Also no South Asian person (myself included) would ever add milk and/or cottage cheese to such a dish. Cubes of paneer can be added. But as this recipe stands it is entirely inaccurate to call it a saag dish or even any version of a saag dish. This seems be more of an \"Indianized\" creamed spinach dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MGPaneer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2099054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-07T20:11:15.737Z",
                "reviewBody": "This is a response to the review by MGPaneer on Jan25 2011(I have not tried this recipe). Saag is NOT name of Mustard Greens in either Hindi or Punjabi. That honor belongs to Sarson. Saag is the name of a dish that is cooked in such a fashion with leafy greens. So if the primary leafy green is Mustard Greens(which is usually the case) then it is called Sarson da Saag (da=of so this translated to Saag of Mustard Greens). This dish could be called Kale da Saag. As for the addition of milk/cream this is a common practice in many Indian restaurants in both India and the US to give the Saag added richness. Home cooks tend to use a big chunk of butter/ghee instead of the milk to give it the richness. So the person is correct in calling this Saag although calling it Kale Saag may be more appropriate since just Saag is usually always with Sarson(Mustard Green). Also Paneer is a type of Cottage Cheese so please go over your info before posting. Just because you Indian does not make you correct(I am Indian btw) Hope this helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "zubin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7815414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-11T14:52:54.397Z",
                "reviewBody": "I was the only one in my family who liked this. I accidentally over blended half of the saag for the last step so it came out looking like babyfood- but such a beautiful color! The only thing I changed was to use olive oil instead of ghee- didn't have any and was too lazy to make some from scratch. I don't know if I'd make this again. It wasn't bad. It helped me use up all the kale I had which was why I thought to make it in the first place but it's really too high in carbs for my husband and I to eat and it didn't particularly wow either of us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacquie Garel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2901995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-12T22:39:56.49Z",
                "reviewBody": "Fabulous and sooooo healthy.  Also a very flexible recipe.  I used small frozen packages of spinach and mustard greens, substituted almond milk for dairy milk (probably could have substituted tofu for the cottage chees), substituted 1 tablespoon tikka masala for the 1/2 teaspoon garam masala, used one giant sweet onion instead of two regular onions, and substituted olive oil for ghee.  I don't really like cooked greens, but THIS was GOBBLED.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maryelizabethanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2581517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-31T18:21:59.963Z",
                "reviewBody": "The contrary opinions on whether this can be called saag and the appropriateness of the ingredients arise from different sub-cultures within the Indian sub-continent. Among Punjabis( people whose ancestors and possibly they themselves are from the Punjab region) the term \"saag\" means a simple curry made from bitter mustard greens and milder greens such as spinach. No milk cream etc is EVER added- that would be blasphemous. For non-Punjabis however \"saag\" means any dish made of leafy green vegetables such as this one. It is common to add cream milk paneer etc to green leafy vegetables. So everyone who posted their ire is correct according to their perspective! For more trivia linguistically \"saag\" is related to \"shaak\" which means vegetable. That is why a vegetarian is called \"shakahari\"- one that eats vegetables.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "nk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3495482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-11T00:35:25.763Z",
                "reviewBody": "REVISIONS: I'm sure the original is amazing too but a few substitutions made this the best Spinach Saag ever! No cottage cheese=used plain yogurt instead Added fried cubes of Indian Cottage Cheese/like tofu constancy: cut into 1 inch cubs fry in a pan of 1TBS olive oil til brown then put in Saag. Try it. Love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "whereiroamishome",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4049607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-23T16:17:32.07Z",
                "reviewBody": "This recipe tastes better with tomato puree in place of milk and cheese.I add cottege cheeze cubes in tomato gravy and palak paste. Chhaya cstopre",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cstopre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2722366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-17T01:18:56.277Z",
                "reviewBody": "Excellent! Tastes just like my fav Indian restaurants! I used cottage cheese a little yogurt I had left and almond milk instead of reg milk. Thanks so much-I've tried other saag recipes-this will be the one I always use!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UudyJa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4109881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-28T18:47:15.053Z",
                "reviewBody": "This was very good. I used mustard greens instead of kale as I thought mustard was more traditional. I didn't have a full cup of of cottage cheese so I used some neufchatel cheese in place of the remaining cottage cheese. I also added some grated blend (cheddar and monty jack) at the end. The flavor improves with sitting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMALA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/babycatcher/"
                }
            }
        ]
    }
]