[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212891/pain-de-campagne-country-french-bread/",
        "name": "Pain de Campagne - Country French Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1083020.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2019-04-04T03:48:22.000Z",
        "description": "I got this recipe out of a novel and made some minor changes. It is a yummy French bread that is worth the wait.",
        "prepTime": "P0DT3H0M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT5H25M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "½ teaspoon instant yeast",
            "½ cup warm water (110 degrees F/45 degrees C)",
            "¾ cup whole wheat flour",
            "2 ½ cups warm water",
            "½ teaspoon instant yeast",
            "6 cups unbleached bread flour",
            "1 tablespoon kosher salt",
            "2 tablespoons cornmeal for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make the sponge, whisk the 1/2 teaspoon yeast in 1/2 cup warm water. Stir in the whole wheat flour until the mixture resembles a thick batter. Beat for about 100 strokes to form longs strands of gluten. Cover the bowl with a damp cloth and let sit at room temperature for 2 to 8 hours (longer is better for flavor development). You can also let the poolish ripen in the refrigerator for 12 to 15 hours, bringing it back to room temperature before proceeding with the recipe.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the poolish is ready, it will be bubbly and loose, with a yeasty, sour aroma. Scrape the poolish into a bowl and stir in the 2 1/2 cups water and the remaining 1/2 teaspoon yeast. Stir well to combine. Add the bread flour 1 cup at a time, mixing well after each addition, until the dough becomes too difficult to stir.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the dough to a floured work surface and knead for 10 to 12 minutes, adding more flour only when the dough becomes too sticky to handle. Sprinkle the salt over the dough and knead it for an additional 5 to 7 minutes. The dough should have a smooth surface and spring back to the touch. Shape the dough into a round and cover with a damp cloth for 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the dough in an oiled bowl, turning to coat the surface of the dough with oil. Cover the dough with a damp cloth and let it rise at room temperature until doubled in size, about 2 to 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Deflate the dough and cut it into two pieces. Shape the dough into two rounds, cover them with plastic or a damp cloth, and allow the dough to rest for 30 minutes at room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape the dough into baguettes. Place a heavily floured cloth on a baking sheet, arranging a fold down the center to separate the loaves. Place the loaves, seam-side up, on the floured cloth. Dust the tops of the loaves with flour, cover with a damp towel, and let rise until doubled in bulk again, about two hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle a baking sheet with cornmeal. Gently transfer the risen loaves to the baking sheet, placing them seam-side down on the cornmeal. Make several diagonal slashes in the loaf with a serrated knife or razor blade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Immediately place the scored loaves in the preheated oven. Bake the bread until the loaves are golden brown, about 25 to 30 minutes. Cool the loaves on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "violet"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.721153846153846,
            "ratingCount": 104,
            "itemReviewed": "Pain de Campagne - Country French Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "47.6 calories",
            "carbohydrateContent": "10.1 g",
            "cholesterolContent": null,
            "fatContent": "0.3 g",
            "fiberContent": "1.6 g",
            "proteinContent": "1.9 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "723.6 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-03T21:56:00.4Z",
                "reviewBody": "Wow, this recipe was quite a task. I have always focused on American style breads with a quick rise, because of the bit of sugar, or just a shorter yeast development. I started the \"poolish\" in the refridgerator the night before in a bowl covered with a wet towel for the full 15 hours. I brought it to room temp. still covered for about 3 hours the next day. I had thought about using the Kitchen-Aid mixer, but I am glad I didn't because I got a good idea for how the dough was supposed to look and feel. I shaped one of the loaves as suggested and used a well floured coil bread basket mold for the other one. I thought the bread turned out very well in taste and appearance. I did have to bake it though for 40 minutes. When I sliced it, it had a soft center and crunchy crust and bottom from the corn meal. It was absolutely delicious! I have developed a new found appreciation for \"artisan\" style breads from this recipe. I just wonder what novel the bread recipe came from now?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-13T01:00:39.11Z",
                "reviewBody": "Great recipe!  Thanks violet!  I've made several breads before that have used a sponge starter, but this is the best (and easiest) I've tried so far.  This will be my go to recipe for french bread.   I think using whole wheat flour for the sponge added a lot in flavor.  I had to add about 1/2-1 cup more flour to prevent sticking.  I added another 1/2 tsp salt because of this.  I was also in a hurry so I shaped the bread after kneading and then baked after the loaves had proofed.  About 5 minutes before they were done, I brushed the loaves with olive oil (since we like a more chewy than crunchy crust).  Even though it did not have the additional rise, the flavor of the bread was still well developed, had an excellent crumb, and wonderful chewy crust.  I made 3 loaves instead of 2 so that they would fit on my pan.  A trick for great crusty bread, make steam in your oven.  Before preheating the oven, place a metal pie plate or other type of pan on the bottom rack.  After the oven is preheated and you've put the loaves in, pour about 1/2 cup of water into the preheated pan and quickly close the oven, do this again about 10-15 minutes later.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/444247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T15:29:07.307Z",
                "reviewBody": "The quantity of warm water shown in the Ingredients for the poolish (1/2 cup) disagrees with the amount listed in Directions (3/4 cup). To achieve a \"thick batter\" I opted for the 3/4 cup of warm water. Right or wrong the end result was two very toothsome loaves of bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3546872/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-10T02:57:43.593Z",
                "reviewBody": "Amazing bread!  Perfectly spongey chewy texture.  Love love love.\nAfter reading others' reviews, and having taken some official college baking courses, here are my tips:\nYou can simplify the shaping and raising steps.  When shaping your loaves, flatten out your ball gently.  Then roll up from the bottom, tight like a sleeping bag, squeezing out any bubbles as you go.  Pull the ends even as you go, too, so it rolls like a jelly roll, not a croissant.  Pinch the seam tightly..  Also, you don't need a baking cloth.  At step 6 just place your loaves on your baking sheet and let them rise there.  No need for an awkward transfer.\nFor a tougher chewier crust, brush it lightly with water before baking and a few times during.  Also, you could place an oven-safe pan of boiling water in your oven to create steam, or carefully flick or spray water onto the hot pan during baking, creating steam.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5875366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-24T17:07:53.663Z",
                "reviewBody": "Violet - Thank you so much for posting your recipe. This bread is exactly what I have been trying to achieve - great sour taste (but not too sour) and excellent chew. It bakes very large loaves so other bakers might want to try making 3 baguettes rather than 2. I made the recipe with the poolish ingredients as written 1/2 cup of water to 3/4 cup of wheat flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Austinphylly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4895561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T22:43:27.653Z",
                "reviewBody": "I love this bread.  The poolish makes all the difference  in getting a more aromatic, fermented flavor that you find in french loaves from the better bread bakeries.  I make the poolish just before I go to bed the night before I wan't to make bread.  I just cover it with plastic wrap and leave it on the kitchen counter until I need it.  It's quick and easy.   . I occasionally use just a few drops of wine vinegar in the remaining water for finishing the dough, no more than 1/8 tsp, to give the bread a touch of sour dough flavor.  When I do that, I add a tsp of honey or brown sugar to proof the yeast.  It's not enough to add sweetness, it's just for proofing and both maybe add a little something-something to the flavor, nothing you can really put your finger on, though!  Either way, this is the best recipe for a simply made french bread I've seen here so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2512568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T22:59:12.023Z",
                "reviewBody": "This was my first time making a poolish and an artisan-type bread. I loved the chewy-crisp crust and the texture of the bread. I didn't see the reasoning behind doing the second rise (step 6) on a floured cloth and then transferring to the baking sheet later so I just did the last rise on a lightly olive oiled baking sheet. The damp cloth stuck a little to the top of my generously floured loaf so it deflated a little bit even though I tried to gently remove it. Another reviewer had this same problem and I think it would be worse to try to do the last rise on the floured cloth and try to move it without collapsing the bread a little right before you intend to bake it. I look forward to practicing a little more with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKIN4MYFAMILY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874699/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T20:08:44.523Z",
                "reviewBody": "This is my favorite kind of bread: just flour, yeast, water, and salt. The staff must’ve fixed the instructions the previous reviewer mentioned; even so, I used ¾ cup water because I like a thinner poolish. I mixed the dough in my Kitchenaid for at least 15 minutes; it’s a very loose dough. Somewhere, I have a baguette pan, but couldn’t find it when I was ready to shape the loaves. So, I had some shaping disasters. One loaf was too long for my baking stone, so the ends fell off and hit the oven rack; the other loaf wasn’t floured well enough and kind of stuck to my towel, so it had some puckering on the surface. (Hence, no pretty pictures!) The taste is very good, though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T00:44:50.413Z",
                "reviewBody": "Excellent! I will continue to make this again and again. Light airy inside perfectly crunchy outside; it's my go-to dough. I don't do any of the 'resting' times because I think they're a waste of time. It makes a big batch and I can get 6-8 small loaves out of it (I store the extras in the fridge in plastic and provided they don't mold they only get better with age.) This is also what I use for homemade pizza crust and it is the BEST! If I want to be healthier I make it with half whole wheat flour and it's still delicious though it isn't as light and airy and it has a slightly bitter taste to it we love it still. Also makes great bagels!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CarolynReese",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5021438/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-02T17:46:44.027Z",
                "reviewBody": "I spent a good part of the day making this bread and it was not nearly as good as my sourdough bread which is a lot less work and tastes better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Garcia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7669227/"
                }
            }
        ]
    }
]