[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/670/main-dish/pork/ham/",
                    "name": "Ham",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/47525/ham-and-cheesy-potatoes/",
        "name": "Ham and Cheesy Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7105257.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:44:54.000Z",
        "description": "A ham and cheese casserole that my family loves.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 tablespoons all-purpose flour",
            "2 tablespoons cornstarch",
            "2 teaspoons lemon pepper",
            "1 teaspoon onion powder",
            "2 cups milk",
            "3 cubes  chicken bouillon",
            "1 ½ cups shredded Cheddar cheese",
            "3 cups julienned potatoes",
            "1 cup cubed cooked ham"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Coat a 9x13 inch baking dish with nonstick cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium heat, toast flour until golden. Stir in cornstarch, lemon pepper and onion powder. Gradually whisk in milk, then chicken bouillon. Cook, stirring, until sauce is thickened. Remove from heat, and stir in Cheddar cheese until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Layer potatoes and ham in prepared baking dish. Pour sauce evenly over potatoes and ham.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 hour. Let sit 5 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Ham"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Fran Heath"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0638297872340425,
            "ratingCount": 47,
            "itemReviewed": "Ham and Cheesy Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "496 calories",
            "carbohydrateContent": "37.8 g",
            "cholesterolContent": "83.4 mg",
            "fatContent": "26.2 g",
            "fiberContent": "2.9 g",
            "proteinContent": "26.9 g",
            "saturatedFatContent": "14.8 g",
            "servingSize": null,
            "sodiumContent": "1907.3 mg",
            "sugarContent": "7.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-03-01T15:48:48.247Z",
                "reviewBody": "This turned out pretty well:  but I made some modifications after reading the reviews.  I melted butter and then mixed in the flour, cornstarch, 1 t of lemon pepper, onion powder and lots of pepper.    I next added the milk, 2 bouillon cubes, some fresh sliced mushrooms and pimentos, and let it thicken.  I made sure to julienne the potatoes, and added broccoli.  The key is to julienne the potatoes so they get done in time.  The broccoli was a little overdone;  maybe I'll cover next time.  That's what's great about this site:  recipe building is a community process, instead of scripture!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michael Dinsmore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/713482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T18:02:36.413Z",
                "reviewBody": "Wow we loved this recipe. I did not have a problem making the sauce without butter. I think that this sauce is very versatile and could be modified for use with any pasta dish as well. Next time though I will ease up on the chicken boullion to cut down on the \"saltyness\" of it. ps: make sure you julienne your spuds small if you want it to cook in an hour.. mine took almost two - well worth the wait though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICK_STERR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-29T00:07:40.877Z",
                "reviewBody": "My family absolutely loves this recipe. I just cut up enough potatos to fill my casserole dish, dice up a ham steak toss it over the potatoes and pour the sauce over it. It turns out great every time. I serve it along with a Ceaser salad. It makes for a great inexpensive meal.  It's wonderfully quick to make too if you don't have a lot of time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheri Lee Brown Walters",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1795809/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T18:57:38.977Z",
                "reviewBody": "This was a great use of our leftover ham but I did make a couple of modifications. I didn't have time to cut the potatoes by hand (it was a last minute thing) so I used the slicing function on my food processor to get nice thin slices. I then cut them up a bit more but I don't think that was necessary. I melted 4 tablespoons of butter and added the flour to that. I didn't have lemon pepper and didn't substitute anything. I also used garlic instead of onion powder. I added chopped onions to the sauce before adding the cheese. I also only used 2 chicken bouillons instead of 3 and I still think it was a little bit salty. We had much more than 1 cup of ham to use up so I put it all in. My husband commented that there wasn't very much of it I would do do an extra half recipe or even double it next time I make it because we like to have leftovers for lunch. Definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3542491/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-20T11:00:41Z",
                "reviewBody": "I didn't get the \"toast the flour\" portion of this recipe. I can't see how its possible so I first melted 4 TBLS butter before adding the flour and (only half the) cornstarch. I also used skim milk only 1 tsp of lemon pepper and 2 chix bullion cubes. Finally I added 1/2c chopped brocoli and a jar of diced pimentos for color and taste. Not too salty or pasty. In fact it was pretty good! Very homey (meaning non-gourmet) dinner. If the potatoes are cubed to the right size (small) they should cook in the time allotted. Thanks Fran.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-10T15:04:06.6Z",
                "reviewBody": "I liked this OK but nothing extra special. This is what I call a mac n cheese kind of meal i.e. just a casual mid-week family type meal what one reviewer called \"homey.\" (Someone else said it was like glorified potatoes au gratin - good description really.) I followed the recipe exactly. As to the undecided-if-its-a-white-sauce: I had absolutely no trouble with it. I really didn't \"get\" the toasting the flour thing but sorta did it anyway. Didn't have any trouble adding the milk to just the dry stuff with no butter and with no lumps. (You must take that word \"gradually\" quite literally and add just tiny bits of milk at a time make sure it's mixed well etc. You have to do this even with butter. When it's more liquidy you can dump in the rest.)(For the self-proclaimed \"expert\" to be unable to do this strikes me as amusing.) I have a cool little slicer thing that does julienne as well as thin slices and it's easier and faster than a food processor and easier to clean. I don't recall if mine was done in an hour but I'm sure I would've made note had it been ridiculously longer than that. And I didn't find it salty but I'm a salt-a-holic so I guess I didn't notice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Erimess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/erimess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T04:32:18.053Z",
                "reviewBody": "Darn good and flavorful recipe but it was a bit salty for me (and I like salty). When I made the sauce it came out a bit too thick and I had to add more milk and even some water to thin it out a bit so that it covered the potatoes and ham better. I am not sure if it was the ham or the chicken bullion that I used that added the extra saltiness. I will DEFINITELY be making it again though!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Monty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/503339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-01T23:17:18.7Z",
                "reviewBody": "I just made this after reading the previous reviews. I reduced the bouillon cubes from 3 to 2 (to combat reported saltiness) made sure to julienne my potatoes (so it would cook in 1 hour) and used skim milk in the sauce (so it wouldn't be too thick). I'm glad I read the reviews first because these adjustments made the recipe come out perfectly. While my husband and I enjoyed it my 3-year-old twins were not big fans. I suspect it may have been a bit too \"spicey\" for them. They picked out the ham to eat but avoided the saucey potatoes. If I make it again I might try reducing or leaving out the lemon pepper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "HENNA4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-18T13:33:55.537Z",
                "reviewBody": "This really came out good with a few changes. I really didn't get the dry toasting of the flour so cooked a finely chopped onion in 1T butter until softened then added a minced clove of garlic and the flour and cooked until the flour was a light gold then added the rest of the seasonings and milk. Pureed the sauce in the food processor (presto! no lumps!) with one bouillon cube (there was no way in the world I was going to use 3) then returned to the pan to cook until thickened. Melted in colby/jack cheese and poured over the layered ham (about 2 cups) and julienned potatos. Baked up with crispy edges and tasted wonderful. Only slight negative I can say is the potatos turned a little gray since there wasn't enough sauce to fully cover which didn't affect the flavor but doesn't look as pretty. Next time I would double the sauce to make the cassarole a little 'juicier'.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARNKITTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/177428/"
                }
            }
        ]
    }
]