[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213138/new-york-italian-pizza-dough/",
        "name": "New York Italian Pizza Dough",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1115227.jpg",
            "width": 3712,
            "height": 2088
        },
        "datePublished": "2019-04-04T03:48:32.000Z",
        "description": "A really wet, sticky pizza dough that bakes up to perfection! Simple ingredients and technique in this dough make your pizza crust authentic, crispy and chewy just like your favorite NY brick oven joint. This recipe makes enough for three 10- to 12-inch pizzas, two 12- to 14-inch pizzas, one 16- to 18-inch pizza, or 6 to 8 small single serving stromboli.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H6M",
        "totalTime": "P0DT10H36M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 ½ cups warm water (110 degrees F/45 degrees C)",
            "2 teaspoons salt",
            "4 ½ cups bread flour",
            "2 teaspoons active dry yeast",
            "¼ cup bread flour, or more if needed",
            "1 tablespoon olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the warm water into the pan of a bread machine, sprinkle in the salt, and add the flour to the pan so the flour sits on top of the water. Make a hole in the top of the flour, and spoon the yeast into the hole. Let the mixture sit for 20 minutes to moisten the flour. Set the bread machine to the knead setting, and knead the dough for about 10 minutes. Turn the dough out onto a floured surface, and knead in 1/4 cup more flour or as needed, adding the flour about 2 tablespoons at a time, to make a wet, sticky, but elastic dough.  The dough should be \"as soft as a baby's bottom.\" Form the dough into a round shape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wipe the inside of a large bowl with olive oil, and place the round ball of dough into the bowl. Turn the dough over a couple of times so the dough picks up a thin coating of oil. Cover with a cloth, and refrigerate the dough for 10 hours or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next day, allow the dough to come to room temperature before rolling out on a floured surface and adding toppings as desired. Roll the dough out thin with a thicker edge before adding toppings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a pizza stone into oven, dust it with a little flour, and preheat oven to 500 degrees F (260 degrees C). Bake the pizza on the stone in the preheated oven until the bottom of the crust is browned, 6 to 8 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ItsJeanettic"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.658823529411765,
            "ratingCount": 170,
            "itemReviewed": "New York Italian Pizza Dough",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "33.3 calories",
            "carbohydrateContent": "3.5 g",
            "cholesterolContent": null,
            "fatContent": "1.8 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.9 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "584.2 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-13T19:10:30.46Z",
                "reviewBody": "This is the best pizza dough recipe I have found. I only let it sit in the refrigerator about 30 mins. and it still turned out really yummy!! I also used a mixer instead of my bread machine. I just find it easier! Thanks for this recipe, I love it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tiselput",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3460424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-01T21:18:19.043Z",
                "reviewBody": "This is the pizza dough recipe I've been looking for! Makes a real New York style pizza. I read a website by a famous New York pizza maker, and he said you had to have a sticky, tacky dough- well, none of the doughs I've made so far have come close until now. Thanks for this!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MCROWNOVER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/741581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-10T22:10:58.837Z",
                "reviewBody": "Just enjoying a slice of pie made with this dough recipe, and it's hard not to keep going back and goo-ing up my hands with \"one more bite\" of it until I finish this review! The quintessential New York pizza has a thin, seared crust layer on the bottom, with light, ethereal bread topped with a thin layer of sauce, cheese, and whatever other items ring your bells. This does not disappoint on any score. This dough stretches easily to supreme thinness when allowed to rest as recommended in the fridge. That's one detraction, that you need to plan ahead. But it can be made and rested for up to 2 days, so no problem. A baking stone is a must for success, as when it's preheated, it will sear the bottom of the crust by instantly drawing out the surface moisture. As for \"blandness\" that some dislike, remember that a great crust acts as a backdrop for your accoutrements. It's not the star. It is, however, a very important supporting player. If desired, you can flavor it with herbs and/or a few Tb of Parmesan. I found the dough to be too sticky with the proportions listed. Whereas I fully understand that a pizza dough needs as little flour as possible, no way could you work with it, until I added about 1/4 cup of flour, which left it still very sticky, but able to be handled with floured hands. Experiment. You want it sticky, but not quasi-liquid. You're going to love this crust. Second-generation Italian girl here, New York born and raised, and I can tell you, THIS is the real deal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T01:09:00.98Z",
                "reviewBody": "This is delicious! it made the Breakfast Pizza from All Recipes taste amazing. both times I made it with this dough it didn't last past dinner time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jc3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jc31/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-01T20:50:15Z",
                "reviewBody": "I make mine WITHOUT a bread machine, and it turns out wonderful.  I use the same ingredients listed, though I might add up to a cup more flour depending on the humidity, b/c like the recipe states, this IS very sticky dough.  To make by hand, I mixed the yeast and water to proof.  Then I added the salt, a tsp or two of sugar (that's my only addition), and mixed in the flour until it was able to be turned out onto a floured surface for kneading.  I kneaded for 5-10 minutes.  Like the recipe states, the dough will be sticky, so I add just enough flour so that it's able to be handled but that it's also not a \"stiff\" dough.  It should be very pliable and soft like a baby's bottom, like the submitter stated ;-)  Then I patted it with oil and let it rise (about 1 hour).  I then punched it down and made it into 2 crusts; one 10\" round pan and one for a 11x13\" rectangle sheet.  This dough is easily \"tossed\" and stretched, so have fun with it! **I prebaked our crusts for about 8 minutes on 450°, until they barely started to have golden edges.  Then I topped them and baked for about 10 more minutes, until it \"looked\" done.  The center of our pizzas had a thin, chewy crust, and the big outside edges were delicious with a slight crisp outside, and chewy center.  Yum!!  Next time I'll get some nacho cheese to use as a dip for our crusts, which were tastier than breadsticks IMO:-)  I definitely recommend this dough, it's simple and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie-Cat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7772758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T17:59:28.263Z",
                "reviewBody": "pre bake the crust before freezing or baking",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2545381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-23T17:23:50.323Z",
                "reviewBody": "Perfect! I made it with my mixer, I had to add more flour before I put it in a bowl to raise the dough. I only waited 1 hour for it to rise and then I rolled it out. I made separate pizzas and put the dough on the grill. It made a perfect chewy and tasty crust. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A.M.Ashley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772321/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T18:47:31.08Z",
                "reviewBody": "The best pizza dough I've tried so far. It's soft, chewy, and shapes greatly. You will easily get thinner, crispier bottom but chewy and soft edge!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rachelp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4572630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-27T12:56:19.207Z",
                "reviewBody": "Thanks for the reviews! Being a NY Italian gal out in the South, there were few options for a good pie. I have been experimenting for 3-4 yrs, with much advice from NY professionals, horrible flops, many trials & errors...and then success. I have since bought a KitchenAid mixer and its so much better to mix the dough, as those of you who have suggested here have done. Whether you are able to handle it very wet or decide to add a bit more flour...make sure you do the autolyse (sit & soak of the flour) first and keep it 'pancake batter-like' when doing the preliminary mixing of ingredients-- its crucial! Then add more flour and mix or knead for 10-15 mins. :) Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ItsJeanettic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2475898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-21T08:40:55.737Z",
                "reviewBody": "This was absolutely impossible to deal with and stretch out on a pizza pan. I just ended up with a sticky mess even after adding a lot more flour. Then it puffed up way too much in the oven and wasn't thin crust at all. Such good ratings on this recipe... I followed it to a t so I'm not sure what went wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2066858/"
                }
            }
        ]
    }
]