[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213739/cranberry-apple-stuffed-pork-loin/",
        "name": "Cranberry Apple Stuffed Pork Loin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1211555.jpg",
            "width": 3128,
            "height": 2346
        },
        "datePublished": "2019-04-04T03:48:52.000Z",
        "description": "An easy and impressive dish that tastes wonderful.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "1 3-pound pork loin",
        "recipeIngredient": [
            "1 cup chicken flavored dry stuffing mix",
            "½ cup water",
            "1 (3 pound) boneless pork loin roast",
            "1 cup chopped apple",
            "⅓ cup dried cranberries",
            "⅓ cup chopped toasted pecans",
            "¼ cup finely chopped onion",
            "salt and black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 325 degrees F (165 degrees C). Combine the stuffing mix and water in a mixing bowl; set aside. Grease a roasting pan with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Trim the fat and connective tissue from the pork loin. Cut from one side through the middle horizontally to within 1/2-inch of the other side. Open the two sides and spread them out like an open book. Place the pork loin between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the pork with the smooth side of a meat mallet to a thickness of 1/2-inch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the apple, cranberries, pecans, and onion into the stuffing mix. Season the pork loin with salt and pepper to taste, then spread the stuffing mix onto the cut side of the loin. Roll the pork into a firm cylinder, and secure with cooking twine. Place into the prepared roasting pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the pork is no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Cover the meat with two layers of aluminum foil, and allow to rest in a warm area for 10 minutes. Remove kitchen twine before slicing and serving.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "tahoegirl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5476190476190474,
            "ratingCount": 84,
            "itemReviewed": "Cranberry Apple Stuffed Pork Loin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "267 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "65.5 mg",
            "fatContent": "11 g",
            "fiberContent": "1.6 g",
            "proteinContent": "25.5 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "307.5 mg",
            "sugarContent": "4.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-15T21:37:28.173Z",
                "reviewBody": "My husband and I really enjoyed this recipe.  I did make a few changes - As pork loin can be a little too lean - I brined the pork. I don't usually buy Stovetop stuffing but I did have a bag of Mrs. Cubison's Cubed Stuffing.  I made the whole bag of the stuffing - used some in the pork roast and served the rest on the side.  I sauted the apples, dried cranberries & pecans as well as adding 2 stalks of celery and half a chopped onion with 1/2 a stick of butter.  Used about 1 1/2 cups chicken broth to make up the stuffing.  My pork loin was really thick - rather than trying to pound it thin I laid it on it's side as directed and sliced to within a 1/2 inch of the other side, laid it open like a book and then from the center of the roast sliced it both to the right and again to the left - folding back the meat.  I ended up with a nice thin rectangle of pork.  Spread the stuffing on the pork and rolled it up like a jelly roll.  I didn't need to tie mine with kitchen twine.  I notice that most recipes for pork roast call for cooking to 160 degrees....which can lead to dried out meat.  I cooked mine to 140 - 145.  Let rest while I made gravy out of the pan drippings (which were beautiful).  Final internal temp. was about 150.  Served with baked potatoes, green beans and Cranberry, Apple Apricot sauce.  Delish!  Thanks for an inspiring recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T23:22:42.13Z",
                "reviewBody": "We loved this roast and have decided it will be our Chrismas Holiday meat dish. I followed the recipe with the following tweaks: Brined pork overnight. Did NOT trim fat from loin. Increased water to 3/4 cup. Added 1/4 cup applebutter to apple, cranberry, pecan mixture. Increased chopped onion to 1/3 cup. Sauteed chopped onions along with 1/3 cup diced celery in 1 tablespoon butter to add to stuffing mixture. Stirred stuffing mixture into apple/cranberry/pecan mixture. After spreading the stuffing on the loin and tying in a roll, I quickly browned in 2 tablespoons olive oil; and placed in roasting pan to bake. I removed the roast when the internal temp reached 145 degrees. Covered with tin foil while I made the gravy from the pan drippings. This was probably the best pork loin roast I've ever eaten . It was so moist and had great flavor. It tasted like the best comfort food you could have. I served with sliced oven roasted sweet potatoes, applesauce and sour dough rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-01T18:04:59.423Z",
                "reviewBody": "Tried this last night-was excited as we love the taste of apple and pork but this was just so-so. Found the recipe to be on the dry side, and if I make it again, I will not use the chicken stuffing mix but perhaps only bread cubes-the chicken flavoring gave the stuffing an odd flavor which we did not care for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "muttzee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1809966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-22T21:16:00.823Z",
                "reviewBody": "I have never made a stuffed pork loin before the directions were very easy to follow. I made my own stuffing using rye bread sauteed onions and carrots to which I added the dried cranberry apple and chopped pecans; I only had spiced glazed pecans but they worked. Instead of water I used apple cider from a local cidery to deglaze the pan. I added this finely diced rye bread and seasoned with thyme savory salt and pepper. I made extra stuffing following hints from other reviewers. Rolled and tied I seard the pork loin on the stove top then cooked in a 375 degree oven... This was a big hit with the whole family and I'm pretty sure I will have to make it again and willingly the recipe is very easy to follow and can be adapted easily to personal tastes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "laughingmagpie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3045250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-22T22:46:14.33Z",
                "reviewBody": "This was very good but I did make my own stuffing as I just couldn't wrap my head around chicken stuffing with pork. I did include the cranberries pecans and apple in the stuffing. I also did not trim my fat for cooking. I used a bit of applejuice to moisten my stuffing and glad I did I think it would have dry. I served it with a sweet potatoe mash and green beans",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5347257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T20:42:04.317Z",
                "reviewBody": "Excellent recipe!! My family loved it and they are very picky when it comes to pork. I did do a bit of tweaking but not much. I brined the meat overnight for a juicier roast. I used pork flavored stuffing mix and 2 different apple types (Granny Smith and Gala). I also cooked a tube of ground breakfast sausage and added it to the stuffing (a stuffing tradition in our house). The roast turned out extremely moist and tender. This dish will be repeated many times. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefDan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2506855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T21:33:38.31Z",
                "reviewBody": "I made this today using a seasoned cube stuffing mix prepared with onions and celery sauteed in a stick of margarine - I added the diced apple and some chicken stock and then poured all over the stuffing cubes. I added the dried cranberries which I had plumped up in a little hot water and then mixed all together. I spread some of the stuffing on the pork roast which I had prepared according to the directions and then seasoned with salt and pepper. I then rolled up the roast and browned it in a little canola oil on all sides and then roasted to an internal temp of about 145. I covered the roast with foil and made a gravy out of the pan juices. The remaining stuffing mix that didn't go into the roast was put in a casserole dish and baked during the last 20 minutes of roasting the pork. I've become a huge fan of cranberries in the stuffing. This is definitely a company worthy main course which I will be making again. Hubs isn't the biggest fan of pork but he does eat it. He loves stuffing so that helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janmarie1964",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2448410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-18T23:41:21.863Z",
                "reviewBody": "We enjoyed this! I followed the recipe for the most part but used Peppridge Farm Herb Seasoned Cubed Stuffing (made as directed cooled) and added a 1/4 cup chopped celery in addition to the other ingredients (For other stuffings I would sautee but don't with a chop recipe I have so thought I would follow the recipe on this). I tied it up every 3 inches then basted with a Maple/Dijon baste of 2 heaping tablespoons Dijon mustard to 1 cup real maple syrup and did so every 15 minutes. I have a convection oven so I backed off the temp to 300 after the first 15 as I was concerned it was cooking too fast and would be dry. Removed from oven about 150 temp and let rest. My husband said it had a nice flavor and enjoyed it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mickdee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mickdee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T00:38:14.91Z",
                "reviewBody": "Original recipe is great. I added figs. WOW!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Oren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6081054/"
                }
            }
        ]
    }
]