[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
                    "name": "Pasta and Noodles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/521/pasta-and-noodles/pasta-by-shape/",
                    "name": "Pasta by Shape Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/48788/beefaroni/",
        "name": "Beefaroni",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1013119.jpg",
            "width": 2718,
            "height": 2727
        },
        "datePublished": "2019-04-02T06:44:59.000Z",
        "description": "This was one of my favorite dishes growing up and now it is my children's. Ground beef, cheese and tomato sauce are baked into a simply delicious casserole.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound ground beef",
            "2 cups shredded Cheddar cheese",
            "2 (15 ounce) cans tomato sauce",
            "2 tablespoons butter",
            "1 (16 ounce) package uncooked elbow macaroni",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crumble the ground beef into a large skillet over medium-high heat. Cook, stirring frequently, until evenly browned. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the ground beef is cooking, bring a large pot of lightly salted water to a boil. Add macaroni, and cook until tender, about 8 minutes. Drain, and stir in butter. Transfer to a large casserole dish, and mix in the ground beef, tomato sauce, and Cheddar cheese. Sprinkle a little salt and pepper over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake uncovered for 30 minutes in the preheated oven, or until heated through and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "Pasta and Noodles",
            "Pasta by Shape Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "IRISHEYES0814"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.058608058608058,
            "ratingCount": 273,
            "itemReviewed": "Beefaroni",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "472.9 calories",
            "carbohydrateContent": "47.8 g",
            "cholesterolContent": "71.8 mg",
            "fatContent": "19.9 g",
            "fiberContent": "3.3 g",
            "proteinContent": "25.3 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "782.2 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-25T23:15:18.39Z",
                "reviewBody": "The only reason I didn't give this 5 stars is because I changed it a bit. I browned the meat with some onion fresh garlic and Montreal Steak Seasoning before adding it to the pasta. I only used 1/2 the pasta it called for and it was plenty!! It was enough for 4 adults and 3 kids with just enough leftover for my hubbies lunch. I used 1 can of diced tomatoes in their juice and 1 1/2 cans of tomato sauce mixed all together with Italian seasoning and some dried parsley. I also reserved some of the cheese for the top(last 10 minutes of baking)and also added some crushed Ritz Crackers on top for extra crunch! My husband loved it! It was super yummy and my picky 4 and 6 year olds gobbled it up. Thank you Kelli for the post. I will definitely make this again mabye adding some veggies next time. It is a good base to start.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mamazilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488733/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-18T15:29:21.543Z",
                "reviewBody": "Very good throw-together dish.  I did make some additions;  sauted a chopped onion, bell pepper and minced garlic with the meat.  Seasoned it up a little with some Italian seasoning, red pepper flakes and worchestshire.  I also put some stewed, diced tomatoes in for a little chunkier sauce.  Not gourmet, but so much better than a box mix!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SweetBasil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-13T21:58:46.547Z",
                "reviewBody": "I did not think this would taste better than it looked. My family and I really enjoyed it (especially my husband). At first when my husband looked at it he frawned lol. But when he smelled it cooking and tasted it he had seconds! He said its way better than the processed canned stuff which I had to agree with him on! I usually dont like beefaroni but making it home-made make it taste good! lol) I made some changes to the recipe to make it more tasty and look presentable: 1) I added more cheese to it. (My family loves cheese lol) 2) Added chunky spagetti sauce with mushrooms (had some spices). 3) Added some spices that wasnt in the spagetti sauce (use spices that you like and use in an Italian type dish) I didnt make the sauce that went to this recipe. 4) I layered it more like a lagnasa mixing just some noodles into the meat mixture instead of mixing it all together. It turned looking and tasting really good! This is a great recipe if you want to make a different and simple italian-taste dish for your family. Hope this helps cause the beefaroni version I made to this recipe will make it taste better as well as make it hold well together...when presenting it instead of it looking like one big slop!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2480082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-13T03:55:05.687Z",
                "reviewBody": "Although this sounds good, the recipe as it was made in the early 1970's for our family it was called Skillet Macaroni and Beef.  All prepared and cooked in one skillet. The first part in the directions are the same...then remove the meat from the skillet and add 1/2 pound elbow macaroni, minced onion and chopped green pepper until onion is soft, (if needed, add a little oil) return meat to skillet and for 1-1/2 lbs ground beef or ground turkey add 16 ounces of tomato sauce, water, salt and pepper, 1-1/2 Tablespoons Worcestershire Sauce. Cover and simmer for 25 minutes or until macaroni is cooked to taste.  Yum-Yum...children loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ZIPORAHS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-03T01:52:18.513Z",
                "reviewBody": "I modified the recipe alot because I thought the dish would need something more.  Overall this is a good starter recipe that you can modify easily.  It's also a fast and easy recipe to make if you are tired and don't really feel like cooking or if you are a beginner cook.  I added 1 chopped red pepper, 1 chopped onion, 2 jalapeno peppers chopped, 3 cloves garlic, seasoned salt and pepper.  Since I didn't have Shredded Cheddar, I had to use 4 cheese mexican shredded cheese.  I added a little bit of salt and pepper when cooking the ground beef and a little more just before I put the dish in the oven. The meal was great and still fast to make since I cut the other ingredients while waiting for the water to boil and while the meat was cooking. This dish could have used another pound of ground beef, but that depends on you and how much meat you want in the dish.  A mistake I made was thinking it needed more tomato and added a few spoonfuls of a can of diced tomato...this was slightly too much tomato.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SZYQ1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/szyq11/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-01T18:36:51.55Z",
                "reviewBody": "This was Awesome. I did add some cajun seasoning (slap ya mama) to it. along with some garlic powder while cooking the meat and after it was all mixed up. I mixed 2 cups of the cheese in the dish and added about a half cup to the top. The boys loved it! EASY to make too. I used about 14 ounces of elbow macaroni. will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CajunDee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/deniselaird/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-23T22:59:38.573Z",
                "reviewBody": "Simple recipe for fantastic comfort food. I add chopped onions and garlic powder to the meat. This is easy to make during the work week and much better than boxed hamburger meals. A hit with the whole family toddler to adult. We make this regularly. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1518212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-15T15:41:06.35Z",
                "reviewBody": "This was a hit with my family. I think it's a good base recipe. It was easy and fast..which makes it a hit with me. After reading the reviews I only used 11oz of pasta added some garlic powder and italian seasoning to the ground beef as it was browning and I used a 28 oz jar of spaghetti sauce because I didn't have the tomato sauce. I also mixed all ingredients in the pan before placing it in the casserole dish..it was easier to mix that way. Following others advice I held some of the cheese back and topped the casserole the last 5-10 minutes. This is a recipe my teenaged daughters could easily make so it will go in my recipe box. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KitchenHazard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2533858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-04T01:54:43.717Z",
                "reviewBody": "Very good. I followed the recipe accept I added 1 1/2 tablespoons of Worchestershire Sauce two cloves of garlic and spaghetti sauce instead of tomato sauce. It made a lot of food I didn't think we would be able to finish it but we did. Awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCOOBYMATT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1453270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-21T00:55:02.183Z",
                "reviewBody": "This recipe as stated is very bland. I made a few changes as others suggested and it turned out much much better:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "vababe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429436/"
                }
            }
        ]
    }
]