[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/217/salad/potato-salad/",
                    "name": "Potato Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16381/salad/potato-salad/red-potato-salad/",
                    "name": "Red Potato Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214156/beaumont-ranch-potato-salad/",
        "name": "Beaumont Ranch Potato Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F616078.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2019-04-04T03:49:00.000Z",
        "description": "I have kept this recipe a ranch secret, but I have decided to share it. This is my variation of a French classic garlic potato salad. It is different than the dish that inspired it, but very good and easy as well.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "5 pounds red potatoes",
            "1 (.7 ounce) package dry Italian salad dressing mix (such as Good Seasons®)",
            "¼ cup tarragon vinegar",
            "¼ cup water",
            "1 cup extra-virgin olive oil",
            "½ cup chopped celery",
            "1 cup real bacon bits",
            "¼ cup chopped dill pickle",
            "¼ cup chopped green onion",
            "3 cups mayonnaise"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the potatoes into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, whisk together the dry Italian dressing mix, tarragon vinegar, water, and olive oil until thoroughly blended. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the hot potatoes into a large bowl, and roughly but thoroughly slice them with a table knife until the potatoes are in chunks. Pour the dressing mixture over the hot potatoes, toss to coat, and let the potatoes cool. Add the celery, bacon bits, dill pickle, and green onion to the potatoes; lightly stir in mayonnaise until all ingredients are well combined, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Potato Salad Recipes",
            "Red Potato Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ranch_maven"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.594936708860759,
            "ratingCount": 79,
            "itemReviewed": "Beaumont Ranch Potato Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "440.9 calories",
            "carbohydrateContent": "19.8 g",
            "cholesterolContent": "16.5 mg",
            "fatContent": "38.8 g",
            "fiberContent": "2 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "5.9 g",
            "servingSize": null,
            "sodiumContent": "554.9 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-30T18:09:03.75Z",
                "reviewBody": "This is my recipe. And I wanted to answers some questions from some of the reviewers.  The most important part of this recipe is to add the dressing to the hot potatoes. If you prefer to peel your potatoes first, it should be fine. I did it that way for years before I opened the ranch to the public.  We make this recipe for hundreds of people at a time.  Taking this step out save us a lot of time. And it gives the salad a rustic look consistent with the ranch's image.  As far as adding more calories by adding the oil, I think the flavor makes up for any extra calories.  You need less mayo for this recipe so I think it is an even swap calorie wise.   This is a recipe that you can make your own with by changing the condiments or the type of vinegar. I have been making this recipe for my family about 30 years.  I started with a bottled Italian dressing and quickly changed to my personal favorite Italian dressing.  At first I made it with corn oil, then safflower oil and finally extra virgin olive oil.   It was the first recipe I added the ranch's signature dishes when we opened ten years ago. I hope you enjoy this as much as my family has.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ranch_maven",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1497875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-19T19:13:13.447Z",
                "reviewBody": "This is the #1 recipe asked for at the ranch.  It has been a closely guarded family secret for years.  I hope you all enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shelleybeaumont",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4791552/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-20T19:11:03.053Z",
                "reviewBody": "I have enjoyed this wonderful dish at Beaumont Ranch and was so excited to learn that it had been offered to the masses!!! It will be a staple at our family gatherings from now on! Thank you so much for sharing it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen Bowman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2420590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-20T16:08:30.013Z",
                "reviewBody": "I took this potato salad to a cookout yesterday and it was a big hit with everyone.  Loved the blending of the various ingredients.  The only thing I did not use were the dill pickles because I was afraid it would make the salad too tart.  I do have one question, if anyone out there can answer for me.  I do not understand why the potatoes are cooked whole and chopped after.  I found this step to be very cumbersome.  When I was trying to chop all the potatoes, it mushed some of the others.  I would think it would be better to  chopped the potatoes before cooking which would save time and make the dish easier to prepare.  Please let me know if I am missing something here.  Appreciate any comments.  Awesome recipe and I will definitely make this one again.  UPDATE:  I made this salad again for a birthday party.  I cut the potatoes into bite size pieces and cooked for 10 mins. once the water came to a boil and then proceeded with the recipe.  So much easier to do it this way.  Also, I had rave reviews and some even said this was the best potato salad they had ever eaten.  Thanks for making me look like a gourmet chef!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2606519/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T17:02:04.72Z",
                "reviewBody": "I'm from Georgia and I've never tried a potatoe salad like this it was great! Thank you for sharing your recipe I will definately make this again. My husband loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jessicaone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3874237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T20:30:05.093Z",
                "reviewBody": "No brainer jut like everyone we loved this. I omitted pickle(DID NOT HAVE ANY) Little more green onion and real bacon(Not a fan of bacon bits.)  Turned out flavorful. I think you could even add boiled eggs. I think this is one of those recipes where once you make the original you can tweek and have fun with new textures and flavors",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3514538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-05T15:09:44.483Z",
                "reviewBody": "Made this recipe exactly as written. Even the pickles. Very good and everyone loved it. The simplest potato salad I have ever made. The reason you want to boil your potatoes whole is that they retain a better flavor. Simply use a fork and butter knife to break up potatoes after they have cooked. I added paprika and greens for garnishment.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debra Farinha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3448462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-07T20:41:46.833Z",
                "reviewBody": "I have been making potato salad this way for years. Use to make with the mix but with the market of great bottled dressings it makes it much simpler.  Every time I make I add a different kind of Italian type dressing , like Roasted Red Pepper, Light Asiago and Parmesan, Balsamic, while they are hot  and let sit to absorb the flavors before adding mayo, adds a different flavor. Always come home with an empty bowl.  Also, must be a Northern thing, we add hard cooked eggs which just add to a great flavor and texture.  This recipe stands alone but when short on time, this is an alternative. Wedo not add dill pickles, the dressing takes care of that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MILLIE CROSS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T17:23:51.833Z",
                "reviewBody": "took this to a potluck and everyone loved it. Next time I will undercook the potatoes slightly as they fell apart with the tossing while warm. But it is a delicious potatoe salad",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aimeejg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1668121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-25T04:51:51.08Z",
                "reviewBody": "I followed this recipe exactly as written (except to reduce the mayo) and thought it was okay. I thought there was too much bacon and mayo. I like bacon but the amount in this recipe is a bit much. If I make this again I will just add 1/3 cup bacon bits and add more to taste. As for the mayo I was going to follow the recipe exactly as written but added the mayo gradually. I'm glad I did this and didn't just dump it in because by the time I got to 1 1/2 cups there was plenty. 3 cups would've been way too much. I recommend this recipe just add 1/3-1/2 of the bacon and mayo and add more if you need to.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "charlie5696",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4227803/"
                }
            }
        ]
    }
]