[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17266/main-dish/pork/pork-chops/boneless/",
                    "name": "Boneless",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214765/crazy-good-stuffing-and-baked-chops/",
        "name": "Crazy Good Stuffing and Baked Chops",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1003065.jpg",
            "width": 2132,
            "height": 2132
        },
        "datePublished": "2019-04-04T03:49:16.000Z",
        "description": "Handed down from my father, these baked stuffed chops were one of my favorites growing up. Not really 'stuffed,' but fabulous! The sherry, mushrooms, and cooking method combine for a truly rich and succulent dish that sets it apart from all others! I hope you enjoy them as much as I do!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ pound sliced fresh mushrooms, or more to taste",
            "1 onion, chopped",
            "¼ cup dry sherry, or to taste",
            "2 tablespoons all-purpose flour, or as needed",
            "⅔ cup milk, or as needed",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (14 ounce) package dry bread stuffing mix",
            "¼ cup butter",
            "6 boneless pork chops",
            "½ cup water",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "½ (10.75 ounce) can  milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium-low heat, cook and stir the mushrooms and onion until the mushrooms are soft and have given up their liquid, about 5 minutes. Stir in the sherry, bring to a boil, and simmer until the onions are tender, 2 to 3 more minutes. Sprinkle flour over the mixture, and cook, stirring constantly until thick. Gradually mix  in 2/3 cup milk to make a creamy gravy, stirring constantly to avoid burning. Mix in 1 can of cream of mushroom soup and the dry stuffing, bring to a simmer, and cook until the stuffing mix is moist, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter over medium heat in a large skillet until no longer foamy, and pan-fry the chops until browned but not cooked through, about 5 minutes per side. Transfer the chops to the prepared baking dish. Stir water into the skillet, bring to a boil, and scrape and dissolve any flavor bits left in the skillet. Let the mixture boil until reduced by half, about 10 minutes. Pour the skillet drippings into the stuffing mix, and mix thoroughly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scoop up generous amounts of stuffing and mound on each chop. Whisk together 1 can of cream of mushroom soup with 1/2 soup can of milk, and pour the soup mixture over each chop to cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until chops are tender and cooked through, about 20 minutes. An instant-read thermometer inserted into the center of a chop should read at least 165 degrees F (74 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Boneless"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Pamela Frechette"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.24,
            "ratingCount": 25,
            "itemReviewed": "Crazy Good Stuffing and Baked Chops",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "633.2 calories",
            "carbohydrateContent": "66.1 g",
            "cholesterolContent": "84.3 mg",
            "fatContent": "24.1 g",
            "fiberContent": "2.9 g",
            "proteinContent": "35.9 g",
            "saturatedFatContent": "10 g",
            "servingSize": null,
            "sodiumContent": "1878.1 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-14T22:41:06.537Z",
                "reviewBody": "I'm the submitter of this recipe and I'd like to note that when you stir in the mushroom soup and the stuffing into the \"creamy gravy\"...you cannot simmer this. Just cook it for a few min. I wish I had more control over the editing process of my father's recipe as some things have been changed (like words and time). This really is a recipe that you just eye ball as it cooks. For example it may take less than 10 min for your pan drippings to reduce by half.;) Otherwise a big thanks to the AR staff for publishing my father's recipe!!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pamela Frechette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2437707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-09T18:51:06.6Z",
                "reviewBody": "I made these for supper last night, and I thought they were, in fact, CRAZY good. Based on what I had on-hand, I had to rearrange things a little, but I tried to keep as close to the recipe as I could. I browned the chops first, then made the sauce and stuffing mixture. I didn't have cream of mushroom soup on hand, so I nearly tripled the sauce recipe (actually used 1/3 cup sherry, 1/3 cup flour, and about 3 cups milk), and seasoned with No-Salt Seasoning, also from this site, plus a little salt and pepper. I removed about 1 1/2 cups of the sauce from the pan before stirring in the stuffing mix. Topped the chops with the stuffing mixture, one slice of provolone cheese, and the remaining gravy. It was absolutely WONDERFUL, and as much as I hated to deviate from your father's recipe, I'm so glad you shared it, and I'm glad it led to such a great meal for us. Can't wait to try the original version, too - hopefully next time I'll be better prepared and have all the stuff ready! Thanks for sharing, Pam!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "campagnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T22:38:50.783Z",
                "reviewBody": "The stuffing was amazing! I used bone in chops because that was all I had...not the best thing to do. We had to scrape the stuffing off so we could see where to cut the chop. Very tasty though...I will make again with boneless chops as the recipe calls for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly J Chadwick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/hollychadwick/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T00:13:27.35Z",
                "reviewBody": "Found this recipe when looking for a throw-together dinner.  I happened to have all the ingredients on hand.  It turned out absolutely fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "timmonssc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6368747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-08T20:43:43.157Z",
                "reviewBody": "This was an instant hit! Classic comfort food at its best. The only changes I made: an 8 oz package of stuffing mix was plenty and I added some black olives to the stuffing. I served it with mashed potatoes= killer! My husband was in heaven! My 16-month old who is quite picky gobbled it up too! Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "intruth7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6529829/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-10T03:02:26.23Z",
                "reviewBody": "Pretty darned good! I did play with this some but the recipe and its directions are fine too just as is. This is an ideal dish for you to put your own spin on and I'll bet the same cook probably wouldn't make this the same way twice! In my case I did NOT brown the chops first. These boneless chops are so lean I didn't want to risk overcooking them. I put them in a foil-lined plan for easy clean up that I had oiled lightly with olive oil. I seasoned the chops with salt pepper and poultry seasoning (a good place for your own spin here in terms of seasonings!) To the stuffing itself I added chopped celery cuz Hubs likes it. I found it kind of drab looking and seriously in need of some color easily rectified with a little chopped parsley. To the sauce I added a good glug of white wine (Chardonnay) as well as a couple of shakes of Worcestershire sauce. Perfectly baked juicy and tender after 30 minutes and like meatloaf good comfort food. Bonus for calling for boneless chops good clean eatin with no bone to have to work around!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T00:54:10.55Z",
                "reviewBody": "Thanks Pam's dad for an outstanding recipe! Even my picky 22 month-old loved this. Next time I'll try this recipe with chicken breasts. I'm sure it's excellent that way as well but delicious as-is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marcia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2019056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-14T20:34:07.637Z",
                "reviewBody": "This dish just didn't come together for me.  The cream of mushroom soup was far too overpowering.  Also combined with the fact that I usually don't like pan-fried meat, it bombed on me.  The stuffing had surprisingly little flavor.  As I was eating my pork chop, I pondered what a homemade mushroom sauce would do to the overall quality of the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "EMW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2351572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-22T17:35:43.923Z",
                "reviewBody": "We loved this recipe. At first I thought it was way too much stuffing but it really wasn't. We love fresh mushrooms so next time I think I'll add more but we gave it a 2 thumb up. It was even better as leftovers!! The only thing different I did was not add the sherry because I ddn't have any. Believe it or not I just poured in a little half & half for moisture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PKruger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4630644/"
                }
            }
        ]
    }
]