[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
                    "name": "Stuffed",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
                    "name": "Stuffed Cabbage",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/48815/ukrainian-meat-filled-cabbage-rolls/",
        "name": "Ukrainian Meat Filled Cabbage Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5899234.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2019-04-02T06:45:00.000Z",
        "description": "In Ukrainian kitchens, cabbage leaves are often used as cases for soft fillings. These rolls are a little different, because the leaves are filled with a meat stuffing and not primarily a cereal mixture. This makes them 'holiday' fare. For a different flavor, use tomato juice instead of chicken broth. See the note at the bottom of the recipe for pressure cooking instructions.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon butter",
            "1 large onion, chopped",
            "¾ pound ground pork",
            "½ cup fresh bread crumbs",
            "1 egg",
            "2 teaspoons salt",
            "1 teaspoon freshly ground black pepper",
            "1 head savoy cabbage, cored",
            "2 cups chicken stock, or as needed",
            "1 tablespoon all-purpose flour",
            "1 cup sour cream",
            "1 tablespoon chopped fresh dill"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt butter in a skillet over medium-high heat. Sautee onion in butter until tender. Remove from heat, and set aside to cool. When the onion is cool enough to handle, mix together the ground pork, bread crumbs, egg, salt and pepper until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the head of cabbage in a large pot, and add enough water to cover the cabbage halfway. Bring to a boil, and cook for about 2 minutes. As the outer leaves become translucent and soft, remove them one at a time by peeling them off with a wooden spoon. Trim off the thick ribs at the leaf stem.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Grease the bottom of a 9x13 inch baking dish, and line the bottom with outer cabbage leaves. Lay a few more leaves on a clean work surface. Place a large spoonful of the pork mixture at the base of each leaf. Roll up towards the top. Repeat until filling is used up. Arrange the finished rolls over the leaves in the dish, and pour in just enough broth to cover the rolls. Place extra cabbage leaves over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and bake for 1 hour in the preheated oven. When finished, drain off broth from the dish into a small saucepan. Whisk together the flour and sour cream. Gradually stir the sour cream into the broth. Cook over medium heat, stirring frequently until heated, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, arrange cabbage rolls on a platter, cover with sauce and sprinkle with dill. This goes perfectly with homemade noodles, or millet kasha.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Stuffed",
            "Stuffed Cabbage"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Olga D"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.63768115942029,
            "ratingCount": 69,
            "itemReviewed": "Ukrainian Meat Filled Cabbage Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "222.5 calories",
            "carbohydrateContent": "12.4 g",
            "cholesterolContent": "67.5 mg",
            "fatContent": "14.6 g",
            "fiberContent": "4 g",
            "proteinContent": "12.2 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "860.1 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-10T15:44:20.437Z",
                "reviewBody": "Consider frying the onions in bacon grease for additional flavor. If you cut the cabbage leaves off the core and boil them in 1 gallon water / 1 cup white vinegar they become flexible yet strong enough to handle. Boiling them already removed from the head makes is easier than trying to separate them from the head while it rests in boiling water. The vinegar toughens them a bit for handling and adds a nice flavor. Savoy cabbage is awfully delicate for rolling - I prefer plain white cabbage. I don't think garlic or tomato in any form belongs in this recipe for it to be authentic. Thanks for a very interesting post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MUSIC_MINX",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/511480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-13T01:53:04.817Z",
                "reviewBody": "This recipe is fabulous! I did make a few changes though. Instead of the ground pork I used 1lb ground turkey. The grocery store didn't have any pork go figure. I also added a tablespoon of minced garlic to the groung meat mixture & 3/4 cup of Italian bread crumbs. It turned out perfect. The rolls were very moist & extremely flavorful. The sauce was a bit thin but yummy none the less. My husband was a bit apprehensive about trying them but raved when he tasted them. The procces is time consuming but worth it. I will definitely make these again. Thanks for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lola/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-28T16:07:58.423Z",
                "reviewBody": "These were awesome - a cross between cabbage rolls and swedish meatballs.\n\nHere's how I tweaked the recipe - it came out great! I took the reviewer's advice and added 1 cup white vinegar to the cabbage water, and it really worked great - I will always do this from now on! I also substitued 1/3 cup oatmeal for the 1/2 cup breadcrumbs and added 1 cup cooked brown rice to the meat mixture. \n\nI had read that the sour cream/broth sauce was runny (and it was) and I wanted more of a white sauce, so I had to add a total of 3 tbs flour to the sour cream instead of just 1 tbs. The sauce was magnificent and went wonderfully with the rolls. \n\nHubby likes the more traditonal tomato sauce on cabbage rolls, so I will go half and half on the next batch to make him happy. I fell in love with this recipe and it is the only one I will use from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bowhuntingredneckswife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2289661/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-23T19:57:58.42Z",
                "reviewBody": "Very good and pretty easy. I added about 2 cloves of garlic near the end of cooking the onions. I also used V-8 juice instead of tomato juice. It seemed to make the sauce a bit deeper. Savoy cabbage is rather easy to work with I'll make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mike Schoenbacher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-23T19:57:54.123Z",
                "reviewBody": "These were great! I grew up in an Ethnic area of upstate and NY and this taste is authentic! These disappeared in no time - so I'll probably double it in the future. They were a little salty - so I'll cut the salt back too. My picky son doesn't like sour cream - and they were great without the sauce... They didn't need it. I really enjoyed these thanks for the taste of \"home food\" Olga!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dwieberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dwieberg/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-22T19:27:42.223Z",
                "reviewBody": "I've been making this recipe for monthes now every single person that has tried it has loved it. including 7 & 10 year olds! The only substitutions I have used have been due to necessity ground turkey works and best of all is hot ground pork. yummy. thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STOMP CATS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/266478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-18T02:26:49.21Z",
                "reviewBody": "This was a great base recipe. A few changes: pre-cooked the rice and added to 1# uncooked ground beef mixed with 1/2 raw onion & 3 cloves of garlic chopped. I added 1 tsp dill weed and 1/2 tsp of caraway seed 1/2 tsp black pepper and 1/2 tsp of cinnamon. I parboiled the cabbage for easier peeling (reserving the rest for Minestrone Soup). I used two pints of homemade tomato sauce for the bottom of the baking sheet and for topping the cabbage rolls. The sauce was absolutely amazing...and very rich! Two cabbage rolls each was all we could eat along with some sugar snap beans and chunky applesauce. F i v e STARS in my book! Thank you for submitting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SANTIH9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/174415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-22T23:29:10.567Z",
                "reviewBody": "I loved this! I made a few changes though. Used 1.5 lbs ground beef instead of pork and beef broth instead of chicken stock. AMAZING.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christen Symmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3406621/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T23:09:37.073Z",
                "reviewBody": "I changed the recipe slightly and sauted garlic and mushrooms with the onions and I used ground beef versus pork. I also added some condensed cream of mushroom soup to the broth (about 2/3 a cap). I also added two tablespoons butter and a quarter cup of half and half to the sour cream topping. It came out AMAZING. But my props are to the original recipe--I had mushrooms I had to use so this is the only reason I changed the recipe. The meat filling was succulent---this recipes so tops the tomato-based versions in my opinion. P.S. this was my FIRST time with stuffed cabbage rolls. It's easy (albeit time consuming) and a recipe I plan to use for many years thanks for sharing it it's a treasure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MULTIFARIOUS5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1330207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-15T22:26:16.597Z",
                "reviewBody": "Made per recipe way to bland. Needs to have spices, garlic powder, dried spice such as parsley R",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "horsewithnoname",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17314317/"
                }
            }
        ]
    }
]