[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214751/no-knead-artisan-style-bread/",
        "name": "No-Knead Artisan Style Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1031765.jpg",
            "width": 2024,
            "height": 1778
        },
        "datePublished": "2019-04-04T03:49:16.000Z",
        "description": "This is a very easy bread to make without any kneading. Bake in a Dutch oven or heavy casserole dish. The bread comes out very crusty and with huge holes throughout, just like at the bakery.",
        "prepTime": "P0DT2H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P2DT3H0M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "3 cups all-purpose flour",
            "1 teaspoon active dry yeast",
            "2 teaspoons salt",
            "1 ⅔ cups warm water (110 degrees F/45 degrees C)",
            "1 teaspoon chopped fresh rosemary",
            "1 teaspoon chopped fresh thyme",
            "1 teaspoon chopped fresh sage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the flour, yeast, and salt in a large bowl and mix to combine. Add the water and herbs, if using, and mix well. The dough will be very sticky and shaggy-looking. Cover the bowl with plastic wrap and set aside at room temperature for 18 to 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Generously flour a work surface. The dough will have risen and will be covered in bubbles. Transfer the dough to the work surface and dust it with flour. Fold the dough in half, and then form the dough into a ball by stretching and tucking the edges of the dough underneath the ball.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Liberally flour a kitchen towel (do not use terrycloth). Place the dough ball on the floured towel. Cover with another floured towel. Let the dough rise for about two hours [see footnote].\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 450 degrees F (230 degrees C). Place a lidded Dutch oven or deep heavy duty casserole dish (with lid) into the oven to preheat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Carefully remove the hot baking dish from the oven. Remove the lid and gently turn the dough ball into the ungreased baking dish, seam-side up; shake the dish so the dough is more evenly distributed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and bake for 30 minutes. Remove the lid and bake until the crust is golden brown, 15 to 20 minutes. Remove the loaf from the baking dish and let it cool on a rack before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jewissa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.488888888888889,
            "ratingCount": 360,
            "itemReviewed": "No-Knead Artisan Style Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "229.9 calories",
            "carbohydrateContent": "48 g",
            "cholesterolContent": null,
            "fatContent": "0.7 g",
            "fiberContent": "1.9 g",
            "proteinContent": "6.7 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "778.8 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-30T22:29:44.907Z",
                "reviewBody": "I've been baking no-knead bread ever since the original recipe came out in the New York Times several years ago, so trust me when I tell you it is not recommended that you remove the baking vessel from the oven after you've just spent 30 minutes heating it.  Do NOT remove it from the oven, just pour the dough (batter, really) into the baking vessel and then cover and bake.   That way you don't lose the heat you just spent half an hour to achieve to heat the pan.  Also, there's no need to shake the dough once it's in the pan, it'll spread by itself while baking.   It's really a misnomer to call this a dough, because it really comes out as a batter.  I agree with the other reviewer that it's impossible to form it into any kind of a ball 'cause it's just too sticky.  And forget the step of placing it on a towel to raise.  It's just messy and doesn't achieve anything more than if you just stir it and place it in a bowl and let it rise another 2 hours.  That said, I would rate this a 4, only because I think the instructions are not the best way to make this bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JoAnn32789",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2231848/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-05T07:03:34.513Z",
                "reviewBody": "I became an avid bread maker when I discovered Jim Lahey's recipe.  I wanted to post it, but you beat me to it, Jewissa.  I'll have to try adding the fresh herbs, though.  Great idea! Proud as a peacock, I brought a few slices from my first loaf to work.  One of my colleagues, who lived many years in various European countries, picked up a piece and immediately identified it as European peasant bread.  After one bite, she said, \"I need this recipe.\"  (She hasn't bothered with recipes in years!)  BTW, the \"heavy-duty casserole dish\" should be either cast iron or stoneware.  I've read that Le Creuset works fine, as long as you remove the handles, which aren't oven-safe at 450 F.  UPDATE: I brought this bread (minus the herbs) to a staff potluck, and it was a great success.  There were many recipe requests.  Those who've tried it are converts.  The only challenges are to find the proper pot and to figure out the timing.  I haven't bought bread since I discovered this recipe!\n2ND UPDATE:  I've found, tweeked, and posted a recipe for a healthier yet delicious whole-wheat multi-grain bread which uses the same method.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J-9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3729292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-26T18:08:20.887Z",
                "reviewBody": "I use 1/2 tsp instant yeast. Mix all ingredients, cover the bowl & set it aside for 12 hours.  Flour a surface, scrape the dough out, stretch it out, sprinkle with flour, fold it over itself one way & then the other, put a sheet of parchment paper in a bowl, spray with cooking oil spray & sprinkle with corn meal, place dough into the bowl for the 2nd rise (1-2 hours), & cover with a cotton towel.  1/2 hour before ready to bake, put the pot in the oven and preheat to to 500 degrees.  When ready to bake, if you want sesame seeds/grains on the top, spray top with cooking oil and add your seeds/grains & pat down lightly, take the pot out of the oven and remove the lid.  (I use several old towels just to protect surfaces when handling extra hot pots, also; you might want to use a pair of long sleeved pot mitts with silicone palms.  Lift the parchment paper & dough out of the bowl and place it into the hot pot.  Take a scissors and cut the excess parchment paper from around the top of the pot.  Put the lid back on the pot and place it into the oven.  After the first 5 minutes, lower the oven to 475 degrees & continue to bake for 25 minutes more.  After 30 minutes, take out the pot, remove the lid & check the internal temperature. If it reads 200 degrees, & the end of the thermometer is not sticky or gooey, put the uncovered pot back in for 10-15 minutes until browned. Remove pot, use a turner to lift the bread & paper out & place bread on cooling rack. Remove paper when cooled.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gipper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4678350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-23T23:27:18.153Z",
                "reviewBody": "I have been making no-knead bread 3 times a week for over a year - love it!  I always thought that getting the dough from a towel into the pot a really clunky process, so I started using baking parchment and got myself a La Cloche. I rip off a piece of parchment a bit bigger than the bottom of the La Cloche, sprinkle it with flour or semolina and place the formed dough on it.  Cover with a tea towel and allow it to rise while the La Cloche is preheating.  What is great about this is that when the dough is ready to bake you can just lift the parchment and set it into the bottom of the La Cloche and put the lid on it.  The parchment will stick out, but it does not affect the baking process at all.  Sometimes the risen dough is so slack that I have to slide a pizza peel under the parchment to lift and transfer the loaf to the pot, but it works great, beautiful, high loaves of bread, no flipping or mess.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary P. Brown",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5501238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-22T00:27:37.78Z",
                "reviewBody": "I also have used this recipe for a couple years with great success.  The only diff is I use 1/2 tsp. instant yeast, 1 tsp salt, 1 1/2 cups water.  This is more in line with the Sullivan St. bakery recipe.  I've included a pic of my version of cranberry walnut bread using this recipe.  Simply add cran. and walnuts to flour mixture, then add water.  Follow directions as given.   I've had luck with a shorter proofing time also....12-15 hrs depending on the season.  To make the baguette pictured, I placed the dough on a hot pizza stone and covered it with a loaf pan.  Shorter baking time, that's all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "freewill2112",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4965592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-18T18:06:52.703Z",
                "reviewBody": "I  Use this recipe all the time.  Usually 2 1/2 cups APF 1/2 c wheat flour. 1 1/4 c water. I let mine sit for 12 hours then 2.  Ive made about 30 of these loaves over the last 3 months.  Jalapeño cheese, rosemary garlic, Hearty (with germ, bran, flax and nuts).  Awesome bread with no work. Comes out looking and tasting better than any artisan bought bread out there!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "balamoreaux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5766259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-24T16:06:56.57Z",
                "reviewBody": "excellent bread. I love the crust. Tastes like great grams farm bread. I make it in the same bowls she used. I doubled the recipe this time the last time the loaf was gone before I could blink! if you feel the dough is to watery add more flour, too dry more water.\n\nPart of making bread is using your sight and the feel of the dough. sticky like a marshmallow you break apart in your hands. dry is like leather so you add a bit more water. \n\nI have been making bread for over 4 decades now if it doesn't work its not the recipe.\n\nThe weather also plays big in making bread and the altitude at which you live.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julia Monroe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/juliaferry/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-03T21:51:41.35Z",
                "reviewBody": "Whenever I make this bread it disappears like magic! I do the same as another reviewer...1  1/4 t salt and 1/4 t yeast and 1 1/2 cup water. I don't bother with using a towel or anything. As soon as 18 or so hours is up, I dump the dough on a floured board, wait for the dutch oven to get really hot and just dump the dough in there! No matter how it has looked when I put it in the dutch oven, it looks and tastes fantastic when it comes out of the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gracee87",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2123715/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-09T15:23:27.623Z",
                "reviewBody": "I made few no knead bread in the past and this recipe is the best .\nEasy and simple.\nBread came out very very  crusty in the outside and soft and chewy in the inside, it looked similar to bread from fancy NY bakeries .\nI read all  reviews and comment and I decided Just gonna do exact recipe steps .\nOther reviews that give bad review basically seem not familiar with baking sticky dough .\nSo that my advice:\nDon't worry how sticky it is just flour your hand and don't worry how it shape look pre baking , just dump  the dough in the Iron cast dutch oven pan and it will shape it self .(yes and I said dump it)\nI read other review say no need to cover the pan and I disagree .\nThe reason you cover it because of the steam that going to drip back in to the dough and give the great crisp bakery style we looking for .\nIf you ever see the Lodge Iron Cast cover u will understand the kisses look like dots and that is mainly for the steam to fall back to the pan .\nOther review give the recipe very poor review because the dough did not rise ,that a bad reason to give bad review , your yeast in fault thats why not working or you put hot water instead of warm which burn the yeast so go buy new yeast and try again .",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yoli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3376128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-08T21:30:08.78Z",
                "reviewBody": "gooey and just did not rise at all. stuck to the dutch oven. takes overnight with unsatisfying results. sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "margaret",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3802880/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "No-Knead Artisan Style Bread",
            "description": "No need to knead this easy crusty loaf!",
            "uploadDate": "2017-11-03T16:02:41.636Z",
            "duration": "PT1M33.427S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa49148d0-46c8-4ee4-b203-3fb211031231%2Fd79caf1f-7521-4542-9066-3cd4f75af2b5%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5634389849001"
        }
    }
]