[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16244/main-dish/rice/beans-and-rice/",
                    "name": "Beans and Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214780/mujaddara-arabic-lentil-rice/",
        "name": "Mujaddara Arabic Lentil Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1658236.jpg",
            "width": 1728,
            "height": 972
        },
        "datePublished": "2019-04-04T03:49:17.000Z",
        "description": "Enjoy a great tasting dish to share with family and friends. Special dish for vegetarians, and one of our favorite meals. Instead of placing the onion on top you can mix it along with the lentils and rice before serving. It makes a perfect meal with a fresh green salad. Also you can use 2 cups of vegetable broth instead of 2 cups of water to cook the lentils.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup dry lentils, rinsed",
            "2 cups water",
            "1 teaspoon salt",
            "1 tablespoon ground cumin",
            "1 tablespoon garlic powder",
            "¾ cup white rice, rinsed",
            "¾ cup water",
            "1 teaspoon salt",
            "2 tablespoons olive oil",
            "¼ cup vegetable oil",
            "3 white onions, sliced into 1/4-inch rings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine the lentils, 2 cups water, 1 teaspoon salt, the cumin, and garlic powder in a pot over medium heat; bring to a simmer, reduce heat to low, and cook until the lentils begin to soften, 20 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the rice, 3/4 cup water, 1 teaspoon salt, and the olive oil into the lentils. Cover the pot and continue cooking until the lentils and rice are tender, about 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the cooking oil in a skillet over medium heat; cook the onions in the oil until browned, 7 to 10 minutes. Spread the onions over the rice and lentil mixture to serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Beans and Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Osiris (Rodizer)"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 130,
            "itemReviewed": "Mujaddara Arabic Lentil Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "371.2 calories",
            "carbohydrateContent": "49.8 g",
            "cholesterolContent": null,
            "fatContent": "14.4 g",
            "fiberContent": "12.2 g",
            "proteinContent": "11.6 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "788.2 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-03T15:55:41.507Z",
                "reviewBody": "To have a really authentic taste, consider these two notes:  1- Saute one onion untel soft and translucent in the pot then add the liquid with the lentils but, DON'T ADD SALT before the lentils are soft, then continue as per above. 2- Saute the other two onions in a skillet separately until they are DEEP GOLDEN AND CRISPY, the onions will taste sweeter and more interesting this way. Set aside until they are cooler. Garnish the mujaddara with it and enjoy.  For those who felt it was a bit dry, Mujaddara is supposed to be eaten along side a fresh green salad or yogurt.  One more thing, consider a bit of all spice and cinnamon along with the cumin to give it more depth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aprilbeauty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2450462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-25T22:26:01.353Z",
                "reviewBody": "My husband is Lebanese and this is a staple in our house.  The kids love it.  I don't prepare using the garlic powder or cumin but sometimes I do add allspice.  We serve this with a yogurt sauce consisting of plain yogurt, crushed garlic and mint.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amazing Bacon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5047925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T23:16:01.447Z",
                "reviewBody": "I thought this recipe was great. It was so economical and such a comfort food. As per other reviews, I added 1 tsp garam masala to the lentils just before I stirred in the rice. I also sprinkled 1/2 tsp cumin seeds and a few dashes of cinnamon onto the onions as they fried / caramelized. Serving this with yogurt was a must. We used greek yogurt, and it was amazing. The tang of the yogurt with the sweetness of the caramelized onions and cinnamon went so well with the hearty lentil and rice mixture. I fried one large yellow onion, and that seemed to be enough. Next time, I will chop the onions instead of slice them into rings because the rings were difficult to incorporate into the lentil rice mixture. I will absolutely make this again. (I also made homemade whole wheat pitas to go with this dish - they were the perfect for this meal. Used a mixture of whole wheat and AP flour, 2:1 for whatever recipe you use.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JellyFish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2653067/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-06T02:17:56.3Z",
                "reviewBody": "I love lentils and rice.  And this is pretty good with a bunch of modifications.  However, it would have been very bland had I not added a bunch of ingredients.  So the rating is for the recipe as written, but this can be made lots better by:\n* using a vegetable or chicken stock\n* adding the salt after the lentils are cooked, else the lentils will be tough if you add the salt earlier\n* adding some onions at the beginning, while the lentils are cooking\n* add an extra 1/2C liquid - even on my lowest simmer and with a lid on the pot, this still ran out of liquid before the lentils were cooked.\nWhen its time to add rice, also add:\n* extra water (you need 2 cups water for every cup of rice, so if you are going to add 3/4C rice, you should be adding 1 1/2C water, not just 3/4C water).\n* add 1 tsp or so of curry powder depending on how hot you like it.\n* add 1 tsp of garam masala (or allspice).\n* add 1/2 tsp ginger.\nAt serving time:\n* provide greek yogurt or a raita.\n* provide sriracha hot pepper sauce.\n\nI didn't use the vegetable oil as it would have added a bunch of unnecessary calories.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "NewBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/880403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-22T19:29:57.843Z",
                "reviewBody": "A bit bland as the recipe reads but with a few seasoning changes it was fantastic! Here's what I did to make it tasty: - vegetable stock instead of water - 3 onions caramelized until dark golden brown - cumin added to onions instead of lentils to toast - tsp cinnamon 1/2 tsp allspice 3 cloves added to lentil water - lots of salt and pepper",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3479831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-05T14:58:40.863Z",
                "reviewBody": "My only comment about the recipe is that the proportion of lentils to rice was way off. One cup of lentils was too much for the amount of rice in the recipe. I would recommend either increasing the amount of rice and/or decreasing the amount of lentils. I also added a pinch of curry powder and topped it off with chopped parsley when it was done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "desiree",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2142768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-19T00:19:27.18Z",
                "reviewBody": "This was great easy comfort food. Definitely caramelize the onions! So-o-o good! I use broth instead of just water and as suggested mix a spoonful of the yogurt with parsley or mint as well into my serving or eat it on the side with cucumber slices. I took others' suggestions and added or used in place of other spices garlic powder and powdered ginger allspice powdered clove and cinnamon along with cumin. I have also used some sweet curry powder. This is not particularly spicy so for more flavour you can double the amounts of some of the spices. To avoid getting gas add 2-3 whole clove (the spice not the garlic) in cooking water of lentils. Gives nice subtle flavour and helps your digestion! We also like to add French Fried onions on top along with the caramelized onions. Gives a nice salty crunchiness and texture. My husband added chopped fresh chilis from our garden for heat. So you can personalize this recipe depending on what you have on hand.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "In-a-Pickle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2174086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-08T20:16:54.557Z",
                "reviewBody": "I love Lentils and Rice so I was happy to find this recipe. I followed it pretty much as written except that I used one cup of rice instead of 3/4 and upped the water added with the rice to one and a half cups. The rice only took about 10-12 min after reaching the boil to be done too. Also around here anyway the arabic restaurants serve it with crispy onions. To get that they need to be fried for much longer than 7 - 10 minutes. Mine took around 40 min on a med-low heat stirred once in a while to get them to fry evenly. They look almost burnt by the time they're done but they're oh so good! I had to make two batches of this because it disappeared so fast. My 16 month old grandaughter loves it! And my sister and neice requested the recipe as well so it will get used a lot. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1735222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-16T20:30:41.74Z",
                "reviewBody": "My husband is from Lebanon and thinks he can cook better than me (German)! So to proof him wrong I cooked this today while he was at work. I also added allspice and cinnamon and 1 tbl Knorr Delikatess Brühe (vegetable broth granules) while lentils were cooking. I added rice and 1 fried chopped onion. I had to keep adding water to lentils and rice, about 2 cups, to get the right consistency. I didn't add the second tsp of salt, but added 7 spices my husband brought from Lebanon. And do add some sugar to caramelize onions. Overall I love this recipe, kids and husband did too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eqofsf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8486135/"
                }
            }
        ]
    }
]