[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214900/delightful-indian-coconut-vegetarian-curry-in-the-slow-cooker/",
        "name": "Delightful Indian Coconut Vegetarian Curry in the Slow Cooker",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1374996.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2019-04-04T03:49:19.000Z",
        "description": "Here's a delightful dish I adapted from a non-vegetarian recipe. It's extremely easy to prepare in the crock pot. Deliciously creamy, it can be served by itself, with rice, or with steamed soft tortillas. Also makes a good samosa filling. It has a nice touch of hot pepper to it.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT4H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "5 russet potatoes, peeled and cut into 1-inch cubes",
            "¼ cup curry powder",
            "2 tablespoons flour",
            "1 tablespoon chili powder",
            "½ teaspoon red pepper flakes",
            "½ teaspoon cayenne pepper",
            "1 large green bell pepper, cut into strips",
            "1 large red bell pepper, cut into strips",
            "1 (1 ounce) package dry onion soup mix (such as Lipton®)",
            "1 (14 ounce) can unsweetened coconut cream",
            "water, as needed",
            "1 ½ cups matchstick-cut carrots",
            "1 cup green peas",
            "¼ cup chopped fresh cilantro"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the potatoes into the bottom of a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the curry powder, flour, chili powder, red pepper flakes, and cayenne pepper together in a small bowl; sprinkle over the potatoes. Stir the potatoes to coat evenly. Add the red bell pepper, green bell pepper, onion soup mix, and coconut cream; stir to combine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover the slow cooker and cook on Low until the mixture is bubbling, adding water as needed to keep moist, 3 to 4 hours. Add the carrots to the mixture and cook another 30 minutes. Stir the peas into the mixture and cook until the vegetables are tender to your liking, about 30 minutes. Garnish individual portions with cilantro to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "CYBERGIFTS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9473684210526314,
            "ratingCount": 95,
            "itemReviewed": "Delightful Indian Coconut Vegetarian Curry in the Slow Cooker",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "369.9 calories",
            "carbohydrateContent": "48.8 g",
            "cholesterolContent": null,
            "fatContent": "18.3 g",
            "fiberContent": "7.4 g",
            "proteinContent": "8.2 g",
            "saturatedFatContent": "15.5 g",
            "servingSize": null,
            "sodiumContent": "373.1 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-06-28T18:50:32.573Z",
                "reviewBody": "I dropped 2 stars for these reasons:  1.  Using powdered onion soup.  This is a form of processed food which is really unhealthy, and can be replaced with one onion and 1 tsp. of salt.  2. I love my slow cooker because of its ease and convenience - when all ingredients can be put into the cooker at the same time.  I find it excruciatingly annoying to have to go back every half hour and add something else (therefore making it ultimately pointless).  I did try this recipe putting everything in at once - and it was a truly good dish (on rice).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "smileypat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4651566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-31T22:25:55.03Z",
                "reviewBody": "This is one of those recipes that only tastes as good as your spices.  Specifically, your curry powder.  I used Spice Islands curry powder for the first time and overall the dish just tastes nondescriptly spicy with kind of a curry flavor.  Looks like I need to find another curry powder!  It still tastes good though and physically it turned out beautiful.  My method was a bit different.  Dumped everything in the pot (only change was to cut back on the peppers and use a can of coconut MILK rather than CREAM since coconut cream is that super thick, super duper sweet stuff you use in cocktail drinks and find in the liquor store) including 1/2 cup of water and the carrots (I like my carrots cooked through and they would not have been if I put them in near the end), stirred it up, set it to low and came back 5 hours later to a lovely looking curry in a rich sauce.  All I had to do was add some salt and it was ready to pour over rice :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "The Bunny Chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thebunnychef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-02T17:06:27.947Z",
                "reviewBody": "Made this last night-added chickpeas and it was awesome! I cooked it for 3 hours on high and served it with rice. Can't wait to eat it again today for lunch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5302528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-13T22:47:10.7Z",
                "reviewBody": "Needs some tweaking but it's a great dish. I served over rice. It's quite spicy for my tastes but my boyfriend (who handles spicy food well) didn't have a problem. Here are the changes I made: 1. Used light coconut milk instead of coconut cream to make healthier 2. Used a whole 10 oz bag of carrots didn't measure 3. Substituted 1 can chickpeas for 1 potato 4. Added some cauliflower (should prob be added with the carrots). 5. Added 1/2 an onion at the beginning Additional changes I want to make next time: 1. Add an extra can of chickpeas for protein 2. Add a handful of peanuts or cashews at the beginning With these adjustments - an awesome recipe! Delish!! Hint - spices will be cheaper at an Indian grocery store or in the international section of the reg grocery instead of with the normal spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Student Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5634273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-13T18:35:56.873Z",
                "reviewBody": "Best Indian curry I've ever had... with a few changes. Like another reviewer recommended, I substituted 1 medium white onion diced and a teaspoon of salt for the package of dry onion soup mix. I also used three whole carrots, cut on a diagonal, instead of the matchstick carrots. I also cut the red pepper flakes and cayenne pepper by half, to 1/4 teaspoon each, which was the perfect amount of heat. I used coconut milk because I live in small town with no ethnic markets, and couldn't find coconut cream. Finally, I added about 1/4 cup of raw cashews. I put everything in the crock pot, and added an extra 1/2 cup of water, gave it a stir and cooked on low for 3 1/2 hours (didn't need to check and add water at all). I then tossed in 1/2 cup of frozen peas, and cooked with the peas for another 1/2 hour. Served with basmati rice and naan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "agraham3991",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8349785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-20T20:31:16.567Z",
                "reviewBody": "Very good! I added a head of cauliflower too just because I had it and used one can of lite coconut milk then half a can of regular coconut milk (again what I had laying around). Also added some cashews with the carrots as well. Will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sduff27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3080437/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-16T15:55:19.627Z",
                "reviewBody": "This was a good easy soup. I substituted organic vegetable broth and fresh chopped onion for the onion soup mix and added some fresh grated coconut.Will definitley make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "erin959",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3827924/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-20T19:48:53.147Z",
                "reviewBody": "I read this recipe and wanted to make for dinner but did not have slow cooker time. I had potatoes already boiled and I cut carrots into matchsticks and steamed in micro. I used coconut milk and veggie broth for the liquid. I cut the pepper flakes and cayenne in half and the curry powder by about 1/3. I left out the Lipton soup mix and sauteed one onion and two cloves of garlic with the bell pepper in olive oil and then added all the ingredients and cook for less than an hour on low on the stove. I also added a can of garbanzo beans. I added the peas frozen at the very end. We served it with a green salad and flat bread for dipping. Everyone liked it and said they were glad that I cut down on the heat so they could enjoy the other flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Donura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5860269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-12T20:02:03.613Z",
                "reviewBody": "Love this recipe! I'm always searching for great slow cooker recipes and this one is a winner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cayce Johnson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5412325/"
                }
            }
        ]
    }
]