[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/916/side-dish/sauces-and-condiments/gravy/",
                    "name": "Gravy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16857/side-dish/sauces-and-condiments/gravy/turkey-gravy/",
                    "name": "Turkey Gravy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215895/rich-make-ahead-turkey-gravy/",
        "name": "Rich Make-Ahead Turkey Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F923892.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:49:45.000Z",
        "description": "If you're like me, I can't stand the last minute rush and expectations in making the turkey gravy. You have one shot and it better be good! Well, this takes out all the stress of that last minute dash. Can be frozen or refrigerated for five days. This is honestly the best turkey gravy I've ever had. You dirty a few pots and pans, but it sure beats the last minute rush Thanksgiving Day. Let me know what you think. Bon appetite!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "6 cups",
        "recipeIngredient": [
            "3 pounds turkey wings",
            "2 small onions, quartered",
            "2 stalks celery, each cut into 4 pieces",
            "2 carrots, each cut into 4 pieces",
            "2 cloves garlic, halved",
            "1 ½ cups dry white wine",
            "4 cups chicken broth",
            "4 cups water",
            "¼ teaspoon dried thyme",
            "2 tablespoons butter, or more if needed",
            "½ cup all-purpose flour",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the turkey wings, onions, celery, carrots, and garlic into a roasting pan, and roast until the turkey wings turn a deep golden brown color, about 1 hour and 15 minutes. Transfer the cooked wings and vegetables to a large pot. Place the roasting pan over 2 stove burners on medium-high heat, then pour the white wine into the roasting pan. Scrape off and dissolve any browned flavor bits from the bottom of the pan into the white wine; heat and scrape the roasting pan until the drippings and wine have reduced to about 1/2 cup. Pour the wine mixture into the saucepan with the turkey wings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour chicken broth and water into the pot, and season with thyme. Push the turkey wings down into the liquid; bring the mixture to a boil, reduce heat to low, and simmer for 45 minutes. Skim off any foam that collects on top. Pour the broth mixture through a colander into a large bowl; pick meat from the wings, if desired, to add to gravy, or discard the spent wings and vegetables. Allow the gravy base to stand for several minutes for the fat to collect into a layer on top, and skim as much fat as possible. Transfer the skimmed fat into a saucepan. There should be at least 1/2 cup of turkey fat; add butter to make this amount if necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk the flour into the turkey fat over medium heat until the flour mixture becomes smooth and golden brown. Gradually whisk in the broth until the gravy comes to a boil and thickens. Season to taste with salt and pepper. Allow the gravy to cool, then refrigerate or freeze. Reheat almost to boiling to serve.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Gravy Recipes",
            "Turkey Gravy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "john.jacoby"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.628865979381444,
            "ratingCount": 97,
            "itemReviewed": "Rich Make-Ahead Turkey Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "111.4 calories",
            "carbohydrateContent": "5.2 g",
            "cholesterolContent": "25.5 mg",
            "fatContent": "4.7 g",
            "fiberContent": "0.5 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "250.4 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-11-26T15:44:30.007Z",
                "reviewBody": "Review update: I make this every year and it's a lifesaver for me. Just wanted to share that I could not find turkey wings anywhere this year so I used a pack of two turkey drumsticks, and the gravy came out just as good as it always has!\n\nThis recipe was a life saver for me, I struggle with gravy and get so stressed out! I made this the day before Thanksgiving as I was prepping as much as I could for the meal. It roasted and simmered for hours and the house smelled just like a glorious turkey was in the oven. I did add some poultry seasoning to the blend. The gravy came out awesomely delicious and all I did at serving time was reheat in a saucepan and whisked in a spoonful or two of the turkey drippings from the roasting pan. Excellent recipe, thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wyattdogster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wyattdogster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-25T02:43:23.413Z",
                "reviewBody": "This is 5-Star Restaurant kind of Gravy!  The only reason that I'm giving this a 4 instead of a 5 is because you need to change your recipe description to warn that this isn't for beginning cooks. The instructions nor ingredients aren't difficult, but this took me (an ntermediate cook) over four hours, and five pots/pans/bowls, to complete.  Scrumptious! Delicous! Best ever gravy!  But a LOT of work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jodyballard/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-24T20:00:54.047Z",
                "reviewBody": "A little work intensive, but worth it in the long run.  I had to make a few revisions.  I used a 1/2 a turkey breast as my local market didn't have wings OR legs, which made for less fat at the end.  I used a whole stick of butter to substitue and spelt flour for wheat allergic family members.  I think that gave it a nice, earthy flavor.  I also kept the onions from the roasting in the gravy for continued flavor.  I also used lots of fresh thyme as it grows in my kitchen.  I will keep and use this recipe again.  Very nice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Randi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1932674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-23T05:58:48.28Z",
                "reviewBody": "First online review I've ever written because this recipe is fantastic!  Last year I was exhausted and smelly  by the time I was done making the gravy before Thanksgiving dinner. And for all my efforts the gravy was just so so.  This year I hoped to change up my game and made this recipe 3 days in advance then froze it and hoped for the best.  I doubled the amount and I had plenty of gravy (I had 25 for dinner).  The consistency was very velvety and smooth.  I used thighs instead of wings and got very little fat, but I thought that to be a good thing. It reheated beautifully and I received many compliments. It tasted very good and it was such a pleasureto have that step of dinner completed, made things much easier.  Will make again and again and share this recipe with everyone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lizzard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7935784/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-11T17:21:00.923Z",
                "reviewBody": "I scaled this back to 6 because there were only 4 of us. I wish I'd kept it at 10 or 12 because for all the work this took to prepare I got only about 1.5 cups gravy! I ended up having to add a package of gravy mix and additional pan drippings in. However! Having said that it was easily the best gravy I have ever tasted! I used most of a small Butterball turkey I had in the freezer (could not find wings anywhere!) but still did not get a lot of fat out of it. I had to use a lot of butter. SO because I cannot seem to make gravy out of turkey drippings I will probably use this recipe again. It did get rave reviews but it was a lot of work even when prepping the day before the big meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SuzieQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3526256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-26T13:13:48.27Z",
                "reviewBody": "This has been my go to turkey gravy recipe for a few years. Yummy! I did cut out a pan this year though. I roasted the turkey wings and vegis in an 8 qt la cruset pan. Reserved the wings and vegis than proceeded with the wine in the same la cruset. Basically the only pans I used were the La Cruset a large bowl and colander for straining the broth. I also used an immersion blender to blend the carmelized vegis into the finished gravy for even richer results. I also add the rec. turkey drippings just before serving. I LOVE THIS RECIPE!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-01T18:46:15.313Z",
                "reviewBody": "The best gravy ever. I used turkey thighs and turkey broth instead of chicken and added garlic to the roasting pan but did not make any other changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SITHGODDESS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/647913/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-20T01:42:12.693Z",
                "reviewBody": "I am so grateful for this recipe as I struggle every year to \"get the gravy done\"! We are attending a Turkey Fry party this year and friends will be deep frying our bird so I was forced to make my gravy ahead of time and boy am I glad I did! \"Rich\" is an understatement! I did add a little Rosemary when I added the Thyme but that is the only change I made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "memichael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4846953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T19:56:53.777Z",
                "reviewBody": "First let me say I have never ever made gravy that didn't come from a jar or powder mix. This turned out great. Reminded me of my Gram's gravy. I'd give it 4.5 stars as I thought it needed some other seasoning beside S&P but I don't know what would improve the taste. This will definately be tradition from now on",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Deborah0309",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3035959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-16T05:46:43.647Z",
                "reviewBody": "Made  this gravy starting yesterday.  I let the broth sit over night\nin the fridge to let the fat congeal.  I just finished making it and I made it just like the recipe states.  It lacks flavor.  It is VERY flat and needs more seasoning.  I'm hoping when I add the turkey drippings it will taste better",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAWN BOND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13920690/"
                }
            }
        ]
    }
]