[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/109/appetizers-and-snacks/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/49587/asparagus-appetizers/",
        "name": "Asparagus Appetizers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6881952.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2019-04-02T06:45:03.000Z",
        "description": "A wonderful appetizer to have on hand that can be made ahead of time, frozen, and used as needed.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "40 pieces",
        "recipeIngredient": [
            "20 thin slices  sandwich bread, crusts removed",
            "¾ pound butter",
            "4 ounces blue cheese, at room temperature",
            "1 (8 ounce) package cream cheese, at room temperature",
            "1 egg, beaten",
            "20 fresh asparagus spears"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Trim crusts from bread, and flatten slightly with a rolling pin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, stir blue and cream cheeses together with the egg until well blended and creamy. Spread a thin layer of cheese mixture over each slice of bread. Roll one asparagus spear inside each, and fasten with a toothpick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a small saucepan. Roll each asparagus wrap in butter to coat. Place on a baking sheet small enough to fit into the freezer, and freeze for one hour, or until butter hardens and wraps are somewhat firm. Remove pan from freezer, discard toothpicks, and cut each wrap in half crosswise. Store in a resealable plastic bag in the freezer until ready to use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, preheat oven to 400 degrees F (205 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange frozen asparagus wraps on an ungreased baking sheet. Bake in the preheated oven for 25 minutes, or until lightly browned. Check occasionally, and turn if necessary, for even browning and to prevent burning. Enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Vegetable"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DALEPFEFFER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.376146788990826,
            "ratingCount": 109,
            "itemReviewed": "Asparagus Appetizers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "462.5 calories",
            "carbohydrateContent": "18.6 g",
            "cholesterolContent": "125 mg",
            "fatContent": "40.3 g",
            "fiberContent": "1.5 g",
            "proteinContent": "8.3 g",
            "saturatedFatContent": "24.9 g",
            "servingSize": null,
            "sodiumContent": "650.6 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-26T13:29:31.983Z",
                "reviewBody": "Fantastic. I actually made these last Wednesday and froze them for a party I had last night (Tuesday). It was a small girls night out gathering with only 4 small appetizer dishes. This was the only dish that had no leftovers. I gave out the recipe enough that I wish I had written it down and copied it. I even used the 1/3 less fat cream cheese and egg beaters. I also reduced the butter and brushed it on instead of rolling it around in the butter. I had enough for 24 slices of bread and could have made more except I ran out of bread. I definitely reccomend you give this one a try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "apedawn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1650590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-24T14:57:26.027Z",
                "reviewBody": "I had an abundance of asparagus so I gave this recipe a whirl. I used whole grain bread decreased the butter & & greatly decreased the cooking time (down to about 14 minutes but next time I will set the oven @ 375 & cook for about 18 minutes). I added chopped chives & freshly ground black pepper to the cream cheese mixture & took the suggestion to sprinkle sesame seeds onto them after rolling them in the butter...very nice addition to the recipe. I used gorgonzola cheese & neufatchel cheese & because of previous reviews spread it a little thicker (but not too much) than I would have...which was a good move. It'll be nice to have homemade appetizers ready to pop in the oven whenever wanted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-21T16:56:34.077Z",
                "reviewBody": "Yummy!  Can't wait to make again.  Next time I will spread the blue cheese/cream cheese on thick! We could hardly taste it.  But that's only because I put a very thin layer on.  I was worried it would be too overbaring.  It's not.  Also, I would brush on the melted butter.  The bread soked it up too much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pasomomma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/388493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-12T01:02:57.547Z",
                "reviewBody": "I've been making this recipe for years and all my friends request that I bring it to our social events! Even people that don't like asparagus LOVE these! The only thing I do differently is I slice the roll into thirds. It makes it more of a \"finger\" food and a little easier to eat if you're serving as an hors'deuvre. Great Recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linnea Wittenburg Bennett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/linnbenn1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-31T20:06:45.513Z",
                "reviewBody": "I've had this recipe for years except there is no butter involved! You can cut the rolls in half place seam side down on a cookie sheet place in freezer til hard remove from cookie sheet and store in a ziplock bag until ready to use. Spray the cookie sheet with non-stick spray before baking. Lots less calories and people always say how great they taste. Have extra bread on hand because I always end up with more filling than 20 pieces will hold. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DECAR48",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/836399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-15T04:19:33.903Z",
                "reviewBody": "Took a little time to assemble; completely worth it! Was told by a discriminating guest \"hors d'oeuvres were over the top!\" My batch made 30 full pieces (limited by the number of slices in a loaf of Pepperidge Farm Thin-Sliced Sandwich Bread) so I got 60 bite-sized pieces; there was enough cheese mixture to make at least another 10-15 pieces. I poured half the melted butter onto a parchment paper-lined cookie sheet arranged the assembled pieces on the sheet & poured the remaining butter over everything -- much easier than trying to roll things around to coat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "heatheranne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1543122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-11T15:09:00.81Z",
                "reviewBody": "This might have been good were it not for all the butter. Just like the suggested cooking time the butter was way too much!!! If I try this again I'll brush melted butter on and spice up the cheese mixture a bit maybe wih chives and/or garlic. And I'll only cook for about 16-18 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie Haas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1504582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-07T20:12:15.39Z",
                "reviewBody": "I thought this was very tasty! I did 3 ozs of the bleu cheese b/c I didn't want it to be too strong for the kids at a family function. I also forgot to add some spices to the cheese mix (as recommended by other reviews) and so sprinkled garlic powder and sea salt on top before baking. In my taste batch using variations of spices on top this was by far the best combo. I also tried both the brush method and the rolling method with the butter and the rolling method won hands down. I just used a pair of tongs to give it a quick roll in the pan of melted butter and still only used one cube of butter. I also skipped the toothpicks. I found that soft fresh bread stuck together just fine with the cheese sauce and I crimped the seam a little to help keep it there. And just FYI the ones I baked immediately without freezing were done in just 10 minutes. All in all I LOVE this recipe though it was a little more time-consuming than I anticipated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "newcook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1955270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-11T16:38:55.47Z",
                "reviewBody": "It's a wonderful appetizer that will satisfy all your asparagus & blue cheese fans! Quite easy as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dimples",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3714049/"
                }
            }
        ]
    }
]