[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2418/desserts/frostings-and-icings/chocolate/",
                    "name": "Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216295/eclair-cake-with-chocolate-ganache/",
        "name": "Eclair Cake with Chocolate Ganache",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F632038.jpg",
            "width": 1600,
            "height": 1600
        },
        "datePublished": "2019-04-04T03:49:55.000Z",
        "description": "A delicious, creamy filling on top of a light choux pastry gets glazed with a rich chocolate ganache. This dessert sounds fancy but it is so easy to make and it's a definite crowd-pleaser!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "1 9 x 13-inch dish",
        "recipeIngredient": [
            "1 cup water",
            "½ cup butter",
            "¼ teaspoon salt",
            "1 cup all-purpose flour",
            "4 eggs",
            "2 cups cold heavy whipping cream",
            "2 tablespoons confectioners' sugar",
            "1 teaspoon vanilla extract",
            "2 (3.5 ounce) packages instant vanilla pudding mix",
            "2 cups cold milk",
            "1 cup bittersweet chocolate, chopped",
            "1 cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish. Place a mixing bowl in the freezer to chill.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the water, butter, and salt in a medium saucepan and bring to a boil over medium-high heat. Reduce the heat to medium and stir in the flour. Cook and stir until the mixture pulls away from the sides of the pan and forms a ball. Transfer the mixture to a mixing bowl and beat in the eggs, one at a time, until fully incorporated. Spread the dough evenly in the bottom of the baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the pastry in the preheated oven until golden brown, 25 to 30 minutes. (The dough will rise and make a boat shape, but should drop as it cools.) Cool completely on wire rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the chilled mixing bowl from the freezer and pour in 2 cups of cold whipping cream. Whip until the cream thickens, about 1 minute; stir in the confectioners' sugar and the vanilla extract. Continue to whip until the cream forms stiff peaks. Refrigerate the whipped cream while you mix the pudding.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the pudding mixes and the milk into a mixing bowl and stir until creamy. Fold in the whipped cream. Spread the filling over the cooled crust and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chopped chocolate in a heat-proof bowl. Bring 1 cup of cream almost to a boil in a small saucepan over medium heat. Pour the hot cream over the chocolate and allow it to soften for 1 minute. Whisk the mixture until smooth. Let the mixture cool slightly to thicken, about 10 minutes. Pour the ganache over the cream filling, spreading to cover the entire surface. Return the pan to the refrigerator and chill for at least 1 hour before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laney Jane"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.746913580246914,
            "ratingCount": 162,
            "itemReviewed": "Eclair Cake with Chocolate Ganache",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "530.4 calories",
            "carbohydrateContent": "39.6 g",
            "cholesterolContent": "160.5 mg",
            "fatContent": "38.9 g",
            "fiberContent": "1.8 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "23.7 g",
            "servingSize": null,
            "sodiumContent": "400 mg",
            "sugarContent": "24.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-06-19T00:23:02.39Z",
                "reviewBody": "This cake is amazing. It's one of the first desserts I've made that was completely finished by my family. It is even better the next day, so I would recommend making it the day before you plan on serving it so that the flavors really meld. The ganache should be properly chilled in order to get the eclair texture. I used semi-sweet chocolate chips and the ganache tasted great. Please don't substitute anything else for this crust, either--the crust what makes the cake taste like a true eclair. The pastry shell stays firm enough to support the filling without getting soft or soggy. I have tried other eclair cake recipes that call for graham cracker crumbs in layers and they do not have the delicious and realistic eclair taste that this recipe has. Freeze the beater(s) along with the mixing bowl and your whipped cream will form stiff peaks faster. And make sure your bowl is completely clean before attempting to whip the cream; that's why you whip it before you mix the pudding. Fold in pudding with a spatula and don't overmix and it will stay fluffy. Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cooking with Kel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606848/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-30T19:43:46.07Z",
                "reviewBody": "UPDATE: the second time around I beat the dough a lot more, until it was more creamy, and it spread easily in the pan.  It poofed up like the recipe said and wasn't as eggy tasting.  It was perfect!\nThis is so delicious! My crust didn't poof up like the recipe said so I was a little worried, but it came out just fine.  It was a bit eggy; I might try it with 3 eggs instead of 4 next time.  Make sure you use heavy whipping cream (if your grocery store doesn't carry \"heavy cream\"), especially for the ganache, and it to a boil before adding it to the chocolate.  It also must sit for 1-2 minutes before whisking it together.  Otherwise it may not harden.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2437306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-03T00:19:49.53Z",
                "reviewBody": "I can't say enough about this cake. It is delicious! The choux pastry is simple to make and the slight saltiness of it is perfect with the creamy filling and chocolate ganache. I made it for a friend's b-day and everyone loved it. I am looking for a reason to make it again soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kittens33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6650751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-22T03:21:35.68Z",
                "reviewBody": "I think this is an amazing dessert. Everytime I make everyone raves how good it is. Very easy to make. I found if you use the better chocolate the ganache turns out perfect. I use Ghirardelli bittersweet baking chips. Saves on chopping chocolate also just dump the bag in a bowl and add the hot cream turns out perfect everytime.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "missymoe1201",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7788567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-22T19:05:45.16Z",
                "reviewBody": "I made this for my husband tonight and he said it was the best dessert I've ever made. I agree. The flavor of the filling was perfect and the chocolate on top was so rich. This took me a bit of time but it was quite easy and worth every minute. YUM. Have a cup of tea ready because this is so rich and delicious. Thanks for the recipe! It is wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becca : )",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2839864/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-24T20:43:26.517Z",
                "reviewBody": "this was very easy to make but did use a lot of bowls utensils etc. and time. i had a feeling the faux cream filling (made with pudding mixes) was not going to be that great and it wasn't. the crust got a little soggy for my taste (that dough probably really wasn't mean to be a bottom crust of a \"cake\"). will most probably not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "occams**razor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3403644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-15T16:37:00.813Z",
                "reviewBody": "I have made this several times and everyone has always loved it. I have as of yet to actually make it as a single cake though. I have done it in mini loaf pans and piped out like eclairs from the store. Mede 75 for a banquet and none were left everyone thought I bought them. This is by far the best eclair recipe that I have made. Just follow directions...easy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sunflower5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4661376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-23T05:09:55.057Z",
                "reviewBody": "I was almost going to make another recipe which used graham crackers so glad I didn't! This was amazing! The pastry shell is a must for it to really taste like a real eclair. I used French vanilla pudding but other than that followed it exactly. The ganache was beautiful once it hardened and everyone loved it! Will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Noelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2974632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-14T17:34:22.677Z",
                "reviewBody": "amazing! easy but a bit time consuming. I brought it to work today and everybody loves it and a few requests for the recipe print out. I add only 3/4C cream to the chocolate ganache and also a few TBS of powdered sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BShannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6317654/"
                }
            }
        ]
    }
]