[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14727/soups-stews-and-chili/soup/beans-and-peas/black-bean-soup/",
                    "name": "Black Bean Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216642/black-bean-soup-with-bacon/",
        "name": "Black Bean Soup with Bacon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1058101.jpg",
            "width": 3350,
            "height": 2730
        },
        "datePublished": "2019-04-04T03:50:07.000Z",
        "description": "I created this for a quick lunch with a few inexpensive ingredients and was very pleased. My husband said that this one is a winner so I thought I would share with others. I personally don't care for cilantro but it makes a nice garnish. Serve with tortillas and guacamole salad.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 slices bacon",
            "2 cloves garlic, minced",
            "2 large carrots",
            "1 large onion",
            "2 stalks celery",
            "2 cups water",
            "2 cubes beef bouillon",
            "2 (16 ounce) cans diced tomatoes",
            "3 (15 ounce) cans black beans, rinsed and drained",
            "2 tablespoons ground cumin",
            "5 dashes hot pepper sauce",
            "salt to taste",
            "¼ cup sour cream, for topping",
            "½ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fry the bacon in a microwave until crisp, or cook it in a skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, crumble, and set aside. Reserve 1 tablespoon of bacon drippings, if desired.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roughly chop the carrots, onion, and celery and transfer to a food processor. Pulse the vegetables until finely chopped.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a microwave-safe bowl, combine the reserved bacon drippings (if using), the chopped vegetables, garlic, water, bouillon cubes, and 1 can of diced tomatoes with their juice. Cook on high for 5 minutes to soften vegetables.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the vegetable mixture into a saucepan and add 2 cans of rinsed and drained black beans. Season with the cumin, hot sauce, and salt. Bring the mixture to a boil and then reduce the heat to low; simmer for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use an immersion blender to puree the hot mixture. (If you don't have a hand-held blender, puree the mixture in batches in a food processor or standard blender.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the remaining can of diced tomatoes and can of black beans. Taste and adjust the seasonings. Add water if the consistency is too thick for your liking. Bring the soup to a simmer and heat for 5 minutes. Ladle the soup into bowls and top with sour cream, shredded cheese, and crumbled bacon.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Beans and Peas",
            "Black Bean Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ROBINBRADY"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.470588235294118,
            "ratingCount": 17,
            "itemReviewed": "Black Bean Soup with Bacon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "172.4 calories",
            "carbohydrateContent": "12.1 g",
            "cholesterolContent": "24.2 mg",
            "fatContent": "9.6 g",
            "fiberContent": "2.8 g",
            "proteinContent": "8.5 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "857.3 mg",
            "sugarContent": "6.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-30T21:27:25.763Z",
                "reviewBody": "I recognized this recipe as having a great start but I also knew I d be improvising quite a bit adding some things to make it even more appealing to me. I particularly liked the bacon garlic and tomato so there was no way I was about to change that. But I wanted something more complex with a greater depth of flavor. Also the microwave cooking method didn t appeal to me so I cooked it completely on the stove-top. And I figure the time I saved by not pulsing anything in the food processor and not bothering to puree any of the soup made up for any time lost by not microwaving. So I sautéed some diced bacon added the directed holy trinity of onion celery and carrot the garlic but I also added a jalapeno pepper seeded and minced and a chopped poblano pepper although bell pepper would have worked fine too. (These measurements all based on the recipe scaled to 3 servings) I wanted it a little meatier so I added some cubed ham chopped cooked chicken would be another fine choice. I let that simmer awhile before adding the beans some frozen corn and a handful of chopped fresh cilantro. I used beef stock a little extra than called for in order to accommodate the extra vegetables. I served this with a little plotch of sour cream and some crispy tortilla strips. I tasted this before supper for purposes of writing this review (tho I never taste when I cook never have) and before you know it I had chowed down two bowls. This stuff is awesome good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-09T02:00:52.38Z",
                "reviewBody": "This is an excellent recipe and everyone who's tried it loves it. I made a few minor changes just using what I had on hand nothing that would have had a huge impact on the end product. I made this soup without the bacon and used ground chipotle powder and bottled crushed chili peppers instead of the hot pepper sauce. I also threw in a can of corn...it just seemed to need that. I also did the whole recipe on the stove top and skipped the fooling around with the microwave. When I make it again I will probably still skip the bacon but will try adding a few drops of liquid smoke. The soup was a HUGE hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "staresm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4667523/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-15T18:52:57.39Z",
                "reviewBody": "I know some people will be irritated with my review, since I REALLY tinkered with this recipe big time! But... here goes! -I think a lot of flavor would be lost if I nuked everything, so I did this on the stove. Taking some comments from Naples review, I picked up a poblano to add to this...and what the heck, I thought, a small sweet potato would be yummy too! I added the poblano and potato with the mirepoix/holy trinity. Once the veg cooked down, I added beef stock (canned) and tomatoes... fresh from the farmers market which I diced. With all the extra veggies and since I was halving the recipe, I only added one can of black beans (which I put in after the tomatoes simmered a bit). Here's where it may get weird: I had about 1/2 cup refried beans leftover from a different recipe and stirred them in. You'd never guess they were in there... I swear, but it made for a thicker broth. I didn't puree anything. Let me tell you how awesome this turned out! :) If you've read this far, hopefully you'll give the recipe a shot, even if you find yourself tweaking it too! It's delish! Trust me when I tell you: it's fantastically delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FNChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fnchef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-01T18:36:12.383Z",
                "reviewBody": "I made this as written except that I omitted carrots and cooked the whole thing in the crock pot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Allrecipes Community",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/allrecipescommunity/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-24T14:48:02.43Z",
                "reviewBody": "I am the original author of this recipe and this was created for a quick meal. When I am not in a hurry, I cook the bacon in the microwave and pour the fat into a large stockpot to saute the veggies before adding the tomatoes, drained beans and broth. If I have enough time I cook the beans from dried. After simmering for about 45 minutes, I'll partially puree the pot of soup then add a can of diced tomatoes with red pepper and a can of drained beans. After that reheats, into the bowls topped with sour cream, crumbled bacon and sometimes shredded cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROBINBRADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/407203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-19T16:59:22.177Z",
                "reviewBody": "Used white beans with chicken broth came out well",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gtpotter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4985687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-25T03:33:45.773Z",
                "reviewBody": "This is a delicious recipe! I too cooked everything on the stovetop and used broth instead of the water and bouillon. I also will add more hot pepper sauce next time to give it a little more kick but otherwise it was super yummy. Served it with a corn bread recipe on this website.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "suzeyb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6191675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-05T02:36:59.953Z",
                "reviewBody": "Because we like spice I added coriander chipolte chili pepper and chili powder...sorry but I did not measure. I also put the crumbled bacon directly into the soup (which I did on the stovetop and did not process). All in all even before my additions it's a great soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7357500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-08T03:38:38.44Z",
                "reviewBody": "I thought it was okay. I think the seasonings could use some tweaking. The cumin was a bit overwhelming.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Erika",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1170505/"
                }
            }
        ]
    }
]