[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216889/al-kabsa-traditional-saudi-rice-and-chicken/",
        "name": "Al Kabsa - Traditional Saudi Rice and Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1128692.jpg",
            "width": 2322,
            "height": 4128
        },
        "datePublished": "2019-04-04T03:50:18.000Z",
        "description": "This was the first Arabic dish I ever made and it turned out extremely delicious, a new favorite! Serve Al Kabsa with a fresh mixed cucumber, carrot, lettuce, and tomato salad -- preferably with a little lime vinaigrette. Some fresh pita bread on the side would be nice also. Saudis like their Kabsa with a hot sauce called 'Shattah'. Enjoy!",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ teaspoon saffron",
            "¼ teaspoon ground cardamom",
            "½ teaspoon ground cinnamon",
            "½ teaspoon ground allspice",
            "¼ teaspoon ground white pepper",
            "½ teaspoon dried whole lime powder",
            "¼ cup butter",
            "1 onion, finely chopped",
            "6 cloves garlic, minced",
            "1 (3 pound) whole chicken, cut into 8 pieces",
            "¼ cup tomato puree",
            "1 (14.5 ounce) can diced tomatoes, undrained",
            "3 carrots, peeled and grated",
            "2 whole cloves",
            "1 pinch ground nutmeg",
            "1 pinch ground cumin",
            "1 pinch ground coriander",
            "salt and freshly ground black pepper to taste",
            "3 ¼ cups hot water",
            "1 cube chicken bouillon",
            "2 ¼ cups unrinsed basmati rice",
            "¼ cup raisins",
            "¼ cup toasted slivered almonds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together the saffron, cardamom, cinnamon, allspice, white pepper, and lime powder in a small bowl, and set the spice mix aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large stock pot or Dutch oven over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the chicken pieces and brown them over medium-high heat until lightly browned, about 10 minutes. Mix in the tomato puree.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in the canned tomatoes with their juice, the grated carrots, whole cloves, nutmeg, cumin, coriander, salt, black pepper, and the Kabsa spice mix. Cook for about 3 minutes; pour in the water,  and add the chicken bouillon cube.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring the sauce to a boil, then reduce the heat to simmer and cover the pot. Simmer until chicken is no longer pink and the juices run clear, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently stir in the rice. Cover the pot and simmer until rice is tender and almost dry, about 25 minutes; add the raisins and a little more hot water, if necessary. Cover and cook for an additional 5 to 10 minutes or until the rice grains are separate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the rice to a large serving platter and arrange the chicken pieces on top. Sprinkle the toasted slivered almonds over the dish.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "EmiratiWife2010"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.509803921568627,
            "ratingCount": 51,
            "itemReviewed": "Al Kabsa - Traditional Saudi Rice and Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "528.2 calories",
            "carbohydrateContent": "54.9 g",
            "cholesterolContent": "88 mg",
            "fatContent": "21.2 g",
            "fiberContent": "3 g",
            "proteinContent": "29.2 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "422.7 mg",
            "sugarContent": "7.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-28T10:17:51.97Z",
                "reviewBody": "I'm from Saudi Arabia, and I've eaten and prepared this dish all my life, and I must say that the steps in this recipe are very accurate. This dish is very diverse and is well-known in all gulf countries. So it's prepared in different ways with different ingredients, and this is just one way. Another delicious way of preparing it (my favorite) is by replacing chicken with small pieces (about 2-3 inch) of lamb or goat and adding about 15 to 30 minutes to the cooking time depending on the meat. These small cuts are not what you would normally find in a butcher shop, and they're typically found in Halal meat stores and Afghani or Persian stores. I personally don't use carrots, and sometimes even make it without tomato puree or tomato paste (it's actually called red Kabsa when tomatoes are used and white Kabsa when they aren't). What I'm trying to say here is, this recipe is very flexible and you can adjust it to whatever ingredients you have/like. As long as sauteed onions, a type of meat and the allspice parts are there, you can't go wrong with it. \r\n\r\nAll the spices in this recipe are sold in Middle Eastern grocery stores in North America as one blend, and even better, many online spice stores sell them. The spice blend is called Baharat, which literally translates to \"spices\" in Arabic.\r\n\r\nNot every one uses saffron and often it's added to make it fancier in special occasions. To get the yellow color of saffron for a MUCH lower price, we usually use ground turmeric instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Khandri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5310670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-04T13:18:15.88Z",
                "reviewBody": "I cooked this dish but did few changes because husband doesnt like chicken so i replaced it with minced meat:)) i crystalized the onions and garlic in buter and added the meat to fry; it became nice and saucy. After i followed the given steps in the recipes and instead the lime powder i added shredded lime skin the taste was soooo good. I also ommited saffron i dont use it in my cooking because it is an expensive ingredient and i don't know to use it properly. I also preboiled the rice a bit in a separate pot and instead of adding it to the meat i added the meat to the rice pot and from time to time added more legume brot to make it saucy and light to chew and swallow. Try it would come out niiiice my tab doesnt let me rate properly but its a 5 f rom me",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crystalgem",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8274821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-18T13:34:50.473Z",
                "reviewBody": "I was happy to find a new Eastern recipe without curry! This dish has amazing flavor and smells delicious while simmering. To avoid msg I cooked the rice in chicken broth rather than using a bouillon cube/water. I ended up adding additional broth to the pot of chicken so the mixture would end up saucier. (I enjoy the succulence that adds served over rice!) I will definitely make this again but next time won't waste my pricey saffron in it - there are so many other spices going on it's just not necessary and is completely overpowered. Another thing that didn't make a lot of sense was making & adding the Kabsa spice mix separately; pouring each spice directly into the chicken pot individually as with the nutmeg etc. would work just as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mommymeggy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2022907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-19T07:22:01.477Z",
                "reviewBody": "This recipe was AMAZING! AND it's authentic! I normally try a recipe exactly as written first time then go about adjusting it to to fit my taste. But I broke protocol this time. I grew up in Saudi but I've never made it on my own until now. In college here in the US I had a few Saudi and Emariti (UAE) friends who would whip this up late at night. And I would help prepare it. \n\nHere are my changes:  \n\n1] I sprinkled raw chicken drumsticks with turmeric which contains curcumin, a powerful anti-inflammatory and strong antioxidant. If you don't want to use saffron; turmeric, aka the \"poor man's saffron\" gives the chicken a nice yellow hue plus health benefits. \n\n2] I added freshly grated ginger with the garlic. But this is a personal and regional preference (East Coast: Dhahran, KSA). \n\n3] I used almost twice the amount of spices (except for the cinnamon) and whole dried lemon (loumi) instead of ground.  \n\n4] My mom's Saudi friend recommended removing the chicken once cooked in broth. I placed chicken in a pan in oven to brown while rice was cooking.\n\n5] To make sure your rice doesn't get mushy, put a kitchen towel under the lid. This keeps the rice firm. I used Zebra brand Basmati (Pakistan). \n\nNext time, I'll also make shattah (hot sauce). THANK YOU very much, EmiratiWife2010 for an excellent dish! My family came to visit and they said it's the REAL DEAL.\n\n*EDIT: Please see photo of one serving. I garnished bowl with hot sauce, cilantro, yogurt (Byblos) and toasted almonds.*",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "oranaise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lumiere/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-13T22:52:39.833Z",
                "reviewBody": "I have made this recipe twice now and while I enjoyed the first time I made it I made adjustments for the second time around. First of all. I increased all the ingredients for the kabsa mix by half and then the other spices that called for \"a pinch\" I just made an even 1/4 teaspoon. As for the rest I increased the diced tomatoes to 16 ounces I doubled the raisins to 1/2 cup and when it suggests adding more water at the end I added another 1/4 cup of tomato sauce. Oh and I didn't mention that I use chicken breast instead of other pieces. This second time around it came out magnificent (In my opinion). I almost couldn't stop eating it. My wife and I both agree though that it could probably use even more raisins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eric Thompson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4263259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-30T19:18:38.41Z",
                "reviewBody": "First time I ever made an Arabic dish.  Loved it.  Smelled great and was delicious.  I read the reviews, and I also did not use the Saffron, didn't even miss it.  This dish is very flavorful with all the other spices in it.  I also used boneless chicken breasts cut into pieces, vs the whole chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keptwoman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8241626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-30T02:00:30.11Z",
                "reviewBody": "After falling in love with Kabsa at a Yemeni restaurant in San Francisco, I had to learn how to make this dish.  This is a great recipe and the spicing was utterly perfect.  I marinated the chicken overnight in some lime/garlic/kabsa spice, and then threw it on the grill to pick up some additional flavor before doing the steps in the recipe.  It is hard to stop eating it!!  The only issue was my rice came out a bit mushy, so I have to focus on water levels and not stirring/peeking to reach perfection, but that's my fault, not the recipe.  Love this dish!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hillorie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11170700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-01T02:22:50.213Z",
                "reviewBody": "This was sooo flavorful. It is not spicy. I substituted a diced chicken breast which enabled me to half the cook time. I also ommited cardamom and saffron since I didn't have on hand. I am sure they would make it even more awesome. I also used lime zest of one lime in place of lime powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "suzannefb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2296877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-05T10:02:51.727Z",
                "reviewBody": "I am the chef at an international school in Bournemouth (UK) and I tried this recipe for my Arab students and they absolutely loved it, and so did all the others. It is now a favourite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "David Larby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14494476/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-28T22:39:24.13Z",
                "reviewBody": "Something was definetly missing from this dish. Too much spice without a warm undertone. I found myself adding chicken bullion and then trying to compensate by squeezing lime over it",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "corie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6339491/"
                }
            }
        ]
    }
]