[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217177/dazzlin-chicken-n-dumplins/",
        "name": "Dazzlin' Chicken -n- Dumplin's",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F627689.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:50:29.000Z",
        "description": "This is a heartier version (whole wheat dumplings) to a down-home Southern comfort food.  Delicious and easy, sticks to the ribs, and keeps you full for a while. We enjoy having strawberry shortcake for dessert with this meal!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 chicken breast halves",
            "4 cups water, or as needed to cover",
            "salt and ground black pepper to taste",
            "1 teaspoon dried sage",
            "1 cup chopped celery",
            "1 teaspoon onion powder",
            "1 teaspoon garlic powder",
            "1 ¼ cups all-purpose flour, divided",
            "1 cup whole wheat flour",
            "½ teaspoon salt",
            "2 ½ teaspoons baking powder",
            "1 ¼ cups heavy cream",
            "1 tablespoon chopped parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken breasts into a large soup pot, cover with water, and sprinkle in the salt, black pepper, and sage. Bring to a boil over medium heat, then reduce heat and simmer until the chicken is no longer pink inside, about 30 minutes. Remove the chicken to a bowl, and let cool; shred chicken when cooled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While chicken is cooling, bring the chicken broth left in the pot back to a boil over medium heat, and stir in the celery, onion powder, and garlic powder. Reduce heat to a simmer, and cook until the celery is tender, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, whisk 1 cup of all-purpose flour, the whole wheat flour, salt, and baking powder together in a mixing bowl. Stir in the cream to make a dough. Sprinkle a work surface with the remaining 1/4 cup of flour, and roll the dough out about 1/4-inch thick. Using a pizza cutter, cut the dough into 1 1/2 inch squares. Toss the dumplings in the flour on the work surface.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop the dumplings, a few at a time, into the simmering broth. Stir frequently to keep them from sticking to the bottom; allow to simmer until the dumplings puff up and the broth thickens, about 30 minutes; stir in the cooked shredded chicken and parsley. Bring back to a boil, and serve hot in bowls.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kari"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1,
            "ratingCount": 10,
            "itemReviewed": "Dazzlin' Chicken -n- Dumplin's",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "471 calories",
            "carbohydrateContent": "37.6 g",
            "cholesterolContent": "136.4 mg",
            "fatContent": "20.5 g",
            "fiberContent": "3.6 g",
            "proteinContent": "34 g",
            "saturatedFatContent": "11.9 g",
            "servingSize": null,
            "sodiumContent": "515.4 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-22T19:02:58.257Z",
                "reviewBody": "This was delicious. We ended up almost doubling the amount of water, and it was still very thick. I recommend using bone-in chicken as the stock was fantastic. The celery could also use a shorter cook time. Thanks for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jinrogue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1711096/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-23T10:14:08.983Z",
                "reviewBody": "This was delicious. Use extra water or this recipe becomes very thick after all of that simmering. I also cut up 3 medium carrots and added them to the celery. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisamariepea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3237032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-09T23:28:30.777Z",
                "reviewBody": "This was a great template for the dish overall. I changed the proportions, especially the liquid- I thought it needed about twice as much and I used stock rather than water. I also used half & half rather than heavy cream because it's what I had on hand. \nThis makes A LOT of dumplings, which is fine by me, but it should be noted that this would serve more than 6 people; perhaps ten  The flavor was very good and I'm happy there were no added oils.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "glasllyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6362497/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-27T19:17:40.673Z",
                "reviewBody": "This was pretty good. I cut this in half and didn't measure the water just covered the chicken with it. I probably used about double of what was called for though. I didn't have any sage so I used poultry seasoning instead and I used carrots in place of the celery. I added a drained can of corn with the chicken and parsley and I felt it added a lot. I tasted the broth after it was almost done and I felt like it was a little bland and needed more salt so I used some chicken bouillon to add more chicken flavor. We really enjoyed this but I felt the smaller dumplings were better than the large ones. They soaked up more flavor. Next time i will make them all smaller maybe 1 inch instead of 1 1/2.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BLyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2975603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-26T23:18:15.94Z",
                "reviewBody": "I used this recipe for the basis of my chicken & dumplings this evening. I had some roast chicken left over after I made a quite sizable bowl of chicken salad along with the carcass. So I got chicken broth and set the chicken parts and bits to simmer. I added onion celery and a small can of drained corn after fishing the chicken out of the broth along with the recipe spices and a few extras. While that simmered I made the dumplings with canned biscuits that I rolled out thin cut into squares and threw in the pot when the veggies were soft in small batches. What I've learned about dumplings is that you NEVER put the top on at least while they're forming. My dumplings turned out great altho I don't think I put enough of them in the broth so that will be for next time. Except that it was peppery my favorite spice these chicken & dumplings came out better than I thought the would.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7637653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-15T19:23:42.38Z",
                "reviewBody": "Grandma's recipe had no detail so I've been searching for one like hers. This is it. (Serves 6.) I used 3 chicken breasts with skin removed. Covered with a combo of water and chicken broth. Added extra liquid so that chicken was submerged 2 inches beneath the surface of the water. I did not adjust the seasonings but did add 1c chopped carrots in addition to the celery. Quite good. On a whim I added a tiny bit(1T)of the remaining heavy cream and shake of black pepper to each bowl just before serving. Yum. That made it creamier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9837889/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-10T01:14:55.513Z",
                "reviewBody": "The flavor wasn't the problem it was the amount of water called for. I was so bummed by the time this soup was done cooking because of the way it turned out. I read the reviews about adding extra water and so was aware of that but the soup was still so thick that it ended up being a pot of mush (with no liquid). If you make this soup make sure your pot is filled at least half way to the top with water or broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "n.schaeffer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3319752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-30T00:27:24.22Z",
                "reviewBody": "We just had this for dinner tonight and it was outstanding! The closest recipe to my moms I have ever made- and my mom is an excellent cook...it's just hard to get recipes from her because she doesn't measure anything:) This is the easiest dough for dumplings I've tried almost impossible to mess up. This ones going in the recipe box and will be repeated for sure. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wendy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3496600/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-11-02T06:24:49.387Z",
                "reviewBody": "this is delicious!.  After reading  the other comments, I also added additional 2 cups  of water and 1 cup of chicken broth.   the gravy was perfect consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/26734310/"
                }
            }
        ]
    }
]