[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218183/beet-pierogies/",
        "name": "Beet Pierogies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1754895.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-04T03:50:41.000Z",
        "description": "A great and unique way to use up some garden beets. The dough in the recipe can be used for any pierogies. Get creative and try it with your favorite mashed potato recipe as a filling, or even pie filling. Excellent with sour cream!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "24 pierogies",
        "recipeIngredient": [
            "1 ½ cups peeled, chopped beets",
            "¼ cup finely chopped red onion",
            "2 teaspoons margarine",
            "1 egg",
            "½ cup water",
            "2 cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the beets and onion into a saucepan over medium heat; add about 1/2 cup of water, bring to a boil, and reduce heat to low. Simmer until the beets are tender, about 15 minutes. Drain the water from the vegetables, and place into the work bowl of a food processor. Add the margarine, start the machine, and pulse several times to finely chop the beets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk together the egg and water until thoroughly mixed, then mix in the flour. Turn the dough out onto a floured surface, and knead until smooth and elastic, 5 to 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough in half, and form each half into a ball. Roll out a ball until it's 1/8 inch thick or less. Using a cup or cookie cutter, cut out dough circles. Repeat with remaining dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To fill, place a dough circle into the palm of your hand, and stretch the dough out slightly. Place about 1 tablespoon of the beet filling in the center of the dough, and fold the dough over the filling. Pinch the edges of the dough together to seal completely, and use your index finger to make small crimped indentations all round the sealed edges. Dust the completed pierogi with flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with water, and bring to a boil. Drop the pierogies into the water, 1 or 2 at a time, and stir to prevent them from sticking. Reduce heat to a gentle boil, and cook until the pierogies float to the top, about 5 to 8 minutes. Drain and serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Niroszyckame"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.176470588235294,
            "ratingCount": 17,
            "itemReviewed": "Beet Pierogies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "192.3 calories",
            "carbohydrateContent": "35.8 g",
            "cholesterolContent": "31 mg",
            "fatContent": "2.6 g",
            "fiberContent": "2.2 g",
            "proteinContent": "6 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "54.7 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-06-21T02:52:38.407Z",
                "reviewBody": "Easy to make because of such simple ingredients.  I used whole wheat flour for my pasta.  I baked some and boiled some of the pierogies, and found that I preferred the boiled ones.  Great taste!  My family liked these, and I will be making them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sueb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2719400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-30T04:13:45.413Z",
                "reviewBody": "I'm giving this 5 starts because it has the potential to be that good, but needs some modifications. As is it is more like a 3 star. I have made this many times and usually double the recipe and cut the beets with a starch like potato or sweet potato. I start the filling by frying 4 cloves of minced garlic in butter, as well as the onions, and then proceed as the recipe says. When I blend the filling I sprinkle on a bit of salt as well. I use whole wheat flour (usually needs an extra teaspoon or two of water). After I boil the pierogies I usually fry them in butter with a bit of thyme, basil, or oregano. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sorou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4880013/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-18T17:25:55.92Z",
                "reviewBody": "These were really easy, tasty and a great way to use up leftover beets from another recipe. I don't think I rolled the dough out thin enough, and because of that they were a little chewy. I think next time I'll run it through my pasta roller to get it thinner. I will definitely make these agin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jmerar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5521658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-16T04:33:44.273Z",
                "reviewBody": "I added 1 tsp salt to the filling otherwise followed directions exactly. I loved it but hubby said it tasted too \"beat-y.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mrs. kosmos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3825395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-11T01:48:36.87Z",
                "reviewBody": "I pretty much followed the recipe exactly. These were only \"eh.\" They really needed some sort of seasoning (salt at the very least but even after I salted them they weren't fantastic). They may have managed a 3 star review if they weren't also a lot of trouble to make. Tip for anyone who is still planning to try them.... don't go to too much trouble to make the thinnest dough possible. I had probably 3 times as many dough rounds as I needed (I put those in the freezer to make ravioli or something with in the future) and the completed pierogies didn't hold up very well. The last 5-6 I put together were fine but the ones that had been sitting there longer fell apart due to the moisture from the beets soaking through the dough. If you do want a really thin dough definitely get your water boiling ahead of time and drop the pierogies in as you go instead of waiting to boil them until they're all put together.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "belle4397",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2786675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-28T02:34:04.14Z",
                "reviewBody": "A warning to all those planning to make this dish; BEETS STAIN EVERYTHING! Don't forget this while you're working. \n\nI enjoy the recipe, but I think next time I'll cut in some potato to mellow the beet flavour. I used whole wheat flour instead of all-purpose and it came out splendidly. \n\nMy biggest issue was presentation; if you get beet on your fingers, you're going to stain the outside of your pretty pierogies, so be careful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "idlehands",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11289675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-05-04T10:52:47.107Z",
                "reviewBody": "I'm giving the initial recipe only 3 stars. It's okay. The amount of time it takes didn't really include all the rolling cutting out and folding so I'm glad I started with 120 minutes of time rather than the 85 minutes listed. I changed the recipe a bit which made it significantly better this time. First I doubled the dough recipe and used whole wheat AP flour. I kept the same amount of beets and added 1/2 lb of lean ground beef. I made the beets as recommended but added in sage and salt. I cooked the ground beef in a pan with garlic and pepper. Then I mixed the beets and beef together in a bowl and proceeded to roll out fill and boil as stated. After boiling I plan fried the pierogies in butter and sage before serving with sour cream. My husband and I aren't fans of beets but this turned out amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Char Triplett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15606825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-09-16T07:00:40.517Z",
                "reviewBody": "They were good but allot of work. I would puree the beet mixture rather than chop it.  I probable not make them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20591529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-09T01:17:29.923Z",
                "reviewBody": "Ok so I don't eat beets I used the dough portion of the recipe my husband no longer hates pierogies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deirdre Loewengart-Oreiro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4879907/"
                }
            }
        ]
    }
]