[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218902/neapolitan-style-pizza-dough-with-garlic-and-italian-seasonings/",
        "name": "Neapolitan-Style Pizza Dough with Garlic and Italian Seasonings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6085942.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2019-04-04T03:50:59.000Z",
        "description": "Neapolitan-style pizza dough variation makes 2 12-ounce pizzas. Apply your sauce, cheese, toppings, and a final spread of cheese to tie it all together.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "2 12-inch crusts",
        "recipeIngredient": [
            "3 cups unbleached all-purpose flour (such as King Arthur®), or as needed",
            "1 ¼ teaspoons salt",
            "½ teaspoon fast-rising dry yeast",
            "1 ½ cups ice water, or as needed",
            "2 tablespoons olive oil",
            "1 tablespoon granulated garlic",
            "1 tablespoon Italian seasoning",
            "½ teaspoon olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix the flour, salt, and yeast until thoroughly combined. Mix in ice water, scraping the bowl as you mix, until all the flour and water have been incorporated into a soft dough. Mix in 2 tablespoons of olive oil. Turn the dough out onto a floured work surface, and knead until the dough is firm but slightly sticky, mixing in more flour if needed. Knead the granulated garlic and Italian seasoning into the dough. (The kneading step can be done in a bread machine set on the Dough setting.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form the dough into a round, and place into an oiled bowl. Brush the top with 1/2 teaspoon of olive oil, cover the bowl with plastic wrap, and allow the dough to rise until double, 1 to 2 hours. Punch down the dough, and cut in half. Form each half into a 12-inch pizza crust, and place on pizza pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Move a rack to the bottom position in oven, and preheat oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the pizza crusts on the bottom rack just until firm, 3 to 7 minutes. Allow the crusts to cool for about 10 minutes before topping with sauce, cheese, or other desired ingredients and returning to oven to bake.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tony Conti"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9310344827586206,
            "ratingCount": 29,
            "itemReviewed": "Neapolitan-Style Pizza Dough with Garlic and Italian Seasonings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "139.1 calories",
            "carbohydrateContent": "24.7 g",
            "cholesterolContent": null,
            "fatContent": "2.8 g",
            "fiberContent": "1.2 g",
            "proteinContent": "3.4 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "244.1 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-01-06T18:09:57.88Z",
                "reviewBody": "This pizza dough definitely tastes good and is not so difficult to make. However I either needed to reduce the amount of water by about 25% or increase the flour by about 25% because otherwise the dough turned out to be way too sticky to handle. Once this adjustment was made it was really nice. Also the number of pies you are able to make was far greater than 2 12-inch pizzas - perhaps I made them thinner than the recipe called for. Either way you won't be disappointed with the taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "btrivedi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2423678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-21T14:41:53.44Z",
                "reviewBody": "I am not even sure if I did this right. I did use powdered garlic and it was fine I think. I used my bread maker to do the dough for one pizza only and let it go through the cycle. Then I took it out and put it into a bowl with olive oil and let it rise for an hour. It did rise a little probably half way. It may have risen further if I let it rise another hour. I took it out and had to put it onto a baking/cookie sheet because it would have fallen through the reg pizza pan I use with holes in it. It was sticky and was not what I was used to for pizza crust thought I ruined it... but put it in the oven for the 7 minutes to pre bake the crust (the smell was to die for!!). let it cool put my toppings on and back in at 400 for roughly 16 minutes. The bottom of the crust was SUPER crispy and very flavorful!! This crust well the way I did it could really hold up to heavy toppings without it falling on your lap. GREAT RECIPE!!!! Just wish I knew if I did it right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb Kavorkian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7408737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-20T21:32:12.463Z",
                "reviewBody": "Nice dough to make when you run out of bread flour! Used it to make little cheese pizzas with kids. They added black olive \"eyes\"with rosemary \"lashes\" and used a thin strip of red bell pepper for the \"smile\". I especially liked it having a long proofing time this allowed me to prep the dough and have that mess cleaned up and out of the way before my little guests arrived to make their pizzas. Thank you Tony!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GTM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/guessthatmess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-18T01:02:13.48Z",
                "reviewBody": "Fabulous! Nice and light yet flavourful. Will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TanyaZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7676486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-22T20:48:55.877Z",
                "reviewBody": "Did not like this dough. It was very sticky. Hard to form into a pizza shape. Once cooked it was too chewy and greasy. I won't be trying this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "skcaga6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7778480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-09T22:28:33.357Z",
                "reviewBody": "The recipe as written calls for WAY too much water. Once the extra water was accounted for by adding approximately 1 1/2 cups of extra flour the crust was fine -- good texture mild flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ajhall",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8063581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-12T14:15:56.463Z",
                "reviewBody": "This was my first attempt at making pizza dough. it was a great recipe and easy to follow as well as super delicious. Of course like most any recipe on here i like to adapt them for various uses. My grandchildren wanted sloppy-joes so i made my homemade sloppy-joe recipe and while it was cooking i prepared the dough. i rolled out the dough to 1/4 inch thickness and used a round 5 inch cereal bowl as a dough cutter. Next i plopped a gravy ladle full of the mixture on one-half the circle to within a 1/2 inch of edges I made an egg was using 3 eggs and using a pastry brush to spread around entire circle I topped the mixture with shredded cheddar cheese and lifted the remaining half of the dough over the mixture sealing and crimping the edges with a fork. I baked the pies in a pre-heated 425 degree oven for 15 minutes until crust was light brown and used the remaining egg wash on the top crust and continued to cook for an additional 10 minutes or until the pies were golden brown. From this pie crust recipe I got 18 individual sloppy-joe pies. My family fell in love with this and my grandchildren keep asking me when i am going to make them again! Bonn-appetite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lee Scott Townsend",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mainelee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-11T14:27:10.753Z",
                "reviewBody": "The key to this recipe is \"What are you looking for?\" A Thick and soft crust or a more chewy and thin crust? This is NOT a soft pizza crust and it is not a fast riser. If you are looking for either of those go to one of the other zillion pizza crust. This dough WILL be very sticky when you make it it is supposed to be this is what makes it what it is do not be tempted to add more flour when you knead it/roll it out you will add a bit more flour anyway.Now I don't have a 1 000 degree open air wood burning pizza oven so I can't truly say this is truly authentic Neapolitan-style. I have been to a certified Neapolitan-style (there are VERY few restaurants of this certification in the whole United States which might be why people don't realize what this recipe is) pizza place in in Eugene OR and I will say this; it is definitely chewy and meant to be rolled thin like a Neapolitan crust is supposed to be. I made it as instructed only changing the granulated garlic for real stuff b/c this is all I had which isn't going to affect the actual dough anyway in make-up. This dough is what I was looking for chewy and yet still soft but not in a loaf of bread type way like all the other pizza dough recipes I have tried. I made these in to Calzone and they were perfect wonderfully chewy yet soft firm and not all all like eating a slice of bread. From now on this will be my stand-by pizza dough recipe because it is all I have been looking for in a pizza dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "godssoulsinger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3706336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-14T03:07:27.103Z",
                "reviewBody": "It didn't rise at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Saffron_Breeze",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14831092/"
                }
            }
        ]
    }
]