[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1549/side-dish/potatoes/hash-brown-potatoes/",
                    "name": "Hash Brown Potato Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/51267/slow-cooker-western-omelet/",
        "name": "Slow Cooker Western Omelet",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1008500.jpg",
            "width": 869,
            "height": 872
        },
        "datePublished": "2019-04-02T06:45:11.000Z",
        "description": "A great solution for busy mornings. Just put the ingredients in your slow cooker before going to bed, and it will be ready for breakfast.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT12H0M",
        "totalTime": "P0DT12H20M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (2 pound) package frozen shredded hash brown potatoes ",
            "1 pound diced cooked ham",
            "1 onion, diced",
            "1 green bell pepper, seeded and diced",
            "1 ½ cups shredded Cheddar cheese",
            "12 eggs",
            "1 cup milk",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Lightly grease a 4 quart or larger slow cooker. Place 1/3 of the hash brown potatoes in a layer on the bottom. Layer 1/3 of the ham, onion, green pepper, and Cheddar cheese. Repeat layers two more times. In a large bowl, whisk together eggs and milk, and season with salt and pepper. Pour over the contents of the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on Low for 10 to 12 hours.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato",
            "Hash Brown Potato Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CSBCOKE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.536723163841808,
            "ratingCount": 177,
            "itemReviewed": "Slow Cooker Western Omelet",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "309.7 calories",
            "carbohydrateContent": "16.1 g",
            "cholesterolContent": "226.9 mg",
            "fatContent": "22.7 g",
            "fiberContent": "1.4 g",
            "proteinContent": "19.9 g",
            "saturatedFatContent": "9.8 g",
            "servingSize": null,
            "sodiumContent": "695.6 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-08-01T00:39:47.533Z",
                "reviewBody": "after reading this recipe 5 years ago, I suggested to our chamber of commerce director we do this for our food booth at the annual Senior Pro Rodeo only make it as a filling for breakfast burritos.  Our booth is there only for the participants.  We have to have the coffee hot and donuts fresh at 7:30 in the morning, because they are getting ready to go through their trials for the nights line-up.  I found this and tweaked it for 50 servings, substituted cooked, ground sausage for ham, nixed the bell pepper, bought flour tortillas,salsa and extra shredded cheese.  We cook this overnight at home, bring the crockpot to the food booth and assemble to make breakfast burritos. We take a tortilla, a decent serving of the omelet, an extra sprinkle of cheese, wrap up individually in foil, and lay them in another crockpot that has a damp towel at the bottom. the damp towel keeps everything steamy hot.  as they are bought, they put their own salsa on. We made them in 25 serving batches.(Two smaller crockpots) word spread quickly we had something better than donuts. we have sold out every year after the 1st year (once they found out)   we also found the second morning (after the first nights show, afterwards they went into town for the dance and drank alot) we sold out faster on the second morning than the first morning.  so we didn't make as much the first morning, and had more for the second morning. it is not labor intensive, and we 3 volunteers get together the night before the rodeo",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Saylor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/paperlady/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-26T22:43:41.233Z",
                "reviewBody": "Love the versatility of this recipe!  Have made this recipe several times at the request of my co-workers.  I have tweaked it each time depending on what type of group I was serving. Have used browned italian sausage (mild to spicy), pre-cubed ham and even bacon. For ease, frozen chopped onions/green peppers and for color, yellow/red peppers.  Used shredded mexi-cheese for a spicier taste or four-cheese blends for a mild one.  In the eggs, I added dry mixed italian seasonings, chopped garlic and a dash of dijon mustard.  Cooked just fine at about 11 hours on low.  For sides, I have served it with hot sauce, fresh salsa or pico de gallo, sour cream and more shredded cheese so people could season it more if they liked.  Haven't had a complaint on it yet :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANNIEPOOH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/459893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-18T18:45:45.2Z",
                "reviewBody": "The first time I made this exactly according to the recipe and took it to a meeting.  It was well liked but had quite a bit leftover.  I'm not a big fan of ham so this time I made it with sage sausage and red bell pepper instead of green.  I also added 1/4 tsp of ground mustard and used a fresh potato instead of frozen. Since the starch turns brown, had to rinse it.  I should have rolled it in a paper towel to absorb the extra moisture.  That was the only issue I ran into using a fresh potato - the extra moisture.  I took it to my meeting and it disappeared.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LibertyB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1734145/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-05T17:29:25.24Z",
                "reviewBody": "The first time I made this recipe just as written and have made this a number of times with some changes. So you don't end up with dry eggs; the type of crock pot is very important to the cooking time. Your narrow tall cylinder time will take longer to cook then a large oval crock pot by 1 to 2 hours difference. I love this recipe because you can make some changes to your family or guests tastes. Place all the ingredients in your crock pot the night before retiring for the evening and your breakfast is ready in the morning. These are some of the ingredients I have used: Purchased frozen hash browns with onion green and red peppers. Try using 2 pounds cooked crumbled well drained sausage instead of ham. We prefer 1 # original and 1 # hot sausage for that extra zing. I use pepper but fine sausage or ham have enough salt for our family. Try using your families favorite salt free seasonings for a different taste. Mixed in the egg mixture. Also try different cheese blends. I prefer using half and half instead of milk and increasing by an additional 1/2 cup. Using skim 2% whole milk half and half or cream will alter the taste. Experiment you might be surprised of the difference in taste and texture. If you use a purchased liner for your crock pot before adding the ingredients; clean up is a breeze. I would give this recipe a 10 star rating if I could.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "quilting pastime",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4636864/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-30T21:02:36.45Z",
                "reviewBody": "This recipe was good but definately needed some tweaking. I did not put hash browns or ham in. I browned a pound of sausage added the onions green peppers eggs and milk and put them all int the slow cooker. In the morning when it was done I sprinkled the cheese on top. We loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MRBERRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1040797/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-09T11:32:52.5Z",
                "reviewBody": "I read some of the reviews on this and modified the following: changed ham to half a pound browned up half pound of sausage and added it. Changed the cheese from cheddar to the Mexican blend. To the eggs I added Italian seasoning and garlic powder. I got some great feedback from everyone eating the breakfast! Will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KRUTHRUFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1152207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-01T18:55:25.747Z",
                "reviewBody": "Loved the variation with hash browns - hadn't tried that before. Omitted the onions and peppers due to finicky children and included ham sausage and bacon. Took to a school class breakfast and it was gone in no time and had several ask for recipe! I made 1 1/2 recipes and it filled the the 5 qt crock pot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMFOUTCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/545518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-25T15:16:44.827Z",
                "reviewBody": "I adjusted recipe to 4 servings and after 9 hours woke up to a very burned and hard breakfast. My wife came to the rescue and made us an omelet and it tasted great. Makes a good boat anchor or paper weight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Joe W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-26T17:40:04.323Z",
                "reviewBody": "I have a few comments on this recipe and previous comments. The recipe is vague on two things: what size crock pot to use and amount of salt. Lots of people said it was dry and flavorless some suggested salt and other spices. I used seasoning salt with powdered garlic and onion and I used 'bout 3/4 tbsp. It was enough to give it good flavor. I added pepper on after cooking because my daughter abhores pepper. Ham definitely isn't enough. I used bacon and ham but I think sausage would have been good too. Also personal preference I used two peppers; one red one green; makes it more colorful and have more variety. And after it was done cooking I cut up some tomato and put it on top too. I think this recipe is perfect for a 4 qt. crock which is what I have and it came out perfect. For the gentleman who came out with a \"burnt paper weight\" who redced the recipe to thirds I believe he probably had a 6 qt. Either that or he took the cook time at face value and just halved that. I made the full recipe and it is done in 6 and a half hours. He should have made it for a brunch as 3 hours probably would have been more than plenty. If reducing the recipe the crock should always be at least 1/2 full with something like this or you probably will wind up with something charred. The woman who said eggs aren't meant for the slow cooker I believe to be unadventurous. Yes this would work in the oven. But it is also good in the crock as long as you don't cook it for half a day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gabichka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4008085/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Western Omelet",
            "description": "See how to make an amazing omelet in the slow cooker.",
            "uploadDate": "2013-07-19T16:19:46.072Z",
            "duration": "PT1M37.3S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F18ba4482-0b87-4337-aa60-a040ebfa073e%2F5e5f954c-d7f1-45bd-9f7f-cf3cd657ab13%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2555255214001"
        }
    }
]