[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/51447/irish-soda-bread-in-a-skillet/",
        "name": "Irish Soda Bread in a Skillet",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4562774.jpg",
            "width": 1440,
            "height": 960
        },
        "datePublished": "2019-04-02T06:45:12.000Z",
        "description": "A basic version of Irish Soda Bread that is baked in a cast iron skillet.  Try substituting the liquid with buttermilk or 2)1/2c cream plus 1/2c sour cream left to sit overnight. Try adding a tablespoon or so of sugar if you like your soda bread slightly sweet. Experiment until you get the flavor you remember.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup milk",
            "1 teaspoon vinegar",
            "2 cups all-purpose flour",
            "½ teaspoon salt",
            "½ teaspoon baking soda"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). In a cup or small bowl, stir together the milk and vinegar. Let stand 10 minutes, or until curdled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the flour, salt and baking soda. Stir in the curdled milk mixture until smooth. Scrape the dough out of the bowl onto a floured surface, and shape into a disc. Place the disc into a cast iron skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 minutes in the preheated oven, or until the crust feels firm to the touch.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Canadian Girl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.54978354978355,
            "ratingCount": 231,
            "itemReviewed": "Irish Soda Bread in a Skillet",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "129 calories",
            "carbohydrateContent": "25.3 g",
            "cholesterolContent": "2.4 mg",
            "fatContent": "0.9 g",
            "fiberContent": "0.8 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "237.1 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-08T22:06:18.243Z",
                "reviewBody": "1st of all, no one should have rated this recipe less than 4 stars.  As a professional bread baker & instructor, I find most people measure incorrectly. Remember to use Dry meas. cups for dry goods & a liquid measuring cup for liquids. Also because of the difference in the characteristics of flour, as well as variations in the atmosphere you should always use less liquid and add as needed. Soda bread is very different from any other bread you can find in the world. It's round, with a cross cut in the top, and it has a velvety texture, quite unlike yeast bread, and the most distinctive and delicious taste. Always slice paper thin, never thick, and when buttered, it is one of the best breaksfast breads, and delicious toasted. I made this recipe 3 times. 1st AS WRITTEN and it was very good. 2nd, used buttermilk, which I prefer, baked on a baking sheet, 3rd. Added 2 t. sugar, 1 c. raisins. Delicious! Gave it 5 stars because the basic recipe is good and I was able to alter to change to my liking. I preferred buttermilk, cut a X on top of bread, bake in a sheet pan, dusted with cornmeal, at 375 for 30 min., remove from oven, brush with beaten egg (for color) and baked an additional 5-8 min. Icc234, you must have measured incorrectly. Like the recommendation from a reviewer to use a fork to stir. I recommend to start with 3/4 c. milk, and add as need. I used the 1 c. of b.milk. Dust hands w/flour, LIGHTLY flour work surface.  Knead dough 5-8 times. BAKING IS A SCIENCE.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3917058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-16T17:28:04.187Z",
                "reviewBody": "This recipe works wonderfully, even when you're in a hurry. I've made it twice now, once with the sugar and once without, and it's fine either way. My husband, the soda-bread expert here, had me bake it for close to 30 minutes, so it would be very crusty; and that worked well. I meant to sprinkle poppy seeds on the dough before I baked it, but I forgot; so I just coated the finished bread lightly with butter and sprinkled the seeds on then--worked fine and looked great. You don't need a cast-iron pan. I just used an aluminum pie plate with a touch of Pam, and no problem at all. Thanks for the recipe, CG!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1074124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-19T03:07:21.047Z",
                "reviewBody": "I wanted a soda bread for dinner which was going to be done in half an hour.  All the other recipes used buttermilk and I had none so I tried this.  I read the reviews so I added a couple of Tablespoons sugar, used red wine vinegar, and tossed in a teaspoon of rosemary and mint.  Absolutely delicious!!   I cooked it for 20 minutes tho' and it almost could have used a minute or two more.  Can't wait to try it again with other spice or herb combinations.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jenna2345",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2381968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-06T16:38:33.57Z",
                "reviewBody": "I really wanted to like this recipe as it's written because it's probably to most authentic recipe for Irish soda bread on Allrecipes.  I made a loaf of this bread this morning.  The results were so-so.  Then it occurred to me how to improve it, so I made a second loaf tonight.  This time I used 2 cups of BREAD flour.  (We are baking bread, after all.  All-purpose flour is for cake and cookies.)  I then took the heat down to 325 and baked it for 35 to 40 minutes.  AMAZING IMPROVEMENT.  While baking, the loaf almost doubled in size; it was lighter and fluffier and tasted like real bread and was not like a dry hockey puck.  The low baking temp also gave me a flakier crust that was less than 1/8 of inch thick all the way around.  I will keep this recipe but I will use my adjustments.  I think I've almost mastered real Irish soda bread, one of the easiest bread to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Russ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7146062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-18T00:17:43Z",
                "reviewBody": "As another reviewer said, this is a great last minute recipe!  I used cider vinegar and added some sugar and a little handful of craisins. I also served it with honey butter.  It was a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "klzee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1762697/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-05T16:28:05.11Z",
                "reviewBody": "Yum! I used 1/2 cup sour cream and 1/2 cup half & half in lieu of the milk, still used vinegar. Also substituted 1/2 cup whole wheat for some of the flour. Turned out great! Not heavy like some recipes. I think the key is not to handle this much, just stir it together until it is coated good and form it into a loaf. Cooked for almost 20 mins, crust was great. Have tried other soda recipes, but this one has been the best so far.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alyssa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2857595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-21T18:39:02.73Z",
                "reviewBody": "Terrifically easy and tastes wonderful.  I used buttermilk and added raisins and sprinkled caraway seeds on top.\n\nI tried it on a cookie sheet with parchment paper and in an iron skillet.  Both worked fine.\n\nHowever, both needed more than 15 minutes.  I\nI needed 25 minutes in the skillet.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MikeSq",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3136211/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-01T18:56:48.6Z",
                "reviewBody": "I am always looking for a quick supper bread besides the regular biscuits or rolls. I was really not expecting much when I tried this recipe. The first time I tried it I followed the recipe but since I did not have a cast iron pan on hand I used a tin pie plate. I left the bread in for half an hour and it was okay, but it stuck to the bottom and the middle was a bit doughy. Next time I found the cast iron pan, slightly greased it and added a half cup of grated old cheese to the flour mix. I sprinkled caraway seeds on top and waited patiently hoping for a good result. When I took the bread out after 25 minutes it was for all purposes...perfect! Wow! I would serve this to company. I am looking forward to playing around with this recipe and trying different fillings and spices. I also added 1/2 tsp. of baking powder the second time and the bread was light and the crust was crunchy and delicious. When it came out I lighty patted it with butter and it was beautiful as well as tasty. Thank you for the wonderful recipe. I figure it is going to be a staple here for this family and I am no longer going to buy those specialty breads at the supermarket. There is no need to! You can change this in a hundred ways and have a new product each time. I really recommend using the cast iron pan though. Quite a difference in the whole appearace of the bread as well as how wonderful the bottom browned! Thanks again! Love it and how easy is that!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Rushton-Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3151120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-17T14:33:34.667Z",
                "reviewBody": "Simple and yummy. My tweaks: raisins and 1/4 c. sugar. I also let the vinegar take over the milk overnight and it made a thick buttermilk which really moistened the bread. I served for breakfast on St. Pat's day with cinnamon butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PATSYSUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1004508/"
                }
            }
        ]
    }
]