[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/930/side-dish/vegetables/greens/",
                    "name": "Greens",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/51803/kickin-collard-greens/",
        "name": "Kickin' Collard Greens",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F11%2F822015_kickin-collard-greens_photo-by-wyattdogster.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-02T06:45:13.000Z",
        "description": "If you like greens you will love this recipe.  The bacon and onions give them a wonderful flavor.  Add more red pepper for a little more spice.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "3 slices bacon",
            "1 large onion, chopped",
            "2 cloves garlic, minced",
            "1 teaspoon salt",
            "1 teaspoon pepper",
            "3 cups chicken broth",
            "1 pinch red pepper flakes",
            "1 pound fresh collard greens, cut into 2-inch pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large pot over medium-high heat. Add bacon, and cook until crisp. Remove bacon from pan, crumble and return to the pan.  Add onion, and cook until tender, about 5 minutes.  Add garlic, and cook until just fragrant. Add collard greens, and fry until they start to wilt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in chicken broth, and season with salt, pepper, and red pepper flakes. Reduce heat to low, cover, and simmer for 45 minutes, or until greens are tender.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Greens"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ken Adams"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7459246767847105,
            "ratingCount": 1779,
            "itemReviewed": "Kickin' Collard Greens",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "127.1 calories",
            "carbohydrateContent": "7.9 g",
            "cholesterolContent": "12 mg",
            "fatContent": "9.2 g",
            "fiberContent": "3.3 g",
            "proteinContent": "4.4 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "1000.8 mg",
            "sugarContent": "1.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-12T19:16:16.09Z",
                "reviewBody": "Ahhh greens.  My favorite are mustards, but they are difficult to find.  My cooking background is eclectic.  My mother moved to Florida from Japan when she was 28 yrs old.  Japanese don't really own ovens so American food and grocery stores were fairly intimidating.  Our African-American maid taught her how to cook American food, and by American food I mean traditional Southern soul food.  So growing up, I always had a saide of rice and soy sauce with my fried gizzard.  I have never wanted to cook greens because my mom makes such excellent greens that I don't think I can compare.  I remember my mother telling a bunch of African-American co-workers that she made excellent greens and they handily dismissed this 5 ft tall Japanese woman as delusional.  Until they had her greens and then begged her to make them at every work pot-luck.  There are some changed I made to this recipe according to my mom's recipe.  Firstly, you must add brown sugar.  This masks the bitterness of the greens.  A splash of apple cider vinegar helps too.  You've gotta increase the bacon in this recipe.  Please.  Three slices?  Try 8 or more.  Cook for a few hours.  The longer, the better, but make sure your bacon doesn't start disintegrating.  Cook the onion and garlic in the bacon grease and nix the oil.  Bacon grease makes everything taste better.  And lastly, the weird secret from Mom:  These can be made in a rice cooker without the inner rice container.  it will boil the broth and then keep it simmeri",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sailshonan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-16T05:02:49.827Z",
                "reviewBody": "I have been voted as the chair person for the vegetable dish for Black History month at work, and needed a recipe.  I am a true collard fan, and have always tried the five star recipes and have never been disappointed.     WHOA! Best greens I have had and can't believe I cooked them. Only made a couple of changes which include I cut out the olive oil and used the bacon grease.  I also used plenty of bacon (about a pound, as I love the flavor) and although skeptical, I added about 1 TBS.  of brown sugar. These greens are wonderful--I can hardly wait to cook them for my workgroup!  THANKS for SHARING.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pauline Hernandez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/740082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T00:06:32.847Z",
                "reviewBody": "OK! never made collard greens in my life.  This review is for all the novices out there that are scared to make this recipe.  This was wonderful!!  I used frozen collards, so I can't imagine how fresh would taste!  I slow cooked mine all day in the crock pot.  I also used 3 thick slices of salted pork and only used one cup of chicken broth for fear of being too salty.  I also added one and a half cups of water.  I didn't have onions on hand so I added 1/2 of a jalapeno, defnitely added some kick to it!  I, too added brown sugar, like I read in previous reviews, also added a dash of apple cider vinegar.  This is absolutely delicious!  Served with black eyed peas, mac and cheese, corn bread and blackened tilapia, it was a yummy start to the New Year.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ARCELI6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/415835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-29T15:11:03.25Z",
                "reviewBody": "If you like greens, you're gonna LOVE this recipe! The only change I made was to add more bacon... only 3 slices of bacon??? Are you kidding me??? I think I at least doubled that!!! I let mine simmer for nearly an hour and they came out perfect! This recipe works just as well with turnip greens or mustard greens too. Whatever is fresh at your grocery that day will do just fine. I could seriously eat these once or twice a week and not get tired of it... Soooo Good!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee Ridgeway",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-02T07:05:56.23Z",
                "reviewBody": "Outstanding!- very flavorful! (Very peppery though... I'll cut some out the next time).  For all ya'll who have referred to the soupy nature of the cooked greens... that's the \"pot likker\", the liquid that remains after you cook your seasoned greens!  Many Southerners prize this flavorful watery liquid, and reserve it to dunk their cornbread in. It is messy but common thing to do after making collard or turnip greens. There are various ways you can do this:  Some folks serve the greens somewhat soupy. But we like our greens strained, and on the same plate as our blackeyed peas and ham. So before we serve greens, we ladle some of the pot likker off the collards and put a little in a small bowl next to each plate for dunking.  Then we use a slotted spoon to strain and remove the collards to a serving bowl. A different thing some people do is to ladle the pot likker, often with a splash of Hot Sauce, onto their cornbread... but I think that makes it too soggy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2231139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-01T03:17:43.23Z",
                "reviewBody": "I'm from the South and these are THE BEST collards.  I've impressed both of my Southern grandmothers with this recipe and have even impressed a few Yankees :-).  The only change I would make is to cook the collards a bit longer.  I sometimes will start them on the stove, then move them to the crock pot for several hours.  To me, the longer collards cook - the better.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULES2JEWELS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-19T03:58:02.33Z",
                "reviewBody": "No sense in hiding it: I'm really impressed with myself right now. I want to give me a pat on the back. But most of all, I want to go in there and eat that whole pot of collard greens I just made. All thanks to this recipe! Somehow, born and raised in Georgia....this is my first time making collard greens. Didn't like them for a long time, but I'm coming around now. And WOW are these good. In addition to upping the (reduced sodium) bacon to 8 strips, I added a little more salt, a heaping tablespoon of brown sugar, and probably two tablespoons of apple cider vinegar per reviews. That totally pushed these over the edge for me. I could hardly give them the 45 minute minimum to simmer....once I did a taste test, it was all over. In summary: MAKE. THESE. COLLARD GREENS.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JustiesChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/justinschef/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-06T15:53:29.59Z",
                "reviewBody": "This was just ok for me, I am from North Carolina, and my roots are from Eastern N.C. So maybe that's why this was just ok for me. I am use to (country ham hocks not to be confused with smoked ham hocks) there is a difference. We boil our greens with the country hocks and fried meat grease, such as fat back ect ect. I had never had greens with onions, garlic and olive oil before. And while I love all the ingredients and it smelled really great while cooking. With collards this was just not for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Claudette P Henry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1922840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-09T19:06:40.59Z",
                "reviewBody": "This is the best! I did add a little brown sugar like the other cook,also use a 1/2 tsp. of frank hot sauce. I also add water for the broth was strong. Next time will use half the amount of broth and water for the rest of the amount",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIANNR1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1340004/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Kickin' Collard Greens",
            "description": "See how to make big-flavored Southern greens.",
            "uploadDate": "2012-10-01T17:26:33.949Z",
            "duration": "PT2M32.486S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc91f39e3-c5be-4cdb-a1e5-3e90f513224c%2F21c59bfe-dec1-43ae-b3cf-eb0f4b41a98c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1871148953001"
        }
    }
]