[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16244/main-dish/rice/beans-and-rice/",
                    "name": "Beans and Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220863/pressure-cooker-red-beans-and-sausage/",
        "name": "Pressure Cooker Red Beans and Sausage",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5466286.jpg",
            "width": 2209,
            "height": 2305
        },
        "datePublished": "2019-04-04T03:52:01.000Z",
        "description": "I am from the South, and red beans and rice is a weekly tradition in my house. This recipe is cooked in no time, thanks to the pressure cooker! Serve over hot cooked rice.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound dried red beans, rinsed",
            "1 (1 pound) package smoked sausage, sliced",
            "1 bay leaf",
            "2 tablespoons Cajun seasoning, or to taste",
            "½ clove garlic, chopped",
            "½ onion, chopped",
            "1 stalk celery, chopped",
            "½ green bell pepper, chopped",
            "1 teaspoon salt",
            "1 teaspoon dried parsley",
            "¼ teaspoon ground cumin",
            "5 cups cold water, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine red beans, sausage, bay leaf, Cajun seasoning, garlic, onion, celery, green pepper, salt parsley, and cumin in pressure cooker. Pour in water to cover, according to manufacturer's directions (do not go over line inside of pot). Stir to combine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Seal lid and bring pot to full pressure over high heat. Reduce heat to low, maintaining full pressure, and cook for 30 minutes. Allow pressure to drop naturally. Remove lid, stir, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Beans and Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "raquel11882"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.69620253164557,
            "ratingCount": 79,
            "itemReviewed": "Pressure Cooker Red Beans and Sausage",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "298.7 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "38.6 mg",
            "fatContent": "18.4 g",
            "fiberContent": "5.2 g",
            "proteinContent": "17 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "1510.8 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-02-12T14:27:42.847Z",
                "reviewBody": "thank you for a great starter recipe...First let me say i have never made Red Beans from scratch that I liked... but i LOVED these. \nI did do a little tweaking to my taste...I put 2 cloves garlic, added 1/2# ham chunks which i cooked with the beans (held the sausage until after cooking under pressure)1 Tbsp Worcestershire Sauce 1 tsp thyme 1 chicken bouillon cube and 1 tsp Tabasco Chipotle sauce extra bay leaf.... i did soak my beans about 4 hrs and cooked in pressure cooker for 50 minutes and then another 10 after adding 1/2 # of sausage.... they were so delicious... best i ever had... and i live in South Louisiana.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4505092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-26T12:19:57.517Z",
                "reviewBody": "This was a great recipe. I've been cooking red beans in my pressure cooker for a couple years now. The only differences I've never used cumin. I do add my sausage with my red beans but I slice my sausage and then sauté with my onions and bell peppers before adding the rest of the ingredients. I think this helps to keep texture of the sausage. After cooking for 30 minutes I take the lid off and adjust my settings to Browning which will bring the liquid to a boil. As it is boiling I mash some beans let it boil for about 10 minutes and it will get nice and creamy.  Serve over white rice. Yum!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3232995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-15T13:55:39.433Z",
                "reviewBody": "This is my new way of cooking red beans and rice from now on. So fast and easy. Okay, here's what I did.  I soaked my beans 1lb all day while at work. I rinsed them and added 4 cups of water. I knew that 5 cups was way too much. I added a smoked turkey hock for flavor along with garlic, a couple of Bay leaves, and a couple tbsp of creole/Cajun seasoning.  I didn't add my sausage until the 30 mins were up. As the beans were cooking I sautéed the trinity (green bell peppers, celery, and onions) with the smoked sausage. When the pressure was released I added the trinity and the sausage and mashed some of the beans to make them creamy, and cooked them for another 15 minutes. OMG!!! My family and I are from Louisiana and we know good red beans and rice.  The best that I've ever made. Thanks for sharing your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Denise Hall-Mitchell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16026651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-30T19:03:28.99Z",
                "reviewBody": "The beans turned out great. The consistency of the sausage was different but I liked it. MY wife did not. Since making her happy is a priority I am going to add the sausage later. As this was my first pressure cooker experiment I may have undercooked them initially. I ended up stirring and mashing once the pressure was down and then put them on for another 5 minutes. Next time I will cook for 20 minutes stir and mash and THEN add sausage cook for another 20 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jay G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6473556/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-04T23:32:53.367Z",
                "reviewBody": "Okay y'all, this is pretty good, but as a member of a New Orleans clan, I can tell you, anyone making an authentic dish will first sauté the sausage (I also use Conecuh®)  then the veggies in the rendering! The flavors are not quite same without this step. Also, we always used either homemade chicken stock (if there's anything left from Sunday dinner) or chicken broth (low sodium since the sausage is salty) rather than water. This actually makes the beans creamier. Yes, you do have to smash some of the beans and let them make \"gravy\". This is a dish we have all four seasons! YUM.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce Stewart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4832657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-29T23:58:20.233Z",
                "reviewBody": "I loved this. Had nice flavor/kick. I pretty much followed recipe to the letter except I couldn't find 16oz size sausage so used 14oz instead. Only issue I had was the cooking time had to add another 10-15 minutes as beans were still a little hard. I also served it over rice. Very nice thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Scher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/210076/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-04T13:02:52.923Z",
                "reviewBody": "The flavors of this are good but after an hour of cooking my beans still weren't quite done. Next time I will soak the beans overnight then cook for 20 minutes without the sausage mash the beans add the sausage and cook another 20 minutes (as mentioned by another reviewer.) Time consuming but easy and it should produce a more desired result. Be careful about the amount of water (don't add too little) since the beans will absorb water. After mashing adjust as necessary. Also - I only used 1 1/2 T. of cajun seasoning and it was on the verge of too much for us. 2 T. would have been way to much. I'm not Cajun so that's part of the reason. But better to err on the side of caution!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Stella67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3109560/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-06T23:48:57.61Z",
                "reviewBody": "Will not be cooked in 30 minutes -- even with overnight soaking. I only ding it for being so far off on the cooking time and not recommending soaking the beans. Seasoning mix was very good -- fairly close to what I currently use when cooking regular stovetop beans -- I don't currently use cumin in mine but I liked the taste with the added cumin. I wondered if the beans would have the creamy textured liquid that I wanted -- they didn't. In the end I just mashed some beans in the pot and cooked a while longer to thicken. Next time I'll do as another reviewer recommended and cook 30 minutes -- stop cooking and use my prior method to sauté the veggies and mash some beans. Then pressure cook another 20 minutes. I will still soak overnight to clean the beans and completely hydrate the beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Poirot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3698043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-15T20:43:41.947Z",
                "reviewBody": "Love this recipe! I've never had much luck getting the beans soft enough with 30 minutes so I let them cook in my Fagor pressure cooker for about 50 minutes. Once that's done I let the pressure drop naturally. I usually have some excess water so I turn the burner on with the lid off. YUMS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "coreyfontenot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8553080/"
                }
            }
        ]
    }
]