[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
                    "name": "Stuffed",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13289/main-dish/stuffed-main-dishes/stuffed-bell-peppers/",
                    "name": "Stuffed Bell Pepper Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222002/chef-johns-stuffed-peppers/",
        "name": "Chef John's Stuffed Peppers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8151429.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2012-04-27T22:45:14.000Z",
        "description": "This recipe's roots can be traced back to the Great Depression, when farmers first began selling the unripe peppers out of necessity. Of course, we did what Americans always do when faced with a new variety of food, we stuffed meat in it.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 cup uncooked long grain white rice",
            "2 cups water",
            "1 onion, diced",
            "1 tablespoon olive oil",
            "2 cups marinara sauce",
            "1 cup beef broth",
            "1 tablespoon balsamic vinegar",
            "¼ teaspoon crushed red pepper flakes",
            "1 pound lean ground beef",
            "¼ pound hot Italian pork sausage, casing removed",
            "1 (10 ounce) can diced tomatoes",
            "¼ cup chopped fresh Italian parsley",
            "4 cloves garlic, minced",
            "2 teaspoons salt",
            "1 teaspoon freshly ground black pepper",
            "1 pinch ground cayenne pepper",
            "4 large green bell peppers, halved lengthwise and seeded",
            "1 cup finely grated Parmigiano-Reggiano cheese, plus more for topping"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Set the cooked rice aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook onion and olive oil over medium heat until onion begins to soften, about 5 minutes. Transfer half of cooked onion to a large bowl and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir marinara sauce, beef broth, balsamic vinegar, and red pepper flakes into the skillet; cook and stir for 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour sauce mixture into a 9x13-inch baking dish and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine ground beef, Italian sausage, diced tomatoes, Italian parsley, garlic, salt, black pepper, and cayenne pepper into bowl with reserved onions; mix well. Stir in cooked rice and Parmigiano Reggiano. Stuff green bell peppers with beef and sausage mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place stuffed green bell pepper halves in the baking dish over tomato sauce; sprinkle with remaining Parmigiano-Reggiano, cover baking dish with aluminum foil, and bake in the preheated oven for 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove aluminum foil and bake until the meat is no longer pink, the green peppers are tender and the cheese is browned on top, an addition 20 to 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Stuffed",
            "Stuffed Bell Pepper Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.796875,
            "ratingCount": 2432,
            "itemReviewed": "Chef John's Stuffed Peppers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "376.9 calories",
            "carbohydrateContent": "35.1 g",
            "cholesterolContent": "51.9 mg",
            "fatContent": "16.9 g",
            "fiberContent": "4 g",
            "proteinContent": "20.1 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "1274 mg",
            "sugarContent": "9.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-21T16:01:54.973Z",
                "reviewBody": "Although I've been using allrecipes for over 10 years, I've never found a recipe that I've enjoyed so much that I would join just to rate it, until now! I am 50 plus years old and have been addicted to stuffed cabbage and peppers for most of my life. I have tried hundreds of different recipes. NONE have even come close to this one! My search for the perfect stuffed cabbage or pepper is over! I will never use another recipe. I'm actually getting ready at this very moment to use the filling minus the rice to make homemade ravioli. Thank You Chef John for such a PHENOMINAL RECIPE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tastebuddy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9641996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-04T16:26:58.203Z",
                "reviewBody": "When I asked my boyfriend what types of things he likes to eat are,  after much prodding, the only thing he named was Stuffed Peppers, noting that his mother makes them often.  Later, he said \"why don't we just go eat them at my moms?\"  Clearly - mom had some good stuffed peppers.\n\nLast night I took a stab at making Stuffed Peppers for the first time ever, for my boyfriend, and used this recipe.  I halved the recipe, and halved 2 large peppers and filled them that way, to make for easier leftover servings.  As I prepared them, my boyfriend stood over me, smirking... and said \"your way is a little different.\"  I could see he was skeptical!!\n\nPresentation wise, these peppers looked the part.  Beautiful.  We sat and ate, and for the first few minutes, didn't speak.  I was getting nervous... I don't think he likes them.  Half way through my plate, he quietly says \"These aren't like my moms.\"  I said \"sorry babe...\" and before I could finish he exclaimed \"THEY\"RE BETTER!!!!  THEY ARE SO FREAKIN GOOD!\"   And they were!!  As I sit here writing my first review, I'm eating the leftovers.  YUM!!\n\nThe only thing, and this may be because I eyeballed halving the recipe, is I wish I made more sauce.  It was delicious and we poured some on extra rice on the side, but there wasn't a lot left for the leftovers.  It was so delicious I'd want extra sauce to pour ridiculous amounts of!  YUM!!  May be different if you do the full recipe, or maybe worth doubling the sauce, or 1 and a half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Snitz427",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10436894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-14T17:47:32.803Z",
                "reviewBody": "Best stuffed peppers I've ever had. I followed the recipe almost exactly - I didn't have beef broth so I just used water and it was still delicious. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tegan04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6536521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-19T03:50:34.963Z",
                "reviewBody": "We made a double recipe of this, using 8 bell peppers (16 halves). The servings are very generous. I followed the recipe pretty well though I did use less of the cheese as I didn't feel like opening another bag. It got rave reviews from everyone. I loved it, my husband loved it, and the kids loved it. The green peppers and bright red sauce make for pretty contrast, and the savory flavor is wonderful. We had quite a lot left over and the leftovers taste just as good. I would highly recommend making a huge batch, and freezing some. It's cheaper and tastes better than the boxed frozen stuffed peppers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "smemily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8187489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-03T04:10:55.323Z",
                "reviewBody": "Probably the best peppers I have EVER eaten! They were fantastic!\nI did change it up just a bit because of what I had on hand. I had a 2 pound package of 93% fat free ground beef, so I skipped the sausage. To\nmock a spicy sausage flavor, I added some fennel seed, pepper flakes and ground sage to the meat. I used brown rice instead of white rice. For the diced tomatoes I used rotel style tomatoes and drained them. I didn't have any parmesan cheese so what was I going to do? Light bulb moment... those pizza parmesan packets they give you when you order pizza! I have a ton of them so I added about 12 packets of that to the meat. I didn't add the cheese on top until the last 20 minutes and I ended up using mozzarella on top. Served it with some whole grain spaghetti that was tossed with onion, garlic and pepper. TOTALLY delish! I am SO full and I am fighting the urge to go munch on more... the sauce was great too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marisa R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3270496/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-14T13:34:13.95Z",
                "reviewBody": "I don't think I ever knew real stuffed pepper love until I met these.  Wow.  Other than using red bell peppers I didn't change a thing.  Confusion over when to add the cheese, in the mixture or as a topping, or 1/2 and 1/2.  I added it to the mixture and it was very noticeable and worked out well there.  It would've been difficult to sprinkle on top as there was a LOT of stuffing, so much I piled it as high as I could on each pepper.  Not cooking the meat first seemed stranged to me, but I think this method adds to the flavor and everything cooked to perfect doneness in the time frame given.  Spoon the sauce from the pan on afterwards for flavor and to make it look even tastier.  If you think is good the first night, it's double WOW reheated the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori McKirahan Burton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/492354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-04T21:35:27.617Z",
                "reviewBody": "I made half of the filling mixture for this recipe and it was plenty for three smallish green peppers (6 halves).  I prepared these early in the day, covered and refrigerated them.  I omitted the pork sausage and used fresh tomatoes.  The recipe is confusing because it instructs you to stir the rice and parmesan into the meat mixture.  Then later instructs you to sprinkle the remaining parmesan (what remaining parmesan?) over the top.  So not knowing how much to put where, I just winged it and used 2 T. in the meat mixture and sprinkled more on top after baking.  I baked these covered for 45 minutes and uncovered for 15 more minutes and my peppers were still crisp tender.  I wouldn’t have wanted to bake them any longer.  This was good and the hint of balsamic vinegar was a nice addition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bellepepper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4452392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-11T18:42:39.97Z",
                "reviewBody": "Yes I tire it, and it was a big disappointment!  After one bite, my wife wouldn't eat it and I ate some only because I spent 2 hours making it!  I followed the recipe exactly, except for using red bell peppers instead of green peppers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "mikenmarg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14248451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-01T13:24:54.147Z",
                "reviewBody": "I thought this recipe was great.  My family was only so-so about it but they don't care for stuffed peppers at all.  The only complaint I have about the recipe is that made as is, you have way too much filling or not enough peppers.  I used 4 very large bell peppers and still had a ton of filling left over.  I even over over stuffed mine and had extra.  I could have easily stuffed 3-4 more peppers with the filling.  I just cooked the extra filling along with the peppers in the sauce.  Thank you for a very flavorful new spin on the old stuffed pepper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "docswife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/docswife76/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John's Stuffed Peppers",
            "description": "Tender sweet peppers stuffed full of flavor.",
            "uploadDate": "2016-04-04T17:08:08.209Z",
            "duration": "PT4M4.967S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fce17f277-9d25-4112-80e5-1ff9f7ecd55f%2Fab383df1-8d5c-4507-bbac-2caf97a39fe5%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4830690163001"
        }
    }
]