[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/749/desserts/candy/chocolate-candy/",
                    "name": "Chocolate Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/53014/plastic-chocolate/",
        "name": "Plastic Chocolate",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6487703.jpg",
            "width": 5261,
            "height": 3984
        },
        "datePublished": "2019-04-02T06:45:17.000Z",
        "description": "This chocolate dough can be rolled out like a fondant, or molded to form roses, leaves or whatever. It's very simple to make, and quite impressive. This can also be made with white chocolate.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT5H15M",
        "recipeYield": "2 pounds",
        "recipeIngredient": [
            "1 pound semisweet chocolate, chopped",
            "¾ cup light corn syrup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt chocolate in a large metal bowl over a pan of simmering water. Stir occasionally until smooth. Remove from heat, and stir in the corn syrup. The mixture will become sticky, but keep stirring until very well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon onto a piece of plastic wrap, and wrap tightly. Let stand at room temperature until firm before using. Overnight is best. Use unsweetened cocoa powder on work surfaces to prevent sticking.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Chocolate Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HBIC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.43859649122807,
            "ratingCount": 57,
            "itemReviewed": "Plastic Chocolate",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "183.5 calories",
            "carbohydrateContent": "27.8 g",
            "cholesterolContent": null,
            "fatContent": "9 g",
            "fiberContent": "2 g",
            "proteinContent": "2 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "9.5 mg",
            "sugarContent": "18.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-09T00:51:02.423Z",
                "reviewBody": "I used white chocolate and cut the corn syrup to 1/2 c. since white chocolate is softer then regular or dark chocolate and it came out perfect!!! I used to make my daughters birthday cake and got sooo many compliments on it. I pinched off a few peices before rolling it out and used liquid food color to make other colors for decorating. This was really easy to work with easier then fondant if you ask me and it tastes so much better too. It tasted like a white chocolate tootsie roll (my fav. candy). Yummy. This will be my new way of making covered cakes and decorations. Thank you so very much for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Berger ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/michelleberger/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T04:09:17.107Z",
                "reviewBody": "Wow! This is a great recipe for a moldable chocolate. My friend and I made 30 white and regular chocolate roses and 60 assorted leaves to place on a full sheetcake for an anniversary party. Just let it set out a room temperature overnight otherwise its too sticky to work with. We had to dust our hands only occasionally while working with it. We dusted our hands with a little cocoa powder for the dark chocolate ones and a little vanilla protein powder for the white chocolate. Didn't think to try oiling our hands with a little vegetable oil! Thanks Emily B.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-17T20:40:25.48Z",
                "reviewBody": "This is great! I made about 85 white roses for my mom's 85th birthday.(I used confectioners sugar instead of cocoa mix---but vegetabale oil sounds like a good alternative too!). They covered the top of my mom's birthday 4 tier chocolate birthday cake. It was gorgeous. A real show stopper. Everyone wanted a picture!!! I have 2 requests for this birthday cake for next year! I've been experimenting with the plastic and used it to mold bowling pins and bowling balls for my 7 y.o. birthday cake; I made a school bus for the teachers when they started school this year. It's a long time to learn how to manipulate the plastic chocolate but it is sooooooo worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarah12601",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2154748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-05T00:51:13.1Z",
                "reviewBody": "I found this recipe really good for mouldable chocolate however while I left it at room temperature it's currently winter here and it got down to -9degrees celcius overnight. When I got to it in the morning it was too hard to do anything with. I found putting it in the microwave for 30seconds helped. The roses also looked a bit dull after I made them so microwaved them slightly which brought out a real shine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Morgaur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2391025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T06:19:06.197Z",
                "reviewBody": "This stuff is pretty awesome I'm very pleased. I made a chocolate cake for my mother in laws birthday and used this to make roses for the top. The roses themselves nearly made me pull my hair out but I found that a tiny heart cookie cutter makes the perfect petal to wrap with. They were a hit thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KELLY759",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/221114/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-12T00:47:40.49Z",
                "reviewBody": "I found this recipe very easy to make and very easy to work with. I put the plastic wrap on a cookie sheet and then poured the chocolate on so that I could take it off the counter while it set but I wish I had rolled it a little thinner. It was probably almost a quarter inch thick mostly because I was afraid it would tear if too thin. I used a melon baller to cut circles and half circles to use as petals. The downside to this recipe is that the final product was not delicious. In fact I found it completely inedible. As my fiance put it \"It's as if you came across a tootsie roll from Halloween at Easter.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CinnaMiss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/910926/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-13T19:20:23.173Z",
                "reviewBody": "I would give this more stars if you had 'um!! I've never worked with anything but icing for decorating a cake with but thought this looked easy enough. Used white chocolate chips and the mixture separated a bit when poured onto the plastic wrap but that didn't bother me a bit! My daughter wanted a \"big sub sandwich\" instead of a cake for her 15th birthday but made her a cake-sub. I used the \"Plastic chocolate\" to make the pickles lettuce and tomatoes... WONDERFUL!!! TIP: Instead of using oil or powdered anything to roll this out I rolled it out between a silicone mat and a piece of parchment paper -NO STICKING! Also when it started to get a bit sticky from working with it I wrapped it in plastic and popped it in the frig for a few minutes... Perfection!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1592141/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-03T17:24:07.55Z",
                "reviewBody": "LOVE this recipe. I tried a much fussier one from a cookbook and it was awful (grainy and gooey) but this is so simple and a nice consistancy. I found a few minutes in the fridge help if it gets too soft. This recipe made enough to cover a two layer 10\" cake with leftover for a few roses. I'm using it in place of marzipan under the royal icing on a mint, chocolate cake for a bridal shower.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2885870/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-12T02:51:30.767Z",
                "reviewBody": "I used this to decorate a wedding cake and it was just what I needed. Everyone raved about it. It does not harden or dry out overnight but may over a longer time period. I used Bernard Callebaut chips and it was delish although it was difficult to cut the cake",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joanne F",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668030/"
                }
            }
        ]
    }
]