[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14765/soups-stews-and-chili/chili/turkey-chili/",
                    "name": "Turkey Chili Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/223171/coconut-curry-chili/",
        "name": "Coconut Curry Chili",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1066431.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2019-04-04T03:52:56.000Z",
        "description": "The coconut, curry, and mango chutney really put the flavor in this one. I put this together one night with what I had, and loved the results. It tastes better the next day, just like most chili. This freezes well. Seriously, you have to try it.  Serve by itself, with rice, and/or with naan bread.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ pound ground turkey",
            "2 (10.75 ounce) cans  tomato soup",
            "1 ¼ cups water",
            "1 tablespoon minced garlic",
            "1 (15 ounce) can chickpeas (garbanzo beans), drained and rinsed",
            "1 (15 ounce) can red kidney beans, drained and rinsed",
            "½ cup chopped carrot",
            "¼ cup mango chutney",
            "3 tablespoons curry powder",
            "1 teaspoon onion powder",
            "salt and ground black pepper to taste",
            "½ cup coconut milk, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Break the ground turkey into small pieces into a large skillet over medium heat. Cook and stir the turkey, continuing to break it into smaller pieces, until completely browned, 5 to 7 minutes. Drain as much grease as possible from the turkey.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine tomato soup, water, and minced garlic in a large pot; bring to a boil. Add the turkey to the pot and return the mixture to a boil and reduce heat to medium-low. Stir chickpeas, red kidney beans, carrot, chutney, curry powder, onion powder, salt, and black pepper through the turkey mixture; bring to a simmer, place a cover on the pot, and cook until the chickpeas are tender, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 1/4 cup coconut milk through the chili, return cover to the pot, and simmer another 15 minutes. Pour the remaining 1/4 cup coconut milk into the chili, stir, and simmer 30 minutes more.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "Turkey Chili Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "usmcwifey"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.756944444444445,
            "ratingCount": 144,
            "itemReviewed": "Coconut Curry Chili",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "311.8 calories",
            "carbohydrateContent": "43.4 g",
            "cholesterolContent": "27.9 mg",
            "fatContent": "9.7 g",
            "fiberContent": "8.6 g",
            "proteinContent": "16.4 g",
            "saturatedFatContent": "4.7 g",
            "servingSize": null,
            "sodiumContent": "890.4 mg",
            "sugarContent": "11.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-11-09T01:02:28.907Z",
                "reviewBody": "Fair warning for those of you who object to those of us who review tweaked recipes- stop reading now! I used a whole pound of ground chicken and a leftover chicken breast, a large can of crushed tomatos instead of soup, chicken stock instead of water, black beans instead of red kidney, parsnips instead of carrots, and the whole can of lite coconut milk. I used extra hot mango chutney and doubled the amount called for. I added onion, sweet potato, red bell pepper, a pinch of hot red pepper flakes and a tablespoon of fresh ginger. This was delicious served over brown rice. It was sweet, spicy, earthy and rich. This is obviously a very adaptable recipe, however I would definitely not skip the hot mango chutney. It really makes this special. It was extra excellent the next day over whole wheat couscous with an extra dollop of chutney and a sprinkle of toasted unsweetened coconut. I love this recipe idea and will make it often with or without tweaks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hazelnut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4308066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-08T19:14:12.76Z",
                "reviewBody": "WOW!! An awesome chili. While it’s unconventional, this chili is among the best ever tasted. A few personal tweaks: (i) 1 lb. ground turkey rather than 1/2 lb.; (ii) 1 1/4 cups low sodium beef broth rather than like amount of water; (iii) 18.7 oz. Campbell’s Harvest Tomato w/ Basil rather than 2 cans (21.5 oz.) of regular tomato soup; (iv) Hot Mango Chutney rather than regular mango chutney (only if some heat is preferred); (v) lite coconut milk rather than regular. Submitter and reviewers say this chili gets better the next day but the first batch we made was devoured, and never made it that long. Anyone who really likes this dish, try Sweet and Spicy Curry with Chickpeas on this site . . . some differences but many similarities to this fantastic recipe. usmcwifey . . . this was so, so good that we’re going to try your Curry Chicken Salad, personal recipe. This is a keeper that gets mounted on the wall.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ConkyJoe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6974221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-09T00:08:19.397Z",
                "reviewBody": "I am making a double recipe as I post. I did add 2 \"new\" potatoes too. I can't stop \"tasting\" a bean or carrot. YUM. Since this is tomorrow's Sunday dinner I have time to zip to the market for the mango chutney. I plan to serve it on quinoa. (We are having rice tonight.) I think this is going to be my fav way to use ground turkey. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce Ciotti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5925199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-22T18:33:44.577Z",
                "reviewBody": "Really great taste with a twist. I didn't have mango and I left it out and it was still exceptional. Next time I will do it in the slow cooker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Queen of Kings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9480749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-22T20:42:27.643Z",
                "reviewBody": "Yum. I added fresh red peppers and basil from the garden. Served over basmati rice steamed in coconut milk. Mine was a tad sweet. Will try with fresh mango instead next time instead of the chutney. Still a delicious twist on chili. Yummy with fresh lime squeezed over top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Camela Giraud",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3878000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-18T15:48:34.583Z",
                "reviewBody": "This Chili is awesome. Great flavor! I wouldn't change a thing although I am sure everyone will have ideas of how to personalize it. It can handle additonal tweaks. I would recommend it if you really like Thai or Indian flavors.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly McConnell Weber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4630276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-15T14:54:24.74Z",
                "reviewBody": "This dish was absolutely AMAZING!! I doubled the turkey and doubled the tomato soup. Used garlic powder instead of minced garlic. Chopped up some baby carrots. Used hot mango chutney because that's all I could find. It was just the right spiciness for me. I had a difficult time finding the chutney. Luckily Wegman's had it. My local Giant Weis and Target didn't carry it. I will definitely be making this again very shortly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROCK80SGRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/234047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-07T23:55:33.2Z",
                "reviewBody": "My husband made this recipe for my birthday. It was very very good- we used the slow cooker and the only thing he changed was the meat- he doesn't like ground turkey so he added chicken instead. He said it was his new favorite curry recipe (besides his aunt's curry, who lives in Bangladesh)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bbeyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4184745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-19T01:48:23.833Z",
                "reviewBody": "I must start by informing you that I tweaked this recipe some. while I am certain that its perfect as is I must say...this chili turned out to be THE BEST I have made! everybody (children included) gobbled this up. Now here is what I changed I sauteed 3 tablespoons of vegetable oil 3 cloves of minced garlic & diced carrots for 7 minutes then added frozen vegi crumbles (instead of turkey). I sauteed until cooked through. I then followed the second part of the recipe using 2 cans of tomato sauce(instead of soup) and using vegi broth(in place of water. I skipped adding the carrots & garlic to the tomato mixture since I already sauteed it with the \"meat\". I used fat free coconut milk and added it at the end after everything is cooked together for the stated time. I followed the recipes measurements of the spices. I hope these are helpful suggestions for vegetarians out there that are craving a hearty or even meat eaters that want to try healthier options.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica Slattery",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4743707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-07T16:31:22.53Z",
                "reviewBody": "This was too sweet for my taste. I used hot curry powder thinking it would balance the sweetness but that didn't work so well. This is more like a curry for gringos recipe. Won't be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "daynine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2115627/"
                }
            }
        ]
    }
]