[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/53536/burmese-chicken-curry-gaeng-gai-bama/",
        "name": "Burmese Chicken Curry (Gaeng Gai Bama)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F892860.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:45:19.000Z",
        "description": "This is actually a northern Thai dish with a definite Burmese influence. I first ate it in a Burmese restaurant in Melbourne, Australia. I asked for the recipe and of course I didn't get it. I later experimented with some Thai recipes and came up with this final result. We really love this with steamed jasmine rice. It's quite a hot and spicy dish, so if you want it a bit mild, check the curry paste you use first. You can replace coconut milk with evaporated milk, but traditionally, coconut milk is a must.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "¼ cup vegetable oil",
            "8 shallots, thinly sliced",
            "1 pound skinless, boneless chicken meat, cut into large pieces",
            "2 tablespoons red curry paste",
            "1 tablespoon curry powder",
            "½ cup coconut milk",
            "¼ cup pureed tomato",
            "2 tablespoons fish sauce",
            "1 tablespoon palm sugar",
            "2 medium tomatoes, cut into wedges",
            "1 bunch cilantro, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil  in a medium skillet over low heat, and stir fry the shallots until browned and tender. Drain, reserving the oil, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the chicken in the skillet with the reserved oil, and stir in the curry paste and curry powder to evenly coat. Pour in enough water to cover, and bring to a boil. Reduce heat, cover skillet, and simmer until the chicken is no longer pink and juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the coconut milk, tomato puree, fish sauce, palm sugar, and 1/2 the tomato wedges into the skillet. Cook and stir over low heat until the mixture is smooth and creamy. Mix in the remaining tomatoes, and continue cooking until tender. Top with cilantro and the fried shallots to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Michelle Chen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.571428571428571,
            "ratingCount": 98,
            "itemReviewed": "Burmese Chicken Curry (Gaeng Gai Bama)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "425.3 calories",
            "carbohydrateContent": "26.5 g",
            "cholesterolContent": "79.4 mg",
            "fatContent": "23.7 g",
            "fiberContent": "2.8 g",
            "proteinContent": "28.8 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "806.1 mg",
            "sugarContent": "9.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:13:57.373Z",
                "reviewBody": "This is really good, though quite spicy. It all depends on the red curry paste you get, though. When I made it, my roommates and I had to eat slowly, drink water, and use a lot of rice. :0) In any case, definitely a good recipe.\r\n\r\nI replaced the palm sugar with brown sugar, the fish sauce with salt, and used a can of diced tomatoes for all the tomatoes in the recipe. Truthfully, the Shallots and Cilantro are garnish. If on a tight budget, eliminate them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LURK922",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/705963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-02T20:54:41.903Z",
                "reviewBody": "Very tasty!  My husband is Burmese (born and raised in Rangoon/Yangon).  He agreed with the description Michelle gave to the dish.  It really is a Thai dish, not a Burmese one.  However, since it has a Burmese influence, I thought I'd cook it up and see if it met with his approval.  I substituted the coconut milk for reduced fat coconut milk.  It worked perfectly and he loved the dish.  He suggested that more fish sauce should be added (about 1 Tbsp. more) to give it a more authentic Burmese influence.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "6FT2REDHEAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1015507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-05T05:30:22.173Z",
                "reviewBody": "Everyone I cook this for always loves this recipe. A few tips. It is easy to overcook the chicken - keep an eye on it. I like to add additional vegetables sometimes (carrots zucchini and straw mushrooms). I keep half the tomatoes fresh (uncooked) and use them to garnish the dish with the cilantro and shallots (see picture). Make sure that when you cook the shallots you cook them well they are best when they are definitely brown and definitely crispy. Finally red curry paste varies widely in how hot it is. Be careful the first time you use a new bottle - it is easy to add more as you go (doesn't have to all be added at the beginning). Frequently I find that there is too much liquid just dump some off. The ratios of liquids are not that important and I frequently just add in the whole can of coconut milk. The liquid is great with the rice so don't stress about how much liquid you have just make sure the flavor is right. Great recipe! A nice dish for the winter because of the nice cheery colors and the spice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yummy4mytummy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/895370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:14:11.39Z",
                "reviewBody": "I made mistakes with this one. Used small pieces of chicken so I shouldn't have used so much water. Had to let the water boil off. I ended up adding more about another 1/2 cup of coconut milk (lite) and stirred the cilantro into the sauce. This was a bit salty I would probably use a little less fish sauce next time. Still tasted great. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBMCE4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/570400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-02T03:22:15.107Z",
                "reviewBody": "I really like this recipe it has a great balance of flavors the fried shallots really adds to it but if you dont have enough you can fry up crispy some paper thin sliced onions. I have made this a few times with chicken and just tried it with baked firm tofu (30 min at 400 degrees) marinated with 6 tblsp. of soy sauce 2 tsp of both honey and balsamic vinegar and a few cloves of garlic. My family especially my husband likes finely minced fresh jalapeno peppers in the dish. I dont use palm sugar just reg. sugar. Thank you M. Chen for submitting this recipe which is now served frequently in my home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Pontell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/130818/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-06T00:34:55.54Z",
                "reviewBody": "I don't like to review a recipe when I have changed it but this one had great \"bones\" and we enjoyed it very much. Did not use the shallots fresh tomatoes or cilantro but DID use the curry paste curry powder and coconut milk as directed; I also used a small can of diced tomatoes instead. Thickened it up with a little flour in the cocount milk and stirred it in. Served it with sticky rice and cole slaw. Will make again! Dee-lish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen_M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T18:40:18.81Z",
                "reviewBody": "this was the 5th curry dish i've tried off allrecipes. hands down, this was the best! dee-lish!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/366064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-04T05:21:14.39Z",
                "reviewBody": "This dish was very good. Easy to prepare. Browned chicken in skillet and finished in the crock pot. We could not find palm sugar anywhere and we live in a very diverse area. Used medium curry paste would have preferred hot. The dish was missing something maybe an additional spice. We couldn't figure it out but we still believe this recipe is a 5 star and will make again. BTW - the curry paste stained our utensils.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LetyPat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780297/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-04T12:36:38.53Z",
                "reviewBody": "This is an excellent curry but the quality of the ingredients really makes it - get the best red curry paste you can. I don't find mine that spicy (if it's just for me I grind up more peppers for it) but others have had some problems. Sometimes I make this with half chicken and half shrimp. It's one of the better curry recipes I've found on this site - I tend to like more Indian (or Burmese) style curry than Chinese or (shudder) British and it has to be a pretty special red or yellow curry to get me away from green curry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICETASTENICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1405188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-16T22:13:09.763Z",
                "reviewBody": "Nothing special.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "CEDAR2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/820684/"
                }
            }
        ]
    }
]