[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17266/main-dish/pork/pork-chops/boneless/",
                    "name": "Boneless",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/53733/pork-chops-with-raspberry-sauce/",
        "name": "Pork Chops with Raspberry Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1368932.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "2019-04-02T06:45:19.000Z",
        "description": "Succulent herbed boneless pork loin chops paired with a tangy raspberry sauce ... heaven on a plate! This is a special family dish or perfect for company. I accompanied it with mashed potatoes and julienned steamed carrots. My husband can't wait to have it again.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ teaspoon dried thyme, crushed",
            "½ teaspoon dried sage, crushed",
            "¼ teaspoon salt",
            "¼ teaspoon pepper",
            "4 (4 ounce) boneless pork loin chops",
            "1 tablespoon butter",
            "1 tablespoon olive oil",
            "¼ cup seedless raspberry jam",
            "2 tablespoons orange juice",
            "2 tablespoons white wine vinegar",
            "4 sprigs fresh thyme"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 200 degrees F (95 degrees C). In a small bowl, combine crushed thyme, sage, salt, and pepper. Rub evenly over pork chops.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter and olive oil in a nonstick skillet. Cook pork chops for 4 to 5 minutes on each side, turning once. Remove from skillet and keep warm in preheated oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the skillet, combine raspberry jam, orange juice, and vinegar. Bring to a boil, and cook for 2 to 3 minutes, or until sauce is reduced to desired consistency (sauce will thicken as it cools). Spoon sauce in a pool onto a serving plate, and top with pork chops. Garnish with sprigs of thyme.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Boneless"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Robin Seidel"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.60184331797235,
            "ratingCount": 1085,
            "itemReviewed": "Pork Chops with Raspberry Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "113.3 calories",
            "carbohydrateContent": "14.9 g",
            "cholesterolContent": "7.6 mg",
            "fatContent": "6.3 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.2 g",
            "saturatedFatContent": "2.3 g",
            "servingSize": null,
            "sodiumContent": "166.9 mg",
            "sugarContent": "13.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-28T22:36:04.937Z",
                "reviewBody": "I tried this a long time ago but never rated it. I made this with pork and once with chicken breasts and both very good. I used frozen oj concentrate about 2 tablespoons in place of OJ. I added some dried rosemary with other herbs, I would have used fresh if I'd had it. I also used balsamic vinegar and loved the mellow flavor! Also I added 2 tbs.of cold butter to this finished sauce, I added it last by slowly whisking it in a pat at a time, it thickens the sauce and gives it that silky quality found in French cooking. Serve this over a bed of soft polenta and you have a restaurant quality dish to serve to guests!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fitforaqueenclothing.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/212781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-20T20:16:15.503Z",
                "reviewBody": "I've made this recipe a couple times now, and it is always great!  It's important to use boneless chops though.  The sauce is perfect, and I've used both red wine and white wine vinegars.  The sauce thickens more once it's off the heat, so follow the directions, then let it sit a few minutes, and it will be perfect for serving.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEGLANGFORD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/876581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-22T03:40:40.16Z",
                "reviewBody": "My husband and I made this tonight.  We loved it.  We made two changes.  One was switching the white wine vinegar with balsamic vinegar. The second was instead of raspberry we used blackberry (since that's all we had).  We've made this recipe before with no changes and enjoyed it...We made again with these changes and LOVED it this time.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Wildes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2555928/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-18T17:08:40.53Z",
                "reviewBody": "This was a fast dinner and was loved by all. I would make it for company, for sure! I grilled 6 bone-in thinner pork chops (had to make a little extra of the rub) - they had great flavor! I reduced my sauce a little too much, so watch that - it does thicken up upon cooling. Also, had no need for the olive oil, but used some butter in the sauce. I made 1 1/2 times the original recipe for the sauce & would like to just double it next time. Oh, and the only different ingredient I used was my favorite vinegar: White Balsamic Raspberry Blush Vinegar - My favorite (I could drink it! Well, maybe not). Served with mashed potatoes & sauteed baby zucchini(so cute on the plate!) - an excellent dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Plourde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2078358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-22T11:59:28.343Z",
                "reviewBody": "HELPFUL TIPS NOT MENTIONED:  I'm giving this 5* for the raspberry sauce, which I think you have to add a T more raspberry to for it to not only taste perfect, but to drown out the wine & create the perfect thickness!  I just wanted to say that this sauce goes great with another amazing dish from this site (\"Pistachio Crusted Chicken\").  If you haven't tried nuts and chicken before, this is the best!!!  We also like to serve this dish with mashed potatoes since everyone wants a reason to use more sauce!  I HAVE made this recipe as state several times, and each time my husband says not to make it with pork again and rather eat it with chicken.  I agree, so I fry some seasoned chicken until browned then add the sauce! Give it a whirl, you'll thank me!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-18T04:04:52.467Z",
                "reviewBody": "I thought these were very good, nice and juicy and the sauce was good, also.  I made as directed, but doubled the sauce, as many reviews suggested.  I didn't double the vinegar, though, I used only 3 TBSP...this was still a bit too much, I think.  When tasting the sauce while cooking, I wondered how I could 'sweeten' it up a bit, and added a little more orange juice and just a little cornstarch to thicken.  It tasted sooooo much better with the chops rather than by itself.  I will definitely make this again soon, just reducing the amount of vinegar next time.  One more thing, I didn't really think it was necessary to keep the chops warm in the oven while making the sauce, I was afraid it would dry them out, I just put them on a plate and covered them tightly with foil, this worked out fine.  Very good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Janett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1522505/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-07T03:07:02.533Z",
                "reviewBody": "Let the chops set all day with the seasoning rub which enhanced their flavor beautifully.  The raspberry sauce perfectly complemented the seasoned pork though I did add a small pat of butter to the sauce to smooth it out. Sauce was a nice mix of sweet and tart flavors.  Served with onion rice from this site and steamed broccoli for a heart healthy dinner.  Thank you Robin Seidel for a nice addition to my recipe collection.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-01T21:20:26.467Z",
                "reviewBody": "FANTASTIC!!!! My Husband who has a very small appetite went for thirds before rolling over to the couch. He said he thought it was the best meal I'd ever made. I served it with mashed potatoes and gravy, and a recipie for Italian peas I saw on here. Definately one of my favs, even my picky 5 year old cleaned his plate. The sauce was rather thin so we used corell dishes and dipped our pieces or pork chop. Yummy!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-09T06:56:38.92Z",
                "reviewBody": "This was delicious and I WILL be doing it again. I used homemade orange juice with  mandarin oranges and added a little of the pulp as well.   Excellent flavor.  Good idea to double the sauce for 4 chops.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynn Mott",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-12T23:19:30.16Z",
                "reviewBody": "The vinegar was WAY too overpowering in this sauce. IF I make this again and that's a big if I will not use vinegar. Instead I'll use plain white wine. Granted I don't like vinegar on French fries or poured on anything straight. But I do cook with vinegar when it's called for in a recipe like this because I expect it will mostly disappear or meld into the flavors of the dish. That didn't happen here. This is basically a sweet raspberry vinaigrette on pork chops. I even added 2 tablespoons of butter as suggested by one reviewer to make it a richer sauce (and to tame the vinegar's strength). Still I found it too strong. Sorry! I had great hopes for this one but it was disappointing. I gave it a three stars because I don't like vinegar so I wanted to be fair in mentioning that and assuming some people may like it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402378/"
                }
            }
        ]
    }
]