[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14765/soups-stews-and-chili/chili/turkey-chili/",
                    "name": "Turkey Chili Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229081/sweet-potato-chili/",
        "name": "Sweet Potato Chili",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2714849.jpg",
            "width": 2216,
            "height": 2216
        },
        "datePublished": "2019-04-04T03:53:39.000Z",
        "description": "A delectable, southern winter dish that warms the heart and fills the tummy! Garnish with chopped avocado if desired.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 sweet potatoes, diced",
            "2 (14.5 ounce) cans diced stewed tomatoes with chili seasonings",
            "1 (8 ounce) can tomato sauce",
            "¾ cup diced sweet onion",
            "½ cup chopped celery",
            "½ cup water",
            "1 tablespoon chili powder",
            "1 teaspoon ground cumin",
            "½ teaspoon ground cinnamon",
            "1 pinch salt",
            "1 pinch ground black pepper",
            "1 pinch cayenne pepper",
            "1 pinch garlic powder",
            "1 pinch onion powder",
            "½ pound ground turkey",
            "½ pound ground beef",
            "1 (12 ounce) can black beans, drained and rinsed",
            "1 cup corn"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place sweet potatoes, stewed tomatoes, tomato sauce, onion, celery, water, chili powder, cumin, cinnamon, salt, black pepper, cayenne pepper, garlic powder, and onion powder in a slow cooker. Cook on high, stirring occasionally, for 5 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat and stir in ground turkey and ground beef. Cook and stir until meat is crumbly, evenly browned, and no longer pink, 10 to 15 minutes. Drain and discard any excess grease. Add cooked ground turkey, cooked ground beef, black beans, and corn to sweet potato mixture in the slow cooker; cook until flavors have blended, 1 to 2 more hours. Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "Turkey Chili Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "salt&light"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.667731629392971,
            "ratingCount": 313,
            "itemReviewed": "Sweet Potato Chili",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "250.3 calories",
            "carbohydrateContent": "32.5 g",
            "cholesterolContent": "38.3 mg",
            "fatContent": "7.4 g",
            "fiberContent": "7.3 g",
            "proteinContent": "16 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "620.9 mg",
            "sugarContent": "8.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-10-07T14:57:56.617Z",
                "reviewBody": "My whole family loved it! I did use all ground beef. I put the ground beef in raw with step one, but only cooked on high about an hour, then switched to low. Left out the cinnamon (just now realized that). Had to sub a garden fresh bell pepper for the celery. I also didn't add the water, my slow cooker seems to make a lot of water on its own. I only had diced tomatoes so I subbed the Black Beans for a can of chili beans (gave me the chili seasonings that the chili tomatoes would have). We love flavor, so my pinches were probably more like spoonfuls (except no salt, we have to eat low sodium). I also forgot the corn. Delish!! I can't wait for the leftovers. Today I'm going to eat it more like a dip on garden veggie crackers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scotdog",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thescotdogs/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-13T16:03:56.99Z",
                "reviewBody": "I made this for the Recipe Group Selection: 06, October 2012. Both my husband and I love sweet potatoes and have put them in our chili and soups before. I didn't have canned tomatoes with green chilies and so I chopped up a poblano and chili pepper from my garden and added in with regular diced tomatoes. I only used one pound of ground meat, no pork. I dashed the cinnamon and to me it is the spice that makes this chili different from your many run of the mill chili dishes, gives that earthy fall flavoring. I have an old crock pot that doesn't cook too hot and five hours on high was perfect. I did pre-brown my ground meat with some onions until it just turned pink, drained and added it in the beginning with all the other ingredients. I also did the open and stir once in awhile as the directions indicated, something I usually never do with crock pots, but it was needed to move around the sweet potato chunks since they seemed to like to float to the top. Everything that said a pinch, got a dash or two. Nice thickness to this and not too spicy. We topped with green scallions, cheddar cheese and sour cream. Smells so wonderful while cooking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-28T22:58:08.88Z",
                "reviewBody": "Nice flavors in this. Sweet potatoes were done way before the 5 hrs on high. I didn't have the 1/2 ground beef handy so made whole amount with the ground turkey. I will do this recipe again but will cook on low and just throw all the ingredients in the slow cooker at the same time no prebrowning I think is needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1865315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-31T23:53:39.67Z",
                "reviewBody": "Wow! I would not change anything. The proportions are great already. The only thing I changed because I didn't have any was that I used a few shakes of Franks Hot Sauce instead of the cayenne pepper. I cut up everything and put it in a gallon ziploc bag the night before. The next morning we just dumped it into the crock pot turned it on low and let it cook all day long. Do NOT add any water - the steam from the crock pot makes plenty of liquid. Everyone is on their second bowl tonight with a request to never make regular chili again! Ha! I would have never thought that sweet potatoes would be good in a chili but they are really tasty! One thing I would suggest - after dicing your sweet potatoes you might want to nuke them a little bit first. Ours were not 100% soft even after cooking all day long. But that could be a variance in taters too. Thank you for sharing your great recipe - it will become a standard at our house now too!?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KittyFanatic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1354028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-21T18:45:22.337Z",
                "reviewBody": "UPDATE: I won 3rd place in a friends and family chili cook off with this one! Thank you to salt&light for posting this fabulous recipe. I have made it an unofficial rule (very strong advice, lol) that this be eaten with fat free Greek yogurt mixed in! It gives it a hearty creaminess that is guilt-free! Yum!!! This chili is so friggin' awesome! It's mostly like a \"normal\" chili, but the sweet potatoes and touch of cinnamon give it a little nudge into something magically perfect for Autumn. I didn't bother with stewed, chili-seasoned tomatoes, I just used regular old canned diced tomatoes and increased the seasonings (except cinnamon) a little. No problem. Used chicken broth instead of water. Also only cooked on high 3 hours before adding the meat. First time I made it, I used all beef. I have my second batch cooking now, using 3/4 turkey, 1/4 beef (what I have on-hand) and I quadrupled the recipe using 2 crock pots, because I am entering this recipe in a chili cook-off my friend is hosting on Sunday. I will come back with an update soon! I served this with fat free Greek yogurt (sour cream is a thing of the past- I can use ALL the Greek yogurt I want, with NO guilt! It tastes the same, try it!!) chopped scallions, oyster crackers, and shredded cheddar cheese. My husband and I thought we'd died and gone to heaven. We looked forward to eating the leftovers every day, 2 meals a day, for 3 days. I can't say enough good things about this. Try it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Margar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3863245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-10T23:39:34.02Z",
                "reviewBody": "A wonderful lower fat and more nutritious chili recipe!  Hubby and I loved this, would be great for a Halloween party, the colors and flavors are so seasonal.  I took a little liberty with the cooking method...I used all ground turkey, browned with onion and added some garlic and cumin, s & p, and added to the crock.  All of the other ingredients went in, and I used liberal amounts of most of the seasonings (except the cayene!).  Cooked this in the crock on high 4 hours, turned down to low for an hour and a half or so.  Perfect.  Thanks for sharing your recipe, this is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Saveur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-13T05:12:20.833Z",
                "reviewBody": "Recipe Group Selection: 06 October 2012 Great twist on chili. I love sweet potatoes hubby does not. I made the soup while he was gone so he would not see me add the sweet potatoes. He had the soup for dinner before I got home. He liked the flavor of the soup but wanted to know what the orange things were. I told him it was carrot chunks. He wasn't so sure about that but that is how I left it. I put all the ingredients in the crockpot in the morning and cooked on low all day. Since the soup would be cooking all day I did omit the 1/2 cup water. The texture and taste of this chili was delicious and I will make it again \"carrots\" and all! Thanks salt&light for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-02T04:03:00.293Z",
                "reviewBody": "Used all ground beef and omitted cayenne for the kids. Served with chopped avocado green onions and sour cream. The entire family ate it up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISRIZZIO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1303949/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-09T19:26:15.27Z",
                "reviewBody": "Nice tasting chili. Easy to prepare. No substitutions or omissions. It is somewhat thin or has juice so if you like a thicker chili than I would suggest omitting water or have enough bread as a side. This def. needs the time to soften up the potatoes so plan ahead. If I have extra sw. potatoes around I would make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AuntE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7758077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-05-20T02:41:20.443Z",
                "reviewBody": "Way too much cinnamon and not enough of the savory spices. If I were to make again I would cut back on the cinnamon and turn up the heat/spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeri Martins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17084833/"
                }
            }
        ]
    }
]