[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229279/marias-mexican-rice/",
        "name": "Maria's Mexican Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6501664.jpg",
            "width": 3024,
            "height": 3484
        },
        "datePublished": "2019-04-04T03:53:45.000Z",
        "description": "My mom is from Nuevo Laredo, Mexico and this is how she has been making rice all her life. One day I finally stopped and measured the amounts she used while cooking. In my view this is the perfect Mexican rice. It's not too greasy or dry, nice color, and great flavor. The Serrano pepper will add flavor but no heat to this recipe since it is used whole and not chopped. If you would like spicy Mexican rice, de-seed and chop the Serrano before adding it to the mix.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "1 cup rice",
            "½ large onion, diced",
            "½ tablespoon salt",
            "⅛ teaspoon ground cumin",
            "⅛ teaspoon ground black pepper",
            "2 ½ cups water",
            "⅓ cup tomato sauce",
            "1 tablespoon chicken bouillon (such as Knorr®)",
            "1 whole serrano chile pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a saucepan over medium heat. Cook and stir rice and onion in the hot oil until browned, about 5 minutes; season with salt, cumin, and pepper. Pour water over the rice mixture. Stir tomato sauce and chicken bouillon into the water. Increase heat to medium-high, place a cover on the saucepan, and bring to a boil. Add serrano chile pepper and continue cooking at a boil for 10 minutes. Reduce heat to medium-low until the rice is tender and the water is absorbed, 15 to 20 minutes more.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "viv85e"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.694117647058824,
            "ratingCount": 340,
            "itemReviewed": "Maria's Mexican Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "163.9 calories",
            "carbohydrateContent": "26.8 g",
            "cholesterolContent": "0.1 mg",
            "fatContent": "4.9 g",
            "fiberContent": "0.9 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "845.4 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-04-21T03:42:08.317Z",
                "reviewBody": "Whoa, did I ever eat this right up!  This is not your everyday, ordinary, boring Mexican rice!  For once I enjoyed something with real flavor rather than the nondescript stuff I’ve pretty much learned to expect.  I don’t know, maybe it’s because I used a good squirt of concentrated tomato paste from the tube because I didn’t want to open up a can of tomato sauce for the couple of tablespoons I needed for the half recipe I made.  I also used chicken stock instead of water and chicken bouillon but I don’t think that can account for how flavorful this was.  I didn’t use the Serrano pepper in deference to Hubs’ sensitive innards but it truly wasn’t missed.  Maybe it’s because the rice is browned before simmering.  Whatever the case, viv85e has come up with a Mexican recipe that’s well worth repeating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-28T08:50:49.117Z",
                "reviewBody": "This is the best Mexican rice dish that I've ever made. I didn't have chicken bouillon so I used 1 cup chicken broth in place of 1 cup of the water. Using the serrano pepper whole really did make for nice flavor without being too hot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "belfers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10402392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-02T01:37:39.953Z",
                "reviewBody": "This was really good -- as good or maybe even better than many of the authentic Mexican restaurants we have here in TX. As another reviewer mentioned, though, mine also turned out a bit more watery than I'm used to, and I also like my rice a bit on the dry side (just a personal preference). Letting the rice sit for 5 minutes after it's done helped, though. The best part is that it's easy to make this vegetarian-friendly by omitting the bouillon and substituting one cup of the water for a cup of veggie broth or one of the many varieties of vegetarian \"chicken\" broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Claire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1277224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-13T19:30:52.49Z",
                "reviewBody": "I love Mexican food, and as a native Texan I can attest that this is the real deal.  I used brown rice since that's all I had on hand, so I had to simmer it longer.  I also added fresh jalapeno slices instead of the whole serrano which gave it great flavor AND the kick I wanted.  In addition, I think I went a little heavy handed on the tomato sauce (not recommended for next time) and omitted the salt (highly recommended).\nEveryone knows you have to \"fry\" Mexican rice before boiling it, so I had high hopes for this dish and it delivered.  It makes a LOT of rice, which is fine because although I originally served it with homemade pork tamales from a sweet neighborhood abuelita, I have used some of the leftovers to stuff bell peppers (mixed with leftover \"Best Black Beans\" by Cameron on this site) much to the delight of my fiance.  And there is still some rice left!\nFollow the instructions, but don't be afraid to add peppers to the pot not just to discard but to mix into the rice depending on your personal taste.  Thanks for sharing... this is going into my regular rotation!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jilly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4743586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-30T02:58:39.46Z",
                "reviewBody": "Excellent rice.  Just what I was looking for.  None of the flavors were over powering.  I hate when people change the recipe and rate it, but this time I did make one change.  I wanted a little more rice so I added an additional 1/2 cup.  Next time, I would do the same, and the only other tip would be to lessen the amount of salt.  I would cut the salt in half.  I don't think it needed that much, and I'd rather add more salt, if desired, at the end, because you certainly can't take it out then.  Yummy, the whole family loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "donomom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8065455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-26T01:29:15.533Z",
                "reviewBody": "Delicious! Perfect rice. There are many Mexican rice recipes out there. THIS is the one that's spot on to the best of the family-run restaurants I used to visit when I lived in San Diego. Really, if you want authentic Mexican rice, look no further, you've found it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lucylove",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lucylove/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-07T16:01:56.597Z",
                "reviewBody": "In place of tomato sauce, I used some mild red salsa and also tossed in some peas and carrots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AcaCandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3693712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-18T00:44:30.487Z",
                "reviewBody": "made this recipe last minute to go with chicken fajitas. this recipe was very easy to follow and love it. soooo good. i did decrease the amount of water because i like drier rice. so instead of 2 1/2 cups i used 2 cups. came out good. def gonna use this recipe again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "brianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3836320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-02T18:16:48.64Z",
                "reviewBody": "Look no further for an authentic Mexican rice recipe, this is it. My mother ran a very successful Mexican restaurant with my aunt in chihuahua Mexico for many years before marrying my dad and this is the recipe she uses to this day. I have never had a better tasting rice in any wannabe Mexican restaurant here in the states. She adjusted the recipe for my brothers who won't eat onions without loosing flavor. Instead of sautéing the onions, she blends it with a clove of garlic and a quarter cup of water and adds it along with the water. This eliminates the use of garlic powder and uses the healthier option of real garlic. If you are out of tomato sauce, you can also blend a fresh tomato to the onion and garlic mixture. We never add pepper and cumin though, the chicken bullion and salt should be plenty of flavor. Taste the broth once all the liquid an spice has been added to the fried rice before it is absorbed, this will be a great time to taste test for flavor, if any is needed add more, if it has too much, add more water. A can of mixed veggies can also be added at this point, we always use peas and carrots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tychicken",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13824379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-05T00:30:34.923Z",
                "reviewBody": "Did not like it at all, very bland",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Wanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11075349/"
                }
            }
        ]
    }
]