[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17575/bread/yeast-bread/english-muffins/",
                    "name": "English Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230072/whole-wheat-crumpets/",
        "name": "Whole Wheat Crumpets",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F926562.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:54:05.000Z",
        "description": "These are a little like an English muffin, except a bit more dense and cake-like with a hint of sweetness. They are good eaten warm and soft, or you can let them sit out a bit for a more European crusty texture, then slice and toast them. Serve in the manner of biscuits or English muffins. Good for sandwiches, too! Especially good is an egg sandwich made with these.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "15 crumpets",
        "recipeIngredient": [
            "½ cup warm water (105 to115 degrees F/40 to 45 degrees C)",
            "2 teaspoons honey",
            "1 tablespoon active dry yeast",
            "2 ¼ cups whole wheat flour",
            "1 teaspoon salt",
            "½ teaspoon baking soda",
            "1 ½ cups milk at room temperature",
            "5 3-inch round metal rings (such as wide-mouth canning jar rings)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir warm water and honey together in a large bowl. Mix yeast into the warm water and let stand until the yeast begins to bubble, 10 to 15 minutes. Stir flour, salt, baking soda, and milk into yeast mixture. Cover bowl and let rise in a warm place for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an electric griddle to medium-low heat (220 degrees F/105 degrees C) and grease the griddle. Grease the metal rings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the greased rings onto the griddle and allow to warm for 1 to 2 minutes; spoon about 3 tablespoons of batter into each ring. Batter will be elastic and stringy, but will fill out the ring as it cooks. Cook the crumpets until golden brown on the bottom and bubbles form on the top side, 5 to 8 minutes. Increase griddle temperature to 230 degrees F (110 degrees C) and flip the crumpets. Cook until underside is golden brown, 2 to 3 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove rings from crumpets, grease the rings and griddle again, and turn griddle heat back down to 220 degrees F (105 degrees C). Repeat to make 2 more batches of crumpets.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "English Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "webmonkey"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6923076923076925,
            "ratingCount": 13,
            "itemReviewed": "Whole Wheat Crumpets",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "78.6 calories",
            "carbohydrateContent": "15.3 g",
            "cholesterolContent": "2 mg",
            "fatContent": "0.9 g",
            "fiberContent": "2.4 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "208.6 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-02-11T04:20:13.503Z",
                "reviewBody": "These were great! We could hardly tell they were whole wheat! They were so easy to make that I will not be buying them premade anymore! Plus they are a lot cheaper to make. I used the round cookie cutters for the first ones but it was a big pain so after that I just poured them onto the skillet into as round of a shape as possible which was pretty easy to do because they don't really spread out. I also used almond milk instead of regular milk because that is all we have. You couldn't even tell. They tasted great plain with butter with jam with eggs benedict and with a fried egg bacon and cheese sandwich. I will be making these often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bctabby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8632557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-28T00:59:31.37Z",
                "reviewBody": "Very good I use these instead of English Muffins only a few ingredients instead of all the stuff in the store bought ones. They store well in the freezer too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2163730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-24T04:21:49.69Z",
                "reviewBody": "Had these with soup for dinner.. yumyum. I had fresh rosemary so I added some. I'll make these again and maybe add just a tad more salt",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-19T11:18:49.13Z",
                "reviewBody": "Works fabulously. I will never make pancakes again -- all I want is crumpets!!! Like another reviewer I used almond milk with great success. The texture of these is incredible. I didn't have rings so I cooked them like pancakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15770294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-07T13:07:37.093Z",
                "reviewBody": "This recipe was excellent and it allows for \"wiggle room\" with ingredients with is nice. I had to use almond milk because that is what I had on hand but everything else was per the recipe. These cooked up beautifully! Fluffy...dense and moist like an English muffin. So good with butter or in my case apple butter. I will make these again but I will experiment with quinoa flour (for more protein) and maybe cinnamon and cranberries. The only \"trouble\" I had was that I didn't have an electric griddle so I had to guage my temps on the stove top using a griddle pan. While they came out wonderully I had to really watch them because if they stove heat is too high it will brown too quickly and not cook through completely. With some trial and error I was able to figure out what worked on my stove. Lastly I used both rings and \"free form\" and both came out great. I think size-wise using only 2 tablespoons per crumpet worked for me. Advice if you are using rings try to use ones with handles as they get pretty hot and can be awkward to pick up with an oven mitt.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SFCzarnecki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14039232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-26T21:59:04.46Z",
                "reviewBody": "I tried this recipe and a traditional white flour one I found elsewhere on the Internet. This was by far my favorite as it was much more flavorful. We are doing an English Afternoon Tea for 8th graders after reading Great Expectations and I'll be cooking these fresh on an electric griddle during the event. Thanks a bunch for the recipe! UPDATE 2/26/17: I did buy crumpet rings and they do support the batter to give you that high rise you want for crumpets but you can easily use small tin cans with both ends removed. I found that a little butter dripped in around the rings while they were cooking helped with ring removal. The electric griddle gave that low even temperature that prevents burning on the bottom. I used small tongs to remove the rings as they do get hot. Between 2-3 Tbs of batter each worked for me and according to British sites these aren't supposed to be split like English Muffins. You eat them whole with clotted cream and lemon curd if you want to go with tradition. Recipes for the toppings are available online as well and also worked out well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bhaun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5072331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-05T12:36:40.857Z",
                "reviewBody": "These are wonderful and only about 80 calories. A great recipe for those using only whole wheat flour. Especially good if you freshly grind your own wheat berries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10719094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-02T07:40:15.343Z",
                "reviewBody": "Fantastic recipe! Thank you so much. I skipped using the rings and made them as round as possible which worked out well. This recipe was easy to prepare and came out so light and fluffy... amazing. I’ve never tasted one so good before. I will not purchase store bought ever again! Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PinkDaisy368",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5326124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-27T20:12:52.98Z",
                "reviewBody": "Easy enough to make but had my trouble with cooking. For me it took much longer than recipe shows. And even when done they were very chewy. I will say the ones I split and toasted were very good. But not enough to want to do this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Ceijae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9756661/"
                }
            }
        ]
    }
]