[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/344/bread/yeast-bread/whole-grain-bread/",
                    "name": "Whole Grain Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15034/bread/yeast-bread/whole-grain-bread/rye-bread/",
                    "name": "Rye Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230396/real-ny-jewish-rye-bread/",
        "name": "Real NY Jewish Rye Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1108705.jpg",
            "width": 1935,
            "height": 1936
        },
        "datePublished": "2019-04-04T03:54:13.000Z",
        "description": "For thousands of years man has been enjoying bread. This rye bread recipe will add to this ancient enjoyment. Having lived in northwest Connecticut for over 35 years, in close proximity to NYC with its great Jewish delis, baking some of the finest rye bread going, I snagged this recipe from a friend. Hope you like it. Enjoy and share with your family, friends, and neighbors.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT3H25M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "2 cups unbleached bread flour (such as King Arthur®)",
            "1 cup dark rye flour",
            "3 tablespoons dry potato flakes",
            "2 tablespoons caraway seeds",
            "1 ½ tablespoons demerara sugar",
            "2 ½ teaspoons instant yeast",
            "1 ½ teaspoons sea salt",
            "1 cup warm water",
            "¼ cup canola oil",
            "¼ cup sour pickle juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place bread flour, rye flour, potato flakes, caraway seeds, demarara sugar, yeast, and sea salt in the bowl of a large stand mixer. Turn mixer to low and thoroughly mix dry ingredients. Beat warm water, canola oil, and pickle juice into dry ingredients. Fit dough hook onto mixer and beat until dough is rough and shaggy-looking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover bowl with plastic wrap and let rest for exactly 30 minutes. Remove plastic wrap and knead dough in stand mixer with dough hook until smooth, firm, and only slightly sticky, 6 to 8 minutes. Turn dough onto a floured work surface and knead until smooth, 1 to 2 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form dough into a ball, place dough into an oiled bowl, and turn dough around several times in bowl to coat with oil. Cover the bowl with plastic wrap, set into a warm place, and let rise until nearly double, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease a 5x9-inch loaf pan. Turn dough onto a lightly oiled surface, shape into a log, and place into prepared loaf pan. Cover with a cloth kitchen towel and let rise until top of dough has risen slightly over top of pan, 60 to 90 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place rack in middle of oven and preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake loaf until golden brown and cooked through, about 35 minutes. The internal temperature of the bread should be 190 degrees F (90 degrees C). If loaf browns too quickly, cover loosely with a tent of aluminum foil with shiny side out. Remove from pan and cool on wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Whole Grain Bread Recipes",
            "Rye Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dad's world famous"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.814345991561181,
            "ratingCount": 237,
            "itemReviewed": "Real NY Jewish Rye Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "148.3 calories",
            "carbohydrateContent": "23.1 g",
            "cholesterolContent": null,
            "fatContent": "4.7 g",
            "fiberContent": "3.1 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "191.3 mg",
            "sugarContent": "1.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-03-20T17:06:28.713Z",
                "reviewBody": "This bread was great!  I didn't have potato flakes so I didn't use them and took out 1/4 cup of water since I researched how much water is used to reconstitute them. I used regular sugar, not demerara, and I didn't have pickle juice so I used sauerkraut juice instead. Since I make a lot of bread I changed up the directions a little.  I mixed the sugar and yeast into about 110 degree water until the yeast became frothy, about 5 minutes. I mixed the flour, rye flour, caraway seeds, and salt together (I would have also mixed the potato flakes in with this dry mixture if I had used them).  I then poured the frothy yeast mixture, sauerkraut juice (or pickle juice)and oil into the dry mixture and mixed them all together. I then kneaded the dough for about 6 minutes with the dough hook in my kitchen aid. I put the dough into an oiled bowl and turned it to coat the whole dough. I let it rise, covered with a towel for about an hour or until doubled in size. I then punched it down and put it in an oiled loaf pan, covered it with a towel and let it rise for about an hour, or until a little over the loaf pan.  I cooked it at 350 degrees on the middle rack of the oven for 35 min.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bctabby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8632557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-18T21:35:01.5Z",
                "reviewBody": "I live in an area of NY that is blessed with both Jewish delis and bakeries and this bread would be right at home in either.  I free formed my loaf and baked it on my pizza stone.  This recipe is a keeper.  Thanks for sharing, Dad!\r\n3/18/14 the potato flakes aren't strictly necessary, especially if you use bread flour rather than AP.  It simply adds gluten to the recipe, making for a nice rise. Vital wheat gluten would also work.  And the pickle juice doesn't have to be a specific type.  I used the juice from a jar of bread and butter pickles, I have also used both white and cider vinegar. It only imparts the slightest of taste and is primarily used as a dough conditioner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-08T16:45:36.45Z",
                "reviewBody": "This bread is absolutely fantastic!  Follow the recipe exactly and you'll get a perfect loaf.  The pickle juice is a must.  \n\nPS:  I'll never understand people who give low ratings to a recipe and admit they changed the recipe completely.  At least try it as written to be able to give an honest rating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4243547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-02T18:43:27.923Z",
                "reviewBody": "The first time I tried this I did everything by hand. I live in a small town in the far south of Mexico and am an hour and a half from the closest grocery store. I had to substitute light rye flour someone brought me from the States and brown sugar but luckily I make my own dill pickles so I had the juice. It came out good. In the mean time someone gave me a kitchen aid stand mixer and I used it the second time and the bread came out superb!!! I added about half a tablespoon more caraway seeds and used a coffee grinder on half of them and left  the other half whole to give it a stronger caraway flavor. The first loaf was done in a smaller bread pan and this loaf was done in the recipes suggested 5 x 9 pan. Made quite a difference. Made Rubens that were to die for. The hardest part was finding sauerkraut and corned beef. Thanks for the recipe since in 16 years in Mexico I have only seen rye bread twice and both times I got my hopes up and was sorely disappointed. Keep em commin Dad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kancunkid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12796002/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-22T19:32:59.797Z",
                "reviewBody": "This recipe is hands-down, the best recipe for rye bread I have encountered. I have successfully made it in the bread machine, using either the full loaf cycle, or the dough cycle and finishing it off the second rising in a loaf pan then baking it in the oven.  It is perfect as written but sometimes I add 1 heaping tsp. of grainy mustard to enhance the flavor. To change things up I've also substituted demerara sugar with organic barley malt syrup, which is commonly used by bread bakers. Thanks for a fantastic recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3567064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-11T00:56:21.843Z",
                "reviewBody": "Wonderful bread. I did grind the caraway seeds cuz we don't care for the whole seeds. I let it over rise so it deflated a bit when I put it in the oven. In spite of my mistake, this is a delicious & perfect sour rye. Thanks so much for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-17T04:22:10.29Z",
                "reviewBody": "Really great recipe!  Was looking for a good \"New York Jewish Deli - Rye Bread\" recipe for my brother's father-in-law, and this hit the mark perfectly!  I had a hard time finding sour pickles, but found an old style deli near me that had a pickle bar and they were more than happy to help me by adding a little more sour pickle juice to my pickle order!  I used a hi-gluten flour - great texture.  I also used the bread machine for the first kneed/rise and had no issues.  I prefer not to bake the bread in the in the machine, and it the recipe worked really well to do it 50/50 like I did.  Next time I make it, I'm going to try and cook it a few minutes longer just to get a little more crust on it (not that it was bad by any means this time).  I am also curious to see how it turns out not cooking it in a loaf pan. Try this recipe - it was really wonderful and the bread is delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "katewackerle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13331586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-22T13:18:34.87Z",
                "reviewBody": "Awesome recipe, hubby took one bite and said \"better than anything you can buy!\" That is his highest praise. \n\nI could not find dark rye flour anywhere in this town so I had to use the light colored one, the only pickle juice I had was Kosher Dill and I didn't know if that was going to mess up the flavor of the bread so I used apple cider vinegar. I was a little worried because the vinegar smell was so overpowering as I was mixing and waiting for the rises, but it was perfect in the end product. \n\nI make a lot of bread, this one took 1.5 hours to rise only slightly and I was starting to worry that maybe I had forgotten to add the yeast to the mixture. I let it rise 1.5 hours again on the second rise and still didn't get a really impressive rise out of it. Worried that it hadn't risen enough I took a chance and popped it in the oven - thank goodness for oven spring! I had to cook it about 10 minutes longer than the directions state too. But in the end it was perfection!\n\nThis is definitely a keeper recipe. I can't wait to toast a slice up and have it for breakfast with a fried egg. thanks for an awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "moggy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5323931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-26T03:04:54.723Z",
                "reviewBody": "I used this recipe the first time I made rye bread.  I didn't have demerara sugar so I substituted brown sugar for it. Also I didn't have sour pickle juice, but I had a jar of sweet/spicy pickles in the fridge and used that instead.  Instead of canola oil I used olive oil.\n\nThe loaf came out like a perfect loaf of sandwich bread, complete with the mushrooming over the loaf rim.  The crust was thin between crisp and chewy. The crumb was medium between coarse and close and it was both fluffy and chewy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Antonia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2728491/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-26T20:45:05.613Z",
                "reviewBody": "I used 3 cups of bread flour and 1 1/2 cups of rye flour and added more to keep dough from sticking to bowl of the mixer in a ratio of 2 Tbsp. bread flour to 1 Tbsp. rye flour. Dough came out silky smooth after being in the mixer for the 8 minutes. Let raise in the proofer at 74 degrees for an hour then put in 9 x 5 bread pan and back in proofer for 1 hour and 15 minutes for the final fermentation. Put in 350 degree oven and steamed the oven and the loaf almost doubled in size. I usually bake at 460 for 15 minutes then drop temp to 400 for about 14 minutes and check temp 190. Will do this the next time I make this bread. I make sourdough rye this way and it comes out great. I live in Tennessee where you can't get good rye bread so I decided to make my own and am now making it for others.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "bobk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17509979/"
                }
            }
        ]
    }
]