[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/706/world-cuisine/european/uk-and-ireland/irish/",
                    "name": "Irish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/54990/irish-chicken-and-leek-pie/",
        "name": "Irish Chicken and Leek Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2244836.jpg",
            "width": 2448,
            "height": 2449
        },
        "datePublished": "2019-04-02T06:45:25.000Z",
        "description": "Creamy, flaky and filling all in one! My father brought this recipe from Ireland; it's a family favorite on those cold winter Sundays. This pie forms a delicious soft jelly when cold and can be eaten that way too!",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 pastry for a 9 inch single crust pie",
            "1 (4 pound) whole chicken, deboned and cut into bite size pieces",
            "4 slices cooked ham",
            "4 leeks, chopped",
            "1 onion, chopped",
            "salt and pepper to taste",
            "1 pinch ground mace",
            "1 ¼ cups chicken stock",
            "1 tablespoon milk",
            "½ cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 1 1/2 quart casserole dish, layer the chicken, ham, leeks and onion a couple of times each until the dish is full. Season each layer with a little salt, pepper and mace. Pour the chicken stock over the layers, and dampen the edges of the dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll the pie pastry out large enough to cover the top of the dish, and place over the top. Crimp the sides down with a fork, and trim the excess from the edges. Cut a round hole in the center of the pastry. Roll dough scraps out and cut into strips. Use the strips to form a design, and place lightly over the hole. Brush the entire top with milk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 to 45 minutes in the preheated oven, until chicken is cooked through. If the top crust is getting too brown, cover it with parchment or aluminum foil. While the pie is baking, heat the cream over low heat. When the pie is cooked, remove from the oven, and carefully remove the design from the hole. Pour the cream into the hole, and replace the design. Let stand for a few minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "AMANDA FAIR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8076923076923075,
            "ratingCount": 26,
            "itemReviewed": "Irish Chicken and Leek Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "598.5 calories",
            "carbohydrateContent": "24.8 g",
            "cholesterolContent": "165.7 mg",
            "fatContent": "32.5 g",
            "fiberContent": "2.5 g",
            "proteinContent": "49.6 g",
            "saturatedFatContent": "11.5 g",
            "servingSize": null,
            "sodiumContent": "690.3 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-23T01:18:54.133Z",
                "reviewBody": "I made this for my family and surprisingly they all enjoyed it. I made a few changes though...I sauteed the leeks and onions in 1/2 a stick of butter. In a separate pot I added an egg with the chicken stock and heated until thickened. Then I added the leeks & onions to it. I cut up the ham slices and layered it along with the cubed chicken and the leek mixture. Instead of using pie crust I used puff pastry and just laid it across the top of the casserole. I turned the heat up to 375 degrees F. Next time I think I'll try making this in a 9x13 and covering the entire top with puff pastry so that each serving has its own little piece of puff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah MJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sweetiesmj/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-18T01:59:51.76Z",
                "reviewBody": "I am a food service director at a retirement facility & we made this recipe for our Men's Luncheon today. We did tighten the filling up as some readers suggested. We baked this as individual pies and used puff pastry to top them instead of pie crust. All 26 men loved this dish & have requested that we have it again. Someone suggested using egg in the sauce to tighten it & I would like to try that as I think it would also add some additional richness. Good flavors & an interesting mix w/ the chicken & ham.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ZEBKJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-16T14:59:50.547Z",
                "reviewBody": "I haven't tried this yet but plan to. I will, however, lightly saute the onions and leeks in 2 tbsps of butter or marg and add 2 tbsps of flour. Let the flour cook for a couple minutes and then add the stock. This should help with the soupiness others have mentioned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TTN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/167295/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-17T17:45:44.95Z",
                "reviewBody": "I can't rate this recipe because I haven't made it yet. But I do see why the other reviewers are saying it was runny. This is basically a quiche recipe without the eggs or cheese. There's too much chicken stock so the heavy cream doesn't have a chance to thicken or set. My suggestion would be to cut down on the chicken stock a bit and add an egg to the cream and stock mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COZY CUISINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-17T15:39:55.94Z",
                "reviewBody": "I made this recipe without reading any reviews. The flavor was wonderful but it definately needs thickening I plan to decrease the broth and mix it with a roux next time I make it. Making the recipe the way it is posted you end up wasting all the cream as it just runs off. I expect I will give it 5 stars when after trying again modified.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Martin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2839121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-19T03:56:58.45Z",
                "reviewBody": "Yes three stars sums it up. I think something has been left out of this recipe. When you pour the cream in it just makes the insides float. However the taste is very good. I thought it was very savoury. However I wouldn't make it again unless I figured out how to make it thicker. I guess adding cornstarch at some point would help.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "scokaiser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1764399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-20T03:06:44.263Z",
                "reviewBody": "It was pretty good. My husband went back for seconds which is a good sign. I would however cut back on the number of leeks and lengthen the cooking time by about 5 to 10 minutes. It was rather soupy so I might cut back on the the heavy cream by half as well. The flavor was good but four leeks way over-powered the taste of the dish. I will try it again but with the tweaks I suggested. Erin go bragh.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CELESTE THE BEST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/904361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-30T15:08:17.603Z",
                "reviewBody": "I think this recipe has great potential. Wish I had read the reviews first -- but instead I made it for a company potluck on St. Paddy's Day without reading them. My Mistake. The other reviewers have it right! I made a roux with the liquids I poured off and served it as a sauce over the remainder and it was quite good. I made it in an Oval stoneware dish and there was way way more than 6 servings with the ingredients it called for. I had leftovers that just wouldn't fit. Could easily do two pie pans. I like the whole shredded chicken approach mixing dark and light meat for flavors. I would definitely cut back to 2 leeks medium size and don't cut into the green at all. Sauteing in a little butter before hand with the onion also (cut back on that a bit too...) would render the whole pie a bit easier to fit in the dishes. Adding some other veg - peas/carrots even a pt of potato might work to help thicken the liquids. Someone mentioned flouring the chicken first - Depending on your chicken prep that would be good too. I think a Tbs or two dusted over would be enough to skip a prepared roux. You'll have butter from the sautee-ing but definitely cut back on the liquids. I'd say 1/2c of chicken broth and 1/2 c cream - added up front not after baking might do it - and then prepare a sauce with remaining liquids with a roux... just in case! Also the puff pastry sounds like a nice alternative. But even a pre-made crust will do. I just prefer making my own. Good Luck",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "RReedd20",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4734741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-24T00:47:42.967Z",
                "reviewBody": "Pretty good not great. I used leftover cooked chicken added peas and cooked it up in a 9\" pie dish. I agree with the first reviewer it was very soupy; perhaps more slits in the crust would allow some liquid to evaporate. I'll probably keep trying other chicken pie recipes. Thanks anyway.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amata",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/869245/"
                }
            }
        ]
    }
]