[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1469/main-dish/beef/pot-roast/",
                    "name": "Pot Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232756/pot-roast/",
        "name": "Pot Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2610358.jpg",
            "width": 2600,
            "height": 2600
        },
        "datePublished": "2019-04-04T03:55:20.000Z",
        "description": "This is an easy oven-baked pot roast with vegetables. The aroma will make you hungry while this delicious roast bakes.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H5M",
        "totalTime": "P0DT3H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 pounds beef pot roast, fat trimmed and discarded",
            "3 potatoes, peeled and cut into 6 pieces",
            "1 large onion, cut into 8 pieces",
            "2 carrots, cut into 1-inch pieces",
            "2 stalks celery, cut into 1-inch pieces",
            "3 cups water",
            "salt and ground black pepper to taste",
            "1 pinch garlic salt, or to taste",
            "½ cup water",
            "3 tablespoons cornstarch",
            "½ teaspoon browning sauce (such as Gravy Master®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place roast in a large baking pan; arrange potatoes, onion, carrots, and celery around roast. Pour 3 cups water into baking pan. Season roast with salt, pepper, and garlic salt. Cover pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until roast is browned and cooked through, about 3 hours. An instant-read thermometer inserted in the thickest part of the roast should read 145 degrees F (65 degrees C). Transfer roast to an oven-safe platter. Remove vegetables using a slotted spoon and arrange around roast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce oven temperature to 200 degrees F (95 degrees C). Place platter with roast and vegetables in the oven to keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the remaining juices from the baking pan into a saucepan; bring to a boil. Stir 1/2 cup water and cornstarch together in a bowl until smooth; pour into boiling pan juices. Reduce heat to medium; cook, stirring constantly,  until gravy is thick, about 5 minutes; season with salt and pepper. Stir in browning sauce.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Pot Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Linda C."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.423611111111111,
            "ratingCount": 144,
            "itemReviewed": "Pot Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "507.7 calories",
            "carbohydrateContent": "41 g",
            "cholesterolContent": "98 mg",
            "fatContent": "23.9 g",
            "fiberContent": "5.5 g",
            "proteinContent": "31.3 g",
            "saturatedFatContent": "9.4 g",
            "servingSize": null,
            "sodiumContent": "200.5 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-07-29T02:13:49.2Z",
                "reviewBody": "i have made many roasts over the past few years, and just reading this recipe i can tell you that you should ABSOLUTELY NOT just throw everything into the pot and throw into the oven, YOU MUST PRE BROWN YOUR ROAST TO LOCK IN THE FLAVOR, and a roast must be cooked low and slow and for a long period of time. also after you pre-brown the roast, you need to deglaze the pan with the wine or broth. i never use wine, i always use broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "barbim71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10218618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-04T02:15:31.03Z",
                "reviewBody": "Just tried this tonight! It turned out great! Very tender pot roast and veggies and it made a great gravy. I used my enamel lined dutch oven instead of a roasting pan and foil. I used Kitchen Bouquet for the browning sauce. I did use 1 cup of red wine and 2 cups of water for a deeper flavor and color. I will be using this recipe again- delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele Laughlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3965325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-02T13:58:00.94Z",
                "reviewBody": "This is a very simple, traditional recipe for pot roast, and it yields tasty, tender results. I also like using the cornstarch and browning sauce -- it makes a silky, flavorful gravy. My only suggestion is to add a little more seasoning; it might be a smidgen too bland without it. Also, try making it in your crock pot for 8-9 hours on low or 5 hours on high!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lin-duh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-31T22:37:41.6Z",
                "reviewBody": "I replaced some of the water with red wine.  I also added in some thyme and some bay leaves.  The more important thing was that I browned the meat in a frying pan before ever putting it in the oven.  Then, when the time comes for making the gravy, I just heat the broth and add in some flour mixed with water.  It came out great and the family loved it.  Next time around, I plan to chop up a few cloves of garlic to toss in with the veggies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CliffHay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13178065/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-17T04:13:37.56Z",
                "reviewBody": "So very good! The next night, I used the shredded leftovers rolled into corn tortillas stuck toothpicks to secure, fried in oil for taquitos, served with guacamole.  AWESOME",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PaulaE1206",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20400444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-28T23:32:04.71Z",
                "reviewBody": "Good recipe. I usually make my pot roasts in my slow cooker, but I grew up with it always being made in the oven, and sometimes I miss the crustier roast beef that you get in the oven, so I tried this last night. We are a family of five, two of whom are teenage boys, who very much love their meat and potatoes. So I doubled the weight of the roast beef, as well as doubled the amount of potatoes and carrots used. I kept the onion, celery, and water the same, and eyeballed the seasonings, adding some to the veggies as well as the meat. I also added a bit more of the seasoning to the gravy, as well as added some bouillon. We enjoyed this very much, but there are a few things I will change next time: I will season and braise the meat before adding to the roasting pan. This helps get the flavor into the meat, as well as produce that crust I love. I will triple the amount of carrots (we love carrots!) I will use beef broth instead of water, and reduce the amount to two cups, adding an additional cup when I make the gravy, if needed. The veggies got a bit too mushy for my taste, and I think it was because there was too much liquid. I will make my gravy with flour rather than cornstarch. This is just a personal preference. I was raised on flour gravy, and I just like it better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jayme Cox Bruce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jayme/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-17T01:25:08.38Z",
                "reviewBody": "Very tender and moist pot roast - no knife needed. I added red pepper flakes cabbage and some mushrooms since I did not have celery and used 2 cups of chicken broth and water (along with carrots and red potatoes). House smelled wonderful. Easy prep and clean up too. Thank you for this great recipe. Also just served with juice from roasting pan which was delish. Next time will try to make the gravy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunshinecracker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6160679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-25T18:28:07.26Z",
                "reviewBody": "I used twice as many veggies as listed here skipped the water used a quart of home-canned tomatoes with juice instead and subbed garlic powder for garlic salt using that liberally. I also had a 3 lb roast. For gravy I subbed searing flour for corn starch so needed about twice as much and made a roux with about 1/2 skim milk instead of water after browning the flour. Worked great. Tasted yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VICKEYA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/243346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-08T01:31:16.883Z",
                "reviewBody": "I followed the recipe as written, with the exception of baking the roast an hour before I added the carrots and potatoes, since other reviewers said theirs got too mushy. Next time I will only bake them for a hour, as I thought they were still a little too over done.  Other than that, the chuck roast was very tender and tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16292016/"
                }
            }
        ]
    }
]