[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/56311/sweet-potato-gnocchi/",
        "name": "Sweet Potato Gnocchi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8061343.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:45:29.000Z",
        "description": "A new and yummy twist to Gnocchi. Pair this up with butter or your favorite alfredo sauce. This recipe can be made with butternut squash instead of the sweet potatoes.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 (8 ounce) sweet potatoes",
            "1 clove garlic, pressed",
            "½ teaspoon salt",
            "½ teaspoon ground nutmeg",
            "1 egg",
            "2 cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Bake sweet potatoes for 30 minutes, or until soft to the touch. Remove from the oven, and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the potatoes are cool enough to work with, remove the peels, and mash them, or press them through a ricer into a large bowl. Blend in the garlic, salt, nutmeg, and egg. Mix in the flour a little at a time until you have soft dough. Use more or less flour as needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. While you wait for the water, make the gnocchi. On a floured surface, roll the dough out in several long snakes, and cut into 1-inch sections. Drop the pieces into the boiling water, and allow them to cook until they float to the surface. Remove the floating pieces with a slotted spoon, and keep warm in a serving dish. Serve with butter or cream sauce.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ELA33INE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.077625570776256,
            "ratingCount": 219,
            "itemReviewed": "Sweet Potato Gnocchi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "346.1 calories",
            "carbohydrateContent": "71.1 g",
            "cholesterolContent": "46.5 mg",
            "fatContent": "2.1 g",
            "fiberContent": "5.2 g",
            "proteinContent": "9.9 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "372 mg",
            "sugarContent": "5.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-28T05:33:36.623Z",
                "reviewBody": "A suggestion for those cooks having trouble rolling and cutting the dough:\nTry putting the dough in a floured pastery bag (or a Ziplock with a corner cut out will do) and squeezing it out like toothpaste. Then slice off bits with a sharp knife to make appropriate-sized dumplings. You can squeeze them right into the pot of boiling water!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1839526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-10T00:59:43.89Z",
                "reviewBody": "I gave this recipe 3-stars before, because my attempt came out very soggy and not very appetising.  However, I have since played with the recipe a bit, getting a better idea of \"soft  dough\" (it should stick to your hands, but stick to itself more...if that makes sense) and now I LOVE this recipe.  Worth the effort - filling, tasty, and great with blue cheese or alfredo sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIGHT10",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1270312/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-05T01:07:00.28Z",
                "reviewBody": "IMPORTANT TIP: baking the potatoes took about 50 minutes - not 30. Also it took forever to cut up the pasta (probably because I didn't do big dough balls). I would plan about 2-3 hours for this recipe. PREP TIPS: I added brown sugar and cinnamon to enhance the flavor of the sweet potatoes. Also regarding the flour thing I think the key is to follow the recipe when adding flour to the dough. Then when you are actually rolling out the pasta make sure the surface on which you are working and your hands are well floured. This will keep it from being too sticky and ending up looking like dumplings. Also the person who said the smaller the better was VERY right. If you make the pieces of pasta large you will end up with extremely filling dough balls. If you want it to be like pasta and not dumplings you need to keep it small. I went with flat squares & rectangles about 1\" x 1\" to 1\" x 2\" (still very filling). Also I used the tofu cream sauce recipe on this site using vanilla soy milk instead of plain (to add sweetness and match the pasta) and it was awesome!! Even my husband who is not a vegetarian loved it.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CareerWife Dreamin' of 1950s",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1879573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-04T01:17:41.77Z",
                "reviewBody": "I made a half recipe to use up leftover sweet potatoes and thought they turned out great! I made them quite small (about the size of the end of my thumb). Anyone complaining about the lack of flavour... um... have you ever had potato gnocchi? These are how they're supposed to be. Hint: cook the sweet potato in the microwave. Just wash the outside stab it a few times with a knife and nuke until soft (expect 15-30 min). Then cut in half and scoop out flesh.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna Cole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2192348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-27T00:58:48.543Z",
                "reviewBody": "I never made gnocchi before and I'm not a \"practiced cook\". This came out spectacular. Like someone else said- its got to stick to itself more than your hands. I added flour to this until it was \"rollable\". I tossed it with a little virgin olive oil and salt and it was great. I think next time I'll try adding some additional flavoring to it maybe cinnamon brown sugar etc. I think anything you'd add to a sweet potato recipe would work well with this recipe. Thanks so much for providing it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marieef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/204029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-08T23:49:41.63Z",
                "reviewBody": "These were delicious. I have been making traditional potato gnocchi for years (from an old family recipe) and decided to try sweet potato - WOW! I topped them with a little bit of butter infused with fresh sage. Can't wait to make them again. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "moxymommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/523152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-02T04:13:22.3Z",
                "reviewBody": "I boiled the potatoes instead of baking them (wasn't paying attention) but I don't think it mattered. It was quick though. Also I used a spaetzle maker and made the dough the consistency of spaetzle. I think this worked except that I put too much into the water at a time and possibly overcooked it making the noodles a bit mushy. As far as taste goes I had to add more salt (and I'm not a salt-aholic) and some pepper. We ate the noodles in alfredo sauce with chicken and peas as a mash-up and it was good (and colorful). This recipe has real promise. I'm going to try it again and be more careful with the boiling to see if the texture improves.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2018968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T01:25:47.56Z",
                "reviewBody": "I really liked these but thought it definitely needed a sauce. If anyone makes these and finds a good sauce please post it because I would like to make them again! I used less flour than what the recipe called for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Litster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/577093/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-07T17:01:03.277Z",
                "reviewBody": "This gnocchi is worth the work, but it is REALLY important to use a ricer or SLIGHTLY MASH with two fork very gently and spread it out in a thin layer to cool to room temperature. You have to be super gentle while mixing in the flour as well. The technique (and it really IS a technique) can be seen in videos online and is important to follow so as to get light, soft gnocchi instead of dense little blobs. Another important point - don't add too much flour (again, it will become dense) and let the \"dough\" rest for 5 minutes before rolling/shaping. I strongly urge anyone to check out some videos first to make your gnocchi experience a pleasurable one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "janelly_welly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4911627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-08T02:37:45.03Z",
                "reviewBody": "I failed miserably at this one! Too much flour in recipe?? Resembled little dumplings with the texture of rubber. I think I need practice in the art of gnocchi making!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1734470/"
                }
            }
        ]
    }
]