[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1014/meat-and-poultry/pork/tenderloin/",
                    "name": "Pork Tenderloin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/57002/pork-tenderloin-with-dijon-marsala-sauce/",
        "name": "Pork Tenderloin with Dijon Marsala Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7236576.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:45:31.000Z",
        "description": "Pork tenderloin coated in Dijon mustard, and served with a Marsala mustard sauce.  Absolutely delicious!  Try the sauce over other cuts of meat and vegetables.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 pork tenderloins",
            "4 tablespoons Dijon mustard",
            "1 tablespoon oil",
            "2 tablespoons butter",
            "2 shallots, minced",
            "1 cup Marsala wine",
            "1 tablespoon Dijon mustard",
            "1 cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Coat pork tenderloins generously with mustard. Oil a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium-high heat. Arrange tenderloins in pan, and brown the meat. Turn to brown evenly. Transfer meat to prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 20 minutes. Turn, and continue cooking for 20 minutes, or until desired doneness.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, melt butter over medium heat in the same pan used to cook the pork.  Cook shallots in butter until soft. Stir in Marsala, mustard, and cream, and cook until volume of liquid is reduced by half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice pork, and place on a serving dish. Spoon sauce over meat, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Tenderloin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KOALAGIRL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6541822721598,
            "ratingCount": 801,
            "itemReviewed": "Pork Tenderloin with Dijon Marsala Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "463.2 calories",
            "carbohydrateContent": "12.1 g",
            "cholesterolContent": "162.9 mg",
            "fatContent": "26.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "32.6 g",
            "saturatedFatContent": "13.7 g",
            "servingSize": null,
            "sodiumContent": "439.2 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-19T06:09:43.947Z",
                "reviewBody": "Simply delicious. I browned the tenderloin in olive oil in a cast iron skillet, and didn't bother roasting it in a different pan. While it was in the oven I sauteed some petite button mushrooms, and added them to the finished sauce which I prepared, with a couple of cloves of minced garlic, once the roast was out of the oven and resting.  Koalagirl, you've outdone yourself!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-20T16:56:08.85Z",
                "reviewBody": "This is an excellent, very tasty dish!         Definitely one of the best pork dishes on this website. The Dijon Marsala sauce is simply amazing! However, I would not coat the pork tenderloin with Dijon mustard before browning the pork in a skillet; simply brown the pork tenderloin as is before putting it in the oven. Adding lemon pepper on top of the browned pork before inserting it in the oven might be  an option.  For the Dijon Marsala sauce, I would cut the amount of heavy cream by half since there was lots of sauce left.  As I didn't have Marsala wine, I substituted it with sherry and it turned out absolutely great.  Next time, I will included half a cup of chopped mushrooms to the Dijon Marsala sauce, which incidentally, compliments pork tenderloin very well.  I do not see the Dijon Marsala sauce for chicken or steak; this sauce is made for pork only.  I will definitely make this dish again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Daniel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2576696/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-14T14:42:11.357Z",
                "reviewBody": "Would rate this higher than 5 stars.  Sauce is of restaurant quality.  I cooked a 2 l/2 lb. loin of pork roast - while that was resting after cooking I made the sauce, sauteing mushrooms, scallions and garlic (didn't have shallots).  When the mushrooms, etc. were tender I removed them and continued making the sauce.  When sauce was finished I added the mushrooms back to sauce to heat up.  The amount called for was perfect for this size roast - fed four of us.  Served with mashed potatoes.  This is very rich so I would suggest a light vegetable - like asparagus, peas, green beans.  Thanks so much submitter - this is a keeper!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aspiring Chef Rita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-23T12:42:54.45Z",
                "reviewBody": "Oh my goodness, was this ever good! The sauce was incredible. During the last ten minutes of browning, I too added fresh mushrooms and instead of transfering the meat to a baking dish I just put the skillet right in the oven. Once done, I took the meat out to rest and then made my sauce in the same pan. This really added a lot of flavor to the sauce. I used fat free half and half and some seasonings and it still tasted rich and delicious. If your skillet's handle is not oven proof, just wrap the handle with aluminum foil and it'll be fine. Thanks so much Koalagirl for a lovely dish that's certainly company worthy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-01T02:18:18.107Z",
                "reviewBody": "Fabulous...simply fabulous. I replaced the shallot with onion because that's what I had, and I don't think it made much of a difference. I also sprinkled Kosher salt and black pepper on the tenderloin before schmeering on the dijon. I think the key to this dish is remembering that there are two types of Marsala. Use the Sweet Marsala and you'll end up with creamy Golden Griddle pancake syrup! I only use Dry Marsala and the flavor of each dish really comes through. This dish was no exception. It's been a long time since I considered a sauce good enough to be a beverage! :-}",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jewel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1509803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-14T16:39:27.93Z",
                "reviewBody": "I made this for Easter and I was very pleased with the results. Whenever I see Dijon mustard in a recipe I do tend to get leary that the sauce will taste more like mustard than anything else but this recipe goes far beyond hiding behind a strong condiment! Very well rounded flavors in the sauce truly complement the pork. Like other reviewers I waited for the last 20 minutes of roasting to begin the sauce. I highly recommend using shallots as the recipe specifies - while onions are similar I believe shallots are the best with cream sauces. I served the sauce on the side for the benefit of the younger members of the family for whom the sauce was too rich. All in all this recipe goes in the \"keeper\" pile! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spicy Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1796455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T09:44:16.42Z",
                "reviewBody": "This was a wonderful and delicous recipe! Everyone liked it. I added crimini mushrooms and substituted shallots with onion. The tenderloin cooked in the time suggested but the slight problem that I had was that my sauce thickened very quickly. Next time I'm going to wait till the last 10 mins or so to make the sauce. Thx for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMMY1231",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1440902/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-12T00:09:30.233Z",
                "reviewBody": "Very tasty! My husband and I thought this was fabulous and our 4 year old and 2 year old girls ate every bite too. I added sliced baby bella mushrooms when I sauteed the shallots. They definitely added a lot to the sauce. My only other substitution was to use half and half instead of the heavy cream (all I had). It still made for a very rich sauce. For some reason my pork didn't take quite as long as called for in the recipe but I always use a digital meat thermometer anyway so that I don't have to worry about cooking times. I served this over egg noodles with a side of broccoli and my whole family agreed this was one of our new favorite meals. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CTCOOK1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1224726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-23T21:29:25.25Z",
                "reviewBody": "Another five-star rating! A friend and I made this together and it turned out delicious. Her suggestion to use dry marsala instead of sweet was right on. The sauce turned out amazing with a mellow subtle taste. We added mushrooms which gave it an extra dimension of flavor and a nice texture. Served it on organic whole wheat couscous with a side of fresh steamed asparagus and a bottle of pinot grigio. Superb!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MitchnCT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1741527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-28T17:21:58.890Z",
                "reviewBody": "We made this for Christmas dinner and were a bit disappointed. We had to triple the recipe for a crowd, so the ingredients got a bit pricy for a mediocre result. We added the \"baby bellas\" (which are actually crimino mushrooms) and a bit of garlic, as well as kosher salt and pepper. The sauce took a long time to reduce (partially due to tripling the recipe). The end result was pretty bland and a bit too sweet. All in all, not worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Robbie Rice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/257438/"
                }
            }
        ]
    }
]