[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/928/side-dish/vegetables/tomatoes/",
                    "name": "Tomatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/57300/vera-cruz-tomatoes/",
        "name": "Vera Cruz Tomatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F449396.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2019-04-02T06:45:32.000Z",
        "description": "This is a recipe that can be used as an appetizer or main meal. And you can use any size tomatoes you want. Just make sure they are firm. If you use roma tomatoes you can get more servings with the stuffings.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 firm ripe tomatoes",
            "3 slices bacon",
            "¼ cup chopped onion",
            "8 ounces fresh spinach, stems snipped",
            "½ cup sour cream",
            "¼ teaspoon hot pepper sauce",
            "salt to taste",
            "½ cup shredded Mexican cheese blend"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Grease an 8x8 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut tops from tomatoes; remove seeds and membranes.  Place tomato shells upside down on paper towels to drain until filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, reserve drippings. Crumble bacon and set aside. Return 2 tablespoons of drippings to skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook onion in the bacon drippings until tender, about 5 minutes.  Stir in spinach; cook and stir until wilted, about 2 minutes. Remove from heat. Stir in sour cream, reserved crumbled bacon, and hot pepper sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle tomato shells with salt; fill evenly with bacon and spinach mixture. Place tomatoes in prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until hot, 20 to 25 minutes. Remove, and top evenly with the shredded cheese. Return to the oven; bake until cheese is melted, about 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Tomatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ChefsyndiG"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.475806451612903,
            "ratingCount": 124,
            "itemReviewed": "Vera Cruz Tomatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "261.6 calories",
            "carbohydrateContent": "9.7 g",
            "cholesterolContent": "43.1 mg",
            "fatContent": "21.3 g",
            "fiberContent": "2.9 g",
            "proteinContent": "9.9 g",
            "saturatedFatContent": "10.7 g",
            "servingSize": null,
            "sodiumContent": "378 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-08T20:18:30.377Z",
                "reviewBody": "I'm the lady who stands mesmerized in the produce aisle, smelling the summer tomatoes. If you're at all like me, lucky enough to adore these gems, the health benefit is a bonus. After confessing all of this, I did in fact come home with a basket of the red beauties. Now.. this isn't the first stuffed tomato recipe I've tried, AR and other sites included. Same old, same old; A big fat disappointment. Not to give up though, this recipe had promise. No rice or breadcrumb fillers. Instead, spinach, crumbly bacon, onion cooked in a little bacon fat. (Please, if possible use real bacon so you can stick to the recipe and get the most out of it.) A little sour cream to keep everything together and some Monterey Jack on top. There it is! I did the - take the first bite - pause- OMG?  I can see where the tomatoes could be watery. I used a paper towel to blot out the insides. Because salt will draw out the juice, don't salt the insides of the tomatoes till just before filling. This seemed to help but even the juice was delicious. I was quite happy spooning it off the plate. (Well, I really wanted to lick it off!) The filling was enough for the 4 of them. The author gives a great tip suggesting Romas for more servings. Thanks so much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cynjne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1447121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-11T17:25:43.063Z",
                "reviewBody": "Made this for the Recipe Group this week. We liked this but I d make some changes next time. First I started with 3-3 1/2 diameter tomatoes. I used a melon baller to scoop out the insides of the tomatoes which worked really well. I left probably a little less than a 1/4\" shell. I made the stuffing as directed but added most of the cheese to it and just reserved a little to sprinkle on top. I barely had enough stuffing to fill the tomatoes so I would increase the amount of spinach next time. I also reserved some bacon for garnish. I found the baking time to be too much and one of my tomatoes totally split apart when serving. I would make these again because they did have really nice flavor but I would leave a thicker shell of tomato increase the spinach and reduce the temperature and baking time. This was a fun recipe to try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bellepepper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4452392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-17T16:59:38.34Z",
                "reviewBody": "I made these for recipe group. I made one big change I subbed 1 cup ricotta for the sour cream because of personal taste and I forgot to add the hot sauce due to personal stupidity. However they turned out fabulous we all loved the fact that we could taste all the ingredients. Mine were not watery at all considering I also forgot to drain the tomato shell before filling them. I would make them again in a heartbeat. Thanks for the great recipe. Cheers",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "laughingmagpie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3045250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-10T17:06:57.987Z",
                "reviewBody": "Wow! Made this for Recipe Group. It's like a BLT explosion in your mouth! I know it's not lettuce and there is no bread. I gave up trying to get fresh spinach for it it all looked yucky. So I drained frozen really well and used about 1/2 a normal size box. I cut the recipe in half also. Used two medium size firm tomatoes. I cut the tops off the tomato and salted the insides after gutting and put upside down on a rack to drain while I made the stuffing mix. I didn't add any extra salt. I never had a stuffed tomato so I wasn't sure I would like this but it was fantastic! A little watery but that is from the frozen spinach I'm sure. Next time I'm using fresh. Really good thanks ChefsyndiG! Hey we live in the same town!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-12T17:02:30.897Z",
                "reviewBody": "Made these for Recipe Group this week. We have never had stuffed tomatoes before and we really liked these. Used just picked tomatoes from the garden. Everyone enjoyed the freshness of the tomatoes and commented on being able to taste each ingredient. All of the flavors went together well. I used fresh baby spinach and experienced a little bit of the watery consistancy that \"sassyoldlady\" mentioned when cutting them open. We usually cut back on the amount of hot sauce called for in a recipe but everyone thought that in this one we actually should have added a tad more. Neither of these little complaints will stop me from making these again before the end of tomato season this summer. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-17T00:32:03.207Z",
                "reviewBody": "I made these at my parents' house last night as a side to go with sauteed chicken breast and brown rice. I used Roma tomatoes fresh from my friend's garden cut in half and cleaned out for this recipe. I skipped the salting and draining step because I didn't care if they were juicy. They turned out perfect! I used a 10-ounce package of frozen spinach because it's what I had on hand. I had to add a little extra sour cream because of the extra spinach and I also used 6 slices of bacon instead of 3. I forgot the hot pepper sauce and my parents didn't have any so I added some salt and pepper to the filling so it wouldn't be bland. We gobbled these down so quickly I didn't have time to take a picture! Thanks ChefsyndiG!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3018112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-27T22:15:05.443Z",
                "reviewBody": "What the heck is recipe group and are all 5 of you i it together??? I made these last night just as the recipe called for and the were delish. I used fresh tomatoes from my garden and per one comment did not scrape the tomato too thin. Family loved them we ate them with a side of angel hair pasta and a salad...perfect meal-didnt even miss the meat. Thanks for a delish recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "foxtell8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3785383/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-16T18:43:12.823Z",
                "reviewBody": "I made this for Recipe Group and liked it. I used FF Sour Cream and Weight Watchers Mexican Cheese Blend. I added the cheese to the spinach mixture and then stuffed the tomato shells. I also topped the tomatoes with a bit of cheese after baking for 25 minutes. I forgot to salt the spinach to taste but will definitely do that next time. Like others I also experienced the watery issue but I think if I had let the tomatoes sit for maybe 10 minutes that would not have been noticeable. This came in at 2 Weight Watchers points with my changes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/paula1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-16T21:43:55.06Z",
                "reviewBody": "Ok...I am giving this a 5 for me...a 4 for the hubby and daughter...so my 5 rules!! LOL...I used 5 gorgeous farmer's market NJ tomatoes and fresh spinach...I also used turkey turkey bacon low fat cheese and low fat sour cream....I loved these....so very tasty....pretty simple and yummy. My daughter did not like the \"mushy tomato\"....I loved it....a nice blend of flavors....I also added garlic to the spinach and onion mixture. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLJ6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-27T23:44:02.41Z",
                "reviewBody": "I made some changes to the recipe to reduce heavy fat content and provide more of a Tuscany creation. I blanched Basil leaves and used them to linr the tomato cavity. I also blanched red onions rather than saute then I used a Parma ham and a mascarponi to bind oregano leaves and finished with a Grana Padano cheese. Yummy as a starter with Veal second and wined with a full bodied Valpolicello.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Harriet Green",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4063695/"
                }
            }
        ]
    }
]