[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/57532/abbys-chicken-rollatini/",
        "name": "Abby's Chicken Rollatini",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F153701.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:45:33.000Z",
        "description": "Much like Chicken Saltimbocca, this is chicken smothered in parmesan cheese and rolled with mozzarella and prosciutto and baked in white wine.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves",
            "½ cup shredded Parmesan cheese",
            "1 clove garlic, finely chopped",
            "4 teaspoons butter",
            "4 ounces thinly sliced prosciutto",
            "10 ounces sliced whole milk mozzarella cheese",
            "⅓ cup white wine",
            "¼ cup olive oil",
            "1 pinch black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pound chicken breasts flat, and lay them on work surface. Sprinkle liberally with Parmesan cheese on both sides. Place a pinch of minced garlic and 1 teaspoon butter in the center of each breast. Cover each breast with a layer of prosciutto and mozzarella cheese. Reserve some of the prosciutto to place on top of the chicken. Roll up each chicken breast, and secure with toothpicks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 9x13 inch baking dish, combine white wine and olive oil. Arrange chicken rolls in dish. Place a small piece of prosciutto on top of each roll, and sprinkle with pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 minutes, or until chicken is no longer pink, an juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kris McFadden"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.461783439490445,
            "ratingCount": 314,
            "itemReviewed": "Abby's Chicken Rollatini",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "486.7 calories",
            "carbohydrateContent": "1.9 g",
            "cholesterolContent": "134.1 mg",
            "fatContent": "33 g",
            "fiberContent": "0.1 g",
            "proteinContent": "41.3 g",
            "saturatedFatContent": "13.5 g",
            "servingSize": null,
            "sodiumContent": "842.7 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-03T05:17:25.14Z",
                "reviewBody": "Abby s dish is just outstanding. We cooked it up because it made sense to use a cheese coating instead of breading to keep the dish moist. And in fact it worked beautifully. Do use fresh grated cheese though. If you use a Kraft type product this dish will disappoint. We were concerned about the low temp of 325 but it keeps the dish moist and genuinely tender. You need to use a baking dish that s big enough to put the rather bulky rolled portions in though. You have to leave good room between them so the heat circulates properly. Otherwise the touching sides don t leave the pink state. And you know those small portions of chicken that are found on the inside of the breast sometimes called chicken fillet? They cook up just as well using the cheese as your breading at this low temp at the same time you cook the real dish they are a delightful snack too. A final touch you might consider is a few minutes of high heat broiling. It s nice to get the top layer of prosciutto all the way to crisp. It ll probably crisp up before you can really brown this dish though so watch for that. Otherwise we highly recommend this dish it s terrific.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MikePhx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2075474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-24T13:24:47.987Z",
                "reviewBody": "Love this! I've made it twice and the second time perfected it I think. After pounding the breasts I cut them in half to make eight smaller rollatinis. Like another poster recommended I covered them with foil for the first 30 min then removed foil and baked another 8-10. The Penne Russo a la Vodka recipe on allrecipes is excellent with this. I served the vodka sauce over the chicken and over a side of pasta. It's a fantastic pairing! Definitely estaurant quality.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steph",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1540228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-07T19:36:30.163Z",
                "reviewBody": "This recipe was fantastic!!! If you rate this anything but 5 stars then you've done something wrong and try it again! If you used Parmesan cheese other than fresh dont bother to rate this recipe as I'm sure it would be bland dull and tasteless. Kraft makes a \"grate-it-fresh\" Parmesan that comes with a container and can be found next to the shredded and blocks of chesses in most markets. Its easy less expensive and VERY good cheese. I did alter it slightly for ease of cooking though did nothing to change the flavor.I use the garlic that is preminced in a jar (I always keep it on hand in the fidge) it's not as strong of a garlic taste (though I love garlic) so I sprinkled it with garlic powder before adding the cheese and procuitto. I also used a little less cheese because I bought the slices. I had the procuitto sliced VERY thin so I was able to roll 2 slices inside and then wrap 2 around the outside so I didnt need to use a tooth pick. The effect was delish the procuitto browned and was somewhat crunchy like bacon would be! YUM The wine and oil gave it a nice subtle flavor. But remove the chicken to a serving plate as the pan is only meant for it to be COOKED in!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T23:09:06.187Z",
                "reviewBody": "I am NOT a chicken fan. It's usually too bland no matter what recipe or variation I use. HOWEVER this recipe is absolutely delicious!!! Just the smell of it in the oven clued me in that this dish was a keeper!!! I followed the recipe EXACTLY rolled up the chicken and was done preparing it in about 10 minutes flat. My husband is picky and doesn't really like chicken either but he ate every last piece and asked when we could have it again. I will make this a staple. The flavors blended perfectly and tasted like a dish I might order out to dinner. THANKS FOR THE AWESOME RECIPE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Savannahbride",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/824966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-20T19:13:14.21Z",
                "reviewBody": "This is a great and east recipe. I added some fresh basil leaves to the roll on top of the cheese. I also browned the rolls in a skillet with a little olive oil before putting them in the oven. I did not use the prosciutto on the outside. I did not want to overpower the flavor of the chicken. After baking I took the wine mixture which I added a little chicken stock and fresh minced garlic and shallot to and reduced it on the stove top by half. I added some heavy cream and reduced to a consistency able to coat the back of a spoon. I removed from the heat and added a T of butter to finish. It was a great sauce to compliment the flavors in the chicken. I served it with some traditional risotto. My boyfriend loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef_Girl79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2051717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:57:32.96Z",
                "reviewBody": "Out of all of the chicken recipes on AllRecipes.com, this is our favorite!  My husband raved about how good this was.  Usually, when I ask how a recipe is, he will say it is \"alright.\"  But he said this one was great !  I substitued ham for the proscuitto, and used a little less than was called for, and I had some provolone to use up, so I used half provolone and half mozzarella.  I made this dish when company was over and served it with a chicken flavored rice mix and broccoli with hollandaise sauce.  I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SNOCITO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/688874/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:57:33.663Z",
                "reviewBody": "I think this recipe has potential. I didn't like the raw garlic in the middle of the breast I think it needed to be cooked first or maybe add a little garlic salt to the parmesan before you roll. Another thing I didn't like was when I removed the chicken from the oven the oil and wine separated and it wasn't appealing to see your dinner sitting in a puddle of oil. Oh yeah I think the chicken definitely needs to be browned before you put in the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MOMMY DEAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/788534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T15:35:16.497Z",
                "reviewBody": "Excellent recipe. The only thing i did differently was pepper each side of the chicken with coarse black pepper and add mushrooms to the pan when baking. Absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIMAZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/806031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-25T22:25:16.043Z",
                "reviewBody": "I just served this to my family tonight and have to tell you, it is one of the most fantastic, tasty, and easiest chicken dishes I have ever made! I used the thin sliced boneless chicken breasts instead of pounding out regular boneless chicken breasts and think this helped also with rolling because the chicken was so nice and thin. Thank's Kris for such a wonderful dish! My entire family raved about it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1286819/"
                }
            }
        ]
    }
]