[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/58854/slow-cooker-tomato-sauce/",
        "name": "Slow Cooker Tomato Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F656339.jpg",
            "width": 2244,
            "height": 1785
        },
        "datePublished": "2019-04-02T06:45:39.000Z",
        "description": "This tangy, zesty sauce instantly became a family favorite. I created it when my family came in from out of town; everyone raved about it and my husband begs me to make it all the time.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT10H0M",
        "totalTime": "P0DT10H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "10 roma (plum) tomatoes - peeled, seeded and crushed",
            "½ small onion, chopped",
            "1 teaspoon minced garlic",
            "¼ cup olive oil",
            "1 teaspoon dried oregano",
            "1 teaspoon dried basil",
            "1 teaspoon ground cayenne pepper",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "1 pinch cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place tomatoes, onion, garlic, and olive oil in a slow cooker. Season with oregano, basil, cayenne pepper, salt, black pepper, and cinnamon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook 10 to 15 hours on Low. The longer you simmer it the more flavorful it becomes. At 10 hours it's really good, but at 15 its even better.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Michele "
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.035714285714286,
            "ratingCount": 84,
            "itemReviewed": "Slow Cooker Tomato Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "104.7 calories",
            "carbohydrateContent": "5.5 g",
            "cholesterolContent": null,
            "fatContent": "9.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "1.3 g",
            "servingSize": null,
            "sodiumContent": "393.6 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-08T16:55:57.85Z",
                "reviewBody": "In reading the reviews for this sauce I wanted to tell the reviewer who said that this was a base sauce and to other reviewers who were modifying the sauce.  This is not a Italian base sauce, each time you correct the sauce by adding other ingredients you further complicate the taste of the sauce.  In otherwords, your breaking down the original sauce.  This sauce as in the original recipe is a good tangy sauce that has muliple uses.\nThe Italian base tomato sauce is plum tomatoes, with 4 cloves garlic, blend and simmer for 30 minutes.  The last 10 minutes add a whole stem of fresh basil and simmer the remaining 10 minutes.  Then pull the basil out of the sauce, remove from heat and let it cool.  Store for furture use.  Then when you need a sauce for spaghetti, or as a sauce for meat like Chicken Parmesan or stuffed shell, you seasn the sauce to the dish.\nGood taste sauce, I'll use it for shell and chicken parmesan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brian Carter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4892622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-23T14:45:04.483Z",
                "reviewBody": "This was so easy & tasty. My whole family loved it. I made the recipe with 40 roma tomatoes fresh from the garden, & used a banana pepper and 1 tsp. cayenne & it was still like an arabiatta sauce. (Added a bit of sugar too!)Everything else, as is! Excellent! We used it for pasta, then the next night for a spicy Chicken Parm. (I didn't seed the tomatoes & the sauce was great...like a fresh tomato sauce from Italy...not the thick Americanized ones.) I'll use up my tons of tomatoes on this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AEMAZA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/634564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-07T19:48:18.95Z",
                "reviewBody": "Excellent. The flavor of this sauce is very good.  The only thing I will do the next time, though, is to reduce the pepper. I like spicy recipes, but my husband does not. So I need to make it a little less spicy.  I made ravioli and used this for the sauce. Very tasty and fairly easy to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danette Brown Stankovich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1536658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-16T05:21:09.803Z",
                "reviewBody": "I am lucky, been cooking a long time and know intuitively how to make things yummy, so I usually am able to take any recipe and make it my own AND make it 5 star! I also am lucky because in Tucson, AZ, spring is Heirloom Tomato season, so I used my own fresh 12 tomatoes from the garden. For this recipe, I used a Vidalia Sweet onion and 10 fresh garlic cloves (see photo!), all minced very fine and sauteed in 1 Tof EVOO; when they were translucent after 5-7 minutes, added diced zucchini and sauteed all another 5 minutes with lid on low. Added all to the peeled, seeded and crushed tomatoes in the slow cooker on low...and went to bed! In the A.M., the juices had cooked off; it was a very rich, thick and chunky sauce. THEN I added spices but absolutely no cayenne. Wanted to keep it strictly tomato sauce for pasta; cayenne is too weird for us, but to each their own! What I DID add was garlic powder, fresh crushed oregano and fresh basil, 1 tsp. garlic salt and 1 tsp. pepper and let it sit on low for another hour. THEN...I tasted it. NOW is the time to really hone down the flavors to make this your very own concoction, with dried herbs, spices and especially if it needs salt. Ended up adding more salt (about two teaspoons total for the recipe), granulated garlic (this is normal for me, can't have too much garlic), onion powder, dried oregano, thyme, basil and ahem, some cumin. \nI love how this basic recipe lets me experiment!\nEvery time different AND zesty! Thanks, Michele!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ellie may",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3578288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-28T02:09:29.39Z",
                "reviewBody": "I've tried this method twice now, each time tweaking some of the ingredients to try for a better result.  It just wasn't very good either time.  I've had a much better result using canned tomato sauce.  The flavor and consistency is just off but I can't really determine exactly what needs to be done to fix it.  I used about 18 roma type tomatoes from my garden, used dry oregano and 1/2 cup of fresh chopped basil.  We don't like a hot pasta sauce so I omitted the cayenne altogether and used fresh ground pepper for the flavor. In addition I added about 1/4 cup dry sherry, 2 cans of chopped portobello mushrooms, extra garlic, and 2 bay leaves.  I pureed the sauce in my blender because my kids prefer a smooth sauce.  The 2nd time I made it I even added in a can of tomato paste and a can of tomato sauce, hoping to richen and improve the flavor but it didn't help much.  Just as a footnote this this, a trick I learned a while ago is that if the sauce tastes too acidic add 1 or 2 Tbsp. butter, mix it in and taste.  Add more if needed.  It should balance out the acidity.   Sugar also helps reduce acidity.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-04T16:40:38.287Z",
                "reviewBody": "Great way to use bulk tomatoes - thanks!I doubled recipe used 1t. red pepper flakes instead of cayenne diced the tomatoes (didn't peel or remove seeds) added 1 T sugar cooked for 15 hrs over night and enjoyed a rich mild sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angie McIntyre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/948811/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-19T13:25:02.217Z",
                "reviewBody": "This sauce would be much better without an entire teaspoon of cayenne pepper. Oh my gosh it was SO spicy! My family could barely eat it. I'm giving it four stars but I'm sure the next time I make it with MUCH less ground cayenne pepper it'll be a five-star recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Geena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1005362/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-14T22:18:41.543Z",
                "reviewBody": "I let this cook overnight about 12 hours in total and boy does this have a kick. I've frozen the rest so we can enjoy the rest later. Will make again without doubt. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-06T02:22:42.39Z",
                "reviewBody": "I used this as starter to make tomato based pasta sauce & I was intrigued. I had to modify it quite though. There was far too much cayenne pepper and I will reduce it drastically for next time. While I will rate the basic recipie as a 3 star here is what I added for my personal tase: Zucchini extra garlic and some tyme. I also added mushrooms red & yellow peppers and I used fresh herbs for the seasonings. 3 hours prior to serving I added some browned & seasoned ground meat (this time I used buffalo but I typically go with lean beef).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Leanne Gledhill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1727955/"
                }
            }
        ]
    }
]