[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236974/lasagna-pepper-boats/",
        "name": "Lasagna Pepper Boats",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2380692.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2019-04-04T03:57:23.000Z",
        "description": "Always looking for low-carb recipes, I was making my family lasagna and got the idea to make my lasagna in a 'green pepper boat' instead of using noodles. This tastes great even to people who love carbs! Freezes well too.  If I make a smaller batch, I will freeze the leftover sauce for the next time.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "6 green bell peppers, halved and seeded",
            "salt to taste",
            "water as needed",
            "1 pound ground beef",
            "3 (8 ounce) cans tomato sauce",
            "1 (6 ounce) can tomato paste",
            "1 teaspoon salt",
            "½ teaspoon dried oregano",
            "ground black pepper to taste",
            "1 (12 ounce) container cottage cheese",
            "2 cups shredded mozzarella cheese",
            "1 cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange bell peppers, cut-side up, in a 10x15-inch baking dish; season with salt. Pour enough water into dish to make 1/4-inch depth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add tomato sauce, tomato paste, 1 teaspoon salt, oregano, and black pepper to ground beef; bring to a boil. Reduce heat and simmer until flavors blend, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill each bell pepper with a heaping tablespoon cottage cheese; top with a layer of mozzarella cheese, a layer of Cheddar cheese, and meat sauce. Sprinkle each 'boat' with more mozzarella cheese and Cheddar cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until peppers are tender and cheeses are melted, 50 to 65 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Joan Gerland Crabtree"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.578125,
            "ratingCount": 64,
            "itemReviewed": "Lasagna Pepper Boats",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "232.2 calories",
            "carbohydrateContent": "10 g",
            "cholesterolContent": "49.4 mg",
            "fatContent": "13.6 g",
            "fiberContent": "2.4 g",
            "proteinContent": "18.6 g",
            "saturatedFatContent": "7.1 g",
            "servingSize": null,
            "sodiumContent": "815.3 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-07-08T01:52:30.863Z",
                "reviewBody": "Once again, a great dinner resulted from a deliberate attempt to use stuff up that needed to be used up.  It’s sort of like lasagna, but not lasagna, gooey, cheesy, and just plain delicious. But I followed the recipe loosely. First, why sink the peppers into a quarter inch of water?  As I always do when I make stuffed peppers, I used my own tomato sauce instead, tho’ commercial tomato sauce is a fine substitute, and much better than water!  You’ll want that extra sauce to spoon over your peppers!  Also, I used a medley of colored peppers, as I find store-bought green peppers a little on the strong and somewhat bitter side.  I added chopped onion, minced garlic, and fresh parsley and oregano to the meat and simply used tomato sauce, no tomato paste.  (I am not a huge fan of tomato paste, which seems to contribute a sweetness I don’t care for)  I just cooked it down to the consistency that seemed right.  I used no cheddar.  Even had it on hand, but thought all mozzarella was more fitting.  I ate mine as is, but served Hubs’ with rice, knowing it would be his preference.  (Well, um, mine too, but I’ve got to watch the carbs more and more as I get older.  Hrumph.)  These were done in 50 minutes, and I added the second sprinkling of mozzarella during the last five minutes.  At 50 minutes the peppers were fork tender but still had enough firmness to maintain their shape and not be limp and mushy.  (Note:  I used a pound of meat for just 2-1/2 peppers, and it was just right)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-20T00:25:11.303Z",
                "reviewBody": "This is one heck of a good stuffed pepper recipe. I followed the recipe as directed, except used colored bells instead of green, since that is what I had on hand. I did substitute ricotta for the cottage cheese as suggested by the cook, a 15oz. container was perfect. I didn't need all the sauce for the filling, so put some of the reserved sauce on our rice and then topped with the peppers. I waited to top with the last sprinkle of cheese the last five minutes of baking. My peppers were done to perfection in 50 minutes. I did add in a chopped onion to my hamburger mixture and a bit more Italian herbs, basil and parsley to the sauce, since I have some fresh in my garden. My husband could not stop raving about this meal. This one is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-01T14:46:27.617Z",
                "reviewBody": "We loved these. Only thing we changed was that we added some fresh basil garlic powder and onion powder. Next time I will make deeper boats by cutting slice from the side of a pepper and scooping out seeds using 1 pepper per serving. That way you can get more filling per serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "spice of life",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2016123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-16T13:09:20.73Z",
                "reviewBody": "Alright but lacked pizzazz.  Could be really good with a few mods i think. Next batch I'll drop the cottage cheese and add more SHARP cheddar vs less mozz. Also will poke some holes in the peppers with a fork(peppers were a bit watery inside) and use a spaghetti sauce i like(or add a lot more seasonings at least) instead of the tomato paste/sauce mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Drkstorm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17971369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-26T13:58:43.783Z",
                "reviewBody": "These were delicious especially the sauce. The only issue I had was the cheese melted out of the peppers. I will use a larger pepper next time and there will be a next time. For low carb these are a winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NainInCandia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1312498/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-30T04:08:36.84Z",
                "reviewBody": "Delicious!! Was so light and refreshing. A great change from traditional noodles. My husband likes low carb meals so this was just right. I added some garlic mushrooms onions and white wine to the sauce to make it more my style. Acooked some noodles as a side dish. Yummy!! I'm sure it will be a monthly dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shellyfoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11865421/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-27T19:00:28.54Z",
                "reviewBody": "We were surprised at how good these were. We simmered halved colored bells (grown in our ten gallon buckets) until slightly tender. Mixed parm cheese with cottage cheese and layered it with ground beef/tomato paste mixture (heavy on oregano and fresh pressed garlic) into pepper halves. Sprinkled with fresh pizza cheese topped each with a pepperoni slice and baked at 350 for 15 min. Used scrunched tin foil to fill in empty space in baking dish and to keep peppers up. Oiled glass baking dish - no water.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4900077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-11T01:39:42.527Z",
                "reviewBody": "Really good! I would use less water in the pan and I added fresh Parmesan cheese on top. Everyone loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Rankin Ray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15272820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-08-29T06:32:33.873Z",
                "reviewBody": "This was a good recipe but I will make some changes the next time I make it. I followed the recipe except for two things. I made my own meat sauce rather than follow the sauce recipe here just because I like my own sauce better than any other I have tried. I also used parmesan cheese as is mentioned in the cook's notes and I didn't put in the cheddar. I just can't think of cheddar cheese as belonging in any type of lasagna dish. I followed the suggestion of putting some of the tomato sauce in the bottom of the baking dish instead of water and that worked fine. I will try these again but will substitute the cheese filling from the recipe on this site for Ricotta Stuffed Zucchini for the plain cottage or ricotta cheese. I think the dish will have a little more taste and body to it. The recipe as written is good and it is a low carb way to get a lasagna taste. With a little tweaking I think it will be a great dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6111011/"
                }
            }
        ]
    }
]