[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/58871/authentic-french-meringues/",
        "name": "Authentic French Meringues",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1125146.jpg",
            "width": 3318,
            "height": 2212
        },
        "datePublished": "2019-04-02T06:45:39.000Z",
        "description": "Authentic French Meringues from a patisserie in France.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "4 egg whites",
            "2 ¼ cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 200 degrees F (95 degrees C). Butter and flour a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a glass or metal bowl, whip egg whites until foamy using an electric mixer. Sprinkle in sugar a little at a time, while continuing to whip at medium speed. When the mixture becomes stiff and shiny like satin, stop mixing, and transfer the mixture to a large pastry bag. Pipe the meringue out onto the prepared baking sheet using a large round tip or star tip.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the meringues in the oven and place a wooden spoon handle in the door to keep it from closing all the way. Bake for 3 hours, or until the meringues are dry, and can easily be removed from the pan. Allow cookies to cool completely before storing in an airtight container at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "RANDYVH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2775,
            "ratingCount": 400,
            "itemReviewed": "Authentic French Meringues",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "31 calories",
            "carbohydrateContent": "7.5 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": null,
            "proteinContent": "0.4 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "6.2 mg",
            "sugarContent": "7.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-07T17:41:30.61Z",
                "reviewBody": "There are two types of meringue; soft and hard.  The difference between the two is the amount of sugar added to the egg whites.  Soft meringue is made with only a small amount of sugar and is used as a topping for pies and cakes. The more sugar in the recipe the crisper the cookie will be.  If you cut too far back on the sugar the cookies will be more like marshmallows.  Hope this helps clear up the sugar debate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Moe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1548163/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-06T17:59:28.327Z",
                "reviewBody": "I am in school for baking and pastry and this is the closest thing I have seen yet to how I have learned to make meringues properly.  My suggestion for those of you having problems with it taking so long to make would be to let the eggs reach room temp before you try to whip them.  It makes the whipping process go much faster.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef in Training",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1847564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-06T16:56:50.36Z",
                "reviewBody": "These are just like the gourmet meringues you buy at the specialty grocery stores.  They are soo yummy! I used 1 tsp vanilla extract and increased sugar by 1/4 cup to make up for the added liquid.  I also set my oven to 185, instead of putting a spoon in the door.  It worked great.  Next time I will definitely add a different flavor or chocolate chips! Also,  I used parchment paper on the pan instead of butter and flour. This is a much better way to go because they fall right off the paper and you have no residue on the bottom of the cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JKERNS81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1330407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-05T02:47:59.093Z",
                "reviewBody": "Foolproof and delicious.  DO NOT REDUCE THE AMOUNT OF SUGAR.  The only thing that I did differently was that I scraped half of a vanilla bean into the egg whites when they reached the stiff peak stage.  (If you add liquid vanilla extract, you will have to up the sugar content, as the extra liquid WILL affect the outcome of the cookies.)  As many former reviewers have noted, the egg whites take a good 15-20 minutes to reach the stiff peak stage with an electric mixer.  (My KitchenAid Pro 600 took about 16-17 minutes.)  Next time, I'm going to try folding some toasted coconut into the finished mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "allison125",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/351270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-12T12:47:39.56Z",
                "reviewBody": "I have made this recipe several times.  I add 1/2 t. flavored extract to the mixture.  I make the cookie larger with an indention in the middle.  After they have cooled I use a coordinated flavor of chilled pie filling (spooned into the indention) and serve as a dessert.  In other words if I use lemon extract in the cookie I use lemon pie filling for the dessert.  I also add a dollop of whip cream on the top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LowFatLady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1035961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-25T00:13:23.02Z",
                "reviewBody": "This is a no fail recipe.  As a chef, I'll give some tips for any beginners out there.  Take a papertowel and about 1 tsp of white distilled vinegar and wipe your stainless bowl with it.  This makes sure there are no oils that will interfere with your egg whites.  Further, I always add about 1/2 tsp of baking powder.  It doesn't change the taste and it makes the whites stiffen up quickly, especially if you don't have time to let the egg whites come completely to room temp.  After the egg whites were completely stiff, I added a dash of cinnamon and butter extract.  I topped them with mini-morsels and made them smaller so that they cook faster.  Hope this helps!  Great recipe and super tasty meringues!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheKook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6190984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-28T03:27:22.173Z",
                "reviewBody": "I don't have an extremely sweet tooth, and thought this original recipe is way too sweet.  So I cut the sugar to half and then I added 1/2 tsp of cream of tartar to compensate. My husband's grandmother use to make meringues for him, and he said it is exactly like he remembered it.  So obviously the lack of sugar did not affect the sweetness so much as the rigidity of the meringues. But the technique of this recipe is perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CHECKERB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/474003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-29T19:52:02.47Z",
                "reviewBody": "I really don't like giving poor ratings and reviews, but I felt like I needed to give a heads-up to people who might be considering using this recipe.  I don't understand all the great reviews and wonderful results people supposedly got with this recipe.  My meringue NEVER got past the stage where it looked like melted marshmallow creme.  I let it whip in my Kitchenaid for about 15 minutes and watched it the entire time, so I know I didn't \"over-beat\" it.  I added the sugar about 2 Tbs at a time, letting each addition fully blend in before adding more.  There was no way I could pipe this into anything but a puddle on the baking sheet, so I ended up using the \"Peppermint Meringues\" recipe instead, omitting the crushed candy canes.  That recipe has cream of tartar in it, which I think really is necessary for getting the meringue nice and stiff (every lemon meringue pie recipe I've ever made called for cream of tartar in the meringue).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Keri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3018112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-08T00:05:48.817Z",
                "reviewBody": "Tips for those who are having problems with these falling flat: meringues are very delicate and almost anything can go wrong with them. It is possible that you are either under-whipping them, or whipping them too much. If you over-whip something, you can make it fall flat by whipping the air back out of it. Conversely, if you don't have enough air it won't stay tall.  A few tips on meringues: *If you have ANY egg yolk, throw it out and start over. It will ruin the structure of the meringue. *Before you add the sugar it's better to be safe than sorry; make sure that your meringue is stiff at the very least, and I prefer to whip mine just before there are stiff peaks forming. (To test this, take a utensil and stick it in the mixture, then draw it out forming a little peak or tail; if it sticks up, it is a stiff peak, if it droops over you may want to consider whipping it more.) *You can also tell how stiff the mixture is by whether the mixture fills itself back out if you part it in the middle. Your mixture should separate and stay separate. *You do not want to have glossy peaks before you add the sugar. You have a greater potential to ruin it if you get to the shiny/satin stage before you add anything. *Oils will ruin the mixture, so be careful if adding flavorants or colors. *Add the sugar VERY slowly. So slowly it hurts. Never dump anything you add, including flavors. *Lift the tip of the pastry bag up and away when piping, don't smash it down in!  Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "falling_empress",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5523150/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Authentic French Meringues",
            "description": "Discover the techniques for making beautiful meringues.",
            "uploadDate": "2012-10-17T03:26:51.434Z",
            "duration": "PT2M57.469S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb0bba2a5-ee33-443e-917f-ccb2392afea1%2F4ea29336-ddd2-4eda-bcfb-46b509691dfb%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1905184001001"
        }
    }
]