[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/238235/easy-cheesy-chicken-and-rice/",
        "name": "Easy Cheesy Chicken and Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9225922.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-04T03:58:02.000Z",
        "description": "Delicious for the whole family!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "1 9x13-inch dish",
        "recipeIngredient": [
            "cooking spray",
            "2 cups rice",
            "1 ½ cups shredded Cheddar cheese, divided",
            "1 teaspoon ground black pepper",
            "½ teaspoon salt",
            "4 skinless, boneless chicken breast halves, or more to taste",
            "2 (10.5 ounce) cans cream of chicken soup",
            "3 cups water, or more as needed",
            "1 (1 ounce) package dry onion soup mix (such as Lipton®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 13x9-inch baking dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread rice into the bottom of  the prepared baking dish. Sprinkle 1 cup Cheddar cheese over the rice; season with black pepper and salt. Arrange chicken breast halves evenly atop the rice and cheese layers. Dot chicken breasts evenly with rounded teaspoons of cream of chicken soup. Pour 3 cups water over the chicken and finish by sprinkling onion soup mix evenly over everything.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 hour. Check rice for doneness; if water is already completely absorbed, add 1/2 cup more water to keep mixture moist. Continue baking until the chicken breasts are no longer pink in the center and the juices run clear, about 30 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Sprinkle remaining 1/2 cup Cheddar cheese over the dish.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KVines3"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.483870967741935,
            "ratingCount": 31,
            "itemReviewed": "Easy Cheesy Chicken and Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "793.5 calories",
            "carbohydrateContent": "89.9 g",
            "cholesterolContent": "123.6 mg",
            "fatContent": "26.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "45.7 g",
            "saturatedFatContent": "12.3 g",
            "servingSize": null,
            "sodiumContent": "2217.6 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-07-14T20:38:30.783Z",
                "reviewBody": "I did change a few things but not much at all. i had to use dark skinless, boneless chicken...sent the husband to the store and that is what he brought me :/. i placed foil over the dish for the first hour and when i removed it i stirred it a little but not much, just enough to stir in the onion packet and move things around. i used cream of chicken with mushrooms because i like mushrooms. i would have put fresh mushrooms in it if they had been on sale and plan to next time i make it. i added my own seasonings besides pepper but i didnt add salt since canned soups are typically salty enough for my taste. the chicken was very tender. i put more than 3 cups of water in the dish i am sure, just rinsed the two soup cans out and i didnt have to add more at any point. \n\ni think this would be a great recipe for someone just learning to cook for their family because it is easy and you can add things to it and experiment with flavors. \n\ni do not know the need of giving an opinion and messing with the rating when you have not made the dish. i look to the reviews for great tips and tricks to make things better or even for things to avoid. I hate olives but i dont go to recipe to recipe rating recipes with olives as 1 star because i think they are horrible and deserve a low rating...i just dont try the recipe and move on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chance",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-14T00:40:37.823Z",
                "reviewBody": "This was very tasty and easy!  The chicken was moist and the rice was cooked through.  The only change I would make would be to mix the soup, onion soup mix, and water together first, then pour over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Larson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3421799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-06-30T06:06:45.573Z",
                "reviewBody": "I used 3 cups of water with chicken bouillon.  I also cut the chicken breast in half.  When I make this again, I will cut the rice amount probably in half ... there was a lot rice with this dish when I used 2 cups.  All in all, it was good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jr.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16450122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-29T02:14:20.29Z",
                "reviewBody": "Don't add the extra salt it isn't needed. The rice turns into more of a risotto which isn't a bad thing. My rice hating husband HATED this. Super props to having everything raw and 'dumping' into a casserole dish instead of having to precook and THEN bake which is why we hate casseroles. Used extra sharp cheddar and ommited salt otherwise didn't change anything. This is extremely heavy so don't be surprised if your family doesn't eat as much as they normally do.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Arizona Desert Flower",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/arizonadesertflower/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-22T18:17:29.883Z",
                "reviewBody": "The layer of cheese and chicken over the uncooked rice prevented the rice from cooking evenly. I had to remove the chicken after an hour and pour boiling water over the rice stir and bake another 1/2 hour without the chicken on top. The chicken did not need that long to bake. I would also recommend using salt and pepper on the chicken instead over the rice and cheese. Next time I would pour the water over the rice before adding the chicken season the chicken and use a well seasoned homemade \"cream of\" without the onion soup mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6180041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-15T07:56:22.057Z",
                "reviewBody": "loved this recipe.  Made recommended changes and added lots of stuff since I was trapped inside due to snow storm.  I used chicken broth (3 cups) in place of water, I mixed the dry soup with the broth, rice (jasmine) and water also added shredded carrots, chopped celery tops and fresh mushrooms to the rice.  put the cheese next than chicken which I sliced each half breast in half the long way.  topped the chicken with the can soup followed by fresh chopped parsley.  After the hour I topped with crumbled bacon and sautéed chopped onion on top of the remaining cheese and a little more fresh chopped parsley.  I would actually cook this again with out the chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon Lawson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/19981681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-27T19:45:17.713Z",
                "reviewBody": "I made this with four halved thawed boneless skinless chicken breasts and jasmine rice. I followed the directions as described except used only one can of cream of potato soup. I used 3 cups of chicken stock instead of the water and sprinkled only about half of the onion soup mix on top in case the flavor/salt was overpowering. Baked at 350 degrees with foil covering and just after an hour took it out to sit for a few minutes before serving. All was cooked through with the stock absorbed and the chicken tender. A comforting filling dinner and yummy leftovers the next day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "marystark1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4697201/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-25T02:31:06.163Z",
                "reviewBody": "Just tried this recipe tonight. I added some diced onions on top of the rice/cheese layer and then also seasoned the chicken breasts with pig in a polka seasoning. It turned out wonderful - I will make this again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jfred",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13815921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-15T21:26:22.217Z",
                "reviewBody": "Loved this recipe!! So easy too! I had to change the cream of chicken soup to cheddar cheese soup because that's all I had on hand. Now I only use cheese soup. And a couple times I was out of onion soup mix so I just added some dried minced onion and some crushed red pepper/ground black pepper and garlic instead. Still came out great! I've made this several times and my husband absolutely loves it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFA1974",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12814852/"
                }
            }
        ]
    }
]