[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16222/meat-and-poultry/chicken/chicken-breasts/broiled/",
                    "name": "Broiled",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19135/broiled-herb-butter-chicken/",
        "name": "Broiled Herb Butter Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4524529.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "Chicken breasts broiled with an herb butter seasoned with garlic, parsley, rosemary and thyme. Comes out nice and juicy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "½ cup butter, softened",
            "3 cloves garlic, minced",
            "1 teaspoon dried parsley",
            "¼ teaspoon dried rosemary",
            "¼ teaspoon dried thyme"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to Broil/Grill and line broiler pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken on pan. In a small bowl combine the butter, garlic, parsley, rosemary and thyme and mix together, then evenly spread a dollop of mixture on each chicken breast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Broil in preheated oven, turning and frequently coating with remaining herb/butter mixture, for about 15 minutes or until chicken juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Broiled"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Heather"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.115241635687732,
            "ratingCount": 269,
            "itemReviewed": "Broiled Herb Butter Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "338 calories",
            "carbohydrateContent": "0.9 g",
            "cholesterolContent": "128.2 mg",
            "fatContent": "25.9 g",
            "fiberContent": "0.1 g",
            "proteinContent": "24.9 g",
            "saturatedFatContent": "15.4 g",
            "servingSize": null,
            "sodiumContent": "222.9 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-11T14:35:54.603Z",
                "reviewBody": "I followed the recipe as written, but it didn't turn out as well as I'd hoped. The chicken was bland and a bit dry on the edges. I also didn't care for the butter flavor, but I usually use olive oil. Broiling caused a lot of smoke, and the end result wasn't worth the trouble. This is a good recipe to tweak, though,  so the next time I made it, I replace the butter with olive oil and mixed it with double the amount of garlic cloves (crushed). I then pounded the breasts to a uniform thickness and marinated them in the oil and garlic mixture for 30 minutes at room temp. I then used fresh herbs but doubled the amount except for the rosemary (used recipes's original amount as I'm not a big fan of rosemary) and added that to the chicken marinade and mixed well. I wrapped the chicken in aluminum foil and baked at 350 for 20 minutes, then opened the foil and broiled on high (my oven doesn't have broil temps, just high or low) with chicken on top rack to add some color. I then squeezed fresh lemon juice over the chicken just before serving. With my changes, I would give this five stars. The chicken was VERY juicy, and almost fall-apart tender. The lemon juice \"brightens\" the flavor. Garlic is a great tenderizer, and the marinating really gives it time to work, resulting in juicier, more tender chicken. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "frymama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2316747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-01T23:09:25.31Z",
                "reviewBody": "This chicken turned out absolutely wonderful! I took a few of the other reviewers suggestions. I used 1/4 cup of butter melted it and then added the spices. I punctured holes into the chicken so that the juices could really get inside. It smelled wonderful coming out of my oven and was so very tender! The taste was incredible and it was so very easy and fast to make! This will definately become a regular in my house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISNLAUREN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/670781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-11T23:49:37.797Z",
                "reviewBody": "I've found the key to baking and broiling chicken and not having it dry out is to create a \"roof\" for the chicken by adding your herbs and garlic and then laying another vegetable over top; I always use onions.  If you top the whole thing with a tad of olive oil and a couple drops of worchestershire, the onions will caramelize and will also let their juices soak into the chicken.  Comes out awesome!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Emily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2854542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-12T14:26:54.127Z",
                "reviewBody": "I've been making this recipe for years with a few differences - I use chicken breasts with skins and bones dried spices from my spice rack and I skip the butter (decreasing the fat content of the dish) - Just sprinkle the spices - garlic sage rosemary thyme and parsley (salt and pepper too if you like) over the top of each breast (adjust the spices to your family's taste - this may take a few times to get it to your liking) then pop in the oven on a broiler pan sprayed with non-stick cooking spray with about 1 inch of water in the bottom bake at 350 for about 1 1/2 hours (adjust cooking time for the size of the chicken breasts- tops should be deeply browned and crispy). Remove from the oven and cover chicken still on broiler pan with aluminum foil for about 10 minutes and serve - you should have one of the most moist and delicious chicken dishes you've ever tasted. The water in the bottom of the pan serves two purposes - one: it will decrease the chances of a grease fire in your oven and two: it evaporates ensuring an extremely moist piece of chicken. The skin gets nice and crispy - I don't eat it but my kids can't wait to get their \"crispy\" - I have also made this with boneless breasts - but my kids prefer the ones with skin. This is an excellent way to cook chicken and the left overs make a delicious chicken salad. The house smells so good when you bake this chicken!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy in NY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2268513/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T22:34:13.167Z",
                "reviewBody": "I read the other reviews and altered the recipe which seemed to work well. To lower calories but save flavor I mixed 1/2 olive oil and 1/2 melted butter instead of all butter. I also warmed the garlic in the mixture so it infused it. I baked wrapped in foil for 30 min. at 350 and then broiled for 7 minutes for color. It turned out quite well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KPACHAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1059197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:34:31.997Z",
                "reviewBody": "I followed previous reviewers' advice and used 1/4 cup of butter which I melted and mixed with the herbs and garlic. I used this mixture to baste the chicken regularly and it was delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T22:53:39.043Z",
                "reviewBody": "I originally looked at this recipe and thought \"Ugh! Way too much fat\" but you can reduce the fat substantially without sacrificing flavor. Simply take 2 TBSP butter add the garlic and seasonings and place in microwave until butter is melted then stir. This \"cooks\" the seasonings into the butter. Brush mixture onto chicken with basting brush brush again when chicken is turned over. A tasty recipe made more health friendly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WENDIMCD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/183073/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-26T14:22:31.317Z",
                "reviewBody": "This recipe is similar to one I've been using for over 40 years. Instead of mixing butter and herbs and then broiling the chicken. I melt the butter add herbs then marinate the chicken for a few hours then place on foil-lined pan and bake at 375 degrees for 45 min to 1 hr. Absolutely great for a crowd just increase chicken etc. to fit the number of diners.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nanacooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2775666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-25T16:44:50.03Z",
                "reviewBody": "This recipe didn't go very well. It created a whole lot of smoke and was not very flavorful. If I HAD to make it again I would marinade the chicken overnight and cut the butter in half. The only change I made was to add 2 tsp. of italian seasoning. I highly recommend \"Chicken Breasts With Herb Basting Sauce\" instead of this recipe. I will not be making this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "RogueOnion8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185024/"
                }
            }
        ]
    }
]