[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/60241/super-easy-mardi-gras-king-cake/",
        "name": "Super Easy Mardi Gras King Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1107901.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T06:45:43.000Z",
        "description": "Do you love the way a King Cake brightens up your party but hate the time it takes to bake one? Here's an easy recipe that's fast and fun and easier than pie! A small plastic baby inserted into the side of the cake will bring good luck in the coming year to whoever discovers it in their slice of cake. Beads, additional plastic babies, curly ribbon, and other festive trinkets can be used to decorate the cake.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "3 (14 ounce) cans refrigerated sweet roll dough",
            "2 (12 fluid ounce) cans creamy vanilla ready-to-spread frosting",
            "¼ cup milk",
            "2 drops green food coloring ",
            "2 drops yellow food coloring",
            "1 drop red food coloring ",
            "1 drop blue food coloring",
            "½ cup multi-colored sprinkles "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Open the cans of sweet roll dough and unroll the dough from each can into 3 strands. Working on a clean surface, place 3 dough strands side by side and gather them together to make one large strand. Fold this in half, and roll slightly to make a fat log. Repeat steps with the remaining dough. Place each log on the prepared baking sheet and shape to make a ring, overlapping the ends and pinching them together to make a complete circle. Pat the dough into shape as necessary to make the ring even in size all the way around. Cover loosely with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until firm to the touch and golden brown, 50 to 60 minutes. Check often for doneness so the ring doesn't overbake. Place on a wire rack and cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cake ring on a serving plate. Cut a slit along the inside of the ring and insert a small plastic baby, pushing it far enough into the cake to be hidden from view.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the frosting evenly between 4 bowls. Stir 1 tablespoon of milk into each bowl to thin the frosting. Use the frosting in one bowl to drizzle over the cooled cake. To the remaining three bowls of frosting, stir yellow food coloring into one and green into another. Stir the red and blue food colorings together with the frosting in a third bowl to make purple frosting. Drizzle the cake with yellow, green, and purple frostings in any desired pattern. Dust the cake with multi-colored sprinkles and decorate with beads, additional plastic babies, curly ribbon, and other festive trinkets.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BUDDHAFULDREAMER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.277777777777778,
            "ratingCount": 54,
            "itemReviewed": "Super Easy Mardi Gras King Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "606.1 calories",
            "carbohydrateContent": "95.4 g",
            "cholesterolContent": "0.4 mg",
            "fatContent": "22.9 g",
            "fiberContent": "1.9 g",
            "proteinContent": "5.3 g",
            "saturatedFatContent": "4.8 g",
            "servingSize": null,
            "sodiumContent": "865.3 mg",
            "sugarContent": "41.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-13T19:43:15.493Z",
                "reviewBody": "I used 2 cans of cinnamon rolls from ALDI, unrolled them, separated into 4 strands, braided them together and formed the braids into a ring.  I'm from New Orleans and usually make one from scratch.  This was the BEST kingcake we've ever had!!!  I used the icing that came with the cinnamon rolls and sprinkled colored sugar.  AWESOME!  My kids are so happy to have fresh king cake in IL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren Ide",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2143492/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-19T02:53:46.043Z",
                "reviewBody": "I'm just wondering what the correct dough is? Is there a name brand you can recommend? I plan on making this later this week and I want it to come out right :-) Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jocelyn1224",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2036903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-20T19:00:39.833Z",
                "reviewBody": "Cool. I am from Baton Rouge La and this is just as good as the best King cake i have ever had. But the traditional colors are purple yellow and green.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Trimell Landry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2679534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-15T23:28:16.503Z",
                "reviewBody": "It is so frustrating to read a review where the individual didn't follow the directions and cries fowl when it doesn't come out right.\n\nI followed this recipe exactly as shown, with the correct sweet dough, and it came out great.  I will certainly make it again.  It is so much cheaper than ordering through a real NOL bakery to have sent up the East Coast!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KARINLM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/472972/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-25T00:57:23.577Z",
                "reviewBody": "I had to make 5 cakes for a Mardi Gras party.  This cake tasted great and is easy.  I only cooked my cake for 30 minutes as I burned the first one at 40 minutes so make sure you really watch it like the recipe says.  The only thing I changed was that I used only one can of frosting and then I just used colored sugars to make the pretty colors. It was going to cost me $20 a cake at the bakery and I estimate that I spent about $8 a cake. I will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Magic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2319404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-16T18:27:23.517Z",
                "reviewBody": "This is the 2nd year I have made it for Mardi Gras. Usually I am person who bakes everything from scratch but l was short on time last year and had never been to NO much less made a king cake before so I gave this a try and it was so good I made it again this year. The recipe didn't specify so I used Pillsbury orange sweet rolls because I thought it sounded more New Orleans (not that I have any idea prob it is not) and I really think the orange added to it and made it hard to tell it was from a can versus plain old cinnamon rolls though you can use them if you don't like orange. I lightly molded them together to form a ring and baked for 20-30 min. NOT 50-60. Keep an eye on it so it doesn't burn! These rolls come with their own icing which I think is plenty. For me 2 cans would be too much. The orange-flavored icing is good but because it has a pale yellow-orange color to it the food coloring for the purple is a little tricky. Last year I followed the directions on the back of the food coloring box which calls for more red than blue. Bad idea it turned out brownish. Instead stay true to this recipe and use equal amounts red and blue (I used 3 of each). Great recipe. I would not have thought of it. Thanks a lot!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John Paul Vincent Sniegoski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3095001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T16:24:54.597Z",
                "reviewBody": "This recipe was super easy and the cake turned out beautifully! I also was unsure about the type of dough to use and would appreciate a note of clarity from the author(or anyone else who has made this). I used canned cinnamon rolls and pressed them into a tube pan. I was unable to do any weaving like the recipe stated but the results were very nice. I found that 2 cans of icing were way too much and I will only use one can next time. One reviewer stated that one of the tradtional King Cake colors is purple. You can buy Neon Food Colors that has a bottle of purple. I will be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2724115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-10T18:16:17.253Z",
                "reviewBody": "My sister and I wanted to have a Mardi Gras party for our girls and this cake was the perfect way to make things cheap and simple. I bought 3 cans of cinnamon roll dough from the refrigerated section of the store (with the pizza doughs crescent rolls and refrigerated cookie doughs). I just unrolled the strands in each can (mine came in about 6 strands) smashed them together folded in half and rolled a little. I repeated this with each can shaped the 3 logs into a ring and smooshed those together twisted them a little bit and then baked. It only took me 25 minutes to bake so do watch the time carefully (I know my oven is a little hotter than most but I think 50-60 min. might burn for most people). I forgot to cover with foil but will do so next time. I used the icing that came with the cinnamon rolls and added food coloring to the 3 tubs of icing to make green yellow and purple. I cut a hole in the bottom of the cake stuck the baby in and filled it back up and iced over the bottom (which did make things messy!) I didn't do as neat a job as I could have but we were just having fun. Everyone raved about this cake (more so than when I bake from scratch...ahem!). The kids had a blast with it and want to make another cake again soon. I think this cake does not have to be limited to Mardi Gras--my sister said she would like to make this for a brunch (minus the food coloring and plastic baby of course!). Thanks for the great idea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3262536/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-25T18:43:08.653Z",
                "reviewBody": "This makes a great king cake! To get purple, mix the blue and red colors like the recipe explains. I've used both the sweet orange roll dough and generic cinnamon roll dough to make this, and both cake out great. Everyone loves eating it, and it looks great too. Toppings: I colored vanilla whipped frosting with gold and purple (red+blue) food coloring, and then used green sugar sprinkles for a most festive look. THANKS FOR A GREAT AND TIME-SAVING KING CAKE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bprioux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4616382/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-21T17:48:53.927Z",
                "reviewBody": "Sorry it was lumpy. These rolls are precut and not made to be unwound. I was hoping they might taste better than the last time I tried them several years ago. Nope still artificial. Give this recipe a pass and patronize your local bakery.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "marie7s",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4886585/"
                }
            }
        ]
    }
]