[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
                    "name": "Lasagna Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16806/main-dish/pasta/lasagna/meat-lasagna/",
                    "name": "Meat Lasagna Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/245858/pressure-cooker-messy-lasagna/",
        "name": "Pressure Cooker Messy Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5064309.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2019-04-04T04:00:47.000Z",
        "description": "This recipe includes all the flavors of lasagna without the oven or fuss.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "8 cups cooked pasta",
        "recipeIngredient": [
            "1 pound lean ground beef",
            "1 onion, chopped",
            "1 (16 ounce) package bow tie pasta (farfalle)",
            "1 (15 ounce) can tomato sauce",
            "1 (15 ounce) can stewed tomatoes",
            "1 (10 ounce) package frozen spinach, thawed",
            "1 clove garlic, minced",
            "1 teaspoon oregano",
            "1 teaspoon Italian seasoning",
            "water to cover",
            "1 (15 ounce) container ricotta cheese",
            "1 cup shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat pressure cooker over medium-high heat. Add ground beef and cook until browned, 3 to 5 minutes. Stir in onion; cook until translucent, 1 to 2 minutes. Stir in pasta, tomato sauce, stewed tomatoes, spinach, garlic, oregano, and Italian seasoning; mix well. Add water to cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover pressure cooker and cook on high pressure according to manufacturer's instructions, about 5 minutes. Remove from heat and release pressure through quick-release method; open pressure cooker carefully.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir ricotta cheese into pasta mixture; simmer until pasta is tender, 2 to 5 minutes more. Sprinkle mozzarella cheese over pasta mixture.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Lasagna Recipes",
            "Meat Lasagna Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Woodmnky"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.9857142857142858,
            "ratingCount": 70,
            "itemReviewed": "Pressure Cooker Messy Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "468.2 calories",
            "carbohydrateContent": "53 g",
            "cholesterolContent": "59.8 mg",
            "fatContent": "15.5 g",
            "fiberContent": "4.5 g",
            "proteinContent": "29.3 g",
            "saturatedFatContent": "7.3 g",
            "servingSize": null,
            "sodiumContent": "566.7 mg",
            "sugarContent": "6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-10-25T08:29:26.293Z",
                "reviewBody": "Ohmigosh, my family LOVED this!  I doubled the recipe and used sausage and ground beef. I like to brown the meat in a separate pan on the stove so that I can drain the meat in a colander before I put it in the pressure cooker (I want my family to eat less grease.) I have one of those 10 qt Power Pressure Cookers from the infomercials. I put all the incredients except the cheeses into the pressure cooker and I used chicken broth (it's what I had in the pantry) to make sure the dry pasta was covered with liquid and stirred it all together.  Then I set the cooker for 8 minutes on the \"Risotto Setting\" and made sure to release the valve and not let it sit on \"keep warm\" to long so that the pasta didn't get soggy.  I stirred in the cheeses, which melted right away, and served.  This will be a family favorite for sure.\n\nUpdate 10/24/2016:\nOk, I noticed all the reviews that said this recipe was bland and my family actually laughed out loud when I told them that, so I set out to find out what I was doing differently here other than the sausage.  I realized that instead of using boring old \"Stewed Tomatoes\" I use a can of Rotel brand diced tomatoes in this recipe.  I think it really punches up the flavor, especially against the ricotta cheese.  Hopefully that helps some of y'all that are looking for something more interesting, because this is a super easy meal and I love making it on weekdays.  It's also great for leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristi Mills Tyler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17396019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-23T02:55:25.633Z",
                "reviewBody": "This was my first \"whole meal\" in my new pressure cooker (cooked rice the day before, but that was it) and it turned out fantastically! I was thrilled!\n\nWe found it very tasty. I used ground moose meat because that's what we have in the freezer, and I actually used 2lbs of meat as I had to feed 7 for dinner. The onion I used was also very large. I had a larger can of tomato sauce than what was called for, but since you had to cover with water anyway, I just threw the whole thing in there as part of the liquid. Also, I very often put more garlic in a recipe than what is stated, and this was no exception - I think I used 4 or 5 cloves (it was a bit older, so it needed some help. ;)\n\nIt cooked up to perfection in my 6 qt Instant Pot set manually to high pressure and 7 minutes (since the meat was doubled). I wish I could say that 7 minutes is the magic number, but my pot didn't seal the first time and I threw it on again for another 5 minutes. I basically stirred in the ricotta cheese and served - we all put our own bit of grated mozza cheese on top. So delicious! We are all looking forward to having this again sometime soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CDHein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2093150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-11T10:43:08.387Z",
                "reviewBody": "This was my \"teach myself how to use my pressure cooker\" recipe, so I played around a bit. I  didn't find it bland, but then I also added all my seasoning to the meat as I browned it, and I used more than called for. I saw one reviewer used Italian sausage instead of ground beef.  Since the meat cooked down so much the first time, the second time I used double the amount, equal part beef and sausage. I also used tomato paste instead of stewed tomatos, just because I never liked chunks of tomato in my sauce, this is probably why I didn't find it thin as some others said. I have since made it several times, sometimes with the spinach and sometimes without. (Some in my family don't like spinach) When leaving  out the spinach, I had to cut back on salt, it seems the spinach needs it more than the rest of the dish. Once I even used frozen broccoli florets instead of the spinach, worked great and tasted really good. Now that I have mastered my pressure cooker, time to find more recipes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAME",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17522958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-07T07:57:07.46Z",
                "reviewBody": "It was pretty easy to throw together. I'm still adjusting to my pressure cooker so it took a little longer to cook. It was a bit bland so I added more garlic salt and seasonings but in the end it was tasty! I'll definitely be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RaeAnne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20358670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-29T23:48:04.85Z",
                "reviewBody": "I simmered sauce on the stove first and then mixed remaining ingredients. Needs some more spices / seasonings. I would also add some broth to make it juicier if I bake it again. Not bad start tho.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8027301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-18T22:51:14.53Z",
                "reviewBody": "Easy recipe. It came out a little watery for my taste so I added a jar of pasta sauce to thicken it up. I put the pressure cooker lid on for 5 minutes without turning the pressure cooker back on to heat the sauce. It came out perfect and is just as good leftover.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ukiki84",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16595207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-13T10:40:07.36Z",
                "reviewBody": "This was a great way to provide a hearty meal quickly. I used a whole onion and cooked it with my meat. For sauce I used some homemade spaghetti sauce (30 ounces) that I added a can of tomato paste to. I upped the seasonings - probably tripled and added some crushed red pepper. Instead of frozen spinach I used about four or five ounces of fresh. I used a box of whole grain pasta which took longer to cook. As others suggested I used broth instead of water. It was probably about 3 1/2 cups of water. After pressure cooking I added cottage cheese as that is what I had on hand. I was concerned about the amount of water remaining but realized that the pasta would soak it up as it finished cooking. I stirred in probably two cups of mozzarella just before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K-Slice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5399653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-14T09:17:55.773Z",
                "reviewBody": "The only thing I did different in the recipe was added more of the stewed tomatoes and more cottage cheese than listed. It was so yummy will be making a lot of this in the future. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6810401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-05-23T04:26:39.293Z",
                "reviewBody": "Added more garlic and will add more spice next time. Still very good and will definitely make often. Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jane Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18065010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-10T08:21:14.023Z",
                "reviewBody": "Bland and I used broth instead of water added sautéed bell peppers and extra garlic. Also soupy and the noodles were mush.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "kaleyr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2763075/"
                }
            }
        ]
    }
]