[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
                    "name": "Fish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69414/aunt-carols-spinach-and-fish-bake/",
        "name": "Aunt Carol's Spinach and Fish Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3987456.jpg",
            "width": 1936,
            "height": 2592
        },
        "datePublished": "2004-02-02T17:35:29.000Z",
        "description": "Simple, easy fish recipe. Any white fish will do! And even the kids will eat up the spinach! (My four year old loves this dish!) This recipe was passed on by my Aunt and was a little bit of this, a little bit of that - so tweak the ingredients to your liking!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry",
            "1 cup sharp Cheddar cheese",
            "⅓ cup dry bread crumbs",
            "1 egg, beaten",
            "1 pound cod fillets",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, mix the spinach, 1/2 cup Cheddar cheese, about 5 tablespoons dry bread crumbs, and the egg. Spread the mixture into the bottom of a small baking dish. Arrange the cod fillets on top of the spinach mixture, and season with salt and pepper. Top with the remaining Cheddar cheese and bread crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and bake 20 minutes in the preheated oven, or until fish flakes easily with a fork.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Fish"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SNOOCHUMS95"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.140287769784172,
            "ratingCount": 278,
            "itemReviewed": "Aunt Carol's Spinach and Fish Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "306.1 calories",
            "carbohydrateContent": "10 g",
            "cholesterolContent": "131.5 mg",
            "fatContent": "14.3 g",
            "fiberContent": "2.5 g",
            "proteinContent": "34.2 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "419.2 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-08T15:53:15.163Z",
                "reviewBody": "Thanks to my niece, Liz, this recipe has been enjoyed by many.  The original recipe is called Cheddar Fish Florentine.  It calls for 1 C shredded sharp cheddar, 2 Tbls dry bread crumbs, 1/4 tsp dried and crushed tarragon leaves, 1 10oz pkg chopped spinach thawed and well drained, 1/2 lb fish fillets.  Combine cheese, crumbs and tarragon, reserve 1/4 C for topping.  Mix with spinach.  Spread this into baking dish, top with fish, sprinkle on remaining cheese mixture.  Bake 450 15 to 20 minutes.  Two servings.  I love all the variations.  I myself added an egg to make the spinach more like a souffle.\n\nOf course, I rate it 5 stars!\n\nEnjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aunt Carol",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2196954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-03T20:40:48.317Z",
                "reviewBody": "I will admit that I made some drastic changes in this recipe but I had to use what I had on hand!  I did not have any cheddar cheese so I used real parmesan (not the green can kind).  I did not have frozen spinach so I used a bag of fresh that I sautéed with a small chopped onion and 2 chopped garlic cloves.  I used Italian breadcrumbs instead of plain.  Even with these changes, this fish was yummy and a big hit with the family.  I may try it the “real” way one day but I liked this way just fine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MNOTSCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/799401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-27T15:33:56.297Z",
                "reviewBody": "I make this recipe about once a week and we love it here! However, I have made several key changes so that's why I'm rating this 4 stars -- Firstly, I set the oven at 400 degrees. Since I use frozen cod, I end up cooking these much longer as well. I place each cod into small au gratin dishes (sprayed with Pam) for individual servings; squeeze fresh lemon juice, sea salt & freshly ground pepper over each; top each with mixture of fresh baby spinach (cut up), 1 cup shredded sharp cheddar cheese, 1 beaten egg, and crushed saltine crackers instead of  dry breadcrumbs; cover each dish with foil.  I found that roasted new potatoes go very well with this fish ~AND~ the best part is they can roast in a seperate pan right along with the fish! For that, I toss the potatoes in a pan with 1 tablespoon of olive oil; little salt & pepper and throw the pan in the oven next to the fish. They're ready when nicely browned. Serve it up with steamed baby carrots--how healthy is that?!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm Not Stupid, I Know Tings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1583526/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-19T19:17:57.837Z",
                "reviewBody": "We absolutely loved this, though I did make a couple minor changes.  I don't care for frozen spinach so I used fresh which I steam-fried with chopped garlic and onion just until wilted.  I removed the excess moisture and proceeded with the recipe.  I substituted hard Parmesan reggiano cheese for the cheddar, which I grated.  It has less fat than the cheddar, is less greasy, and we love the flavor.  I topped the fish with a mix of Italian bread crumbs and finely grated Parmesan, which I then sprayed with a bit of butter flavored cooking spray so it would brown and crisp nicely.  It came out fabulous and my husband absolutely loved it.  I've made it several times now and it will definitely stay in my recipe rotation.  Thank you so much for such a delicious and healthy recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Homestead Grandma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/homesteadgrandma/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-02T01:15:19.437Z",
                "reviewBody": "I thought it was very tasty but needed a few tweak's.Cooking time needs to be 35 minutes @ 350 degrees add some cream to the spinach shred the cheese splash the fillets with some butter and serve with fresh squeezed lemon juice I would make this dish again a nice change for a fish dish...............",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bill Howard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2088255/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-04T21:06:59.667Z",
                "reviewBody": "What a delicious recipe which begs to be tweaked. We added 2 minced cloves of garlic grated parmesan basil and a bit of dried mint to the bread crumb/spinach mix. We then grated some 5 year old cheddar over the mix in the baking dish added the cod and repeated the process. This one is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DUNST43",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1336185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T15:23:03.92Z",
                "reviewBody": "This recipe tasted great especially with a few additions. I put the fish in lemon juice for half an hour to add that lemon-fish taste. With the spinach mix I added mushrooms and onions. With the cheese I doubled that amount. I will make this again real soon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Danielle Alexis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1560250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-06T01:29:13.533Z",
                "reviewBody": "The temperature and cook time is way low for this recipe - I gave it 30 mins at 350 degrees, and it was certainly not overcooked. That said, this is a really great combination of flavors, and is quite unique. I didn't add anything to the recipe and made just as stated - it was just fine, what some might consider \"bland\" but I thought it enhanced the cod and cheddar flavors nicely. The spinach mix was quite good, but if you're trying to disguise the flavor for spinach-haters, more customization would be needed (extra cheese, extra egg, etc.). All in all this was a really nice and quick fish dinner - thanks for sharing :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "M. Stoffel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/maggiemay/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-17T20:27:20.75Z",
                "reviewBody": "This recipe is super easy and so good!! I season my fish with lemon pepper before it bakes and the flavor with the cheese and bread crumbs is delicious!! this is a family favorite!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A. Workman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1714197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-21T02:55:41.773Z",
                "reviewBody": "Lackluster as written with an improper cooking time and temperature to boot.  Embellishing on this quite a bit - mushrooms, shallots, garlic, white wine and cream, seasoning the fish, and increasing the oven temperature and baking time did help a great deal, but it still wasn’t something I’ll make again.  Needs too many improvements – not solid as is.  Moreover, this probably was the most unattractive dish I’ve ever made (hence, no photo).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            }
        ]
    }
]