[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70188/monkey-meat/",
        "name": "Monkey Meat",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F236977.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:46:10.000Z",
        "description": "A wonderful recipe for shredded beef with a Mexican flair.  Remove seeds from chiles and peppers if less heat is desired.  Serve this meat with tortillas, guacamole, sour cream, salsa, etc. If fresh tomatoes are not in season, a 14.5 ounce can of diced tomatoes may be substituted.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H30M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "4 pounds tri tip roast",
            "3 teaspoons salt, divided",
            "¾ teaspoon ground black pepper, divided",
            "3 tablespoons chili powder, divided",
            "3 tablespoons ground cumin, divided",
            "⅓ cup olive oil, divided",
            "2 large onions, chopped",
            "4 cloves garlic, chopped",
            "2 Anaheim chile peppers, chopped",
            "1 poblano chile pepper, chopped",
            "2 jalapeno chile peppers, chopped",
            "1 green bell pepper, seeded and chopped",
            "1 carrot, chopped",
            "2 stalks celery, chopped",
            "4 roma (plum) tomatoes, chopped",
            "1 whole dried red chile pepper, seeded and chopped",
            "1 (14 ounce) can beef broth"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Trim the beef roast of excess fat and tissue, and cut into 4 or 5 large chunks. In a cup or small bowl, mix together 2 teaspoons of salt, 1/2 teaspoon of pepper, 1 tablespoon of chili powder, and 1 tablespoon of ground cumin. Rub this mixture into the meat, and let stand at room temperature for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 3 tablespoon of olive oil in a large deep skillet or Dutch oven over medium-high heat. Sear the meat on all sides. Remove meat from the pan, and pour in the remaining olive oil. Reduce heat to medium, and add onions, garlic, Anaheim peppers, poblano peppers, jalapeno peppers, green pepper, carrot and celery. Cook, stirring frequently, for about 5 minutes to release the flavors.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add roma tomatoes to the pan, and season with remaining chili powder, cumin, salt and pepper, as well as the dried chile pepper. Bring to a simmer and cook for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return the meat to the pan, and stir in the beef broth. Bring to a boil, then simmer over low heat for 3 to 3 1/2 hours, until meat is very tender. Taste and adjust seasonings if necessary. Remove meat from the pot, shred, and return to the pot. Reheat if necessary before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Joyce A."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.580645161290323,
            "ratingCount": 31,
            "itemReviewed": "Monkey Meat",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "423.9 calories",
            "carbohydrateContent": "7.5 g",
            "cholesterolContent": "124 mg",
            "fatContent": "24.1 g",
            "fiberContent": "2.3 g",
            "proteinContent": "43.3 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "819.8 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-04-06T15:21:33.937Z",
                "reviewBody": "When I first made up this recipe and served it my son called it monkey meat because it was made with beef which shredded into strings. We've always thought of monkeys as stringy animals and so the name stuck. I hope this doesn't turn anyone off on trying this recipe. It is kind of labor intensive at first but the results are really and truly scrumptious!!! Also you can use a different roast - i've used shoulder clod roast and chuck roast with delicious results. Whatever's on sale at your butchers!!! You can also substitute the peppers to whatever you can find at the store.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce A.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/35848/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T22:36:55.383Z",
                "reviewBody": "I starting looking for tri-tip recipes that didn't involve the grill and this recipe sounded interesting. My family loves Mexican food but are not fans of spicy so I opted to omit the red chili pepper; and only used 1 jalapeno & 1 anaheim pepper (both seeded). I also substituted the poblano with 1 tomatillo and the rest of the ingredients were followed exactly. It had enough flavor for my family (especially since I have 2 small ones) I seared the meat and sauteed the vegetables then placed them in the slow cooker with the beef broth and cooked it for several hours. This made enough food for my family of 5 to have 3 separate meals from it. Tacos the 1st night breakfast burritos with scrambled eggs the next morning and then shredded beef burritos another night. Received rave reviews from everyone that tried it. I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "arbonne_ne1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2499500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-20T06:11:28.963Z",
                "reviewBody": "This was very good.  Read all reviews and was surprised at how many do not use chili in fear of food being to hot.  If you buy mild chili it will take on the flavor of chili with out the heat and that is a flavor all should experiance. I buy about 10 to 15 pound of Hatch Chili every year seperate it and freeze.  i use all year long.  However I never combind several chilies like Pobalno and Jalapenos and only cook 20 min.  If you don't like heat make sure all seeds are removed then you get flavor not heat.  I think most important step is to Sear meat and  sauted all veggies before the mix.  After I mixed it I put in Crock Pot becaus I don't like to stand over the stove making sure nothing burns.. This was good amazing thing is you can substitue the meat for all cuts like Chicken, Pork even ground beef.  It will all turn out.  Mostly don't be afraid of heat get mild and it all works out. When making a stew or soup I use a cup to two cups in my dishes.  It really add a flavor that can not be duplicated.  Next time I am going to try adding chipotle chili in adobo sauce just a teaspoon to table spoon the rest of the can I will seperate and freeze in a baggies for other uses....I really think it would take this reciepe up a level or two.  Guess I will try it again and let you know.   ValerieRoman9@aol.com",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Roman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-12T04:02:37.03Z",
                "reviewBody": "Well while the preparation for this recipe is indeed very labor intensive (so much chopping!) the recipe turned out very yummy. These are my modifications: I omitted the celery and carrot I couldn't find all of the different peppers required and wound up having to use jalepeno and banana peppers both with seeds. Because of the lack of heat I also tossed in a teaspoon of red pepper. Also two large onions seemed entirely too much for the dish (that and both my fiance and myself are not huge fans of onions)-- I wound up only using about 2/3rds of a large Texas Super Sweet. I cooked this in a slow cooker for about 4 hours on high. I would in the future cook this on low probably all day so the meat would be more tender although it was still good. One last thing: I added a double shot of tequila to the mixture although I really couldn't taste it. Perhaps next time I will marinate the meat in tequila along with the spice rub overnight to liven things up. In all it was very good with an excellent combination of flavors-- I will make this dish again. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DarkerSolace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1386632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T13:28:29.957Z",
                "reviewBody": "I was looking for a recipe to use up about 1lb of tri-tip that I had left over from a barbeque. It had been marinated in tamari coarse mustard and fresh rosemary then grilled. I came across this recipe scaled it down for 4 servings. The changes I made-obviously didn't sear the meat didn't add the red chili (personal taste)and probably used about 1 can of beef stock but followed the recipe after that. Served it with white rice homemade guacamole sour cream and cheese with wheat tortillas. It was fantastic!! My boyfriend ate so much he barely left enough for MY lunch today!! The meat shredded beautifully and was very flavorful! A little spicey-but when paired with sour cream and guac it cooled down very nicely. I will be using this for all my left over tri-tip! Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2304827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T22:47:14.097Z",
                "reviewBody": "A funny name for such a yummy dinner! You can cut down the prep time by using a large chopper. I only used one of annaheim one of the poblano one can of jalapenos and 7 dried chilis. The spice is nice as it adds flavor but doesn't overwhelm the dish as just hot. I used a sirloin steak as it is what we had on hand. Thank you for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3637903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-29T23:52:49.457Z",
                "reviewBody": "Wow my whole family LOVES Monkey Meat! I made the recipe EXACTLY as stated and it turned out wonderful! Everyone in my family LOVED this meat my four kids husband myself and my step daughter! This recipe is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Die Cut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4138109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-23T00:54:37.67Z",
                "reviewBody": "Takes a little prep but well worth it. The final result is wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "downtownhb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1562238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-20T22:18:41.433Z",
                "reviewBody": "I have been looking to years for machaca meat and here it is. My entire family raves about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pamela T.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2126194/"
                }
            }
        ]
    }
]