[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
                    "name": "Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16212/appetizers-and-snacks/snacks/crackers/",
                    "name": "Cracker Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/71063/cheese-and-chive-crisps/",
        "name": "Cheese and Chive Crisps",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F90297.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:46:16.000Z",
        "description": "These cheesy crispy snacks are deliciously spiced, and made extra crispy using crispy rice cereal!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "9 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "3 cups shredded sharp Cheddar cheese",
            "2 cups all-purpose flour",
            "¼ cup chopped fresh chives",
            "½ teaspoon salt",
            "½ teaspoon pepper sauce (such as Frank's Red Hot®)",
            "¼ teaspoon garlic powder",
            "2 cups crisp rice cereal"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the softened butter and cheese until well blended. Stir in flour, chives, salt, hot pepper sauce and garlic powder until thoroughly mixed. Stir in cereal. Divide the mixture into four parts, and roll into 6 inch long logs. Wrap in plastic wrap, and refrigerate until firm, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Unwrap the cheese logs, and slice into 1/4 inch thick rounds. Place on an ungreased cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes in the preheated oven, until edges are crisp and slightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Snacks",
            "Cracker Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "NIKKIDOC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.433333333333334,
            "ratingCount": 30,
            "itemReviewed": "Cheese and Chive Crisps",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "81.8 calories",
            "carbohydrateContent": "4.5 g",
            "cholesterolContent": "17.1 mg",
            "fatContent": "6 g",
            "fiberContent": "0.1 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "101.6 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-16T19:11:53.193Z",
                "reviewBody": "LOVE this recipe. For the sake of my ears I omitted the chives (didn't want to hear little ones complaining there was green stuff in their crackers). I also upped the garlic powder to 1/2 tsp and instead of the hot sauce I used 1/4 tsp cayenne powder which gave it a slight kick at the end if you want some noticeable heat I'd use 1/2 tsp. It is fantastic and will definitely make this again. It turned out better than expected (I've tried a few of these types of recipes before and this one wins). Next time I will add some whole wheat flour. I rolled the mixture in some plastic wrap just put a pile on the plastic and close the wrap so none will escape then shape it into a log - don't be afraid so smush the mixture together it needs to hold together well in the fridge. When you slice it don't use a serated knife and don't saw the log just slice straight down some pieces may crumble but if you pack the mixture together well before you refridgerate it should be just fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Soifua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/soifua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-27T14:46:47.187Z",
                "reviewBody": "Really good and a great alternative to hydrogenated store-bought Cheez-its. I used fresh chives chopped in the food pro which was quick & easy but a little slimy- made no difference in taste though so I'll do this again. I baked the first two rolls after refrigerating for 1 hour. I had to slice them thick but even then they kept crumbling apart. Make sure you squeeze the rolls tightly to compressed the mixture in the plastic wrap. I sprayed my sheet with Olive Oil and flattened with my hand as others suggested. I spinkled them with coarsely ground sea salt just before baking. They weren't even completely cooled before most of them were gone with my husband and kids around! What we did have leftover he said were even better and more like store bought the next day after the flavors settled. The next two rolls I sliced and baked after a couple days of refrigeration. With a sharp knife this made the slicing 10x easier because the rolls were so much more firm and I could slice them thinner like 1/8\" or less. And I'm sure I got more than 9 dozen. Thanks so much for this-- this was the first cracker recipe I tried but I don't need to search any further!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2875503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-02T14:47:58.773Z",
                "reviewBody": "OMG....YUM! I'm taking these to a party later today and I must have eaten twenty of them already! Based on everyone elses reviews (and thank you btw) I used a lot more hot sauce than called for added about a half tsp. of cayenne in addition to the two cups of cheddarI threw in a half cup or so of parm and only used half of the chives. These are really amazing and I thank you Nikki!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-23T15:50:20.903Z",
                "reviewBody": "I recently went to a party where cheese crisps were served they were so delicious I couldn't stop eating them and had to have the recipe. I was hoping this was it but it's not. The chives are too overpowering and these don't have the spicy kick the ones at the party had. I even doubled the hot sauce and garlic to suit our tastes but all you can taste is cheese and chives. Needs a bit more salt too. My first batch stuck to the pan so I sprayed the pan after that. These are ok not great not terrible. A good jumping off point with a little tweaking this could be 5 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMIKOMI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/800402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-18T18:03:04.643Z",
                "reviewBody": "I have been making crackers similar to these since I was a teenager decades ago. The hints that I have to make it easier is to: A. Use finely shredded extremely sharp WHITE cheddar cheese (I have to buy blocks and shred by hand). B. Melt the butter C. Sift the flour D. and lastly I don't form into a roll or refridgerate. The dough is warm from the melted butter and I've found it best to just squeeze it into 1\" balls in my hand and then press it down on a cookie sheet with the bottom of a flat cup. Make sure the bottom is completely flat and not dished. I also dip the cup into flour between crackers so it doesn't stick. I never have leftovers...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "res",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4328506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-24T17:09:52.483Z",
                "reviewBody": "This is a really good recipe. I gave it a try to add to my spread for the holidays. The only reason I gave it 4 stars is because the recipe calls for the dough to be chilled then sliced but I found it didn't really help to chill it. Its still an awkward dough to work with. I just rolled it out to 1/4 thickness and used small cookie cutters.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kellygrrrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/968148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-23T12:31:54.857Z",
                "reviewBody": "Delicious and easy...simply rolled into small balls & used fork to press tops and baked rather than refrigerating first. Would have liked a little more crunch. Otherwise flavorful and yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Hagy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1686997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-26T00:54:13.637Z",
                "reviewBody": "These were just okay to me. Nothing great. I really had high hopes for these! I made them exactly as written. Maybe I should have made changes that other members suggested in their reviews...(2 hours later)...Okay I just got some great suggestions from other members on this site on how to make these better! I added more salt garlic powder grated parmesan cheese and cayenne pepper.I also baked it til they were very brown.This was so much better!!! These spread out a little while baking so leave a little room on the sheet. I baked these on parchment paper.They taste similar to the boxed name brand cheese crackers!So now I changed it from 3 stars to 4 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lillianrusso/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-13T17:31:15.893Z",
                "reviewBody": "Great recipe thanks for sharing. Next time I will add more hot sauce though. I left them in the fridge overnight in tight little rolls and used an electric carving knife to slice them in the morning. Worked like a dream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bermudajan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2000001/"
                }
            }
        ]
    }
]