[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/260235/whole-wheat-and-steel-cut-oats-bread-a-long-fermentation-bread/",
        "name": "Whole Wheat and Steel-Cut Oats Bread - A Long-Fermentation Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5201234.jpg",
            "width": 2212,
            "height": 1000
        },
        "datePublished": "2019-04-04T04:09:43.000Z",
        "description": "This is a no-knead bread recipe that I put together using ideas from other recipes and my own variations. During the long fermentation period, the grains soften and swell to give the bread a wholesome and satisfying flavor and texture. It has a chewy crust that is crispy when toasted and a soft crumb. This bread is more convenient because it can be mixed one day and baked the next day when you have time. The long fermentation releases the nutrients of the grain and enhances the flavor of the bread.",
        "prepTime": "P0DT0H50M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT22H35M",
        "recipeYield": "2 9x5-inch loaves",
        "recipeIngredient": [
            "2 cups steel-cut oats",
            "5 cups bread flour",
            "4 cups whole wheat flour",
            "¾ cup nonfat dry milk powder",
            "6 tablespoons coconut sugar",
            "3 tablespoons vital wheat gluten",
            "2 tablespoons kosher salt",
            "2 tablespoons flax seeds, crushed",
            "¾ teaspoon active dry yeast",
            "5 cups water",
            "6 tablespoons vegetable oil",
            "3 tablespoons raw apple cider vinegar (such as Bragg®)",
            "2 tablespoons all-purpose flour, or as needed",
            "1 egg",
            "1 tablespoon water, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat a heavy skillet over medium heat. Add the steel cut oats; cook and stir until lightly toasted, about 5 minutes. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine bread flour, whole wheat flour, toasted steel cut oats, dry milk, sugar, gluten, salt, flax seeds, and yeast in the bowl of a stand mixer with a paddle attachment. Add 5 cups water, oil, and vinegar. Mix on low until all ingredients are moistened. Increase speed to medium-high; mix until gluten is developed and dough is elastic, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough into a clean, oiled bowl. Cover with plastic wrap. Let rise in a warm place until doubled in volume, 1 to 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stretch and fold dough 4 to 6 times. Place back in bowl, cover, and refrigerate 16 to 18 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from the refrigerator 2 to 4 hours before baking. Turn out onto a well-floured surface; sprinkle top of dough with flour. Halve the dough; flatten each half. Fold in all 4 sides like an envelope; press edges together into the dough. Shape each piece into a loaf with the smooth side on top. Place in 2 loaf pans; cover with a non-terry towel. Let rise until dough just crests above the top of the pan, 45 minutes to 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 500 degrees F (260 degrees C). Place a pan of water on the lower rack to produce steam for the bread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk egg with 1 tablespoon water in a small bowl. Coat tops of loaves with the egg wash.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until browned, about 15 minutes. Remove the pan of water carefully; cover loaves with aluminum foil tents. Continue baking until an instant-read thermometer inserted into a loaf reads 200 to 205 degrees F (93 to 96 degrees C), 45 to 60 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove loaves from pans and cool on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "judy2304"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.2857142857142856,
            "ratingCount": 7,
            "itemReviewed": "Whole Wheat and Steel-Cut Oats Bread - A Long-Fermentation Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "187.8 calories",
            "carbohydrateContent": "29.9 g",
            "cholesterolContent": "8.5 mg",
            "fatContent": "5.1 g",
            "fiberContent": "4 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "506.8 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-12-19T08:49:30.353Z",
                "reviewBody": "Good base recipe. I used this to make a multigrain cinnamon raisin bread.  \n\n I swapped out 1 cup of the bread flour for 2 cups of ground oats, added an egg for richness, used up my slightly sour milk instead of water,  added 1 cup of raisins (soaked in the milk with the wet ingredients, 1 Tbs of molasses.  AFter the over night rest I rolled out the dough to about 1/2 inch thick then applied a cinnamon sugar mix to it like cinnamon rolls.  Rolled up the bread then let it rise.  For the cinnamon sugar mix I used 1/4 c brown sugar, 2 Tbs white sugar, and 1 Tbs cinnamon.  Made 4 BIG loaves.  Don't add cinnamon to the bread before the rising because it's an antifungal and can interfere with the yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Stone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3412236/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-02-11T02:00:26.087Z",
                "reviewBody": "I would ask that you review the recipe and cooking instructions.  First, this made a huge batch of bread dough.  When I divided it in half, each of my bread pans was already overfilled.  The dough I had would have fit better in 3 loaf pans.  Second, the bread got very brown in 15 minutes, and was burned top and bottom by the time that it finally got to 200 degrees internally.  Yes, I used aluminum foil tents.  The taste is very good (except for the burned bits), but I wonder whether 11 cups of oats and flour plus the other ingredients can really be accommodated.  Also whether the 500 degree oven is a mistake, or should be turned down after the first 15 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara Friesen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9022684/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-05-19T01:44:15.76Z",
                "reviewBody": "I love this kind of grain bread. I had some steel cut oats that I needed to use. My mom used to make wheat bread that looked a lot like this bread. I love the crunchy crust the thick texture of the bread and it tastes delicious toasted! Hubby loves it too! Will make again as soon as I get some more steel cut oats!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Timeflies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6683228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-01-05T23:10:20.25Z",
                "reviewBody": "I tried this bread because I had never made yeasted bread before. I did however make quick bread and thought this would be along similar lines. First of all I followed the recipe exactly. I ended up with a lot more dough than the recipe would suggest. I had to divide between 2 really large bowls. It too much dough to put in just 2 loaf pans so I ended up putting it in 2 9 inch round pans. However the real problem was the oven temperature. I set my oven at 500 degrees. I brushed the tops with egg wash and put them in the oven for 15 minutes with a pan of water underneath the bread as directed. After 15 minutes the bread was beautifully brown. The recipe stated to tent them which I did and leave them in the oven for another 45 to 60 minutes! I left them for another 10 minutes before noticing a burning smell. Both loaves were badly burned on the bottom and one was burned on the side. When i cut away the burnt part the bread itself is very good. But I think I will learn to knead bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "wiccanwoman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5222273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-11T05:45:59.31Z",
                "reviewBody": "I made it exactly as directed. The amount of batter was too much for my Kitchen-Aide Artisan mixer. I used the mixer anyway and almost burned out the motor, as well as making a mess at the top of the paddle and mixer head. But I persevered. It did rise but not as much as other bread dough that I have made. There was too much dough for two pans so I divided it into three. While baking, I had the same problem as another person who rated this recipe. The crusts were burning so I took it out of the oven  about ten minutes early. It wasn't quite done according to the thermometer, but was too dark to continue cooking. After the bread cooled, I tasted it and of course it tasted underdone. As well it was very heavy. I cut off all of the crusts and dried the bread out in the oven for breadcrumbs. I like the idea of this recipe but it didn't turn out for me and I won't make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "penny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27312072/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-14T00:57:58.253Z",
                "reviewBody": "I make at least three loaves of bread a week, so I was hesitant to follow the recipe as written, but I like to give the benefit of the doubt, as I obviously do not know everything there is to know about bread.\n\nNot good as written. Recipe is MUCH too large for a Kitchen-Aid mixer. Recipe is very liquidy, so I had to add flour to get it to stay together. And baking at 500F for an hour, even with a foil cover for the last 45 minutes turned out bread that was burned all over and raw in the middle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "momofpjcv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27332515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-16T14:53:30.68Z",
                "reviewBody": "This is my recipe, and I also make it with the 9 grain mix that does not have to be toasted. I usually use coconut palm sugar as the sweetener. This bread is great for toasting, but toasting takes more time than store bread. This is not like any bread you can buy in a store, and you know what goes into it. I make multiple loaves and freeze them after slicing. That way I can use slices as I need them. \n\nOne step left out of this recipe is that the oven temperature should be reduced to 450 after browning.  Depending on your oven, this can be 10-15 minutes. The bread should be on the light side as it will brown more after tented. I have found spritzing the oven sides 3 times every  3 minutes works better than a pan of water for oven spring.  The internal temperature of the loaves should be 200-205 degrees when done. The baking after tenting will take 45-60 minutes depending on your oven. GAUGE BAKING TIME BY INTERNAL TEMPERATURE AND NOT TIME. \n\nSince this is a no-knead bread, the dough is too wet to be kneaded by hand. You need to used a wide dough scraper to turn it onto itself. The dough should be very sticky. Adding more flour will alter the results.  \n\nAnyone that bakes a lot of bread knows there are a lot of variables. Dry flour may require more water, oven temperatures can vary, raising times can vary depending on room temperature and altitude, and more. If the last raise is a few minutes too long, there will be no oven spring, and the top of the bread will cave in.  Bakin",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "judy2304",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/judy2304/"
                }
            }
        ]
    }
]