[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/73993/monterey-chicken-with-potatoes/",
        "name": "Monterey Chicken with Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F340084.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2019-04-02T06:46:30.000Z",
        "description": "This is a delicious dinner recipe developed by my mom. Roasted potatoes and chicken breasts are topped off with a cheesy cilantro and salsa topping at the last minute before serving.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "6 medium red potatoes, cubed",
            "½ cup butter, melted and divided",
            "4 skinless, boneless chicken breast halves",
            "1 tablespoon fresh lime juice",
            "1 ½ cups shredded Mexican blend cheese",
            "¼ cup chopped fresh cilantro",
            "½ cup salsa",
            "1 lime, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 425 degrees F (220 degrees C).  Line a 9x13 inch baking dish with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Toss potatoes with about 1 tablespoon of melted butter until coated. Arrange in a single layer in the bottom of the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 minutes in the preheated oven. Remove pan from oven, and push potatoes out to the sides of the dish. Place the chicken breast halves in the dish. Stir together the remaining butter and lime juice. Brush onto chicken. Return to the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, or until the chicken is no longer pink and the juices run clear. In a small bowl, toss together the cheese, cilantro and salsa. Sprinkle over the chicken and potatoes. Return to the oven for a few minutes, until the cheese is melted. Serve with lime wedges.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "KELLY624"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5021645021645025,
            "ratingCount": 231,
            "itemReviewed": "Monterey Chicken with Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "766.8 calories",
            "carbohydrateContent": "56.7 g",
            "cholesterolContent": "176.6 mg",
            "fatContent": "42.5 g",
            "fiberContent": "6.5 g",
            "proteinContent": "42.8 g",
            "saturatedFatContent": "26.8 g",
            "servingSize": null,
            "sodiumContent": "824.9 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-05-18T15:28:01.483Z",
                "reviewBody": "My family loved this. There was nothing left. I added salt & pepper to the potatoes. I marinated my chicken in 1/4 cup lime juice, cilantro and 1 1/2 cup salsa (I used fresh from the refrigerated section of the grocery) before baking. I also sliced a lime very thin with a mandolin and added it to the marinade. When I added the chicken to the potatoes, I put all the marinade in too. I covered and baked this for 25 minutes at 425 and then reduced the heat to 350 for another 30 minutes. I uncovered the pan and added the cheese and baked for a few more minutes. The salsa and lime flavors are a great combination. I will serve this to company.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CATLADY14",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1408674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-23T19:02:19.013Z",
                "reviewBody": "Read alot of reviews before making this. I marinated the chicken in 1/2 cup mild salsa to which I had added 1 Tblsp. fresh lime juice for 1/2 hour. While it was marinating I sliced the potatoes fairly thin and cut each slice into 4 pieces put them in my roaster pan(14x9) which was lined with heavy duty foil sprayed with Pam lightly salted and peppered them sprinkled some onion flakes over them and drizzled the tablespoon of melted butter over them and tossed. Baked for 15 min. in preheated 425 oven. Took pan out pushed potatoes along side of pan and put the chicken in the middle brushed pieces with the remaining butter and tablespoon of lime juice which I mixed in a small bowl. Returned to oven for 10 minutes. Mixed Newmans Black Bean & Corn Salsa & parsley together poured over chicken baked at 425 covered for 25 minutes reduced oven temp to 375 and cooked another 20 minutes. Removed foil and sprinkled Sargento Reduced Fat 4 Cheese Mexican over chicken and potatoes and put back in oven for 5 minutes. This is so good. I will be making this often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allrecipes Community",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/allrecipescommunity/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-18T16:17:59.123Z",
                "reviewBody": "This dish is absolutely wonderful and fresh. I made a few changes in ingredients. I had sauteed chicken earlier in the day so I had that on hand. I baked the potatoes at 425 for the time mentioned pushed them aside and dropped the temp to 325 (since my chicken had been cooked earlier) and returned it to the oven until heated through. I also used dried chives in place of the cilantro I didn't have on hand and also used Italian blend of cheeses in place of the Mexican blend. My husband and I LOVED it and I plan to keep this and make it for family and friends. Thanks Kellly!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUTH ANN M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/801262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-13T18:58:39.153Z",
                "reviewBody": "Yum, Yum!  I also marinated this for about 30 minutes in 1 TBSP lime juice and 1/2 Cup salsa.  Then I used another 1/2 Cup salsa with the cheese mixture.  Also roasted the potatoes for about 25 minutes before I added the chicken.  It was really, really good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Pulley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/hkp123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-01T17:01:38.96Z",
                "reviewBody": "I'm changing my review to five stars I made again last night and it was so amazingly simple easy and delicious it deserves it! I don't make the chicken just the potatoes we just weren't thrilled with the chicken part the first time but these potatoes will be on the menu at least a few times a month. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELLENEJ22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1168691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-10T09:01:58.883Z",
                "reviewBody": "I made this again for the first time in about 5 years. I've up'ed it to a 5 and wanted to re-review but I see no way to just delete an old review so I'll just add to it. The original: I liked this as is. I didn't have Mexican cheese and used a combo of Jack mozarella & Colby. Otherwise it was made as is including temperature cooking times etc. And I thought the chicken was fine and unlike others the potatoes seemed to tend to overcook. Perhaps I cubed mine smaller? I made it a second time got lazy & didn't use the foil and it didn't turn out as well. I think potatoes do work well in foil. I liked that I could do everything in the oven and not cook anything ahead of time. New additional comments: This time I had a Mexican combo and that may have made a difference. I taste-tested and rather wondered why I'd even given it a 4 but it was much better as a whole put-together dish eating chicken & potatoes together. I think the butter is necessary both in terms of allowing the potatoes to get cooked (and I stirred them) and to make them tender. My oven temp is right on and I think these times work but big chunks vs cubed will take longer. It also doesn't specify a size for the potatoes and mine were probably about 5 oz give or take.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erimess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/erimess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-19T01:54:53.14Z",
                "reviewBody": "This is a family favorite. The only things I do differently is I make a little more sauce (salsa/cheese/cilantro) because we like it and I also add a can of corn which I spread over the chicken and potatoes. I've served it to company and they loved it as much as we do.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUNNYZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1182486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-12T03:14:35.387Z",
                "reviewBody": "I know everyone hates when people give less stars when they changed the recipe so I am giving it 5 stars even though I did make some changes. It was delicious and it doesn't have to be so unhealthy either. Here's what I did differently. I used about a pound of yukon gold potatoes tossed them with 1 tablespoon of extra virgin olive oil about 1/2 teaspoon of cumin and 1/2 teaspoon garlic salt. Then added about 3 tablespoons of chopped fresh cilantro. I followed the baking directions then added the chicken breasts about 1 pound total each breast half sliced in half again so they were thin. I melted 1 tablespoon of butter added about 2 tablespoons of cilantro and squeezed half a lime in. This I brushed on the chicken. Baked again. Took it all out poured 1/4 cup salsa over the chicken (cherry salsa yum!) then topped with about 1/4 cup of cheese...it doesn't need much because everything else makes it so good! With those changes it comes out to about 340 calories per serving (of 4) which is much better than the original. Perfect easy and fast to assemble.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nikkionwine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/justsupermom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-20T19:24:28.187Z",
                "reviewBody": "I will give this another try...should've read the reviews before making it. Definitely needed to marinate - the chicken was bland underneath the sauce. It was also rubbery b/c of the high temp cooking that took about 15 mins longer than stated. Next time I'll marinate and drop the oven temp after about 25 mins as another reviewer did. The lime flavor was refreshing! Such an easy recipe that it deserves a second chance!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Louise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ldouglas1996/"
                }
            }
        ]
    }
]