[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/203/meat-and-poultry/lamb/",
                    "name": "Lamb",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1021/meat-and-poultry/lamb/chops/",
                    "name": "Chops",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/74037/lamb-chops-with-balsamic-reduction/",
        "name": "Lamb Chops with Balsamic Reduction",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F31252.jpg",
            "width": 2832,
            "height": 2128
        },
        "datePublished": "2019-04-02T06:46:31.000Z",
        "description": "This recipe for lamb chops is a favorite in my house.  It is an easy and quick recipe for two people (we eat two chops each). Rosemary and thyme give it great flavor.  If you double the recipe, remember that the sauce will take longer to reduce.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "¾ teaspoon dried rosemary",
            "¼ teaspoon dried basil",
            "½ teaspoon dried thyme",
            "salt and pepper to taste",
            "4 lamb chops (3/4 inch thick)",
            "1 tablespoon olive oil",
            "¼ cup minced shallots",
            "⅓ cup aged balsamic vinegar",
            "¾ cup chicken broth",
            "1 tablespoon butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl or cup, mix together the rosemary, basil, thyme, salt and pepper. Rub this mixture onto the lamb chops on both sides. Place them on a plate, cover and set aside for 15 minutes to absorb the flavors.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large skillet over medium-high heat. Place lamb chops in the skillet, and cook for about 3 1/2 minutes per side for medium rare, or continue to cook to your desired doneness. Remove from the skillet, and keep warm on a serving platter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add shallots to the skillet, and cook for a few minutes, just until browned. Stir in vinegar, scraping any bits of lamb from the bottom of the skillet, then stir in the chicken broth. Continue to cook and stir over medium-high heat for about 5 minutes, until the sauce has reduced by half. If you don't, the sauce will be runny and not good. Remove from heat, and stir in the butter. Pour over the lamb chops, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Lamb",
            "Chops"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PGRAYMENDOZA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.761730652041438,
            "ratingCount": 1641,
            "itemReviewed": "Lamb Chops with Balsamic Reduction",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "254.5 calories",
            "carbohydrateContent": "5 g",
            "cholesterolContent": "63.9 mg",
            "fatContent": "19.3 g",
            "fiberContent": "0.2 g",
            "proteinContent": "14.6 g",
            "saturatedFatContent": "7.8 g",
            "servingSize": null,
            "sodiumContent": "70.4 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-12T22:29:27.453Z",
                "reviewBody": "A savory dish without garlic?!  Oh, the humanity!\n\nI set this precious dish on a bed of wild greens, avocado &  seasonal tomatoes with a whisper of bleu cheese.  An incomparable success!\n\nA glass of good red wine cleared the tongue, readying it for more, more, more!\n\n(added 05/12/07: Fry a sliced pear or two until golden brown after you fry the meat.  Pour the prepared vinegarette over both!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Scott Simmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1287563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-28T22:21:06.247Z",
                "reviewBody": "This is an excellent recipe for lamb. One of the few recipes here I've changed little to none. I see quite a few complaints on the reduction as being either too thin, or that there's too much left over. Make sure you give the sauce time to reduce(reductions are by no means quick), and know that the more surface area to your skillet, the less time it takes to reduce. Also, if you're trying to do this in a non stick pan, that might be the problem. Use good stainless steel as it is a great heat conductor, and also necessary to properly sear the lamb. I also see complaints about it tasting too \"vinegary\". If you reduce it properly and use high end balsamic vinegar, you should not have this problem. After all, there is no point to CHEAP balsamic vinegar, EVER.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EKW0801",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1901740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-27T05:54:28.217Z",
                "reviewBody": "This was my first time making lamb so I was more than a little nervous. I cannot believe how great this was! My husband kept making sounds after biting into it, \"Ooh, Ahhh,ummmm.....\" I would give it ten stars if I could. The lamb was great served on a bed of wild greens and the reduction sauce was perfect drizzled over everything including my rosemary baked potato wedges. It paired well with Nero D'avola's \"Romolo Buccellato\" (a red wine). An unsung hero of a wine, well worth the $8 we paid for it. Next time I'll try shallots instead of onions and I'll look for a nice warm deep mellow balsamic. I'm exciting about making it again, maybe even making it for a dinner party!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KITTEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-29T04:12:26.763Z",
                "reviewBody": "This was AMAZING! Keep in mind that you should use a GOOD quality balsamic in this recipe.  The stuff you buy for $3/bottle is fine for marinades or maybe dressings, but when using basamic as a foundation in a sauce, shoot for upper-end grocery store quality; or even better, swing by a gourmet shop for a high quality vinegar.  A recipe is only as good as the ingredients you use!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMANSAVAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-01T20:46:51.747Z",
                "reviewBody": "Delicious!  I followed this recipe very  closely.  I placed the rub on the chops a few hours before dinner.  Excellent flavor and aroma.  I doubled the sauce (& cooking time) and added just a pinch of flour to it near the end to thicken. Soooo tasty.  One tip for other lamb neophytes... the lamb chops i bought were the size of lollipops.  I didn't realize how small they were until I got home because the butcher wrapped them before I saw them.  They were very tender and tasty, but you would've needed at least twice the number of chops to satisfy.  So, check the size of the chops before you buy them and adjust accordingly.  I will absolutely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jayne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1507863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-29T18:46:31.06Z",
                "reviewBody": "I am attending culinary school and this meal was truly amazing and I have cooked alot of stuff! I did do a few changes after reading a few reviews. We are huge garlic fans in this house so I seared the lamb in fresh garlic. For the reduction, I reduced for about 17 minutes and added about 2 tbls of heavy whipping cream for some added flavor. I finished off with roasting red potatoes drizzled with olive oil, rosemary, fresh basil and thyme, crushed red pepper and pepper in the oven covered for 20 mins and uncovered for 20 at 405 degrees and green beans. This meal gets 10 stars! A sure favorite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TaylorGjerde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4108863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-20T23:32:43.45Z",
                "reviewBody": "I love Lamb, And this is a great recipe. I changed the herbs to Herbes de Provence and this time it was even better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PREDESTOGO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/191139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-27T17:56:35.53Z",
                "reviewBody": "BOY OH BOY! We had this last night. Super fantastic delicious recipe. We followed the recipe exactly with the exception of rubbing the chops with garlic (3 large cloves minced) then rubbed with the mixture. Then seared the chops in the skillet to get some of the marinade in the sauce. Then I finished the chops on the grill. Also doubled the sauce mixture and it took 20-25 min. to cook down, which is a must. I'm not a fan of any kind of vinegar, but this was great. Will make it again and again. Larry",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Norma Sorenson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1659986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-24T16:37:14.64Z",
                "reviewBody": "I have to admit that the whole reason I found this recipe was because I had a good bottle of aged balsamic vinegar that I wanted to try. I did an ingredient search and found this one and boy am I glad I did. I took another reviewer's comment about using any cut of meat and used pork tenderloin because I didn't have any lamb at home. Boy was this good! The blend of herbs and the reduction sauce were great! Of course because I changed the meat my cooking times were longer but everyone wanted more and said how good it tasted! Thank you soooooo much for the recipe!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Bezemes Walstrom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-18T18:18:48.53Z",
                "reviewBody": "Very disappointed the first two times I tried this; altered the recipe a bit and it was delicious! Use any cut of lamb (trim excess fat) Brown meat in skillet with a little onion garlic and OO. Remove lamb and add to pressure cooker with tray insert (use about 2 1/2 cups of water). Pressure cook the lamb for 20-23 minutes; turn off let cool 5-10 minutes naturally then cool pressure cooker in cold water. Remove lamb set aside and reserve stock/liquid for the reduction sauce! In a ziploc bag measure 2 generous Tbl. Rosemary and crush really well - then add 1 heaping Tbl. Thyme and 1 scant Tbl. Basil - salt and pepper to taste. Shake the seasonings until well blended. Place the lamb one piece at a time in the ziploc bag and coat evenly with spices - set on a foil lined cookie sheet. Place lamb in the broiler for 5-7 minutes; remove & set aside. Reduction sauce: needs to be doubled! I altered the ingredients/amounts for optimal flavor. 1 1/2 T Olive oil 1/2 cup finely chopped onion 2 cloves minced garlic 1/2 cup balsamic vinegar (make sure to use real good quality balsamic vinegar; the ingredients should not say 'red wine vinegar'!!) 1 T unpacked brown sugar (helps mellow the bold vinegar flavor) 1 1/2 c. lamb stock (reserved from the pressure cooker) 3 T butter Use the skillet the meat browned in; follow the directions for preparing the sauce. Reduce the sauce properly!!! Place the lamb in the sauce & allow meat to mingle for 5 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Lamb Chops with Balsamic Reduction",
            "description": "Tasty lamb chops are cooked on the stovetop with a tasty balsamic sauce.",
            "uploadDate": "2013-03-26T23:07:07.296Z",
            "duration": "PT3M19.825S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa7a70ab5-30a5-412f-b127-de87a23a8f8c%2F5c3b4880-bff4-4f8c-9743-d38711578721%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2255584418001"
        }
    }
]