[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76330/pro-ganache/",
        "name": "Pro Ganache",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F584947.jpg",
            "width": 2856,
            "height": 2142
        },
        "datePublished": "2019-04-02T06:46:43.000Z",
        "description": "Ganache recipe used in many bakeshops. This can be stored in the refrigerator for up to two weeks, or about 3 days at room temperature.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H15M",
        "recipeYield": "4 cups",
        "recipeIngredient": [
            "2 cups semisweet chocolate chips",
            "2 cups heavy cream",
            "2 teaspoons vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chocolate chips in a large bowl, or in the bowl of a stand mixer. Pour the cream into a saucepan, and bring to a boil. As soon as the cream boils up to the top of the pan, quickly remove it from the heat, and pour it over the chips. Let stand for a minute or two, then stir with a whisk, or use the paddle attachment for the mixer, to mix until smooth. Be sure to scrape the bottom of the bowl occasionally. Stir in the vanilla until well blended. Place a piece of plastic wrap directly on the surface, and allow to cool at room temperature, or in the refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "PASTRYCHICK101"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.454545454545454,
            "ratingCount": 143,
            "itemReviewed": "Pro Ganache",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "102.4 calories",
            "carbohydrateContent": "7.1 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "8.7 g",
            "fiberContent": "0.6 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": "5.3 g",
            "servingSize": null,
            "sodiumContent": "6.8 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-26T17:38:25.047Z",
                "reviewBody": "Ganache recipes can vary greatly in chocolate to cream ratios - this version falls somewhere in the middle and is great! I like to simplify the process by chopping the chips in my food processor until they resemble fine crumbs. Then I heat the cream in a heavy bottomed saucepan until it just starts to bubble around the edges, pour the hot cream down the feed tube of the food processor, add the vanilla and give it a whirl... in seconds you have wonderful ganache. I should mention that chocolate chips contain stabilizers that allow them to keep their shape while they are warm, and those stabilizers don't melt down smoothly like chocolate does, so for a smoother finished product, I strain the warm ganache through a fine mesh strainer (this is not a necessary step, but will give more professional results). Use this ganache warm as a pourable glaze, let it cool to room temp (over night) and use like a standard frosting, or chill until firm and whip with a heavy stand mixer until it's lighter in color and spreadable. You can even use this ganache to make authentic chocolate truffles - just roll the chilled ganache (unwhipped) into balls and coat with cocoa powder, chopped nuts, or whatever. By the way, I used this recipe to cover a chocolate wedding cake and it turned out wonderfully! One more hint: if you use this ganache to \"frost\" a cake, but be sure to bring the cake to room temperature before cutting (using a hot knife). You'll love this extremely versatile and tasty recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRINCIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/885183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-18T19:48:37.18Z",
                "reviewBody": "Normally I insist on using a good quality chocolate for ganache but today I just threw a doctored up cake mix together quickly and thought this chocolate chip version would be \"good enough.\"  To my surprise, it was better than just \"good enough\" and I was pleased to glaze my cake with it.  (And I even forgot to add the vanilla!)  I chilled it just long enough to make it of thick pouring consistency so that it adhered to the cake nicely without most of it running  off.  I had quite a bit left over, so I just refrigerated it for another time.  Maybe I'll melt it again and use it as a glaze for cupcakes, or a fudgy topping for cheesecake.  Or maybe I'll let it come to room temperature and whip the heck out of it for a fluffier frosting.  Or maybe I'll heat it up and pour it over ice cream, or stir some into hot milk, or....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T23:11:26.16Z",
                "reviewBody": "I cooked this a day ahead of time and put it in the fridge overnight.  To get the ganache to a pourable state, I let it get to room temperature then put the glass bowl I had it in over a pot of simmering water to 're-melt' it.  It was perfect.  I poured it over a layered ice cream cake I made for a birthday and they were very impressed.   Delish!  =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOODLVR31",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1356678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T18:41:37.18Z",
                "reviewBody": "This was excellent. I always wanted to make this and I really loved it. It was different to work with you can put it in between layers or use as a rich icing. It left such a nice shine on the cakes. I had enough to cover a 3 layer cake and a small heart cake. It had a flavor that was divine. Everyone was very impressed with this cake already requesting it for special occasions. I wanted to make something very special for my nephews 16th birthday. I made a 3 layer cake 2 layers were a yellow butter cake and the middle layer was chocolate. I put a vanilla butter cream between 2 layers and a chocolate butter cream between the other 2 layers. Covered the entire cake with the ganache then made a whipped cream for the top sprinkled it with chocolate shavings and ground almonds. I believe it was my best work thus far. Thanks for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Coco",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/918615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-10T20:48:27.263Z",
                "reviewBody": "The Pro Ganache was not very Pro in my book. I used it to pour on a cake and the icing was both thin (I did not overheat it), and it cracked which made it look not very \"Pro\". I followed the recipe exactly and used good quality Ghiradelli chocolate chips. I'll keep looking for a good ganache recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "REDJEN323",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1393861/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-27T20:32:52.28Z",
                "reviewBody": "I made this recipe the first time and felt it wasn't quite the flavor I was happy with. Then I made it again did half semi-sweet chocolate and have milk chocolate and it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tina Andre' Fox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-24T17:28:41.903Z",
                "reviewBody": "This recipe worked very well for me. I did only a half batch, because I was just pouring it on a small oatmeal cake. I used a little different tecnique then this recipe recomended. I put the whipping cream and vanilla in a sauce pan over med heat. I then added my choc. and just stirred it untill it was all melted. Brought it to a slight boil over med/high heat, and then poured it directly over my cake, and sprinkled it with flaked coconut. Very yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsey Wolnowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-19T04:04:48.43Z",
                "reviewBody": "One of my favourite things about this recipe is that it's so easy to scale it. I quarter it and get a perfect amount for one 8 or 9 inch cake. I also use half milk chocolate melts and half good quality non-baking chocolate usually Lindt 70% cocoa chocolate. This is a delicious and versatile recipe that I use all the time. Can't recommend it highly enough!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2591664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-21T02:47:23.45Z",
                "reviewBody": "This stuff is incredible. Whipped a bit - you can keep it in the fridge and serve it as chocolate pots. My family can't stay out of it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PROSEDIVA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/547118/"
                }
            }
        ]
    }
]