[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76778/slow-cook-thai-chicken/",
        "name": "Slow Cook Thai Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F572192.jpg",
            "width": 2856,
            "height": 2142
        },
        "datePublished": "2019-04-02T06:46:45.000Z",
        "description": "Slow cooked chicken breasts in a rich, peanutty, slightly spicy sauce.  Serve over rice.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H20M",
        "recipeYield": "6 Servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves - cut into 1/2 inch strips",
            "1 large red bell pepper, seeded and sliced into strips",
            "1 large onion, coarsely chopped",
            "½ cup chicken broth",
            "¼ cup soy sauce",
            "1 tablespoon ground cumin",
            "3 cloves garlic, minced",
            "½ teaspoon red pepper flakes",
            "salt and pepper to taste",
            "2 tablespoons cornstarch",
            "⅔ cup creamy peanut butter",
            "1 tablespoon soy sauce",
            "¼ cup lime juice",
            "3 green onion, chopped",
            "¼ cup chopped fresh cilantro",
            "½ cup chopped roasted peanuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken breast strips, bell pepper and onion into a slow cooker. Pour in the chicken broth and 1/4 cup of soy sauce, then season with cumin, garlic, red pepper flakes, salt and pepper. Stir to blend, then cover and cook on Low for 4 1/2 to 5 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove 1 cup of the liquid from the slow cooker, and mix this with the cornstarch, peanut butter, 1 tablespoon of soy sauce and lime juice. This should blend into a fairly thick sauce. Stir the sauce back into the slow cooker, and place the lid on the pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on High for 30 minutes. Garnish with green onions, cilantro and peanuts before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "DELTAQUEEN50"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.798941798941799,
            "ratingCount": 378,
            "itemReviewed": "Slow Cook Thai Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "408.2 calories",
            "carbohydrateContent": "18.3 g",
            "cholesterolContent": "61.2 mg",
            "fatContent": "23.3 g",
            "fiberContent": "4.3 g",
            "proteinContent": "35 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "1118.5 mg",
            "sugarContent": "6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-23T16:20:22.95Z",
                "reviewBody": "Unusual dish! After reading the many conflicting reviews I had to make it. I followed others suggestions and cut the cumin down to 1/2 tbsp. and peanut butter to 1/2 cup.  I also added extra soy sauce.  I thought it was very good and was not put off by the scent or color.  Afterall, it is a peanut butter based sauce. I did add additonal steamed veggies as we are low carb people and avoid rice.  Will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lkatperson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1921574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-05T19:59:07.513Z",
                "reviewBody": "I don't know if she's right, but my momma said, \"Thai don't have crockpots, and they don't slow cook\" - I should have heeded her warning.\n\nThe recipe strikes me as a dummied down peanut satay.  A more authentic recipe would shish kebab the meat, wouldn't use onions at all (after 5 hours, they melt and make the sauce taste funny), nor bell pepper (contributes no flavor but also melts) and would use coconut milk instead of chicken stock.\n\nThen there's the weirdness in the recipe - you put 3/4 C of fluid along with the chicken in a crockpot, and 5 hours later it's magically the 1 C to be used in step 2?  Huh?\n\nWhen I discovered how much I didn't like this dish, I separated the chicken, rinsed it out in a colander, and added my own sauce.  This recipe became just a bad memory.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "andrewfairley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1728276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-18T05:32:37.217Z",
                "reviewBody": "What a tasty dish! As per others' suggestions, I increased the chicken broth to 1 cup; decreased the peanut butter to 1/2 cup, the cumin to 2 tsps, and the crushed pepper to 1/4 tsp (not a big fan of \"hot\"); and added 1/2 tsp. curry powder. Other than that, I followed the recipe. I found 4-1/2 hours of initial cooking time to be perfect. The sauce was just right, not too spicy, but rich and flavorful, and with a nice consistency that was thick enough to spoon over spaghetti noodles (my substitute for Thai noodles) without being runny. I also disagree with those who said it didn't look appetizing. I sliced the red bell pepper into strips, and they added a nice confetti-like color along with the bright green cilantro garnish. All in all, a winner in my book!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RCKim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/972222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-26T20:04:39.89Z",
                "reviewBody": "This was very very good, The Chicken Satay is one of my favorites... I love how people change things and then say oh I didn't like this.... Read it first, if you don't like that kind of food don't eat it... I use my Crock Pot for EVERYTHING I can,I even convert alot of things which is very easy to do and they have instructions for that too,... It is very much a time saver for me and being disabled it helps out alot as I can not stand a long time or keep bending...Great flavor and if they want they can skewer the meat after and gee maybe throw it under a broiler for 3 min or so to get a little crispy.... Be inventive people and just because you make changes don't need to be rude about it, after all we all tend to change to our own taste...Thanks for a wonderful recipe great taste and wonderfully easy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TerriC511",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1877407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-23T21:18:33.96Z",
                "reviewBody": "I was very disappointed in the nature of some of the reviews.  It does not take an expert cook to read a recipe and know you may not like it based on your personal tastes. This is a recipe exchange community not one for bashing food critic wannabes. First I would recommend as I do with ALL crockpot meat recipes...brown your meat first.  Add veggies mid way through and chop them fairly large.  I also added carrots, peas and celery.  I would say there is one thing missing that would make it great.  I am thinking ginger paste but didn't have any on hand.  Also the lime juice is a must.  My family loved it and as other reviewers said, don't skimp on the garnish.  Thank you for sharing and please ignore the ignorance in some of the reviews.  Please ALL let's keep  site reviews as what works, what doesn't and no matter what be grateful for the those who take the time to share their recipes, without them we wouldn't have such a great site to visit for new ideas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2768717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-15T04:52:55.31Z",
                "reviewBody": "I tried this recipe mostly out of curiosity and because I already had everything on hand. I'm not sure if this is authentic or not (have never eaten Thai food) but it sure was good! I used natural crunchy peanut butter and omitted the chopped peanuts at the end. After adding the cornstarch I let it cook about 50 minutes (waiting for my brown rice to cook) and it got a little too thick. So next time I would do only 1 TBS cornstarch in and not let it cook as long. I only put in about half of the red pepper flakes. My kids (a one-year old and three-year old) loved this and ate tons of it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-30T13:15:16.75Z",
                "reviewBody": "This was the best recipe for the slow cooker I have found yet (I've only had it one month). It tasted like a restaurant made it. I did use less peanut butter than it called for (only 1/2 cup) and it worked out fine. I made the change for calorie reasons. It's spicy and great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunshination",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/993216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-19T17:02:52.077Z",
                "reviewBody": "I found this very tasty - OK not as fabulous as at a Thai gourmet restaurant but it's a crock pot recipe for goodness sakes! The KEY is not to omit the garnishes (cilantro peanuts and green onions) and I added a lot of additional lime after I dished up each serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1905221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-10T23:56:01.997Z",
                "reviewBody": "Different and delicious. I even prepared additional meals in large gallon freezer bags. Now I just pull out a freezer bag and cook it on slow for 10 hours following step 4 on the day of cooking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kevinsmommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1294536/"
                }
            }
        ]
    }
]