[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77008/rosemary-scented-pork-loin-stuffed-with-roasted-garlic-dried-apricots-and-cranberries-and-port-wine-pan-sauce/",
        "name": "Rosemary-Scented Pork Loin Stuffed With Roasted Garlic, Dried Apricots and Cranberries and Port Wine Pan Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F545020.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:46:49.000Z",
        "description": "Pork loin roast - good-looking, lean, and attractively priced (under $25) - makes a memorable, no-fuss meal for holiday entertaining.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "3 tablespoons olive oil",
            "16 whole peeled garlic cloves",
            "2 tablespoons minced garlic cloves ",
            "1 (8 pound) whole boneless pork loin, patted dry, at room temperature",
            "Salt and freshly ground pepper",
            "3 tablespoons minced fresh rosemary (snip with scissors), divided",
            "16 dried apricots (or similar amount of your favorite dried fruit)",
            "⅓ cup dried cranberries",
            "¼ cup apple jelly",
            "¼ cup port",
            "½ cup chicken broth",
            "2 tablespoons apple jelly",
            "2 teaspoons cornstarch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Adjust oven rack to upper-middle position and heat oven to 250 degrees. Heat oil in a small skillet over medium-low heat. Add whole garlic cloves and cook, stirring occasionally, until soft and golden, about 5 minutes. Remove with a slotted spoon; reserve oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn pork loin fat-side down. Slit lengthwise, almost but not quite all the way through, to form a long pocket, leaving a 1/2-inch border of unslit meat at each end. Brush cavity with some of the reserved garlic cooking oil, and sprinkle generously with salt and pepper and 1 Tb. of the rosemary. Line cavity with sauteed garlic and apricots; sprinkle in cranberries. Tie loin together with kitchen twine or heavy-duty string at 1 1/2-inch intervals.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush with remaining oil, and sprinkle generously with salt and pepper. Set roast, fat-side up, diagonally or curved (so it fits) on a large, lipped cookie sheet or jellyroll pan. Warm 1/4 cup apple jelly along with the minced garlic and remaining rosemary. Brush mixture onto meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast until a meat thermometer stuck into the center registers 125 to 130 degrees. (Start checking at about 1 1/2 hours.) Remove from oven; raise oven temperature to 400 degrees. Brush loin with pan drippings, return to oven, and continue to roast until the loin is golden brown and a meat thermometer stuck into the center registers 145 degrees F (63 degrees C), about 20 minutes longer. For even more attractive coloring, broil until spotty brown, 3 to 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let roast rest 15 to 20 minutes; transfer to a carving board. Stir juices around pan to loosen brown bits. Pour through a strainer into a small pan, and stir in port, chicken broth and remaining 2 Tbs. of jelly; bring to a simmer. Mix cornstarch with a couple of tablespoons of cold water; whisk into sauce. Simmer until lightly thickened. Slice pork and serve with a little sauce.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ben S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.770833333333333,
            "ratingCount": 240,
            "itemReviewed": "Rosemary-Scented Pork Loin Stuffed With Roasted Garlic, Dried Apricots and Cranberries and Port Wine Pan Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "365.9 calories",
            "carbohydrateContent": "15.3 g",
            "cholesterolContent": "109 mg",
            "fatContent": "15.6 g",
            "fiberContent": "1 g",
            "proteinContent": "39.1 g",
            "saturatedFatContent": "5.1 g",
            "servingSize": null,
            "sodiumContent": "225.4 mg",
            "sugarContent": "11.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-27T16:30:35.97Z",
                "reviewBody": "This pork roast is absolutely awesome!  Here's what I did a bit differently:  we were serving 6 guests so cut the whole pork roast in half but used the full recipe for the stuffing.  Timing was perfect but did take out of the oven  at 150 as I figured it would still cook.    Moist, tender and perfect.  The Port Wine gravy was delicious.  Served with pureee of Sweet potatoes and roasted onions with balsamic vinegar and it was a wonderful accompaniment.  Be sure the meat therm. is placed into the pork and NOT the dressing.  Although the recipe said to baste with the pan dripping, there were none -- only burnt pieces on the cookie sheet.   As the pork was setting, I added the   juices from the pork  to the gravy.  Do try -- it got rave reviews from our guests but be careful not to overcook as a friend did.  Take it out at 150 to rest!  I will definitely make this over and over again.  Cheap, delicious meal!  For those who  wish to cook at 350, I think the very slow cooking time is what gives it the flavor and tenderness.  The timing really does work as boosting the  temperature up to 400 makes it nice and brown and taking  it out of the oven at 150 is perfect as it sets for a while.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATHEFLIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-11-28T21:37:53.163Z",
                "reviewBody": "Thought I would try something different than turkey for Thanksgiving...WOW!  This recipe was great and easy to prepare.  The sauce with port wine was gone before I knew what happened. I took the roast to an internal temp. of 155 and it needed another 10 minutes in the oven; roast was moist and everyone loved it.  UPDATE: Since my first review I have now doubled the gravy/sauce because everyone loves it.  Also, 1/2 way through the cooking I added some chicken stock to the pan so the drippings did not burn or stick to the pan; this made it very easy to scrape the pan for the gravy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUILTRESS1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/662077/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-29T12:25:35.22Z",
                "reviewBody": "Sophisticated & soooo flavorful!  Not too difficult to prepare either.  I used a 3lb pork loin (rib section) & baked at 350 degrees for about 1 1/2 hours.  I broiled it at the end for a few minutes.  Perfect presentation & texture.  I used the same amount of ingredients from the original recipe (8lbs pork loin) & doubled the sauce at the end.  Way more than enough for two people.  Plenty of leftovers, which we plan to have tonight :)  Definately give this a try.\n\nA good trick - add some chicken stock to the bottom of the pan every twenty minutes or so & stir w/the drippings.  It'll keep the bits from burning & you'll have plenty of \"drippings\" to make the sauce.  Great when you want to double the sauce.  Also, baste the roast each time you add the stock.  It keeps it moist and flavorful :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jayne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1507863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-23T18:50:00.217Z",
                "reviewBody": "A fabulous recipe!  I made this for a large dinner party and wanted to save some time, so I stuffed the loin the night before.  I think doing this allowed the garlic and rosemary flavors to completely permeate the entire body of the roast.  It was a complete success, and quite beautiful as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONTANADAISY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/903281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-27T19:48:33.753Z",
                "reviewBody": "I served this for Christmas, and it was fabulous!!  I used a 4 pound pork loin to serve 8 people, and it was beautifully browned once done.  The only change I would suggest is instead of using whole garlic cloves to stuff it with, coarsely chop the garlic before cooking it in the olive oil, until soft.  Then, use the smaller pieces to stuff the loin along with the apricots (also coarsely chopped) and cranberries.  The pan sauce is amazing with the pork, and especially good on roasted garlic mashed potatoes.  This was yummy, my entire family raved about it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-06T20:16:19.673Z",
                "reviewBody": "4.5 stars for the recipe itself but 5 stars for taste. This was delicious and made the house smell so good while it was cooking. It was also not difficult to prepare especially for what I would call a \"special occasion\" dish. My only complaint is that the temperature and cook time did not seem to make sense. 250 degrees seemed really low to me as I have always roasted a tenderloin at 350 before but I decided to follow the recipe to the T at least the first time around. I scaled the recipe for a 2.5 pound roast- I plan to make the full scale 8 pound version for Christmas but wanted to do a trial run and I'm glad I did! Anyhow just as I suspected the roast was nowhere near done when I went to check it and baste it as the recipe calls for. In fact it was barely browned on the bottom while the rest was still raw. At that point I increased the temperature to 350 for the rest of the time and it turned out fine. I am not sure if it matters that I used a smaller roast. Other than that it was absolutely delish different and impressive looking! YUM! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angel771",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1565569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-25T23:53:29Z",
                "reviewBody": "excellent outstanding and superb! we had this for christmas eve dinner with my parents and we all agreed that this recipe has won a special place in our family's traditional holiday recipes. i had no trouble with the cooking time. i thought i might but it came out wonderful. the pan drippings were even a little bit over done. i did use a much smaller roast about a 3 lb. i will be making this meal again in about two weeks when my brother comes in for a visit. next time i'll stuff the roast more and definitely make more sauce. i served this with a caprese salad the recommended roasted onions and mashed potatoes. one last thought the meal wasn't too heavy and didn't sit like a brick in my stomach like a lot of holiday meals tend to do. best christmas eve ever! 1/14/06 i made this again for a visit from my brother his family and my grandmother and her husband. everyone raved (even the skeptics). this time i used 2 3lb. roasts and still the cooking time worked perfectly. we thought we might have leftovers didn't happen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BEAUANDLILYSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1437331/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-18T14:20:41.67Z",
                "reviewBody": "I agree- you need to change the temperature. A 6lb roast will take about 1 1/4-1 1/2 hrs at 325. Use a working meat thermometer to check for doneness at 155-160. It is a beautiful presentation! I used dried apples instead of apricots and also dried cherries(yum). My sauce did not come out \"saucy\" but more \"brothy\" but it tasted good and I agree it should be doubled to have enough. I will make this again! Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MHBMHB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1319052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-22T14:00:14.67Z",
                "reviewBody": "I made this last night and it was the best pork roast! Very moist. My family wasn't wild about apricots but they still ate it. I was wondering about using chopped tart apple instead...Had a 5 lb roast and roasted it @ 350 for 1 hour 10 min then 400 for 20 min. Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ASHBYKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T19:08:39.217Z",
                "reviewBody": "It was ok. Really fruity. I thought it would be exotic and interesting and I guess it was- but not something I'd do again. Noone touched the leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KissTheChefette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2673754/"
                }
            }
        ]
    }
]