[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17656/main-dish/beef/salisbury-steak/",
                    "name": "Salisbury Steak Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77927/poor-mans-hamburger-steaks/",
        "name": "Poor Man's Hamburger Steaks",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F232653.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:46:54.000Z",
        "description": "An old fashioned hamburger steak recipe topped with cream of mushroom. Serve with some warm mashed potatoes and your favorite green vegetable. Our family loves this. Makes a great cheap meal!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 pounds ground beef",
            "25 saltine crackers, crushed",
            "1 cup milk",
            "½ teaspoon black pepper",
            "½ teaspoon salt",
            "½ teaspoon garlic powder",
            "½ teaspoon Italian seasoning",
            "3 (10.75 ounce) cans  condensed cream of mushroom soup",
            "1 (8 ounce) can mushrooms, drained"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the ground beef, crackers, milk, pepper, salt, garlic powder, and Italian seasoning. Form 6 or 8 large beef patties, and place in a 9x13 inch baking dish, or other shallow casserole dish. Pour the condensed soup evenly over the top of the patties, and sprinkle canned mushrooms over the top. Cover the pan with a lid or aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for about 45 minutes in the preheated oven, or until beef patties are well done.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Salisbury Steak Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "RHONDA35"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.395604395604396,
            "ratingCount": 182,
            "itemReviewed": "Poor Man's Hamburger Steaks",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "693.3 calories",
            "carbohydrateContent": "23.3 g",
            "cholesterolContent": "142.5 mg",
            "fatContent": "46.6 g",
            "fiberContent": "1.4 g",
            "proteinContent": "43.2 g",
            "saturatedFatContent": "16.7 g",
            "servingSize": null,
            "sodiumContent": "1618.4 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-23T02:18:06.017Z",
                "reviewBody": "After reading all of the reviews and following some of the other reviewers' tips, we ended up eating a delicious meal using this recipe. I made the burger patties exactly as written, but after forming them I put them in a 425 degree oven for 10 minutes on each side to bake off a good deal of the grease. While they were baking I sauteed two large, sliced onions with a teaspoon of minced garlic in two tablespoons of butter until the onions were soft. To the onions I added the three cans of Cream of Mushroom soup (used fat-free), two soup cans of water, two beef boullion cubes, and enough Kitchen Bouquet (probably about 1/2 to 1 teaspoon)to darken the gravy/sauce mixture; I let this simmer over low heat until all of the meat patties were browned. Then I drained the grease from the browning pan, wiped the pan clean, put the meat patties back into the pan on top of a bit of the gravy/sauce, and poured the rest on top of the meat. Reset the oven to 350, covered the pan with foil, and baked for one hour more. This was delicious; lots of flavor and the patties were very moist. We put the gravy/sauce on top of mashed potatoes, and also had fresh, lightly steamed broccoli on the side. Thank you for this recipe...my husband and son went crazy over this (husband ate three meat patties, son ate two)! I used the entire three pounds of ground beef and ended up with a total of 12 patties. So glad I don't have to cook tomorrow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEXI, JACK and COOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1361959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-14T12:33:14.327Z",
                "reviewBody": "I scaled this down to one pound of 'burger and two cans of soup. Instead of making seperate patties, I covered the bottom of the dish with the hamburger, cooked 10 minutes @ 350 degrees, poured off the grease then cut the meat into six seperated sections before pouring the mushroom soup over the top then I put on the canned mushrooms. I made this just like the recipe called for with the exception of getting rid of a LOT of grease before puting the soup on. You can also make this with tater tots inbeded in the soup before putting it in the oven for 45 minutes.  If you want to put the tater tots on, don't put the foil cover on. Very easy, very quick and very tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ROOKIE COOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1054472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-01T00:48:47.777Z",
                "reviewBody": "I will never forget when one of my high school friend's mother made this when I spent the night. Loved it, came home raving about it, and finally got my mother to make it. Still make it to this day. Great comfort food!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-24T20:03:30.4Z",
                "reviewBody": "Very yummy-- I scaled this down to 1 lb of beef and 1 can of cream of mushroom. I left out the milk and used an egg instead to help hold the patties together. I also seasoned the patties with onion powder and seasoned salt instead of garlic powder and italian seasoning. Following the advice of another reviewer, I first browned the patties at 425 for 10 minutes a side and then poured off the grease (glad I did- it was the cheap stuff, so there was plenty to pour off). While doing that, I sauted half an onion and a clove of garlic, then added the cream of mushroom and about 2/3 can of water and let that simmer until the patties were done browning. After pouring off the grease, I added the gravy mixture to the patties, covered with foil, and baked at 350 for another 25 minutes. It was GREAT. Served with mashed potatoes and black eyed peas-- a good cheap meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RomeLover85",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3040759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-19T12:06:58.49Z",
                "reviewBody": "I did not care for this recipe. Seeing how A/R came and edited my review, I guess you can't be specific as to WHY you did not care for a recipe. I'll say it again. Recipe as written, turned out greasy and unappealing. Better read the reviews that changed this one around before trying, that's all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MakeItWork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/makeitwork/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-13T04:10:53.47Z",
                "reviewBody": "I found that the meat was a bit mushy the first time I did it ( following the recipe) so the next time I only added half the milk and and only half the crackers I also added some misses dask garlic and herb seasoning. And to the soup I mixed it with a pack of brown mushroom gravy mix and 1 1/2 cups of water then I pored the gravy mixture over the patties. It came out great and my family ate right up!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee Lynn Powers Swindells",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2793891/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T13:31:22.767Z",
                "reviewBody": "I thought this was really good!  My changes were, omitting the milk (I forgot it, and I'm not sure how it helps the dish anyway) and to the mushroom soup I added worchestershire, a teaspoon of onion powder, beef bouillion and a few pepper flakes.  It was very flavorful and I think I liked it better than some of the salisbury steak recipes from this site.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Graden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1056521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T18:58:34.693Z",
                "reviewBody": "This was allright. Nothing special but decent nonetheless. Both my hubs & I agree that Anne Marie Sweden's hamburger steaks w/ onions & gravy is FAR superior to this recipe (these \"steaks\" were too bland for our liking). Yes the two are different but only slightly so - the gravy here is mushroom based & Anne Marie's gravy is just a basic (but SUPER flavorful) brown gravy. As many others have done I too made several changes. W/o them I'm afraid I would have liked this even less. Keep in mind that I only made 1/3 of this recipe (4 steaks) since I was feeding 2 people. I set my oven to 425 degrees baked my steaks for 10 min. per side reduced the oven temp. to 350 drained all grease & then proceeded as directed. My other changes were to saute a sm. (sliced) yellow onion & a t of minced garlic in 1 T butter until softened / fragrant top my steaks w/ the mixture add a.75 oz. packet of McCormick brand brown gravy mix & 1.5 c. H2O to my can of condensed cream of mushroom soup & pour over all. After I took everything out of the oven I noticed my gravy hadn't thickened (I worried about adding so much H2O but it was too late to do anything about it). To fix the issue I mixed 1 T cornstarch w/ 1 T cold H2O poured my gravy into a sm. saucepan added the cornstarch slurry & brought to a slight boil to thicken. Perfect! Served w/ garlic mashed potatoes & corn this was an \"OK\" meal but not one I'd repeat again. Thanks anyways RHONDA!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-10T00:08:57.09Z",
                "reviewBody": "Crackers instead of bread crumbs? That is genius!! I don't know why I didn't think of it before. My family really enjoyed this and my picky 11 yr old son even asked for more! I added one egg to the meat mixture and after I formed the patties I dusted each with flour. I used 2 cans of cream of mushroom soup mixed it with evaporated milk and poured over each patty. They were delicious! Served it with a salad mashed potatoes and ranch style beans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LoriJeannine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lorijeannine/"
                }
            }
        ]
    }
]