[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/78493/mock-chicken-fried-steak/",
        "name": "Mock Chicken Fried Steak",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F678082.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:46:58.000Z",
        "description": "I'm not sure where my mom got this recipe, but she used to make it at least once a month. Although she never served it with gravy, I think peppered gravy would go great with this.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 pound ground beef",
            "2 teaspoons chopped fresh parsley",
            "1 tablespoon chili powder",
            "1 teaspoon salt",
            "1 egg",
            "2 cups crushed saltine crackers, divided",
            "½ cup oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the ground beef, parsley, chili powder, salt, egg, and 1 cup of crushed saltine crackers. Form into 6 balls, then flatten into patties. Coat patties with remaining cracker crumbs, and place them on a plate. Refrigerate for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium heat. Fry patties for about 7 minutes per side, or until the centers are well done and the outside is golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "OMEGAJASMINE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.343434343434343,
            "ratingCount": 198,
            "itemReviewed": "Mock Chicken Fried Steak",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "412.3 calories",
            "carbohydrateContent": "17.4 g",
            "cholesterolContent": "77 mg",
            "fatContent": "30.9 g",
            "fiberContent": "1.2 g",
            "proteinContent": "16 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "706.6 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-04T16:04:27.773Z",
                "reviewBody": "This looks alot like the recipe I use. Only I use Italian bread crumbs, a little in the meat and to coat, instead of the cracker crumbs. I also use two eggs and one grated carrot in the meat to keep it from getting too dry. The kicker is that I don't fry them in oil I just put them in the oven on 380 for about 35 min. This is a much healthier version. Served with ketchup or gravy, either is good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "liesh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2534167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-27T04:01:47.467Z",
                "reviewBody": "Delicious with mashed potatoes and country gravy!  Only complaint - the patties didn't need to be cooked 7 minutes on each side, mine were definitely a bit overdone.  The crackers give a nice crispy coating.  I used the Lipton Beefy Onion soup mix instead of chili powder, and it was great.  Absolutely one of our new regulars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THELAWRENCES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-05T23:53:41.883Z",
                "reviewBody": "This is soooo good! I did make a couple of changes. I brushed the patties with egg and then pressed the cracker crumbs in. Like others I had to keep cleaning out the skillet to get rid of burnt breading. Kept done ones on a rack on a cookie sheet in the oven at 300F while cooking the rest to keep warm. I used two eggs in the meat mixture. Did not need to be cooked 7 minutes... only until nicely browned. I made up a packet of Country Gravy and had mashed potatoes and corn. True comfort food! Will definately make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth A May",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1774790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-01T20:51:14.757Z",
                "reviewBody": "My husband loves these.  He calls them \"hamburger steaks\".  I get a package of hamburger patties already made up, which are pretty thick, season them them garlic powder, onion powder, steak seasoning, and pepper.   Cover them with flour, dip in mixture of egg and buttermilk, put them back in the flour and cook covered on medium heat till done.  About 4-5 min on each side.  Then I scrape the bottom of the iron skillet to get all the goodies off, drain all but about 2-3 tablespoons of oil, then add about 3-4 tablespoons of flour, cooking till brown, then I mix up a cup of milk and half a cup of water together and add it a little at a time till I get a thick gravy.  Pour over the steaks and serve with garlic mashed potatoes and veggie.  One delish meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lavonda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4625450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-06T15:50:34.363Z",
                "reviewBody": "I really get a kick out of \"mock\" anything, but I must admit I was kind of surprised at how close this came to real chicken fried steak!  I used ground turkey instead of beef, but in every other way I followed the recipe to the letter.  The chili powder is definitely noticeable, but since we like chili powder that was no problem.  And I actually think it's the combination of the chili powder and the saltines that makes this so steak-like.  I used a nonstick pan with a light coat of olive oil, and fried them on 7 minutes for the first side and 5 for the second (covered so that the meat would \"bake\" while it fried).  I served it with brown rice and a mushroom cream gravy - very tasty!  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ZeldaSayre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/102702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-12T02:34:48.057Z",
                "reviewBody": "DELICIOUS!!! I'm currently living overseas and finding certain spices is nearly impossible... chili powder included so I didn't use any. I used extra parsley instead. Aside from that one tweak everything else was done by the book. I served with mashed potatoes and glazed carrots. I also used the drippings to make a basic gravy that you typically find being served with chicken fried steak. The ingredients are simple the preparation is simple and the cooking part is simple... no complaints from me at all. This recipe definitely gets 5 stars from me! Thanks. =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lonnarific",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-20T19:41:56.13Z",
                "reviewBody": "All 3 of my kids loved this--a rare feat in our household! I substituted ground turkey for the beef & added a packet of onion soup mix. I also needed more than 1 cup of crushed crackers to coat the patties maybe because of the texture of the turkey. Served w/mashed potatoes & country gravy. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marcy McClure Mock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1992745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-06T02:10:22.657Z",
                "reviewBody": "Very good and easy.\nI too did not use the chili powder, but used some dry onion mix(I get mine from the bulk store).\nDon't need near the amout of saltine's listed. I wasted a lot.  Maybe 1/2 to 3/4 cup in the meat and then another 1/2 cup to coat.  I did not put in any salt, but did add pepper.  Loved the crunchy coating.  Also used very little oil to cook.  Just cook a bit more slowly so it doesn't burn.  Healthier that way.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "koigal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2339154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-15T17:15:18.483Z",
                "reviewBody": "This was a nice change of pace from tacos and burgers but I think it needs some changes. As written the chili powder is overwhelming and the crumbs don't stick to the patties. I would half the amount of chili powder and dip the patties as regular chicken fried steak--flour egg flour or cracker crumb. I lined and sprayed a baking sheet and cooked at 375 for 30 minutes like another reviewer suggested. They cooked up great but forgot to make the patties thin as they shrink and plump when cooked. I loved that these can be baked so much healthier for you. Next time I will try these changes and it could be a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "footballgrl16",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4002607/"
                }
            }
        ]
    }
]