[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
                    "name": "Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/81525/slow-cooker-cranberry-roast/",
        "name": "Slow Cooker Cranberry Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6830833.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-02T06:47:12.000Z",
        "description": "This is a family favorite! Simple but absolutely delicious roast! It makes a fantastic gravy that complements the roast and goes great with mashed potatoes!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (1 ounce) envelope dry onion soup mix",
            "1 (3 pound) beef chuck roast",
            "1 (16 ounce) can jellied cranberry sauce",
            "2 tablespoons butter",
            "2 tablespoons all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place onion soup mix in the bottom of a slow cooker. Place roast in the slow cooker, and top with cranberry sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook 8 hours on Low.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove roast, and set aside. Set slow cooker to High. Whisk together butter and flour, and slowly mix into the liquid remaining in the slow cooker to create a thick gravy. Serve with the roast.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ATLANTAKIM"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.412859560067682,
            "ratingCount": 591,
            "itemReviewed": "Slow Cooker Cranberry Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "419.9 calories",
            "carbohydrateContent": "33.9 g",
            "cholesterolContent": "115.5 mg",
            "fatContent": "17.3 g",
            "fiberContent": "1.1 g",
            "proteinContent": "31.6 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "531.8 mg",
            "sugarContent": "28.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-02T02:14:27.857Z",
                "reviewBody": "I know the ingredients call for a beef chuck roast but I think it's actually supposed to be a PORK roast like the write up states (\"Simple but absolutely delicious cranberry PORK roast!\")... I can't imagine a cranberry sauce with beef but who knows... I chose pork since fruit sauces are usually a good complement and it turned out fantastic! My husband wolfed it down and normally he's a very slow eater... Don't worry about it not having much liquid to begin with-- I stared into my crockpot for quite awhile debating if I needed to add water (my hubby even peered over my shoulder and commented on how dry it looked compared to my other crock pot recipes) but I went on faith and followed the recipe to a T and it turned out great (the cranberry sauce quickly \"melts\" and turns into a watery stew for the meat to cook in). Yes this is a sweet recipe but it's sweet like BBQ sauce is sweet (it tastes appropriate and not remotely like cranberry sauce-- trust me I'm not a big fan of the stuff)... I'm also not a big fan of pork but I am a HUGE fan of crock pots and know that otherwise dry/tough meat ALWAYS turns out fabulous in it.... Give this recipe a try-- your tastebuds will thank you for it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1817352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-16T15:39:10.747Z",
                "reviewBody": "I've been making this for years my family loves it. The last four hours of cooking I add baby carrots and cut up potatoes and sprinkle a second bag of onion soup mix on top of them. This recipe is fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Moody",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/637538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-31T01:41:52.937Z",
                "reviewBody": "I thought this might turn out wierd but had to try it because it seemed so easy. It was great! It doesn't taste like cranberries (I used a store-brand of cranberry sauce) but formed lots of nice brown-type gravy to serve over my garlic-roasted mashed potatoes. I used one fresh 3-lb chuck roast and one.5 lb rump roast (from the freezer) and prefered the rump roast because it wasn't so fatty. So next time I'd just do a rump roast instead. I added some baby carrots to the crockpot and those were great too. Luckily I bought two cans of cranberry sauce so I can make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T03:30:34.687Z",
                "reviewBody": "No, it's not a mistake: this is for a beef chuck roast (but feel free to use pork, I guess). What a revelation! I've made pot roast for years, but would never have guessed that cranberry sauce would produce a nice browned roast (in a slow cooker!) with such rich gravy. I used water and corn starch to thicken the gravy, instead of the butter & flour in the recipe. We had it over egg noodles, but next time I'll add quartered potatoes and baby carrots, because I think they would go well with this. If so, I would also add 1/4 to 1/3 cup of water, to produce a little more gravy for cooking the vegetables.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JED901",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1144644/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-11T02:34:37.39Z",
                "reviewBody": "WOW!!  What a great recipe!!  Kids even loved it.  I did not have the dry onion soup mix so I substituted the soup mix with 4 tsp beef boullion, 8 tsp dried onion flakes, 1 tsp onion powder and 1/4 tsp pepper. I also added 2 carrots sliced up. Thanks for the fantastic meal!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A&J&J mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1668886/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-18T14:35:09.1Z",
                "reviewBody": "This was wonderful different and sooooooo easy. I used stewing beef that I had on hand. I placed the beef in the slow cooker and dumped the soup mix in and gave it a quick stir then I dumped the can of cranberry sauce on top covered and let it go all day. I also used whole berry cranberry sauce since thats what I had in my cupboard. I liked it that way but the kiddies prefer without the berries so I will make it that way next time. I served this over egg noodles and it was absolutely amazing! I just couldnt get over how easy this was to make. You really cant get any simpler. Thanks so much for sharing!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAZZO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/702298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-02T20:40:23.407Z",
                "reviewBody": "This is absolutely the best and easiest slow cooker roast recipe!! I've made it twice first with beef (arm) roast and second time with pork loin roast. The arm roast didn't produce enough liquid so I didn't need to thicken the sauce. In future would use chuck roast because the sauce tasted a little charred since it was slightly thick. The pork roast was awesome!! I thickened the pork juices with corn starch instead of flour/butter and loved it! Used whole berry cranberry sauce both times. Did not add any additional liquid--just the whole cranberry sauce--and it was perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanya C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1965694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-08T17:05:08.15Z",
                "reviewBody": "I made this as written with the exception of choosing to use the ocean spray whole berry cranberry sauce. I'm extremely surprised how much juice this created in the crock pot with out adding any liquid at all. I did use a beef chuck roast but I can see how this would be terrific with pork as well. For those who had trouble with the butter and flour. Its a roux so: In a 2 cup glass measuring cup melt your butter in the microwave the add flour and mix with fork. Then slowly ladle juice from the crock into the cup and mix with fork. It will thicken almost immediatly. Continue until you have added enough to make 2 cups making sure your smoothing it with for in between adding liquid. Then add to crock pot this will ensure your gravy (which is amazing) does not clump. If you choose to use cornstarch dissolve cornstarch in water prior to adding to the gravy mixture. I also suggest cutting back the cornstarch to 1 tbs and not simply subbing it for the flour as cornstarch thickens at twice the rate of flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-21T15:44:24.873Z",
                "reviewBody": "Didn't change a THING! This is FABULOUS! Roast was amazing! Gravy was OUT OF THIS WORLD! Served the gravy over the meat and over mashed potatoes. Try this! It's to DIE for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Bovenkamp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-08T22:01:36.97Z",
                "reviewBody": "I followed this recipe exactly however my husband and I thought that it was pretty bland... not sure if I did something wrong but we will not be making this again:( sorry...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Lindquist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5044855/"
                }
            }
        ]
    }
]