[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83296/balsamic-chicken-and-fresh-mozzarella/",
        "name": "Balsamic Chicken and Fresh Mozzarella",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4545519.jpg",
            "width": 2420,
            "height": 2420
        },
        "datePublished": "2019-04-02T06:47:17.000Z",
        "description": "A tasty, healthy chicken that's fancy enough for a guest but easy enough for any day of the week.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "10 skinless, boneless chicken breast halves",
            "1 (16 fl oz) bottle balsamic vinaigrette salad dressing",
            "2 tomatoes, sliced",
            "2 pounds fresh mozzarella cheese, sliced",
            "1 bunch fresh basil leaves",
            "2 tablespoons balsamic vinegar",
            "salt and freshly ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken in a shallow dish or large resealable plastic bag. Pour the dressing over it, cover or seal, and marinate in the refrigerator for 12 to 24 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Coat a large skillet with cooking spray or oil, and set over low heat. Remove the chicken from the marinade and discard the marinade. Fry chicken breast halves over low heat for about 30 minutes, or until juices run clear.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange chicken on a serving platter. Place a generous slice of fresh mozzarella on top of each piece. Place a leaf of basil on top of the cheese, and cover with a slice of tomato. Dash balsamic vinegar over the platter, and season with salt and pepper. Serve!\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "TVMOVIEGIRL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.454545454545454,
            "ratingCount": 297,
            "itemReviewed": "Balsamic Chicken and Fresh Mozzarella",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "542.4 calories",
            "carbohydrateContent": "8.5 g",
            "cholesterolContent": "138.6 mg",
            "fatContent": "36.8 g",
            "fiberContent": "0.4 g",
            "proteinContent": "41.2 g",
            "saturatedFatContent": "15.4 g",
            "servingSize": null,
            "sodiumContent": "750.7 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-28T22:58:28.423Z",
                "reviewBody": "Fabulous!! I made this for my family last night and they all loved it!  I changed a little to suit me, though.  I marinated the chicken for 24 hours and then baked the chicken instead of pan-frying it.  I baked it at 350 for 30 minutes.  Then I layered shredded mozzarella on top and placed in the oven for 5 more minutes so it would melt.  I took the advice of another reviewer and warmed the tomato and basil slightly in a skillet.  Then I placed them on top of the chicken.  My husband was raving all night.  It is our new favorite meal and it is so easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "justaMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2301534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-01T02:44:17.8Z",
                "reviewBody": "This was EXCELLENT. Made a few modifications: didn't have any balsamic vinaigrette on hand so I made Mama's Balsamic Vinaigrette (on this website), which I highly recommend! Marinated chicken filets for 24 hours (poked holes in the chicken so they would absorb marinade even better). I put the whole thing - marinade and all (added a dash of Italian seasoning) - in a baking dish and put it in the oven for 30 min at 350. During the last ten minutes of cooking, I put tomato slices around the chicken in the pan so they would warm up and absorb some of the awesome flavor. During the last 5 minutes, I put mozzarella slices on the chicken so they would melt, along with dried basil sprinkled on top. I served it by pouring some of the leftover balsamic vinaigrette around the chicken and placed the tomatoes on top. It came out PERFECT. I will definitely make this over and over again - it was so easy, yet elegant, and it was incredibly tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Snyder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1498491/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-09T22:40:56.013Z",
                "reviewBody": "My family LOVES this recipe.  It is so easy to make, and tastes so fresh and \"alive\".  This recipe has become part of my regular repertoire.\n\n10/09,2006:  Update:  I used the basis of this recipe with some fresh tilapia (white fish) and it was fabulous.  I marinated the fish in the balsamic vinegrette for about 45 minutes.  I lined a jelly roll pan with aluminum foil, and placed the fish on the foil.  I then covered the fish with shredded mozzarella and baked in a 425 F oven for 10 minutes, then broiled for 2-3 minutes until the cheese was golden and bubbly.  To make the remainder ingredients easier to eat with fish, I chopped the basil and diced the tomatoes before layering them on the top of each fish fillet.  Finally, I sprinkled with additional balsamic vinegar and served.  YUM YUM!!!  Thanks again, this is one we make all the time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sugarmagnolia_fl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1357576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-18T15:04:23.887Z",
                "reviewBody": "OMG- I read these reviews and I was just horrified- does no one understand cooking? every single review I read turned this into some kind of psuedo chicken parm \"thing\".  The recipe is meant to be as instructed it is warm chicken with A cold ensalade caprese on top.  the warm of the chicke and the cold of the salad are meant to be- to heat them destroys the entire meal. this is something I happen to make often-  i usually grill the chicken, but pan frying works well-  if you are going to try this recipe don't alter the process, or you are just wasting your time",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "realvintagegirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10257840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-03T22:27:41.03Z",
                "reviewBody": "A very good recipe for chicken. I didn't have time for a lot of marinating so put the dressing in a bag with the chicken for 1/2 hour at room temperature. To ensure there was enough flavour I pan fried the chicken for a few minutes per side (until golden brown) and then transferred the pan to the oven adding a few tbsp of the marinade. I cooked it for 20 minutes at 350 degees. Taking the advice of others I shredded the mozzarella and put it on the chicken at the end of the cooking time letting it bake for several more minutes to melt the cheese. I chopped the basil and tomato and heated it in the microwave putting it over the chicken before serving. Delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb A.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2377088/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-27T05:06:50.747Z",
                "reviewBody": "AWESOME!! WHEN I READ THIS RECIPE I JUST THOUGHT IT LOOKED KINDA BLAH I TRIED IT ANYWAYS CUZ IT SEEMED SO EASY & I HAVE A NEW FAVORITE! I MARINATED FOR 24 HOURS & INSTEAD OF JUST SETTING THE LEAF & TOMATO SLICE ON THE CHICKEN I CHOPPED THE BASIL A BIT & MIXED W/ THE SLICED TOMATOES IN THE PAN OVER MEDIUM HEAT. JUST LONG ENOUGH TO GIVE THE BASIL GOOD FLAVOR BUT NOT LONG ENOUGH TO LOSE THE SHAPE OF THE TOMATO. WILL PROBABLY MAKE THIS ONCE A MONTH!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLIM!!!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626804/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-29T19:14:52.2Z",
                "reviewBody": "A really nice robust meal to make without that much hassel. I dredged the chicken in flour seasoned with minced garlic rosemary and oregano before sauting. Added a clover of minced garlic to the balsamic vinegar before drizzling it over the chicken. Served with Italian bread and a tossed salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-17T04:04:15.037Z",
                "reviewBody": "I seem to be having a \"daily recipe\" day. Perusing through todays recipe's I thought I would give this a whirl along with the candied carrots from today's \"daily's\". Pounded out the chicken breast this morning and put them into the marinade. I have to admit I had hoped for more time than 12 hours but it still managed to permeate the chicken admirably. I made this exactly as stated with the exception that I grilled the chicken. 12 hours seemed a little weak which is why this is given 4 stars. Helpful hint: Let the chicken marinate as long as you can to let the full flavor shine through. Thank you TVMovieGirl!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-09T16:26:38.527Z",
                "reviewBody": "I am a big fan of caprese salad (tomato and fresh mozzarella) and this recipe is exactly that but with chicken added. Reading some reviews here about melting the mozzarella cheese leads me to believe some people are not using the correct kind of cheese. You must use FRESH WATER PACKED mozzarella or in a pinch can use the plastic wrapped fresh mozzarella but even that is a bit too dry and hard for caprese. Shredded dry mozzarella will not work in this recipe. I modified slightly by using thin cut chicken breasts which cuts down the cooking time for a quick and easy meal. I also threw in some pine nuts when cooking the chicken. Instead of drizzling the balsamic vinegar over the assembled top I marinated the tomatoes in the vinegar while I cooked the chicken. I don't recommend marinating the mozzarella as it absorbs the brown coloring and will taste fine but ruin the presentation. This makes a great light meal served with a ceasar salad and breadsticks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Timmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2409968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-18T18:37:24.737Z",
                "reviewBody": "I didn't care for this like I thought I would. Could have been the modifications I made. I didn't have whole breasts so I used strips. I marinated and coated with Italian Panko before frying. I layered everything in a pan and put in oven just to melt the cheese. They only flavor I got from the dish was the Panko (thank goodness I used it) and the tanginess of the tomatoes. It wasn't bad but just not a 4 or 5 star dish in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GDEEZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/603952/"
                }
            }
        ]
    }
]