[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83419/chicken-breast-stuffed-with-spinach-blue-cheese-and-bacon/",
        "name": "Chicken Breast Stuffed with Spinach Blue Cheese and Bacon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2251498.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "2019-04-02T06:47:18.000Z",
        "description": "This is a recipe I came up with while trying to use up some leftovers from another recipe. You can add more or less pepper depending on your taste.  My family liked it hope you do to.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "8 slices bacon",
            "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness",
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry",
            "1 cup crumbled blue cheese",
            "2 tablespoons all-purpose flour",
            "⅛ teaspoon ground black pepper",
            "¼ teaspoon salt",
            "2 tablespoons olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook bacon until crisp. I prefer to use an indoor grill. Bacon can also be cooked in a skillet over medium-high heat, or the microwave at about 1 minute per slice. Drain on paper towels, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). In a medium bowl, stir together the spinach and blue cheese. Crumble in the bacon, and stir to distribute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lay the chicken breast halves out on a clean surface, and distribute the spinach mixture evenly onto the centers of them. Fold the chicken over the filling, and secure with toothpicks.  Stir together the flour, salt and pepper on a dinner plate. Roll the chicken in the flour to coat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a skillet over medium-high heat. Quickly brown each piece of chicken on top and bottom. Remove to a lightly greased baking dish, and cover with a lid or aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 minutes in the preheated oven, until chicken juices run clear, and filling is hot.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Judy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.455555555555556,
            "ratingCount": 450,
            "itemReviewed": "Chicken Breast Stuffed with Spinach Blue Cheese and Bacon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "444.2 calories",
            "carbohydrateContent": "7.1 g",
            "cholesterolContent": "112.8 mg",
            "fatContent": "27.4 g",
            "fiberContent": "2.2 g",
            "proteinContent": "41.6 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "1154.3 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-21T14:13:47.307Z",
                "reviewBody": "Really delicious--if you like blue cheese. My husband calls this one a keeper. Instead of browning on the stove I simply breaded these in breadcrumbs and crushed nuts and baked them. You can prepare several servings at once freeze before baking thaw and then bake at a later date. So I triple this recipe--not much more work but we get three separate dinners out of it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "minivanmama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1332978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-05T01:58:26.077Z",
                "reviewBody": "You know I was actually going to make up a recipe for spinach and blue cheese stuffed chicken breasts but came here first to see if there was a reicpe for what I had in mind. This is almost it! These are my changes: I only had fresh spinach so I wilted it in the micro (one-minute intervals...man that stuff shrinks!). Mixed it with blue cheese (for hubby I did shredded mozzarella and a bit of light sour cream cause he dislikes blue cheese and I just had the mozz on hand). I then pounded my chicken breasts spread the cheese mixture on one side and rolled it up wrapping two whole raw bacon slices around it. Didn't even need toothpicks. Pretty easy to prepare too (I prepared the cheese/spinach mixture ahead of time and put in in some tupperware in the fridge). I skipped the browning with flour and olive oil- as the bacon cooked in the oven it took care of that part. I loves this dish! Tasted hubby's and it was good although not as good as mine because I LOVE blue cheese!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-14T15:25:07.767Z",
                "reviewBody": "This recipe is SO good.  One of my faves, and now I have it memorized.  The only change I made was to add minced garlic and chopped onions.  Everyone that has had it, loves it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mallove81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1983307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-29T01:42:52.96Z",
                "reviewBody": "I prepared this with my own twists on the recipe mainly to accomodate the tastes of my blue cheese detesting husband--though I'm sure I would have rated it equally just as written. Just eyeballing it I mixed the frozen spinach with Alouette Garlic and Herb cheese and put a spoonful of this mixture on each pounded flattened chicken breast. I rolled them up and wrapped two slices of partially cooked bacon over each. I didn't bother with flouring them or browning them in a skillet just simply placed them in a baking dish at 350 degrees for 45 minutes. Moist and tender SO flavorful and pretty on the plate too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-13T14:31:22.03Z",
                "reviewBody": "These are very tasty. I don't like Blue Cheese so I used fetta instead. I also added a little nutmeg to the spinach. (The flavouours go really well together. I stole this idea from my Lasagna recipe) I aldo added a couple tblsp of mayo just for some creamyness. I topped the entire thing off with some grated monteray jack cheese. Wonderful combination!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsey Wolnowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-23T19:25:25.01Z",
                "reviewBody": "I can't say enough about this meal...it ranks high on my list of \"best things I've ever cooked!\" I didn't measure the cheeses...I just used however much I preferred and I used freshly chopped bacon bits rather than actual bacon strips. The chicken was so tender and the cheeses I used (bleu cheese and feta) mixed with the bacon and spinach were delicious. I will DEFINITELY make this again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1933305/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-15T23:17:58.92Z",
                "reviewBody": "This was really good although I made a few adjustments. First I sauteed fresh spinach with a crushed garlic clove in some olive oil. The cheese I used was one that I found in the gourmet cheese section at the market. It was a layered brick of blue cheese/old cheddar. The cheddar really helped keep the flavor mild. I think using the full amount of only blue cheese would have been overpowering like others have mentioned. The chicken breasts I used were de-boned but still had the skin on. I put the stuffing underneath the skin then sauteed in a pan (without the flour). I finished these off in the oven. I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "France C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/francecevallos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-22T04:03:13.75Z",
                "reviewBody": "Loved it! We browned the chicken before putting in the filling and it worked great. Also agree with the other folks about using half blue cheese and half feta...tastes great but not too overpowering. Will defintely makes this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AZcook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1950951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-28T13:20:03.28Z",
                "reviewBody": "I made this the other night. It was delicious. My boyfriend who declares that \"no recipe deserves 5 stars there's always room to improve\" gave it 5 stars! Next time I think I will use fresh spinach and brown the chicken a little more. But it was so delicious!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jlbax_wvu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1800670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-23T17:58:49.077Z",
                "reviewBody": "I made these the other night and I had some problems with the recipe. First of all there was way too much filling for the chicken. I only used about half of it. I used a good Danish bleu cheese and the flavor was very strong. Overall it was tasty but too overpowering almost tongue numbing. I think I will adjust this with about half the spinach and 1/4 cup of blue cheese. I would also add some sauteed onion and garlic to the filling. As written I would give it 3 stars but I think with a little tweaking it could easily be a 5 star recipe. It has potential.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cyndi K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476363/"
                }
            }
        ]
    }
]