[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1285/meat-and-poultry/chicken/chicken-breasts/breaded/",
                    "name": "Breaded",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83556/chicken-breasts-stuffed-with-perfection/",
        "name": "Chicken Breasts Stuffed with Perfection",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4483195.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2019-04-02T06:47:19.000Z",
        "description": "What's not to love about anything with feta, spinach, sun-dried tomatoes, garlic and mushrooms in it? The best thing about these is that they are easily prepared a day ahead or frozen and eaten later. These are perfect to have for company along with a nice salad and the Chocolate Lava Cakes for dessert.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves - pounded thin",
            "1 (8 ounce) bottle Italian-style salad dressing",
            "8 slices of stale wheat bread, torn",
            "¾ cup grated Parmesan cheese",
            "1 teaspoon chopped fresh thyme",
            "⅛ teaspoon pepper",
            "1 ½ cups feta cheese, crumbled",
            "½ cup sour cream",
            "1 tablespoon vegetable oil",
            "3 cloves garlic, minced",
            "4 cups chopped fresh spinach",
            "1 bunch green onions, chopped",
            "1 cup mushrooms, sliced",
            "1 (8 ounce) jar oil-packed sun-dried tomatoes, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place chicken breasts in a large resealable plastic bag. Pour in Italian dressing, seal tightly, and refrigerate at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the stale bread, Parmesan, thyme, and pepper into a food processor. Pulse until the bread is processed into crumbs. Seat aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the feta and sour cream. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium heat. Stir in the garlic. Then add the spinach, and cook until it wilts. Stir in green onions, cook 2 minutes. Remove spinach to a plate, and leave any liquid in the pan. Stir in mushrooms, and saute until soft. Remove mushrooms to plate with spinach. Allow to cool briefly, then combine spinach and mushrooms with feta and sour cream mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the sun-dried tomatoes into the mixture, and spread onto a large cookie sheet. Place in the freezer for about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken breasts on a cookie sheet, and place about 3 tablespoons of the filling mixture in the center of each breast. Roll the breasts, and secure with a toothpick. Transfer chicken breasts to a baking dish, and sprinkle breadcrumb mixture over chicken breasts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake, uncovered, in a preheated oven for 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Breaded"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Adrienne Belaire"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.638009049773756,
            "ratingCount": 442,
            "itemReviewed": "Chicken Breasts Stuffed with Perfection",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "622.4 calories",
            "carbohydrateContent": "34.7 g",
            "cholesterolContent": "119 mg",
            "fatContent": "35.2 g",
            "fiberContent": "5.1 g",
            "proteinContent": "43.4 g",
            "saturatedFatContent": "13 g",
            "servingSize": null,
            "sodiumContent": "1516.6 mg",
            "sugarContent": "8.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-03T20:41:55.187Z",
                "reviewBody": "Made this for a party last night and everyone screamed for more!  The only change I think I would make next time is to change the topping to the prepared stuffing mixed with a little butter as suggested by another reviewer.  Making the crumb topping from the recipe was just too much work and I even think it made the chicken looked dried out.  I brushed some butter on top right before serving to give it some \"glisten\".  Other than that, the flavor was excellent.  I made them in the morning, put them in a baking dish lined with non-stick Reynolds Wrap and popped them in the oven to cook while I was serving appetizers and drinks. I served each breast on top of a bed of cooked fettucine noodles which I had sauteed in olive oil and seasoned with garlic salt & parsley flakes.\nAs a side, I stir-fried (again in garlic oil) a mixture of strips of green, red and yellow peppers, sugar snap peas, tiny baby carrots and baby portabella mushrooms and seasoned them with salt and just a little cayenne pepper and ginger.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DELLADOG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T03:19:31.933Z",
                "reviewBody": "I have been cooking since I was 6, so aren't many recipes I don't make \"improvements\" on, and this one was no exception. \nFor starters, medium is too high of a heat setting for sautee'ing the garlic. It will burn. You need to put the heat to medium low, and use 2 tbsps oil. After the garlic, spinach and green onion was sautee'd and removed from the pan, I added the mushrooms, but seasoned them with 1/8 tsp garlic salt w/ parsley, 1/8 tsp garlic pepper, and 1/8 tsp onion salt. They had a distinct marinaded flavor.\nWhen mixing the feta cheese mixture, I increased the sour  cream to 1 cup, because it was too dry without it, and I wanted the mixture to be smoother so the flavors would combine and the cheese would melt some when cooked instead of making the mix clumpy.\nThe bread coating I changed completely. I used 2 cups italian style bread crumbs, 1/2 cup of shredded parmesan/romano/asiago cheese blend and 1/8 tsp seasoned pepper blend.\nWhen I served this, it was gone in record time. I even had a picky-eater 5 year old visiting that cleaned her plate. I had some filling left over, so I put it in the fridge and then took it to my in-laws' house for their Easter party. I threw it in a bowl and microwaved it, and it made an AMAZING dip when served with Tostito's Scoops. It was gone in 5 minutes. Thanks so much for the key ingredient combinations! You gave me the means to concoct my own something special. I will be making this often, and definately if I have company coming!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Pika_Dream",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2341087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-06T15:30:11.077Z",
                "reviewBody": "This recipe not only tasted great, but it also came out looking great too! I made it strictly following the recipe the first time and loved it, but it does take a while to make. The second time I made it, I used some shortcuts, and it came out just as great. First, instead of making the bread crumb topping, I used a prepackaged cornbread stuffing (Pepperidge Farm), made it according to the package directions, and then patted a thin layer over the chicken before baking. Instead of precooking all the ingredients for the \"perfection\", I simply used thawed frozen spinach, canned mushrooms (the no salt added kind), and just didn't bother precooking the onions and garlic before mixing with the feta/sourcream. Also, instead of premarinating the chicken, I just poured a little Italian dressing over the chicken after stuffing and adding to the pan (just make sure and not add a lot). Since the ingredients weren't warm before placing in the chicken this way, I left out the freezer part all together. Doing this cut the prep time down from an hour to about 10 minutes  - and there was very little taste difference! As a side note, I did have to cook my chicken a good bit longer than 25 mintues in order to get the chicken completely cooked - more like 45 minutes (but then the breasts I used were rather thick and I didn't pound them thin...just cut a slit and stuffed that way to save time). I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GinaR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1581927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-17T19:47:17.637Z",
                "reviewBody": "I made this last night and it was incredible!  The prep work was worth it.  Like others I used bread crumbs instead of making my own and that did save a little time other than that I followed the recipe exactly.  The cook time was more like 35 minutes though.  I have some leftover \"stuffing\" mix and am freezing it to use another time.  I hope it holds up in the freezer! Update: I did find that the stuffing does hold up in the freezer for future use! Great stuff!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-02T00:26:20.077Z",
                "reviewBody": "Wow... just wow. My husband and I LOVED this recipe but as always I made some adjustments. First (as recommended by other reviewers) I used Italian seasoned bread crumbs mixed with Parmesan cheese as the topping on the chicken. I also coated the chicken with the breadcrumbs. I also used about 1.5 times the garlic. My major adjustment came in the substitution of one of the ingredients. Instead of feta I used goat cheese and that's where the \"WOW\" came from. If you're a fan of goat cheese you've got to try it this way. Thanks so much for sharing this amazing recipe - my husband and I have a new favorite dish! Update - I served the \"stuffing\" as a dip at a party and my guests went nuts for it. Thanks again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ddelmon/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-15T13:59:28.013Z",
                "reviewBody": "This is a very tasty recipe that presents well and is fairly easy to make. For the filling mixture I used ricotta cheese and yogurt (because that's what I had on hand) instead of feta and sour cream. Freezing the mixture for a while just makes it easier to spread but you might not need to wait the whole 30 minutes. Others have mentioned that the chicken needs longer than 25 minutes to cook but if you take the time to pound the breasts flat first before rolling them (this step takes about 2 minutes and creates a really professtional-looking result. I put the chicken in a plastic bag and pound it with an empty wine bottle -- works like a charm!) you shouldn't need to add any cooking time. For the topping I happened to have some homemade seasoned breadcrumbs in the fridge but I would highly recommend using packaged breadcrumbs or stuffing mix it will save you a lot of time. The only thing I would change next time around is the Italian dressing marinade. I don't think it added much flavour (except salt). Next time I think I'll try a simple oil/garlic/herb marinade. This is a great dish for company! I served it with swiss chard and caramelized onions and oil & garlic pasta.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ahfisher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1516727/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-11T06:33:49.377Z",
                "reviewBody": "Excellent. I passed on marinating the chicken breasts. For the breadcrumb mixture I used one half cup of bed crumbs; one half cup of parmesan cheese; 1/8 tsp pepper and 1 tbsp of italian seasoning. This was more than sufficient for nine chicken breasts. I basted the chicken breasts with melted butter before sprinkling the bread crumbs. I found two tbsps of sun-dried tomatoes more than sufficient. I also added half a minced shallot to the stuffing and cooked all of the vegetables together. I found a lot of liquid in the baking dish when I rmeoved the chicken from the oven. Be prepared to quickly transfer chicken to a platter on removal from oven. Enjoyed by all. I will be doing this recipe again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vern",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2001209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-18T01:04:37.12Z",
                "reviewBody": "Now that I've made this recipe my own, it is my go-to for company. I've made it simpler because I don't actually stuff the chicken. Instead I make plenty of the stuffing mixture and spread it on the bottom of a 13x9 and put thin-cut chicken on top of it and the bread crumbs on top of that. It cuts down a lot on the prep time and you get more of the wonderful stuffing. I serve it over pasta and the extra stuffing makes a wonderful sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristy Lundholm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-18T15:01:33.377Z",
                "reviewBody": "Made this for Christmas dinner....it truly was perfection. The only change was leaving out the mushrooms because of family taste preferences. I also used prepackaged bread crumbs for the topping. I cooked 9 breasts and had exactly the right amount of \"perfection\" for filling. I recommend cooking in a 9 x 13 with edges because we had a lot of juice when it cooked. Thank you so much for a fabulous christmas dinner!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JWINTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/738082/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-31T20:53:35.48Z",
                "reviewBody": "I made this last night and was really excited. The stuffing tasted great before put it in the ckicken but the final dish I did not like. I thought that every ingredient worked well together but the Italian dressing. I will probably not make this again but if I did I would leave out the marinade. It had enough flavor without that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "emily25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2502781/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Breasts Stuffed With Perfection",
            "description": "Try this tempting entree of tender marinated chicken breasts stuffed with cheese, mushroom, spinach and sun-dried tomatoes topped with a scrumptious bread crumb topping.",
            "uploadDate": "2016-02-22T18:10:15.818Z",
            "duration": "PT3M0.414S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F12b22224-a672-499c-b53d-231bdf179e8a%2F50da052f-905a-4e30-af41-a8c8057a79fa%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4767668850001"
        }
    }
]