[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/84706/grandmas-polish-perogies/",
        "name": "Grandma's Polish Perogies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3540617.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2019-04-02T06:47:25.000Z",
        "description": "My grandfather is Polish, and his mother taught my grandmother how to make these delicious perogies. The recipe has been in the family for generations, with a few alterations of course! Serve plain, or with butter, sour cream, bacon, etc. Perfecting the perogie technique takes time, and after a while, you will develop your own system.",
        "prepTime": "P0DT2H0M",
        "cookTime": null,
        "totalTime": "P0DT2H0M",
        "recipeYield": "60 perogies",
        "recipeIngredient": [
            "4 ½ cups all-purpose flour",
            "2 teaspoons salt",
            "2 tablespoons butter, melted",
            "2 cups sour cream",
            "2 eggs",
            "1 egg yolk",
            "2 tablespoons vegetable oil",
            "8 baking potatoes, peeled and cubed",
            "1 cup shredded Cheddar cheese",
            "2 tablespoons processed cheese sauce",
            "1 dash onion salt to taste",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the flour and salt. In a separate bowl, whisk together the butter, sour cream, eggs, egg yolk and oil. Stir the wet ingredients into the flour until well blended. Cover the bowl with a towel, and let stand for 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place potatoes into a pot, and fill with enough water to cover. Bring to a boil, and cook until tender, about 15 minutes. Drain, and mash with shredded cheese and cheese sauce while still hot. Season with onion salt, salt and pepper.  Set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate the perogie dough into two balls. Roll out one piece at a time on a lightly floured surface until it is thin enough to work with, but not too thin so that it tears. Cut into circles using a cookie cutter, perogie cutter, or a glass. Brush a little water around the edges of the circles, and spoon some filling into the center. Fold the circles over into half-circles, and press to seal the edges. Place perogies on a cookie sheet, and freeze. Once frozen, transfer to freezer storage bags or containers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To cook perogies: Bring a large pot of lightly salted water to a boil. Drop perogies in one at a time. They are done when they float to the top. Do not boil too long, or they will be soggy! Remove with a slotted spoon.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "STEPH577"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.669456066945607,
            "ratingCount": 478,
            "itemReviewed": "Grandma's Polish Perogies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "281.3 calories",
            "carbohydrateContent": "37.6 g",
            "cholesterolContent": "50.4 mg",
            "fatContent": "11 g",
            "fiberContent": "2.6 g",
            "proteinContent": "8 g",
            "saturatedFatContent": "5.9 g",
            "servingSize": null,
            "sodiumContent": "350.5 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-10T17:40:24.823Z",
                "reviewBody": "Because it can be quite time consuming making perogies, here's a suggestion.  Make your filling the day before.  That way you only have to mess with the dough the day you are going to make them. Also, after boiling the perogies, we always saute them with butter and onions before eating. Fry perogies until a light golden brown.  Little crispy on the outside and soft on the inside. Don't burn your onions. gently saute until translucent.  A dollop of sour cream when serving is a nice additon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Goodchild",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1860862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-09T00:06:26.62Z",
                "reviewBody": "Two suggestions that make go from alright to WOW! 1) After boiling the perogies remove from the water and fry them with a small amount of oil until browned on both sides. 2) Top with cottage cheese. By themselves, they are a bit bland, but with the cottage cheese they are fantastic. \nFor the filling, I omitted the prepared cheese sauce and added more grated cheese and a little milk & butter.\nWe liked them so much that we wanted to have family dumpling cook-off, trying different types of filling. With some leftover dough we made dessert dumplings filled with cherry pie filling which were also very good. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ripple2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2178036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-04T20:17:18.26Z",
                "reviewBody": "This was OUTSTANDING!!!!!  I have never made perogies before, and was extremely hesitant after reading ALL the reviews.  Even hubby said to just go to the store and buy a bag! Which, of course, to me was an invitation to an immediate challenge!!  It took some doing, but 4 hours later~VOILA!! Very time consuming, as I was all alone, but I highly recommend an assembly line of family members to quicken to project!! I, on the other hand, love to do it all myself, taking all the praise...HAHA!! Luckily, they were an IMMENSE hit with my family, even my 11 year-old, who never eats perogies, EVER!!!  I must say that rolling out the dough was a struggle, then I cut them into perfect circles, which shrunk to 1/2 the size once I picked them up.  Easy to fix, just mashed them down with my fingers, kind of like pizza into a pan.  I then overstuffed them and pinched closed with floured fingers, and froze.  I ended up with 58 perogies and still extra filling, which I froze for later use, and I made it with mashed potatoes, cheddar, real bacon, fried onions, salt, pepper, garlic and onion powder.  YUMMY!!!  My husband and his buddy who is here from Newfoundland, went on for hours about them and my cabbage rolls.  The best compliment is when they say \" this is even better than my mom's!!\" LOVE THAT! Permanent recipe in my rotation and thanks a bunch, ever so much!! LOVELY!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paivi Minnie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2372626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-05T03:51:54.423Z",
                "reviewBody": "This is a great dough! I did add extra oil...I am a fan of the calories and this prevents the dough from drying out, plus lets face it this dough gets a little sticky...I kept oiling my hands as I kneeded the dough. Filling well that is up to you and what your into... I like onions fried in butter and simple easy....cheese whiz. Makes for great freakin perogies! Here is the trick to freezing perogies...a cookie sheet and wax paper... you can put layer after layer of perogies on 1 cookie sheet!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jenafreaky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2112318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-12T13:43:47.263Z",
                "reviewBody": "This was my first time making perogies.  I followed the dough recipe exactly.  Very easy to work with!  For my filling, I used red skin potatoes (because I had them on hand) and added diced onions sauteed in lots of butter!  Also added cheddar cheese, parsley, salt and pepper. I did have some extra filling -- not a problem. When I actually prepared some for dinner, I boiled them as instructed and then browned them on the grill with more onions,oil, and butter (on foil). They were great! Thank you for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLYNCH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1406249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-16T03:30:15.11Z",
                "reviewBody": "Great recipe - the dough is delicate and tasty and can be filled with any filling you can dream up. I made mine with mashed potatoes and carmelized onions. I had to cover my dough with a moist paper towel while making the perogies because it began drying out. Also a note of caution - when freezing perogies place on a lightly greased plate or cookie sheet. I didn't do this and mine stuck to the plate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DTALER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1328329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-02T20:00:09.297Z",
                "reviewBody": "I made this special treat for my family's Easter Sunday Diner. I made them a week in advance and froze them. They came out GREAT! Everyone loved them! Def. make in advance. It took hours to make. I prefer to roll out the dough pretty thin because I dont care for a really \"doughy\" pasta. This is time consuming but the dough rolls out really nice! Double the recipe and it makes about 6 dozen perogies. I needed to add a little more flower then what was recomended. I omitted the cheese sauce but made three differnt flavors beacon onion and garlic. The onion flavored seemed to be the most populare.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mtaylor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2333863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-10T14:58:11.61Z",
                "reviewBody": "These where the best perogies I have ever made, the dough was so easy to work with, the biggest complaint I had from my family was that I didn't make enough!  One tip I placed the perogies on parchment paper before freezing to avoid sticking to the pan, works great!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "allheart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2199415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-01T13:53:53.513Z",
                "reviewBody": "Mmmmm Good. I haven't had real home-made perogies in over 15 years. I had to get this recipe so I could learn to make them. In my second batch I used minced onions in the potato mix and a whole lot more of cheese and added some all purpose seasoning/everglade seasoning. After I boiled the perogies I sauted them in light oil with more onions just to brown and crisp them. I can eat them plain but my family likes a little alfredo sauce over them. Great Recipe!! Thank You!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PWolvin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1648542/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-20T15:13:26.87Z",
                "reviewBody": "When I made my first batch they all came out soggy and had a gross texture. I made sure I took them out once they started to float. Maybe I'm just not used to the texture but for me they weren't so great! Also I would use just 6 potatoes instead of 8 or you will have leftovers. When I finished I ended up just frying them and they tasted much better. I may make these again but I'll change up alot things!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "andrea92fl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6636438/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Grandma's Polish Perogies",
            "description": "See how to make traditional potato-filled perogies.",
            "uploadDate": "2014-06-06T16:20:45.729Z",
            "duration": "PT4M14.921S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd4044e05-61ea-41e9-b40a-1460ae5777ed%2F7dc87161-7cf9-4dae-9b6d-a810c192e00f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3609424195001"
        }
    }
]