[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/145/breakfast-and-brunch/cereals/",
                    "name": "Cereals",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1311/breakfast-and-brunch/cereals/granola/",
                    "name": "Granola Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/85628/ultimate-irresistible-granola/",
        "name": "Ultimate Irresistible Granola",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3863054.jpg",
            "width": 4128,
            "height": 2322
        },
        "datePublished": "2019-04-02T06:47:31.000Z",
        "description": "This is THE BEST granola out there. Walnuts, pecans, coconut, sesame seeds and honey are just a few of the delectable ingredients that make this the most delicious and nutty granola out there, you won't be disappointed!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "5 cups rolled oats",
            "1 cup blanched slivered almonds",
            "1 cup chopped walnuts",
            "1 cup chopped pecans",
            "1 cup sesame seeds",
            "1 cup wheat germ",
            "2 cups shredded coconut",
            "1 cup unsalted sunflower seeds",
            "1 cup canola oil",
            "1 ½ cups honey",
            "1 cup raisins",
            "1 cup dried cranberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the oats, almonds, walnuts, pecans, sesame seeds, wheat germ, coconut and sunflower seeds. In a small pan over medium heat, stir together the oil and honey. Cook and stir until blended. You could also do this in a large measuring cup in the microwave, heating for about 2 minutes and 30 seconds. Pour over the oat mixture, and stir to coat evenly. Spread out in an even layer on two cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 minutes in the preheated oven, until the oats and nuts are toasted. Immediately after it comes out of the oven, stir in the raisins and dried cranberries. Let stand until cooled, and stir again to break up any large clusters. Store in an airtight container at room temperature for up to two weeks, but I guarantee it won't be around that long!\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Cereals",
            "Granola Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Veronica S"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.726114649681529,
            "ratingCount": 157,
            "itemReviewed": "Ultimate Irresistible Granola",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "532.2 calories",
            "carbohydrateContent": "55.7 g",
            "cholesterolContent": null,
            "fatContent": "33.6 g",
            "fiberContent": "7.3 g",
            "proteinContent": "8.8 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "8.8 mg",
            "sugarContent": "31.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-17T00:07:58.34Z",
                "reviewBody": "I tried this one twice. The first version I followed almost exactly the recipe, though substituting some of the nuts for other nuts but keeping the qty the same, and adding some kosher salt and maple syrup as suggested.. The result was VERY oily and not a lot of flavor. So.. second time around I made the following changes:\nincrease oats to 6 cups\nreduce oil to 1/2 cup\nused 1 c honey, about 1/3 c maple syrup, and about 4 TBS brown sugar, and a splash of apple cider...I also added cinnamon and salt to the honey/oil mix. YUMMY!  \nI also used some hazelnuts, pepitas, dried cherries, flax seeds, and threw in some whole almonds too.  The result of this batch is much better. The apple cider makes it smell great too. Way less greasy, and still was able to make clumps  (press down into the pan after adding fruit.. once cool break into clumps).  I am making this for xmas gifts.. so I added a few white chocolate chips to each bag after it was cooled also.  Great recipe, it is very forgiving so go ahead and experiment!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Wiltshire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-13T23:05:06.393Z",
                "reviewBody": "First of all THANK YOU Veronica for this amazing recipe. I just made a 10x recipe and am giving it away as Christmas gifts. I have a few comments that may be of interest to others. (#1) as others have noted this is a forgiving recipe and you can tweak as desired. Personally I like it with an additional 1c oats and only 1/2 cup of sesame seeds and 1/2 cup of sunflower seeds and add 1/4 tsp salt. (#2) You can be make this into bars or very clumpy granola as follows. Bake the granola in a jelly roll or half sheet rimmed pan. After mixing in the dried fruit cover with a clean kitchen towel and press down hard to flatten into bars. Once completely cool you can then break into bars or crumple into chunky granola. Great for snacks. (#3) for a different taste this can be baked for up to 45 minutes. Be very sure to stir often after 20 minutes so it won't burn but you will end up with a rich golden brown granola that is quite crisp. The recipe as written produces an excellent chewy granola...if you want it crisp just bake longer. Thanks again Veronica.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "J.P.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/781672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-29T22:41:29.86Z",
                "reviewBody": "This granola is fantastic, I can't stop eating it!!!  I added about 3 tsp cinnamon and 2 tsp of salt.  The salt just brings out the flavors of all the nuts and the cinnamon spices it up just a bit.  Thanks--I love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1703025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-23T15:09:02.983Z",
                "reviewBody": "I made this last night and was very impressed! I've tried several granola recipes and this is the first one that actually worked like I wanted it too. I did change a few things- I omitted the sesame and sunflower seeds and wheat germ. I used flax seed instead of wheat germ. I used extra virgin coconut oil instead of canola- for a more healthy approach. I also used 1 cup of honey and 1/2 cup of Agave nectar. I added a few dashes of salt and cinnamon. I also had to double the cooking time- I had two cookie sheets in the oven. It just wasn't cooking very quickly. Just wait until it gets golden and toasty. Great recipe and VERY easy! Thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacie Roberts Aho",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1775063/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-23T18:15:58.5Z",
                "reviewBody": "After trying a few different granola recipes that didn't deliver I've settled on this one. I've made it several times and will make it several more. While the recipe is great just as it is I like adding an additional cup of oats (this cuts down on potential oiliness) playing around with the various dried fruit options (still keeping the total at 2 cups) and especially like adding a bit of kosher salt when adding the fruit. The kosher salt gives it this great sweet/salty thing that everyone who tries it favorably comments on. So far it seems that this recipe can sustain quite a bit of tinkering which I find fun and freeing! I'm always changing amounts depending on what I have on hand I've even added whole wheat flour for a thicker consistency and the recipe always transitions beautifully. Thank you for a great granola recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amberb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/75259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-11T20:55:15.483Z",
                "reviewBody": "I LOVE IT! It's so yummy! I did do a bit of a change though. I only added 2 cups of the slivered almonds instead of all the other nuts to cut out on fat. I also sprinkled about 2 tbs of cinnamon in my dry mixture. I also added quite a bit of vanilla to my oil and honey mixture because I love the taste of it so I didn't even measure it just started pouring. I added extra cranberries and raisins to make up for the other ingredients as well. I know it might sound a bit bland but we didn't need the extra fat in our granola cereal because my husband is a cereal fanatic he can eat cereal 3 times a day bowl fulls at a time. So I wanted a healthier version of the cereal so you didn't feel as though you were eating healthy when you really weren't. I notice a lot of viewers just take their granola as a snack mine didn't bunch up to much it's more like a cereal then it is clusters so I just had my first bowl with some milk and it's quite tasty also I feel kinda full...although it could be from grazing from the mixture to begin with! Enjoy your version of this easy base granola!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINDEES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/751745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-12T22:38:57.14Z",
                "reviewBody": "So yummy - dangerously so! It makes a LOT so you could halve the recipe and it would be fresh every time you eat it. I found it hard to fit it all on my baking sheets. I had to do it in batches.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Bogaart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1269122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-19T19:50:54.783Z",
                "reviewBody": "As many reviewers said this smells wonderful when baking. I made many of the same modifications - additional oats cut the oil. Also added vanilla and flax seeds and substituted maple syrup for part of the honey. As I write this my three year old is munching on a bowl of it and is asking for more. I think we'll keep this one. Thanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FLOYDENE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1450561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T05:22:36.343Z",
                "reviewBody": "DELICIOUS. This recipe was a big hit at Easter family brunch. Everyone raved about it. Both of my sisters and my mom want a big jar of this for Mother's Day! I used dried blueberries instead of cranberries and I used dried sweetened coconut bits instead of shredded coconut and added a bit more salt to taste. Wonderful on yogurt. Give it a try you won't be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie O.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1856101/"
                }
            }
        ]
    }
]