[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1227/everyday-cooking/vegan/",
                    "name": "Vegan",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1663/everyday-cooking/vegan/side-dishes/",
                    "name": "Side Dishes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/86313/baked-tofu-bites/",
        "name": "Baked Tofu Bites",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F20406.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T06:47:34.000Z",
        "description": "Tofu cubes are marinated and then baked in the oven. The tofu can be used as a hot or cold snack or used as salad topping. Don't forget the smoke flavoring, it really adds the special flavor.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (16 ounce) package extra firm tofu",
            "¼ cup soy sauce",
            "2 tablespoons maple syrup",
            "2 tablespoons ketchup",
            "1 tablespoon vinegar",
            "1 dash hot sauce",
            "1 tablespoon sesame seeds",
            "¼ teaspoon garlic powder",
            "¼ teaspoon ground black pepper",
            "1 teaspoon liquid smoke flavoring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Lightly spray a non-stick baking sheet with oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Slice tofu into 1/2-inch slices, and gently press excess water out of tofu. Cut sliced tofu into 1/2-inch cubes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, stir together the soy sauce, maple syrup, ketchup, vinegar, and hot sauce. Stir in sesame seeds, garlic powder, black pepper, and liquid smoke. Gently stir tofu cubes into sauce. Cover, and marinate at least 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tofu on the baking sheet in a single layer. Bake in a preheated oven for 15 minutes. Turn tofu, and bake until the tofu turns golden brown, about 15 minutes more.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegan",
            "Side Dishes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "VICKY9999"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0302375809935205,
            "ratingCount": 463,
            "itemReviewed": "Baked Tofu Bites",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "167.7 calories",
            "carbohydrateContent": "12.8 g",
            "cholesterolContent": null,
            "fatContent": "8.8 g",
            "fiberContent": "0.9 g",
            "proteinContent": "12.7 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "1002.3 mg",
            "sugarContent": "8.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-25T14:21:15.61Z",
                "reviewBody": "This is a GREAT recipe. I omitted the liquid smoke (before reading other reviews) because I didn't have any on hand. After reading other reviews, it sounds like this was probably a good thing. I wouldn't change a thing (other than omit liquid smoke) about this recipe. These bites are so tasty, both hot and cold, that I could see using them in various ways at least a couple of times a week (I like tofu!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KellyG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1531031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-10T16:24:03.773Z",
                "reviewBody": "This is one of my favorite ways to prepare tofu. I've made this recipe many times and find that baking it for a minumum of 45 minutes produces a more textured tofu.  I love the marinade as written and with a few variations, like adding powdered giger or honey instead of syrup, these little tofu bites are even more delicious!  The marinade really bakes into the tofu so don't plan on a saucy dish, I usually pair these with a saucy veggie stir fry and rice, yum! What a perfect dinner! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michigan Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/818228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-13T20:55:27.47Z",
                "reviewBody": "I have just put together this marinade and I really like it! I did use half low sodium soy sauce and half regular soybean sauce. Chopped garlic bits instead of powder. Also I started by putting in only a few drops of liquid smoke at a time and tasting to see my preference. I think you need the liquid smoke. Just in a smaller amount. I used extra sesame seeds and they are the toasted. When I put it in the oven I am thinking of sifting a little cornstarch over the top to give it a little crunch. This will be great with some broccoli. Thanks for an easy and yummy recipe! Update I am finding that there is no need for the cornstarch as the marinade cooks and clings to the tofu. Sort of but not really in a crunchy way. I also feel like the marinade loses some \"punch\" upon cooking. The picture posted must have extra sauce used. I would make this again baking my tofu with the sesame seeds without the marinade. I would take the marinade and bring it to a quick almost boil on the stove and pour it over the top of the tofu about half way through the cooking time. Perhaps that would offer more flavor in the finished product. It was however good cold before I cooked it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "glad42day7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2130646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-22T22:56:32.23Z",
                "reviewBody": "I usually follow the recipe exactly as written the first time. But after reading all the reviews I did make a couple of minor changes. I pressed the sliced tofu between towels with a weight on top to dry it out. I really think this helps it absorb the marinade better. I left out the liquid smoke because I don't like the taste of it. I also added an extra tbl of maple syrup and sesame seeds and I subsituted 1 tbl of sesame oil for 1 tbl of the soy sauce. I wasn't sure why so many reviewers said that they didn't think this was enough sauce because it seemed to be plenty to cover that amount of tofu. But after baking it did seem to bake off or thicken or something so that the tofu was just coated and the flavor baked in and no extra sauce. I did end up baking it for 45 minutes since 30 just didn't seem like enough. I think I will try 40 min next time though as a few pieces did start to burn on the bottom. Although it was ok warm. Hubby and I liked it best after it had been chilled. The flavor was subtle but delicious. And the texture was just right. We had a little as a snack and used the rest on a salad. I will definitely make this again but next time make a double batch since it disappeared so quickly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "peebsy weebsy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2953036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-29T21:56:53.603Z",
                "reviewBody": "I liked these. THey are nice and low cal. The marinade sounded strange, but is really quite tasty, however I omitted the hickory smoke flavor.  I feel it is really important that you dry out the tofu as much as you can before marinading them. This is easy to do by lining the sheetpan you are going to use to cook them with a folded towel (paper towels are not absorbent enough unless you use a lot of them) then place the tofu down and top with another folded tea towel. Place a cutting board ontop of this and finally top with a heavy frying pan or (I used my food processor, very heavy but effective) something with some heft. Let sit for at least 15 minutes, longer the better.  Then when they do go into the marinade, 5 minutes is not nearly long enough. I did it for an hour at room temp and found even that to still be a bit short. The longer you have the better it will penetrate and taste on the tofu. I will def make this again. Safe to leave out at room temp on the counter all day to snack. Once they are refrigerated they lose something, in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelsolake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/189512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-19T23:25:17.8Z",
                "reviewBody": "I thought this was pretty good! After reading reviews I doubled everything except the soy sauce and I also omitted the liquid smoke (don't like it) and added 2 cloves minced garlic to the marinade. Marinated for an hour then plopped everything on a baking sheet and flipped/stirred it a few times while baking so the extra marinade would coat the tofu and hopefully carmelize better than what other reviewers were suggesting. Also upped the temp to 400 degrees for the last five minutes to try to get it to dry out some more. (Note: Watch closely! Burns easilty!) Made a mess of my baking sheet but I did manage to get a few pieces with crispy edges which is what I was shooting for. Other than that flavor and texture of tofu was excellent. Went nicely with sesame broccoli.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-16T19:50:37.763Z",
                "reviewBody": "These are so good! I must confess that I ate the entire batch for a snack the other night. Roasting the tofu is key here... the crispy edges are great. I wasn't crazy about the idea of adding ketchup (it tastes fine the idea just sounds strange) so I will try these with a different marinade next time-- maybe soy sauce sesame oil rice vinegar honey crushed red pepper and garlic. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "healthnut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1869546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-04T01:40:45.987Z",
                "reviewBody": "Really good we will be making this again and again! I am always sure to really take a lot of time squeezing off the excess water when I prepare tofu. It really helps with the texture and also the tofu will soak up more of the marinade. I let it sit of paper towels for 30-45 minutes with two three pound weights on top. Also I cut out the liquid smoke used chili oil instead of hot sauce halved the amount of maple syrup and halved the amount of soy sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gerrijo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-24T03:23:03.873Z",
                "reviewBody": "I really enjoyed this recipe but I think next time I'll either cut back the liquid smoke or omit it altogether. I found that flavour a bit overpowering. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "REYASUNSHINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1383476/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T02:58:04.53Z",
                "reviewBody": "Too much smoke flavor. 1/2 the soy sauce and double the sesame seeds. My son loved these. Would be great as an acompaniment to an Asian salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "deesnyder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1862858/"
                }
            }
        ]
    }
]