[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/86446/three-cheese-manicotti-ii/",
        "name": "Three Cheese Manicotti II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6947421.jpg",
            "width": 2305,
            "height": 2305
        },
        "datePublished": "2019-04-02T06:47:35.000Z",
        "description": "The whole family will jump for joy when they try this easy Italian dish!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (8 ounce) package manicotti shells",
            "4 cups shredded mozzarella cheese, divided",
            "2 cups ricotta cheese",
            "1 cup grated Parmesan cheese, divided",
            "1 tablespoon minced garlic",
            "1 egg",
            "2 tablespoons dried basil",
            "2 (26 ounce) jars pasta sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add manicotti and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, mix 3 cups mozzarella cheese, ricotta cheese, 1/2 cup Parmesan cheese, garlic, egg, and basil. Stuff cooked manicotti with the mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread about 2 cups pasta sauce over the bottom of the prepared baking dish. Arrange stuffed manicotti in the dish, and cover with remaining sauce. Sprinkle with remaining mozzarella cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 15 minutes in the preheated oven. Sprinkle with remaining Parmesan, and continue baking 10 minutes, until mozzarella is melted and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sonrisa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.621722846441948,
            "ratingCount": 534,
            "itemReviewed": "Three Cheese Manicotti II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "611.5 calories",
            "carbohydrateContent": "64.6 g",
            "cholesterolContent": "95.8 mg",
            "fatContent": "24.1 g",
            "fiberContent": "8.2 g",
            "proteinContent": "34 g",
            "saturatedFatContent": "12.1 g",
            "servingSize": null,
            "sodiumContent": "1679.4 mg",
            "sugarContent": "23.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-15T19:33:03.67Z",
                "reviewBody": "Very tasty! But manicotti are much easier to stuff when they are uncooked! I make a no-boil version by adding 1 cup of water to the marinara sauce (I only use 1 jar) and changing the baking time to one hour. (For easy stuffing, put the ricotta mixture into a large ziploc bag and snip off the corner.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CORBINMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1052787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-29T02:16:53.01Z",
                "reviewBody": "This was really good.  The only changes I would suggest is soaking the manicotti in hot water for 15 minutes instead of boiling them.  They are much easier to fill.  They will cook the rest of the way in the oven to the perfect consistancy.  Secondly, I used 36 oz of sauce.  Coat the bottom before you place your pasta down.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Audrey Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2253094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-01T22:55:05.173Z",
                "reviewBody": "This tasted great. I don't know about others, but I had difficult fitting all the shells into a 9x13 pan without having to stack some on top of each other. Fortunately, there was enough sauce to make this possible and keep the shells from sticking to each other. To the pasta sauce, I added ground sirloin, minced onion, and Italian seasoning. When I make this again, I will probably try adding a cup of water to the pasta sauce and not pre-cooking the shells, as I found it impossible to stuff them and not tear them in some way once they were al dente. The Ziploc baggie trick also didn't work for me when stuffing the shells. I had much better success with taking some of the cheese mixture, rolling it in my hands into a tube like it was playdough, and then inserting the rolled cheese into the shell. \n\n****UPDATE**** I've now made this a second time with spinach added to the cheese mixture (which is a good way to sneak in a veggie since I couldn't even taste its presence) AND 1 cup of water added to the sauce to allow the shells to cook in the oven. It was MUCH easier to fill the shells with a Ziplock baggie while they were uncooked, and I just adjusted the cook time to 1 hour, which worked perfectly. The dish tasted the same and was much less work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNDIDH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/627214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-11T18:00:24.843Z",
                "reviewBody": "This was wonderful! DH claimed it was the BEST manicotti he has ever eaten. I added some parsley to it and some fresh grated parmesan cheese. I used a large freezer bag filled it with the filling and cut a hole in the corner to fill the shells easily Will make again Thank YOU!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.Escandon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1573567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-06T01:17:00.597Z",
                "reviewBody": "This was great!  I did take the advice of others and only put the manicotti into boiling water and removed the pan from the burner and let it sit for about 5 min. then filled them.  They finished cooking perfectly in the oven.  Very easy and tasty meal.  Great with a tossed green salad and garlic bread.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patti Terranova",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1808025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-18T21:16:21.58Z",
                "reviewBody": "HELPFUL SUGGESTION WITH MANICOTTI: I didn't know what method to try on cooking the manicotti just enough to stuff and finish cooking while baking so I took the easiest, and each time it works out perfectly!  Heat a big pot until it boils, take off, stick manicotti in it, and let sit for 15 min!  Take out one at a time and let them dry as you prepare the filling.  I wasn't sure if this would taste gross if I filled them too much and I'm glad they weren't overpowered by the ricotta!  Using a gallon size freezer bag and cutting the end, I just stuffed as much as I could.  Easier to not put ALL the filling in at once so you can squeeze it out the bag w/o feeling really weak (guilty).  I didn't bother adding the Parmesan at the end of baking and w/all the mozz on top, it wasn't needed! 2C of sauce on the bottom of 9X13 was perfect.  Served w/garlic bread and salad!  Perfecto :) ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-07T16:58:51.813Z",
                "reviewBody": "This was the first manicotti I ever tried much less made. I'm not a big ricotta fan but this turned out really good. For the pasta sauce I made the \"Best Marinara Sauce Yet\" also from allrecipes.com. I followed the recipe exactly as far as ingredients but I took the advice of others here (I love simple!) and put the cheese mixture in a gallon freezer bag cut the corner and stuffed the uncooked manicotti quite easily and with no mess! I then added a cup of water to the marinara put everything in the baking dish as directed and cooked the manicotti in the oven for an hour. Worked perfectly little mess and easy for a baking newbie! I will make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bill721",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2511679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-13T05:22:16.167Z",
                "reviewBody": "This is a great recipe for manicotti. I didn't realize I had no mozzarella so I used montery-jack and it was very good. I used Pecorino-romano cheese for the filling and shredded parm for the top part. I didn't boil my manicotti first- just made sure there was plenty of sauce covering the shells and I baked covered for 35 minutes then uncovered added the parm and baked 10 minutes more. Perfect! The pasta was cooked perfectly. I used Marinara Sauce II from this site- great match. I really enjoyed this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-27T16:22:14.843Z",
                "reviewBody": "This is an excellent base recipe and can easily be adjusted to anyone's tastes. I thought that this was missing a little something. Next time I will add some onions and minced garlic to the cheese mixture and maybe saute some fresh mushrooms to add to the pasta sauce. I will be making this again with a few tweaks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OTTOS2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1416836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-10T00:04:33.1Z",
                "reviewBody": "A pretty good base recipe but I found it very bland. The second time over I seasoned the cheese mixture with salt and pepper as well as some parsley and a pinch of nutmeg. I cooked the garlic in a tad of butter just to soften them up a bit before adding them to the mix. (The first time I made it we were bitting into almost raw pieces of minced garlic!) I also shredded the mozzarella by hand with the finest grate setting which helped it melt more evenly into the mix. It takes a little longer in the oven then stated. But again like I said a pretty good base recipe just season it a bit and then make it yours with your choice of ingredients!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "polarpixie0",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7312704/"
                }
            }
        ]
    }
]