[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13390/main-dish/pork/pork-chops/pan-fried/",
                    "name": "Pan Fried",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/88123/apple-cider-sauce-and-pork-loin-chops/",
        "name": "Apple Cider Sauce and Pork Loin Chops",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1101450.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-02T06:47:45.000Z",
        "description": "Seasoned pork loin chops baked with apple cider and Worcestershire sauce and finished with sherry make even the pickiest husband say, 'Wow!' Serve with mashed potatoes.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "3 tablespoons olive oil",
            "4 pork loin chops",
            "seasoning salt to taste",
            "black pepper to taste",
            "garlic powder to taste",
            "½ teaspoon poultry seasoning",
            "3 tablespoons Worcestershire sauce",
            "1 (8 ounce) container frozen apple cider concentrate, undiluted",
            "¼ cup dry sherry"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large oven-safe frying pan over medium-high heat. Sprinkle chops with salt, pepper, garlic powder, and poultry seasoning. Place in hot oil, and brown on both sides. Drizzle Worcestershire sauce over chops, and pour in apple cider.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 25 minutes. Remove chops to a plate, and return frying pan to stove over medium-high heat. Stir sherry into pan, and boil until sauce thickens, stirring frequently. Serve sauce over chops.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Pan Fried"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "suzette"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.49811320754717,
            "ratingCount": 265,
            "itemReviewed": "Apple Cider Sauce and Pork Loin Chops",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "324.8 calories",
            "carbohydrateContent": "28.6 g",
            "cholesterolContent": "36.9 mg",
            "fatContent": "16.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "14.1 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "307.3 mg",
            "sugarContent": "23.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-10T23:41:01.717Z",
                "reviewBody": "I made these chops tonight.  Whew, they were so yummy.  I tweaked the recipe a little bit.  I cored and peeled 2 Red Delicious apples and sliced them up very thinly.  Then I peeled\r\nand sliced 2 onion.  I sautéed them in a skillet with a little bit of olive oil, salt and pepper while the pork chops were browning.  I also added the sherry to the apple cider\r\nconcentrate.  When the chops were ready to go into the oven, I poured the Worcestershire sauce over them and then about 2/3 of the cider concentrate/sherry mixture.  Then I spooned the sautéed apple/onion mixture over the chops.  I sprinkled about 1 Tbs. of Worcestershire sauce over that, and then poured the remaining cider concentrate/sherry mixture over that.  The chops I used were rather thick, so I baked them for 35 minutes.  My husband gobbled them up and said I could make them again anytime.  A keeper for sure, thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CELESTE THE BEST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/904361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-01T01:18:53.797Z",
                "reviewBody": "This recipe is very easy and tasty. I did not have frozen cider and used regular apple cider and they came out delicious and moist. Cooked 375 for less than 20 minutes. Forgot to add sherry and still great. The more you season the chops the better they are. Great combination of spices. Served with mashed sweet potatoes and buttured white acorn squash (which i decided I like better than the green acorn squash). I will definitely make again and thanks for tasty quick recipe for pork chops.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MHBMHB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1319052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-07T02:41:14.153Z",
                "reviewBody": "My husband loved this! I did make a few small changes. I didn't have poultry seasoning so I used seasoning salt. Also I did not have cider concentrate so I also used regular cider. It seemed to work fine for me. Last I thought I had sherry in my pantry and surprise DH used the last of it a week ago. So I substituted white wine vinegar and we really enjoyed the flavor. I noted that previous reviews said the sauce did not thicken so I added about 1tsp. of cornstarch and it mixed it well. Thickened nicely. I served this with rice pilaf and it really complimented the gravy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs_Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/copperskillet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-13T15:32:15.86Z",
                "reviewBody": "Everyone in the family loved this recipe. I made a few substitutions though...I used apple cider and two tblsp of apple butter instead of apple cider concentrate and I browned the pork chops after I seasoned them and dreged them in flour. Then I took the chops out and set aside added apple slices and half a chopped onion to the skillet until carmelized. After that I put the chops back in added the rest of the ingredients to the skillet turned it down to low and covered it and simmered for about 30 min or so until done. It made an awesome sauce! To thicken the sauce I added a bowlkick tblsp butter melted with flour added to it until it's like a paste. Not to sweet just right! Try cream sherry instead it's way more fragrent and yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "melabee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2117144/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-17T12:43:40.737Z",
                "reviewBody": "My hubby went nuts over this dish. He said I win the expert chef award! I read all the reviews and i also wasn't able to find cider at this time of year so i added nutmeg and cinamon. I also only cooked the chops for 16 minutes in the oven since everyone said theirs was overdone and mine came out PERFECT! I also thinly sliced apples and onions and sauteed them with the concentrate worsheshire and sherry mixture when the chops were almost done I brought the sauce to a rolling boil for about 4 to 6 minutes and it thickened to a sweet perfection. My hubby said it was like having desert for dinner and he ooohh yeahed as he ate way too much of it! Mashed potatoes is the perfect match as well! Read all the reviews they make all the difference!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Corrie Benedict-Jones",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2224711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-10T22:27:41.937Z",
                "reviewBody": "The flavor was excellent on these but my chops too came out very dry as another said. I'll try this again just in the skillet without baking or maybe with much less time. My sauce thickened up well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MomMakesItBetter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1499261/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-01T19:07:11.297Z",
                "reviewBody": "I made this dish for my fiance and she thought it was the best pork chops she's ever had. I cooked 2 chops instead of 4 but still baked for 25 minutes so they were a tad over done- but only a little. Otherwise it was perfect and we will definitely be having them the next time we host a dinner party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1704777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-30T05:28:51.78Z",
                "reviewBody": "WOW...this recipe is fantastic!! My significant other loves pork and I'm always looking for different ways to prepare it so that it does not become dry. The pork loin chops were tender and juicy and the sauce and seasonings only enhanced the flavor. When I first found this recipe I was afraid that 25 minutes in a 375 degree oven would dry the pork loin chops out but the apple cider helps to keep them moist. An absolutely perfect no-fuss meal...I served this with a spinach salad and garlic mashed potatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CKCSMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1438750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-13T17:33:09.377Z",
                "reviewBody": "Fantastic -- my family loved it! I didn't have seasoning salt so I used a celery salt instead. I couldn't find apple cider concentrate so I used regular apple juice concentrate and added some cinnamon and grated nutmeg. I also cooked it entirely on the stovetop. I added the celery salt pepper garlic powder and poultry seasoning to some flour in a large zip-top bag threw in some pork sirloin chops and coated them with the mixture. (The flour probably helped my sauce thicken.) I browned the chops set them aside lowered the heat a bit and added thinly sliced onions to the pan. Once the onions were carmelized I threw in the apple juice concentrate cinnamon and grated nutmeg to taste the worcestershire and the sherry and stirred it all. I added the chops back in covered and simmered for about 25 minutes. When I removed the chops I let the sauce continue to simmer for only a minute or two that was all that was needed for it to thicken up. This was a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OneSweetShannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1921708/"
                }
            }
        ]
    }
]