[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13299/main-dish/seafood/clams/",
                    "name": "Clams",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/91837/clam-bake/",
        "name": "Clam Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8142118.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2005-10-01T13:04:55.000Z",
        "description": "This is the most fun you can have with your seafood. It started with the idea of a fun get-together clam bake then took off with a life of its own. This recipe is a general guide. Have fun, mix and match your favorite seafood. I would ask your fish monger what is fresh, and then decide what seafood to add. I've even added a whole octopus before. Serve with a nice white wine, turn on some music and have fun. Great outdoor meal.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "8 medium red potatoes, scrubbed",
            "1 pound clams in shell, scrubbed",
            "1 pound mussels, cleaned and debearded",
            "½ pound unpeeled large shrimp",
            "1 (48 fluid ounce) can chicken broth",
            "¼ cup dry vermouth",
            "1 ½ cups butter, divided",
            "1 loaf French bread"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place a potatoes in a layer in the bottom of a large pot. Cover with a layer of clams, then mussels, and finally the shrimp. Pour in the vermouth and enough chicken broth to fill the pot halfway. You may not need all of the broth, depending on the size of your pot. Cut a half cup of the butter into cubes and place on top of the seafood. Cover with a lid, and seal tightly with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring to a boil, then simmer over medium-low heat for 45 minutes. Remove from the heat, and carefully remove the foil and lid. Remove the seafood and potatoes from the liquid and serve on a large platter, family-style.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1/2 cup of reserved butter, and divide into 4 individual dishes for dipping. Serve with French bread and remaining softened butter for the bread.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Clams"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DENISEK1"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3125,
            "ratingCount": 32,
            "itemReviewed": "Clam Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1383.3 calories",
            "carbohydrateContent": "137.4 g",
            "cholesterolContent": "294.4 mg",
            "fatContent": "74.1 g",
            "fiberContent": "10 g",
            "proteinContent": "41.6 g",
            "saturatedFatContent": "44.7 g",
            "servingSize": null,
            "sodiumContent": "3133 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-31T01:16:35.983Z",
                "reviewBody": "Im Maine we do this with clams lobster potaotes and corn and use white wine or beer in place of the vermouth doesnt get any better than this....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Laliberte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stylincook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-17T11:22:22.27Z",
                "reviewBody": "This was delicious and my guests loved it. Only one comment:Parboil the potatoes and cut the cooking time in half.It will keep the mussels from shriveling up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nokidoki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1626772/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-22T11:38:27.403Z",
                "reviewBody": "Very good base recipe -- I doubled the recipe and used a 12 qt. stock pot to cook it in. I was a little concerned that the broth might need a little something more so I added a bottle of clam juice a half of a lemon cut in chunks and about 5 whole peeled cloves of garlic. Also used baby Yukon gold potatoes which were fabulous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SJRJA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/836514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T22:30:42.12Z",
                "reviewBody": "This is a GREAT recipe. I've made it twice now.  The first time I made it the broth had no flavor, so I changed it a little bit this time(I hate when people do this, but...)by using a bottle of beer with the chicken broth, a bag of mccormick's shrimp boil seasoning, a head of garlic, a few onions, and adding kielbasy and corn to the mix.  The broth was PERFECT for dipping with bread. This is the perfect summer one pot meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cat M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1841528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-27T00:31:36.003Z",
                "reviewBody": "I would give this four stars as written - it's as simple as can be for a no-fuss easy one-pot meal. For our personal preference next time I will probably leave out the potatoes - with the corn and yummy seafood no one in my family even touched the potatoes. Also I will double the clams and mussels. I used seafood stock (all I had) and added a quarter of a lemon and a few cloves of garlic to the broth while cooking. I also cooked this a bit differently since I didn't want the seafood coming out tough or rubbery. I started with par-boiling my potatoes in salted water. Then I dumped out the water and added the corn to the potatoes and the broth and my additions of lemon and garlic. I cooked these for about 5 minutes. I added the clams in a single layer on top of the corn and potatoes and steamed for eight minutes. Pulled them out. Added the mussels in a single layer for 8 mintues. Pulled them out and added the shrimp for a few minutes until cooked through (maybe 5 minutes?). Then I put the clams and mussels back into the pot and served with crusty french bread and melted butter. The broth was fabulous and the seafood was just right (not tough and rubbery or shriveled). I will definitely make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "valerie160",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3239272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-06T21:31:21.42Z",
                "reviewBody": "Couldn't get any more delicious or easy! I took a large stockpot put the red potatoes on bottom a layer of clams layer of mussels and then snow crab legs instead of the shrimp. We also put a banana leaf on top for steaming (can also use seaweed). We added the entire 48 oz of chicken stock and a bottle of beer instead of vermouth. After sealing tightly we followed the recipe's instructions for 45 minutes on Med-low (after bringing to a boil). We also included Old Bay Seasoning I was afraid the seafood would be overdone but it wasn't. Excellent- especially the snow crab! A nice surprise was how delicious and soft the red potatoes came out. The skin had a lovely taste and the insides were creamy. We're already planning our next one with a bigger pot and more seafood:).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NESSER79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1250833/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-22T17:14:23.583Z",
                "reviewBody": "I grew up on the bay in MASS and all I have to do is make this recipe to feel back at home. We called it a clamboil and had it every Saturday night (where I live now its just hamburgers and hot dogs). You don't need the chicken broth if you don't have it. Try adding potatoes and onions and hot dogs and chourico (Portuguese sausage or some other type)to the mix. There is something for everyone in this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LORIJANUARY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1262037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-26T18:48:41.767Z",
                "reviewBody": "My family had the best time preparing and feasting on this meal. We gathered together from all over the country to celebrate out mother's 60th birthday. We filled up a huge pot with potatoes corn sausage shrimp clams mussels and lobster tails. We did layer seaweed in bottom of pot and in between some layers to avoid scorching. We used a mix of chicken broth and white wine as well as chopped garlic sea salt and old bay seasoning. We steamed it over our firepit for about 45-60 minutes. We put brown paper on a large table outside and poured the contents of the pot on the table. Everyone just gathered around the table and feasted on the food as they liked. It was so delicious and fun we decided it was going to be our 1st annual clam bake to be repeated every summer. We may change the order of placement of seafood because the shrimp and mussels did get a little over done. Also be careful how much liquid you use. You don't really want the seafood floating in it. We may change a few things next time but I would recommend trying this for a fun and different meal. Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MImom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mimom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-16T18:28:45.077Z",
                "reviewBody": "VERY GOOD",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAVIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2481856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-11T04:09:33.057Z",
                "reviewBody": "As a chef this is a good dish as written but the potatoes should be par boiled as mentioned by another member. I would not cook the seafood for 45 minutes either. Cook until the clams and the muscles open. Throw out the ones that don't.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Pierre Racette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3683498/"
                }
            }
        ]
    }
]