[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16232/meat-and-poultry/turkey/breasts/",
                    "name": "Breasts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/92528/slow-cooker-turkey-breast/",
        "name": "Slow Cooker Turkey Breast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F16%2F92528-slow-cooker-turkey-breast-Lori-2x1-1.jpg",
            "width": 2000,
            "height": 1000
        },
        "datePublished": "2019-04-02T06:48:00.000Z",
        "description": "Quick and easy way to cook turkey in the slow cooker. With only two ingredients, the only hard part is waiting.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H10M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (6 pound) bone-in turkey breast",
            "1 (1 ounce) envelope dry onion soup mix"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse the turkey breast and pat dry. Cut off any excess skin, but leave the skin covering the breast. Rub onion soup mix all over outside of the turkey and under the skin. Place in a slow cooker. Cover, and cook on High for 1 hour, then set to Low, and cook for 7 hours.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Breasts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ms_sally"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.551479289940828,
            "ratingCount": 1690,
            "itemReviewed": "Slow Cooker Turkey Breast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "273 calories",
            "carbohydrateContent": "1.5 g",
            "cholesterolContent": "164 mg",
            "fatContent": "1.5 g",
            "fiberContent": "0.1 g",
            "proteinContent": "59.5 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "308.9 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-15T16:07:35.853Z",
                "reviewBody": "SO EASY AND SO GOOD!  I made a few modifications:  Using a 7.25lb Bone-in Turkey Breast I layered the bottom of my crockpot with 3 cut-up celery stalks, one sweet yellow onion, 1/4 cup chicken broth, and 1/2 tbsp. minced garilc.  I placed the turkey breast on top of the celery and onion, rubbed the turkey inside and out with the onion soup packet (lifting up the skin on top of the breast and adding the seasoning right on the meat works great!), also rubbed some oregano, sage, thyme, and 1/2 tbsp minced garlic on the breast.  Drizzled the breast with 1 tbsp. melted butter.  Cooked on high 1 hour, low for 7 hours more.  Perfect moist turkey!  Smells and tastes great, plenty of leftovers for sandwiches, casseroles, or enchiladas!  Will be a simple cold-weather staple for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LadaFun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2490651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-16T00:15:56.493Z",
                "reviewBody": "Excellent!! I made this tonight on a whim.  I was going to grill our 6.5 lb turkey breast, but thought I'd give this a try.\n\nThe only thing I really did differently was smear a couple of pats of butter on the inside of my slow cooker ( as some suggested) and I used dry herb and garlic soup mix that I had on hand.\n\nThere is little preparation, I started the procedure at 7 am and didn't turn the cooker off until 4 pm   and left it on warm for 1-1/2 hours while I got busy with other things.\n\nThis turkey breast browned nicely near the edges and lightly on top, it fell apart as I took it out and there was plenty of delicious juice in the pot.  \n\nThe meat was succulent, with a melt in your mouth quality.  I didn't have time to make gravy out of the juice, so I just set it out as it was; it was wonderful on the turkey and potatoes I served. No additional seasoning needed at all.\n\nAs a working mom, this was a godsend, and my husband and teenage children were very very pleased with the results (all, including me, were VERY skeptical at first)turkey breast in a slow cooker...ewww.\n\nI'm going to share this recipe with my friends, it seems wrong not to.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2207962/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-09T12:39:03.5Z",
                "reviewBody": "I like to put just enough water to cover the bottom of the crockpot. Place the turkey in, surround it with quartered onions and carrots, brush the bird with melted butter and then season it well. This makes a delicious turkey breast and I use the leftover turkey breast for casseroles, etc. in the future as it freezes well. The broth can be strained and used as well. Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-16T02:11:28.227Z",
                "reviewBody": "This was so easy and came out absolutely delish! I think I'll make this regularly to have turkey for sandwiches during the week -- way better than cold cuts and you don't have to do the whole Thanksgiving turkey thing to get it!  This would also be a great way to make extra white meat for a holiday when you're worried that your turkey won't be enough.  I put about a half a cup of white wine in the bottom of the crock pot, added some thickly sliced carrots, a sliced onion, about 4 stalks of choppped celery and a couple garlic cloves.  Added salt and pepper, placed the turkey breast on top, with the onion soup spread on it and under the skin and cooked it on low for 8 hours.  When it was done, I sauteed some mushrooms (4 containers:  two each Baby Bellas and shitakes, sliced), onion and garlic in a little olive oil and butter in a skillet, then added 1/2 cup white wine and about 2 cups of the broth from the crock pot.  I brought that to a boil and mixed another half cup of broth with a couple tablespoons corn starch to make a \"slurry\".  I added that to the skillet and it was so delicious over the turkey! Thanks for a great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "S. N.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1797733/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-21T17:43:33.483Z",
                "reviewBody": "This is wonderful!  I did not know you could cook turkey breast in a slow cooker like this.  If you're like me, you'll probably be tempted to add stock or liquid to the meat -- DON'T!  Believe me there'll be plenty of wonderful juices to make gravy from.  If you just don't feel comfortable cooking it dry you can add about 1 Tbsp of melted butter (which is what I did) and you'll be totally happy with the result.  Instead of using bone-in breast I used a piece of cut-off breast meat and it's still plenty yummy!  Great for making sandwich or salad turkey meat.  Try this recipe if you don't feel like turning on the oven and heating up the kitchen and potentially trying your bird.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COASTALSUM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/850662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-29T15:27:36.1Z",
                "reviewBody": "This was my first turkey I've ever made and it turned out great. I am cooking for two so I used a 3 lb boneless turkey breast. I forgot to buy the dry onion soup mix so I spinkled onion powder and Italian seasoning on the turkey breast. I cooked for 1 hour on high and then left it on low for another 3 hours and it turned out perfectly! I will definitely be making it this way again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Indy Nurse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2470333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-06T02:51:31.67Z",
                "reviewBody": "Moist and very tasty.  I will be cooking many more turkey breasts in my slow cooker.  It is August and it is too hot to cook.  This is another good recipe that doesn't heat up the kitchen.  I cooked a 7 lb. breast and used onion powder, marjoram, garlic pepper, dried parsley and salt. As someone suggested, I put a few pats of butter in the cooker.  My slow cooker only heats from the bottom, so I didn't want the meat to stick before the drippings were released.  I cooked mine 3 hours on high. I will be using this for turkey enchiladas, sandwiches, and just as is.  No more turkey cold cuts for me.  This is too easy and tastes a zillion times better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sally",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/510578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T18:28:58.66Z",
                "reviewBody": "I am totally amazed at the 'brilliance' of those who 'review' a recipe after adding (in one case 9) so many ingredients that it doesn't even resemble the simple and delicious recipe that was shared!  Get real folks....send in your own recipe and leave the others alone!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1671861/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-28T13:50:52.343Z",
                "reviewBody": "This recipe was a lifesaver for me! I'm living on an island outside the US and had to drive 40 miles just to buy a frozen turkey breast, expecting to roast it in the oven for guests Thanksgiving evening. On Thanksgiving morning, I discovered we had no gas for the oven. So I found this recipe, had the onion mix on hand, and put it all in the slow cooker. Seven hours later, I had a perfectly cooked turkey breast. Perfect for nervous first-time Thanksgiving hostesses!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K.A.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1616063/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-14T16:47:59.577Z",
                "reviewBody": "Help!! I was so excited to try this. Is the problem with slow cookers that do or do not have a heating element on the sides? How could I go wrong w/just a turkey breast and dry onion? I'm still a novice . After 7 hrs. on low, my turkey was as dry as could be and all the juice filled my 7 qt more than halfway. I would have prefered the juice inside the turkey. Any comments aprpeciated..I really needed this recipe. THanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "valerie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4855954/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Turkey Breast",
            "description": "This moist, meaty turkey breast has just two ingredients--it couldn't be easier.",
            "uploadDate": "2012-07-10T19:35:19.667Z",
            "duration": "PT1M44.479S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F75a7139a-9f86-45ca-8ce1-00d80ce71a8d%2Fef1db0ce-d666-44ea-a2df-7cbad5caae47%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729205248001"
        }
    }
]