[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20611/marias-stuffed-chicken-breasts/",
        "name": "Maria's Stuffed Chicken Breasts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F206542.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-08-08T17:04:04.000Z",
        "description": "This is a great and easy chicken dish with a twist. How do you cook some chicken like Maria?! Like this!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "salt and pepper to taste",
            "1 (15 ounce) container ricotta cheese",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained",
            "1 clove garlic, minced",
            "2 eggs, beaten",
            "1 (8 ounce) package shredded mozzarella cheese, divided",
            "1 (16 ounce) jar spaghetti sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season chicken breasts with salt and pepper to taste. Slit open on the side for stuffing; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine the ricotta, spinach, garlic, eggs and 3/4 of the cheese. Mix well and stuff each breast with 1/4 of the mixture; secure with toothpicks and place stuffed breasts in a lightly greased 9x13 inch baking dish. Pour sauce over all and sprinkle with remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 45 to 60 minutes, or until chicken is cooked through and juices run clear.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Maria Fontana"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.421787709497207,
            "ratingCount": 716,
            "itemReviewed": "Maria's Stuffed Chicken Breasts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "578.1 calories",
            "carbohydrateContent": "26.3 g",
            "cholesterolContent": "231.3 mg",
            "fatContent": "26.3 g",
            "fiberContent": "5.6 g",
            "proteinContent": "58.3 g",
            "saturatedFatContent": "13.4 g",
            "servingSize": null,
            "sodiumContent": "1101.5 mg",
            "sugarContent": "11.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-04T21:20:36.023Z",
                "reviewBody": "This recipe was great...with a little tweaking.  After reading the other reviews, I realized that it was going to need a little extra flavor.  So, I pounded out the chicken breasts until they were thin, and then dipped them in egg and coated one side of the brests with a 1/2 and 1/2 mixture of italian seasoned bread crumbs and grated parmesan cheese.  I quickly fried the breaded sides in a skillet with olive oil and then spooned on the cheese/spinach mixture rolled them up and baked them.  They were a hit!  Oh, and only make 1/2 of the cheese mixture....otherwise it just goes to waste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kah1708",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2115965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-15T14:50:38.373Z",
                "reviewBody": "This is a great recipe for when you are having company over.  It is so easy to prepare ahead of time.  I made a few slight changes.  Being a garlic lover I used 3 large cloves instead of 1 and finely diced it.  I made sure to use chopped frozen spinach rather than whole leaf.  Once thawed I squeezed out the access juice and actually ran my knife through it some more to ensure smaller pieces.  I added 1/4 cup of shredded (not grated) Parmesan cheese to the filling for that extra punch of flavor and seasoned it with salt and pepper to taste.  Finally, the trick to not having extra filling is to use 6 large chicken breasts instead of 4 (make sure they are thick).  When it was time to fill them...I didn't cut it open along the side and close them with toothpicks.  Instead, I created a pocket by cutting a 1\" slit on the top of the thickest part of the breast by using a long fillet knife.  Once inside I ran my knife side to side...careful not to puncture any holes.  I then stuffed it with the mixture by pushing it in with my thumb (be sure not to overstuff) or you can be fancy and pipe it in if you wish.  Doing it this way eliminates the need for toothpicks.  As for the sauce...I simmered it first with fresh chopped basil before pouring it over the chicken breasts to bake.  This gives a jarred sauce new life and a fresh homemade taste.  Serve it with a vegetable medley and warm sliced Italian bread.  Everyone will love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEFBAUER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/195544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-16T00:17:34.763Z",
                "reviewBody": "This was very yummy.  First as with all chicken-I marinated in buttermilk all day(1cup milk 1 TBS vinegar or lemon juice if no buttermilk) for that extra moistness.  For the cheese stuffing I added extra garlic, fresh basil, and fresh grated parmesan cheese.  I stuffed chicken and baked covered for 35-40 minutes and removed foil and sprinkled more mozzerella cheese on top and baked an additional ten minutes.  Will def make again but BEWARE you do really only need like half the cheese filling.  I used five large breasts and stuffed them pretty good and had lots of filling left over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-29T21:01:10.47Z",
                "reviewBody": "This recipe was amazing!  It is now one of my families favorites!  I did find that it was easier to pound out my chicken thin and wrap it around the filling as opposed to cutting a slit in the chicken and stuffing it that way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K. Crowl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1914285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-23T02:29:55.09Z",
                "reviewBody": "This turned out incredible! I had some heavy cream I wanted to finish so I made \"Alfredo Sauce\" (Rebecca Swift) from this site instead of the spaghetti sauce. From reading the reviews I knew that there would be extra stuffing so I filled some pasta shells topped them with the alfredo sauce covered with tin foil and baked at the same time for 45 minutes. In the stuffing I doubled the garlic and added some italian seasoning. I waited to sprinkle the extra mozzarella until the last 5 minutes. My husband said that this was the best thing I've ever made! I did have a little trouble cutting the chicken for the stuffing; I didn't want to use the toothpicks so I used a method from another reviewer (CHEFBAUER) of cutting down into the thickest part then running the knife from side to side. I'm sure it will be easier next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1448109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-26T15:50:01.043Z",
                "reviewBody": "This is a great \"starter\" recipe! I used bone-in chicken breast took the skin off and let it marinate in Italian dressing while I was at work. I used 3 cloves of roasted garlic and a little less than half of a sweet onion and put it in my mini chopper. I let the spinach cook with the garlic and onion and then added thinly sliced baby portobello mushrooms and Italian seasonings onion powder etc. I then mixed the spinach mixture in a bowl with low fat ricotta cheese and mozzarella- I left out the egg. I stuffed my chicken with this mixture put it in a baking pan covered it with foil and baked @ 350 for 30 min- then I uncovered the chicken poured the sauce over it and baked it for 25 min.- then finally I topped the chicken with a slice of mozzarella and baked 10 min until cheese melted. This was FANTASTIC!!! Everyone loved it. I can not stress enough how good this was- I can't wait to make it again Enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aNicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/229141/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-09T02:01:16.95Z",
                "reviewBody": "Good recipe.. I made a few changes to suit my own taste. I added more garlic to the cheese mixture. I used an Italian blend shredded cheese I also and 1/4 cup of freshly grated parmasean cheese in the cheese mixture. I sauted chopped mushrooms in olive oil and garlic and added it to the cheese mixture as well. I pounded the chicken breasts and placed the filling in the middle and rolled the breast. I secured the breast with toothpics. I also ended up with extra filling so I took the advice of others and stuffed manacotti shells with the remaining mixture. I baked both dishes inthe oven at 350 degrees for 45 minutes (until the cheese starts to get golden brown around the edges).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sabrina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/625563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T20:46:28.967Z",
                "reviewBody": "This was quite tasty.  I'm giving it 4 stars because it really did make too much stuffing (even though I halfed the recipe!), and I had to \"add\" to it so the stuffing wasn't so bland... but it was a very good base for a stuffing recipe, and I would make it again.\r\n\r\nI used fat-free ricotta, and this worked well.\r\n\r\nI used fresh spinach (about half a bag, still too much).  I first poored a little bit of olive oil in a pan, and sauted 2 garlic cloves and chopped up mushrooms.  I then added the spinach and tossed and cooked about 3 minutes. I let that cool, and added that mixture to the ricotta.\r\n\r\nHint... \"true\" Italians use nutmeg in their cooking... I always add a little to any ricotta mixture, and it is delicious... for this, I added about 3 dashes.  Try it, you won't be disappointed :)\r\n\r\nThanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "NikkysNiche",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/654348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-29T19:58:50.34Z",
                "reviewBody": "This was great!  Make sure you get the chopped spinach - My grocery store only carried whole frozen spinach, so it was a little stemmy.  Instead of butterflying my chicken I pounded it flat and rolled up the cheese in it.  (This also makes the chicken cook in about 30 minutes).  I put the extra cheese into Jumbo pasta shells, poured some spaghetti sauce on them and put the two dishes in the oven together (in separate pans).  They were both done in 30 minutes and my husband loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Lane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1571907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-05T07:33:27.077Z",
                "reviewBody": "This recipe was just okay. It needed a large bottle of sauce and could have used a few more spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "APLUSTILL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/653253/"
                }
            }
        ]
    }
]