[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/94113/high-temperature-eye-of-round-roast/",
        "name": "High Temperature Eye-of-Round Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1497037.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-02T06:48:04.000Z",
        "description": "Eye of round roast is roasted at 500 degrees F. This recipe takes a very tough piece of meat and makes it so tender and delicious.  Feel free to improvise with the seasonings and use garlic salt in place of regular salt. The easiest roast you'll ever cook!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (3 pound) beef eye of round roast",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 500 degrees F (260 degrees C). Season the roast with salt and pepper and place in a roasting pan or baking dish. Do not cover or add water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the roast in the preheated oven. Reduce the temperature to 475 degrees F (245 degrees C). Roast for 21 minutes (seven minutes per pound) then turn off the oven and let the roast sit in the hot oven for 2 1/2 hours. Do not open the door at all during this time!\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the roast from the oven, the internal temperature should have reached at least 145 degrees F (65 degrees C). Carve into thin slices to serve.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lyn N Barbour"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4169133192389,
            "ratingCount": 2365,
            "itemReviewed": "High Temperature Eye-of-Round Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "227.1 calories",
            "carbohydrateContent": null,
            "cholesterolContent": "71.4 mg",
            "fatContent": "12.6 g",
            "fiberContent": null,
            "proteinContent": "26.6 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "58.5 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-07T18:15:40.513Z",
                "reviewBody": "I make a version of this recipe all the time and in my opinion it's the only way to make an eye roast. This post may help some of you. First I like to preheat the oven at 500 for 20 min. it gets the walls of the oven nice and hot so it holds the heat longer. Then with a pastry brush I paint the whole roast with a browning sauce you can find it in the dry gravy mix section at your local supermarket it comes in a little bottle with an orange lable and lid. Then I season the roast with garlic powder,salt,and fresh ground black pepper. once the roast is seasoned I place it on a roasting rack in a shallow roasting pan FAT SIDE OF ROAST UP! VERY IMPORTANT. AS THE FAT MELTS IT BASTES THE ROAST! Put it in the oven for 7 min. per pound then turn off the oven and leave in for 20 min. per pound. DO NOT OPEN THE DOOR TO PEEK AT THE ROAST. WHEN TIMER GOES OFF REMOVE FROM OVEN AND LET THE ROAST REST FOR 20 MIN. VERY IMPORTANT TO LET REST! SO THE JUICES SETTLE DOWN INTO THE ROAST. SLICE THIN AND ENJOY!! YOUR GONNA LOVE THIS RECIPE I PROMISE YOU. SO EASY! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PJL4965",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/561019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-18T21:57:22.15Z",
                "reviewBody": "I had a 4 lb eye of round so I cooked it at 475 for 28 minutes. We had some unexpected delays, so I decided to just leave it in the oven rather than take it out after the 2.5 hours. It was probably in another hour or so.\n\nThis was done to PERFECTION for us! We like our roast beef bright pink all the way through, but not rare. This hit it spot on!\n\nFor seasonings I rubbed the roast with a combination of salt, pepper, onion powder, garlic powder, paprika and thyme. I probably used about a teaspoon of salt and about 1/2 teaspoon of each of the others.\n\nThanks for a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LinEv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2415398/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-19T03:56:45.137Z",
                "reviewBody": "The most bizarre sounding recipe I'd ever heard and one of the best roasts I've ever had. Whatever thermodynamics were at work here were great. The outside was seared and crusty while the inside was medium rare, tender and juicy. The flavor combination was delicious. Thank you for sharing this wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mammaw",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2782500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-20T17:28:04.23Z",
                "reviewBody": "You know, I never make comments on anything over the internet..but have to on this recipe.  I was unbelievably surprised!  Following the directions to a tee (except using my own rub for the meat) this eye of round came out perfectly!  My husband is in the food business and was also amazed that an eye of round could come out so tender and juicy and very full of flavor. We like our meat medium and it came out slightly pink. For those who like it more done I would suggest turning on the oven to 350 after the 2 1/2 hours and check the temperature after 20 min.  I'll also try this method for other types of roast as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kacybeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2607430/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-22T01:05:09.843Z",
                "reviewBody": "I'm always on the the lookout for easy,...if not to say idiot-proof recipes,...that make my time in the kitchen minimal!This certainly fit the bill!As others,...I followed the recipe,...using a 7 lb. eye of round roast!Following this method,...I had to leave the roast in for 49 minutes at 475 degrees!I was skeptical,...especially when my smoke detectors went off!But,as instructed,...after the time required,...I dutifully turned the oven off for the 2 1/2 hours!What transpired after the time required...was nothing short of awe-inspiring!It had the perfect hue of pink in the middle,...and was mouth-wateringly succulent!This will be my go-to roast beef recipe 'til the end of time!I thank you,Lyn,...for making this guy's life just that much easier!Bless your heart!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Troll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1799160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-06T00:49:39.263Z",
                "reviewBody": "THE BEST!  i had a 5 lb roast, and we don't like it too red (well, I do, but the kids get kind of grossed out).  To get it a little closer to medium I roasted it at 475 for 39 minutes.  after 90 minutes in the turned-off oven, the meat thermometer read 125, but I figured it had definitely been up to at least 145, as it should be.  I took it out and covered it with tin foil.  While the roast rested, I put fries in the oven and made up a package of Aus Jus mix, adding the small amount of juice and scrapings from the bottom of the roasting pan. The roast was sooo warm and juicy when I cut into it!  I got out my handy, dandy Electric Food Slicer, and sliced up the roast very thin.  Then, I warmed the beef in the aus jus for a few minutes.  Finally, while the meat soaked, I make up some 'Weck rolls.  Slice fresh deli kaisers, place them face down on a cookie sheet, and brush with a small amount of water.  While still damp, grind coarse salt on the tops of the rolls.  Pop them in the oven for a few miutes to toast.  Serve sliced beef on the rolls with aus jus on the side.  Horseradish is a great compliment!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1956974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-27T18:35:07.89Z",
                "reviewBody": "I foresaw a problem with this recipe because I have an old gas oven with very poor insulation, I knew it would be stone cold before the roast was done.  Instead of turning my oven totally off I left it on around 200 F.  I didn't have very many juices in my pan for doing this, but the initial high temperature locked moisture into the meat and it turned out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rooj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2777615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-10T20:15:28.697Z",
                "reviewBody": "Before this recipe, I had never made a roast. I'll admit, I was really scared to do it the way that the recipe suggested, at such a high temp. I only had a 1.5 lb. roast so I didn't cook it as long (7 mins per lb., so I only had it on high for about 10 mins). It turned out perfectly!! I was so happy, and I ended up making a rump roast yesterday the exact same way. My family loved it. Thanks for the fabulous method...I will never cook a roast any other way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stasialu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2592944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-06T19:08:20.417Z",
                "reviewBody": "This recipie is awesome. I was also skeptical when I read it. My family doesnt like their meat rare so I cook it for about 9 minutes per pound. I also make holes in the meat and insert sliced cloves of garlic, then season with salt and pepper. Comes out perfect everytime. Another plus... its so easy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hillary5233",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2890004/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-23T22:44:41.350Z",
                "reviewBody": "I can see that my opinion is clearly in the minority here, but I was disappointed with this recipe.  I've made it twice now, hoping for a miracle - no such luck.  The recipe isn't necessarily at fault - the meat reached the stated temperature and was a beautiful pink color, BUT this cut of meat is TOUGH.  It also had very little taste.  This was the type of meat you start chewing and it just gets bigger and bigger in your mouth!  YUCK!!!  Sorry to disagree with almost everyone else who reviewed this recipe, but we will stick with a chuck roast or a standing rib roast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SBelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4125362/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "High Temperature Eye of Round Roast",
            "description": "Roasting in a hot oven makes this roast very tender.",
            "uploadDate": "2012-06-13T20:36:21.650Z",
            "duration": "PT2M7.628S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff24c35cc-e0ec-46e2-bf19-85dd61ca4a42%2F0fc91b94-b9f7-4dbf-802b-47d008bafb33%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1688035025001"
        }
    }
]