[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/97621/foolproof-rib-roast/",
        "name": "Foolproof Rib Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F792951.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "2019-04-02T06:48:07.000Z",
        "description": "I was looking for an easy way to make our Christmas Rib Roast. It turned out PERFECT. Rib Roast can be expensive, so this is a total splurge or special occasion dish. Enjoy.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (5 pound) standing beef rib roast",
            "2 teaspoons salt",
            "1 teaspoon ground black pepper",
            "1 teaspoon garlic powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Allow roast to stand at room temperature for at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Combine the salt, pepper and garlic powder in a small cup. Place the roast on a rack in a roasting pan so that the fatty side is up and the rib side is on the bottom. Rub the seasoning onto the roast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast for 1 hour in the preheated oven. Turn the oven off and leave the roast inside. Do not open the door. Leave it in there for 3 hours. 30 to 40 minutes before serving, turn the oven back on at 375 degrees F (190 degrees C) to reheat the roast. The internal temperature should be at least 145 degrees F (62 degrees C). Remove from the oven and let rest for 10 minutes before carving into servings.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SALSIEPIE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.751266464032422,
            "ratingCount": 1974,
            "itemReviewed": "Foolproof Rib Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "576.1 calories",
            "carbohydrateContent": "0.6 g",
            "cholesterolContent": "137.2 mg",
            "fatContent": "46.2 g",
            "fiberContent": "0.1 g",
            "proteinContent": "37 g",
            "saturatedFatContent": "18.6 g",
            "servingSize": null,
            "sodiumContent": "879.6 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-20T04:38:31.787Z",
                "reviewBody": "This method of cooking may make you hesitant BUT it works every time !!!\n\nThe trick is DO NOT OPEN THAT OVEN DOOR TO PEAK AT YOUR ROAST - Tape it shut if necessary to stop your curosity... you will absolutely be 100% satisfied if you do this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "joyce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1682016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-19T02:30:08.187Z",
                "reviewBody": "I also add rosemary to the rub mixture.  This method really does work every time!  You keep the roasting times the same no matter what size roast you use - the larger the roast is, the longer it will continue to cook during the time the oven is turned off. The second roasting time should be 30-40 minutes for rare; add 10-15 more minutes for medium or well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2426199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-18T22:13:47.523Z",
                "reviewBody": "We tried this recipe yesterday with a 2 1/2 lb rib roast! Fantasic!\nRubbed the roast down all over with olive oil, and then rubbed in McCormick's Grill Mates Monteral Steak  Seasonings (coarse salt,black pepper,red pepper,garlic and paprika)all over the roast and inbetween where we had the ribs cut. Tied entire roast back together  We cut the 1st cooking time down to 30 mins, waited about 2 hrs (the roast was 127 degrees) and then just turned the oven on for about 20 addl' minutes until the roast regisered 145 degrees-Perfect. Just remember NO PEEKING from the time the roast goes in, till it comes out! Smelled Wonderful and tasted even better! Thank You for this recipe, will now really enjoy fixing Rib Roasts no more guessing about the length of time it takes too cook!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANCHIP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/988410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-01-12T19:51:31.797Z",
                "reviewBody": "A great recipe if none of your side dishes require baking.  5 stars for taste, but subtract a little for the inconvenience of having my oven out-of-commission all day.\n\nI cooked it 45 minutes on the second baking as suggested by a previous reviewer that said the recipe as stated cooks a rare roast.  (thanks for that tip, btw)  Our 9-pounder was nicely medium-rare in the middle, with about two inches on either side of the middle medium-well. \n\nPS:  Forgot to mention, the butcher \"boned and tied\" the roast for me.  (They slice the meat off the bone, then tie it all back together.)  Much easier to carve this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lee m",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2574355/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T20:33:16.84Z",
                "reviewBody": "This is the first prime rib that I have fixed and I too was hesitant when I read the recipe; but, it was awesome.  The hardest part of the recipe is NOT opening the oven door.  It tasted as good as it smelled while cooking.  The next time that I fix a rib roast I am going to put garlic in the roast and put a can of beef broth in the bottom of the pan, I had no au jus, only fat in the bottom of the pan.   ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CarolinaGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2469585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-02T20:37:53.9Z",
                "reviewBody": "We bought a 10.5 lb standing rib roast at Costco to serve for christmas.  We had 8 family members coming for dinner and we had already had our quota of ham and turkey.  After scouring the internet for prime rib cooking instructions I decided to go with this one because of the large amount of great reviews. The one thing I gleaned from all the advice was that a meat thermometer is crucial. I bought one that has the probe that stays in the meat while the meter stays outside so it can be watched.  I am so glad I did it this way.  I let the meat sit out for two hours prior to cooking and it was 50 degrees when put in the oven.  We like our meat med rare so I decided to use 125 as the max oven temp of the meat. I had read 120 for rare 125 for med rare and 135 for med. Beyond that why bother.  After 2 hours and 10 mins the roast was 125. I pulled it out of the oven and let it sit for 45 mins. It rose to 130 degrees. I turned the oven back on 30 mins (300 degrees) before serving.  The probe registered 130 when I cut the meat.  The outside was beautiful and the inside was perfect.  A little med on the ends and med rare in the middle.  Everyone loved it and sang my praises.  Thank you so much for the recipe.  My one piece of advice, use a meat thermometer because all ovens are different and most roasts cook a little different then the last one you cooked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BINKY149",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/639428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-07T03:39:09.417Z",
                "reviewBody": "This is by far the BEST recipe I've ever used for rib roast!  It doesn't matter what size roast you have, just follow these cooking instructions.  I was very sceptical, but this was soooo tender and delicious.  I'll only cook rib roast this way in the future.  THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NAUTICOLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-25T23:52:49.837Z",
                "reviewBody": "Perfect, absolutely perfect.  I also didn't feel comfortable with the style of cooking, but perfect.  I used the same times, did not open the oven for the entire 3 hours, but did add some potatoes upon reheating to 375.  They were perfectly cooked as well (quartered red potatoes with   caramelized onion and garlic). Used the salt and pepper measurements and added some Sint Maarten Guavaberry Blackening. Half the amount of the salt, a quarter of the pepper. Used a 4.16 lb. roast. Spectacular, the meat itself is delicious, just need to cook it right.  THIS IS THE WAY. \n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Milkshake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2023830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-24T14:41:06.837Z",
                "reviewBody": "I respectfully disagree with MJG1940 who said with this method of preparing a prime rib it doesn't continue to cook once out of the oven because it doesn't have a bone. Think about it: Potatoes, cookies, cake, hardboiled eggs, pasta, casseroles, etc. all continue to cook once they are out of the oven/boiling water, and they don't have a bone. Not only does the roast continue to cook because of the internal heat, but as it cool a little the juices run slower and give a more juicy roast when it is carved. I never buy a prime rib with bones, it seems like a waste of money to me.  \n\nBUT, this recipe needs to be adjusted for larger cuts of meat After you have baked it for one hour, let it set, then turned the oven back on, the recommend times for :.  3-5 lbs. 30-35; 6-7 lbs, 40-45; and 8-10 lbs, 50-60 minutes.  Be sure to let it sit for 10-15 minutes before carving it.  AND make sure you DON'T open the oven door during the entire process.  If you need an oven, remember, that is why God made Crock Pots, microwaves and electric fry pans!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marlene Osborn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3386942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-14T18:02:02.433Z",
                "reviewBody": "It DOES matter how large or most importantly how small the roast is when selecting your baking time.  I followed recipe EXACTLY and am now staring at a black, overcooked, dry rib roast. Terrible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Lolo Kay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3866864/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Foolproof Rib Roast",
            "description": "When you want to splurge, this rib roast recipe rocks.",
            "uploadDate": "2012-07-10T19:45:36.503Z",
            "duration": "PT2M0.162S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe319be18-a522-46ce-81cd-3cf0bae44161%2Fd7a84fcb-dabd-4d02-ba47-b6947916a1c3%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729165841001"
        }
    }
]