[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1998/bread/quick-bread/biscuits/",
                    "name": "Biscuits",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/98051/super-simple-biscuits/",
        "name": "Super Simple Biscuits",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F490195.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:48:08.000Z",
        "description": "This super simple recipe will have warm biscuits on your table in a jiffy! Best served warm... add some Cheddar cheese and garlic powder if you like. Yummm!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 biscuits",
        "recipeIngredient": [
            "1 cup self-rising flour",
            "½ cup butter, softened",
            "½ cup sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the flour, butter, and sour cream together in a bowl until blended. Scoop the batter into ungreased cupcake tins.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until puffed and golden brown, 20 to 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Biscuits"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Katie-Kate"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.298245614035087,
            "ratingCount": 57,
            "itemReviewed": "Super Simple Biscuits",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "250.4 calories",
            "carbohydrateContent": "16.3 g",
            "cholesterolContent": "49.1 mg",
            "fatContent": "19.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "383.7 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-18T17:38:51.937Z",
                "reviewBody": "Nice little biscuits.  I made my own self-rising flour (in a one cup measure: 1 1/2 t. baking powder and 1/2 t. salt; then add all purpose flour to cup and level off). I used lite sour cream just to use it up and I did add 1 T. of milk because my dough seemed really dry.  As another reviewer mentioned these didn’t brown very well on top, even though I drizzled them with a little melted butter before baking.  So, I slipped them under the broiler just for about 30 seconds to give them a little better color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bellepepper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4452392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T16:55:56.35Z",
                "reviewBody": "This makes a very thick batter, almost a dough. The batter nicely fills 6 muffin tins. My biscuits took the full 30 minutes to bake. The sides browned nicely, but the tops were still very light. Next time I may add some melted butter to the tops about halfway through baking. I couldn't wait until dinner, and tried a biscuit. I half expected them to be bland, but they were delicious. The salt in the flour, richness from the butter and tangy undertone from the sour cream are a delightful combination. I spread a little homemade apple butter on one for a very tasty snack.  It's so quick and simple and can easily be doubled.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam Ziegler Lutz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pam-3boysmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-25T23:30:57.313Z",
                "reviewBody": "Expect a THICK dough when you make this. This is drop-biscuit consistancy. The flavor of these were good though VERY crumbly. Like I would bite into one and it would fall apart. That really was the only downfall for this recipe. When I eat a biscuit I like to bite into it and not have to pick the pieces off of my plate. I think it could use another flavor besides the sour cream and butter. Next time I'd like to add some garlic powder or something if I were to serve this with dinner again. Maybe knead the dough a bit with a little more flour and see if cutting this with a biscuit cutter would make a difference. This would make a great breakfast biscuit with a homemade jam spread on the insides.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-31T20:01:56.76Z",
                "reviewBody": "I tried this recipe as an experiment just for grins because some things about it were so unusual. What struck me? First baking them in a muffin tin. Second at the moderate temperature of 350 a temperature more for cupcakes. Third a stick of butter for a cup of flour?! Finally some reviewers reported the tops didn't brown. I decided to try this recipe with a different take. I blended the butter with the flour until crumbly then gently stirred in the sour cream taking care not to overwork the dough so as to ensure tenderness. I like the crusty sort of crunchy golden exterior of a nicely baked biscuit so I baked them at 450 on a cookie sheet lined with foil for easy clean-up. I dropped them onto the sheet in mounds and flattened them slightly. (If I try these again I'd skip that step - maybe they'd rise just a tad higher) I was pleased with the results all of which I expected. I saved time and a pan to clean by dropping them onto cookie sheets. The biscuits baked to a golden brown including the tops - and in 10 minutes! They were soft and tender with a crusty exterior. And because of all that butter they were rich and flavorful. But...as I also expected these were TOO buttery - you could use half the butter (even if you had to add a little extra sour cream or even milk to compensate) and these would be much better - less butter-saturated and a little less salty. Four stars as I baked them lower if baked as directed and they didn't brown.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-06T17:13:22.41Z",
                "reviewBody": "Be sure and use unsalted butter otherwise these are WAYYYYY too salty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "bmatheson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1610064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-06T19:11:25.66Z",
                "reviewBody": "I did 2 cups of Bisquick 1 stick of butter and 1 cup of sour cream! This was the perfect amount to fill a 12 count muffin pan. UNREAL! These are the best biscuits I've ever had. Won't be looking for another biscuit recipe....this is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jaime920",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3168716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T15:47:20.443Z",
                "reviewBody": "I made these for dinner last night and had to stop my son from eating ONLY these biscuits. I added garlic and cheddar chesse and baked in a mini-muffin tin. The only thing I will do differently next time is to lightly grease the tins. I think the cheese made them stick slightly. Thanks for the recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LMM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4421709/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-20T15:58:04.95Z",
                "reviewBody": "Quick easy tasty. These will work well for easy breakfasts for my husband...he can just zap them in the microwave and add butter and jelly. I hope others give them a try now too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TwoSweetPickles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lynna/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-25T04:35:37.08Z",
                "reviewBody": "The recipe given is a dough not a batter. If you want a thick batter use buttermilk instead of sour cream. It also has more butter than usual. To make a thick batter as described I used: A scant cup of whole wheat pastry flour (I always use whole wheat) 1/2 tsp each baking powder and baking soda. Then I softened 3 Tbsp. margarine and mixed it w/ 1/2 c. lite sour cream and 3 Tbsp. water to get the right consistency & baked in a muffin tin as recommended but at 400 deg in the toaster oven for 14 min. covered loosely w/ foil and an additional 5 min. uncovered. The batter created so much steam that they didn't have enough substance for biscuits. There is such a thing as TOO light. They did have good flavor. Next time I will make it w/o water as a soft dough. I will use my own labor-saving method and make scones (faster than biscuits) by hand-forming the dough into a log about 3\" diameter then patting it down into a 3/4\" thick rectangle on a small non-stick toaster oven tray. I then score it w/ a sharp knife into triangles--this size recipe makes about 5 good sized scones. It is much easier than rolling & cutting biscuits. I'll bake as I described above. What this recipe has taught me is that by softening the margarine I can skip the usual scone step of cutting the shortening into the dry ingredients and that lite sour cream is a slight improvement over my usual buttermilk. I appreciate learning to make already easy scones even easier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Little Old Lady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5024877/"
                }
            }
        ]
    }
]