[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/152/breakfast-and-brunch/potatoes/",
                    "name": "Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/100506/irish-potato-farls/",
        "name": "Irish Potato Farls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5228161.jpg",
            "width": 2576,
            "height": 1932
        },
        "datePublished": "2019-04-02T06:48:11.000Z",
        "description": "The word farl originates from the Gaelic word fardel meaning four parts. These potato griddle breads can be made with leftover mashed potatoes too.  Serve hot with a little butter and salt, or fry them alongside soda bread as part of an Ulster Fry-up.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 farls",
        "recipeIngredient": [
            "4 medium potatoes, peeled and halved",
            "1 pinch salt",
            "¼ cup all-purpose flour, plus extra for dusting",
            "1 tablespoon melted butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a  pot, cover potatoes with water and bring to a boil over high heat. Simmer on medium-high heat until the center of the potatoes are tender when pricked with a fork, about 20 minutes. Turn off heat. Drain, return potatoes to pot and allow to completely dry out over remaining heat. Mash with a potato masher until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place warm mashed potato in medium bowl. Stir in flour, salt and melted butter. Mix lightly until dough forms.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a well floured surface, knead the dough lightly. The dough will be sticky. Use a floured rolling pin to flatten into a 9 inch circle about 1/4 inch thick. Cut into quarters using a floured knife.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle a little flour into the base of the skillet and cook the farls for 3 minutes on each side or until evenly browned. Season with a little salt and serve straight away.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ita"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.037037037037037,
            "ratingCount": 54,
            "itemReviewed": "Irish Potato Farls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "217.9 calories",
            "carbohydrateContent": "43.2 g",
            "cholesterolContent": "7.6 mg",
            "fatContent": "3.1 g",
            "fiberContent": "4.9 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "33.4 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-17T21:58:54.523Z",
                "reviewBody": "To those folks who complained about blandness: This is a biscuit. A quick bread devised in a time of dearth in order to survive. It's not a cookie nor a main course. It's easy and filling and tasty and a good foil for a myriad of savory foods if you happen to be fortunate enough to have something else for an entree. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAUSERATI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1436444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T19:07:04.13Z",
                "reviewBody": "If you add buttermilk to the recipe, it makes the dough more pliable, also the griddle must be at a very low temperature.My granny used to make these when I was growing up in Ireland, and she always added butter milk.I add crushed garlic to mine now, and sometimes basil.You can even add mashed veg to get your kids to eat them, taste good too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "betty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4034517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-06T18:02:51.14Z",
                "reviewBody": "We had these with the Ulster Fry-Up, and although I had told myself beforehand that I'd have only one wedge, I ate so many that I'd hate to admit to the actual count. Fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "foodelicious",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/foodelicious/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T23:17:45.343Z",
                "reviewBody": "These were delicious! I added a little onion powder to the dough mixture - this was a BIG help! I used bacon grease to fry the second batch instead of using flour - this was also quite tasty. They were good either way really... thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1347047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T19:20:41.587Z",
                "reviewBody": "I was raised on these but we just called them potato pancakes because my Mom and Grandmother made them into individual cakes. I add a little onion and garlic powder and always serve with a little butter on top. By doing individual cakes they are easier to spoon on the pan and flatten and 1/4 of flour is just enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Thiel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3292040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-13T21:42:12.22Z",
                "reviewBody": "My family learned to make these years ago when we moved to Canada from Northern Ireland. Also Soda Farls because you can't get either here, lol. These are actually made to griddle, but then fry in bacon grease or lard, then we put HP sauce on them. Yummy! Same as the Soda Farl, after grilling you fry in whatever grease you want and either eat with an egg on top or HP sauce. This is a family favorite for us. The soda farl tastes good just eating right off the griddle, but these I have always perferred them after you fry them. (but you still have to griddle them first before you fry) Anyways, that is just my two cents, lol. Enjoy. Oh, and the key to these turning out is to dry your potatos after boiling as the OP said. If you don't dry out your potato, it will be too mushy with the flour. And with these and with Soda farl, you need to be willing to adjust how much flour you use. There can be lots of different factors that affect how much flour goes in. And the soda Farl is the same thing with the buttermilk. Sometimes it is say one cup and other times you might use 1 1/4 or even 1 1/2 cups. Once you get to know what the dough for either should look and feel like, you just make your adjustments with the ingredients. If you ask some of the older generations that made these for an Ulster Fry, they will tell you that you can't always count on the exact same measurements.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "maggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2826439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-22T22:14:39.133Z",
                "reviewBody": "Fantastic! I moved from Northern Ireland to Canada in 2003 and this is what I missed most! They taste exactly as they do when you buy them from the shop. I prefer to toast mine with butter dripping off them. I use a 10 pound bag of potatoes so that I can make extras for freezing and share with the rest of the family I have over here. Thank you so much for posting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gemmasgrub",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2844038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-08T15:50:01.173Z",
                "reviewBody": "These are delicious! I followed the PR's suggestion and doubled the butter and flour...mmmm...betcha can't eat just one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SJDOYLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/838377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-08T16:29:05.95Z",
                "reviewBody": "Farl's are wonderful and this is the perfect recipe. I notice a lot of people saying they needed to double the flour - I find that it depends on the water content of the potatoes. The dryer the potato - the lesser the amount of flour. You are after all making a dough. it is very important to let the potatoes dry on a warm stove. I've been known to put mine in the oven for a bit on warm. I do also add a bit more butter - and thats just for personal taste (and in case I over-dry!:)) These are a wonderful comfort food and in these days - this recipe can be used as a base for a wonderful main dish add a veggie over top with a bit of meat a bit of gravy sort of like a pot pie YUMMY a very very economical and delicious meal! or for breakfast add crumbled cooked bacon to your dough and serve with fried eggs over top! I've even tried rolling this dough around pre-cooked hotdogs and I got to tell you it was wonderful! (but thats just me:)) - for changing the recipe up - Try adding rosemary or dill. Plenty of Garlic... and yum onion! Grate and dry your onion with the potatoes. instead of butter try butter and sourcream - or sour cream alone. The sky's the limit. Thanks Ita for the perfect Farls recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sheila",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sheilac/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-11T04:54:05.903Z",
                "reviewBody": "I usually make boxty for our StP's dinner but I saw these and thought I'd give them a trial run. I can't say I liked them. I found I needed WAY more flour to make the dough pliable and they really didn't achieve the light fluffy texture that farls should have. I think I'll try my luck with Ita's farl recipe that uses buttermilk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            }
        ]
    }
]