[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/248/main-dish/burgers/",
                    "name": "Burger Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1987/main-dish/burgers/veggie/",
                    "name": "Veggie",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/101522/jamaican-burgers/",
        "name": "Jamaican Burgers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5483876.jpg",
            "width": 1500,
            "height": 1000
        },
        "datePublished": "2019-04-02T06:48:13.000Z",
        "description": "Jamaican burgers are spicy vegetarian burgers that are very tasty. They are my favorite to make, and my friends love them!",
        "prepTime": "P0DT0H2M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H17M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "2 ¼ cups chopped onion",
            "3 cloves garlic, minced",
            "1 habanero pepper, chopped",
            "1 ½ tablespoons grated fresh ginger root",
            "1 teaspoon salt",
            "¾ teaspoon ground allspice",
            "¾ teaspoon ground nutmeg",
            "2 ¼ cups cooked black beans, rinsed and drained ",
            "2 ¼ cups cooked long-grain white rice",
            "2 ½ cups dry bread crumbs",
            "6 hamburger buns, split"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon of olive oil in a large skillet over medium heat. Add onions and garlic; cook and stir for a few minutes. Mix in the habanero pepper and continue cooking until tender. Remove from the heat and transfer to a bowl. Pour in the beans, rice and bread crumbs. Season with ginger, salt, allspice and nutmeg. Mix thoroughly using your hands. Form into 6 patties.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the remaining oil in a large skillet over medium-high heat (you can use the same one). Fry the patties until golden on each side, about 10 minutes total. Serve on buns with your favorite toppings.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Burger Recipes",
            "Veggie"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Hannah"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2555555555555555,
            "ratingCount": 90,
            "itemReviewed": "Jamaican Burgers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "530.8 calories",
            "carbohydrateContent": "92.6 g",
            "cholesterolContent": null,
            "fatContent": "9.7 g",
            "fiberContent": "10.9 g",
            "proteinContent": "17.5 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "1307.4 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-05T04:08:33.94Z",
                "reviewBody": "These were delicious! Like several of the other chefs I added egg to my mix. My partner and I really enjoy making Veggie Patties and have tried several of our own creations and this recipe served as a great base to start with. Admittedly I am a professional chef so most recipes I only use as a guide. A few pointers for those having problems with binding. Once my beans are cooked I slightly cool and use my kitchen aid to make a a chunky bean paste. I would also add the rice to this mix (although I substituted quinoa instead). Also if you are unsure if the mix will hold try a mini test pattie. This will also allow you to adjust seasoning as beans take a lot of salt and flavors come out with heat. Additional suggestions are try adding some grated carrot fresh parsley and also can go half and half with black beans and another of your favorites. As well I like to make a large batch of the mix and make my burger for dinner and shape the rest onto a parchment lined cookie sheet and freeze patties. Once frozen I portion them into packs. Make sure to keep a layer between them or it wont be fun pulling them apart! Jerk Mayo and cheese also top these off nice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelsey Brick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1417973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-11T07:45:11.343Z",
                "reviewBody": "Never having eaten let alone made a veggie burger - I have to say that these were pretty good! I halved the recipe and still made 4 good sized burgers. Made exactly as written. For those reviewers who said that these didn't form into patties and crumbled when cooking you didn't follow the directions! Mixing thoroughly with your hands is a MUST. I started out mixing with a spoon and the mixture was dry and loose then I dove in with my hands and really mixed and mashed it up and that made all the difference! Had NO problems forming patties and very minimal crumbling only around the edges when cooking. There is no need for an egg in this recipe if you follow the directions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sixkyej",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-27T19:40:04.233Z",
                "reviewBody": "I both make and buy a lot of vegetarian burgers and this recipe is the best by far! I've made these twice now for my family - once on buns with melted cheese lettuce sauteed onion and tomato and once as just patties with our favorite Jerk sauce sweet peppers and onions to complete a Caribbean themed meal - both were complete hits! Having small children I substituted the habanero with a jalapeno and also used a dash of cinnamon instead of the allspice as I didn't have any on hand. I made the recipe for 8 using two cans of drained and rinsed black beans. The fresh ginger is a must!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Xia Neifion Clark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/105102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-10T17:15:00.647Z",
                "reviewBody": "I am sitting here eating THE VERY best veggie burger ever! Thank you for the recipe! I used brown basmati and homemade whole wheat breadcrumbs. I also added two eggs and coated with cornmeal for a very nice crunch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shawnessym",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2589705/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-09T20:40:51.86Z",
                "reviewBody": "Edit: I am editing my review and giving it 5 stars because I did not read the instructions properly the first time I made these. You do not need egg - mashing the mixture holds it together great. Such a wonderful recipe thank you! Great recipe! I would've given it 5 stars but it was really lacking a main ingredient as others have stated: egg. We used 2 and the burgers held together great even on our grill. Otherwise it would've fallen completely apart. Topped with lettuce tomato and slices of avocado awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KELLYRNH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/831930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-17T02:40:11.233Z",
                "reviewBody": "Not sure what the last person did wrong but these burgers formed excellent patties - so good that we were even able to BBQ them which was a welcome change from frying. The only thing I changed in the recipe was that I used 2 cans of black beans and used Basmati brown rice. The taste was awesome - not too hot but enough to know you were eating something with heat. I will definitely be making these again. The recipe also make a lot more than six patties which is OK because I'm looking forward to the leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deidre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2272478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-05T16:45:29.533Z",
                "reviewBody": "Awesome tasting veggie burgers better than any we've tasted before! I needed to add agg to bind this together although the recipe doesn't call for it. Three vegetarian friends have placed this recipe on their FAVORITES list.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JoanPyke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2639812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-26T22:42:50.19Z",
                "reviewBody": "I believe this recipe could make T-Rex less of a carnivore. I made this exactly as stated and cannot think of any alterations to make. I used a 3\"x1/2\" round cutter to form \"burgers\" and served it as a sandwich burger with the typical condiments. Using the cutter I had ten servings and put the leftovers in the freezer for another time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mike Harvey, daPITA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mikeharvey1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-31T18:24:06.767Z",
                "reviewBody": "These had an unusual taste for a veggie burger but we enjoyed them. I give it a 4 because I had trouble with the patties staying together. I did substitute ground oats for the bread crumbs which maybe could have caused the problem. If you are looking for something different yet east this recipe is great. If you are looking for something resembling more of a \"traditional veggie burger\" this may not be the recipe for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kellyd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2475255/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-08T01:01:29.267Z",
                "reviewBody": "These were tasteless. I don't know I didn't know quite what to expect and I gave these every advantage making home made buns the works. I used Basmati rice which has a flavor we adore. For the record use an egg squishing it all together is something you'll still have to do to form a patty perhaps a 2nd egg might help but to what end? I might try something like this again but it would have to be radically different.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Randy Schultz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2434451/"
                }
            }
        ]
    }
]