[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/102831/grilled-chicken-and-portobello-lasagna-rollups/",
        "name": "Grilled Chicken and Portobello Lasagna Rollups",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F212160.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:48:15.000Z",
        "description": "A different take on lasagna, these rollups have a filling of grilled chicken breast, sauteed portobello mushrooms, spinach and cheese. They are wonderful with a side salad and hot garlic bread.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "18 rollups",
        "recipeIngredient": [
            "18 lasagna noodles, cooked and drained",
            "2 cups marinara sauce",
            "1 teaspoon vegetable oil",
            "2 portobello mushrooms, diced",
            "1 cup frozen chopped spinach",
            "2 cups diced cooked chicken ",
            "1 (15 ounce) container ricotta cheese",
            "½ cup grated Parmesan cheese",
            "1 teaspoon dried oregano",
            "salt and ground black pepper to taste",
            "2 cups Alfredo sauce",
            "1 cup shredded mozzarella cheese",
            "¼ cup pine nuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the lasagna noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the noodles are cooked, but still firm to the bite, about 8 minutes; drain and rinse.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Spread the marinara sauce in the bottom of a 9x13 glass baking dish; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a skillet over medium heat; cook and stir mushrooms until they soften, about 5 minutes. Stir in spinach, and cook until hot; remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together the chicken, ricotta cheese, Parmesan cheese, oregano, and the cooked spinach mixture in a large bowl. Season to taste with salt and black pepper. Spread about 1/4 cup of the mixture on each lasagna noodle. Roll the noodle up, and place seam-side down into the prepared baking dish. Repeat for each noodle. Spoon Alfredo sauce over the rollups.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake, covered, in the preheated oven for 40 minutes. Uncover; sprinkle with mozzarella cheese and pine nuts. Return to the oven and bake until the cheese is melted and bubbly and the pine nuts are toasted, about 10 minutes. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Rachel Hardy Cunningham"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.682539682539683,
            "ratingCount": 63,
            "itemReviewed": "Grilled Chicken and Portobello Lasagna Rollups",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "602.7 calories",
            "carbohydrateContent": "50.8 g",
            "cholesterolContent": "74.2 mg",
            "fatContent": "32.1 g",
            "fiberContent": "4.2 g",
            "proteinContent": "30 g",
            "saturatedFatContent": "12.7 g",
            "servingSize": null,
            "sodiumContent": "1003.8 mg",
            "sugarContent": "9.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-24T17:45:03.317Z",
                "reviewBody": "This recipe was very delicious! I did make a few mistakes though and I hope by sharing them it will help others out.. First I should have chopped my ingredients previous to starting the cooking - I used fresh spinach mushrooms and a frozen chicken breast I had to defrost and cook. I started boiling the lasagna noodles far too early so by the time I actually made the rolls they were sticking together and some were ripped. The next mistake I made was doing the mushrooms separate - my boyfriend doesn't eat them so I decided to add them to only a few rollups for myself but the mushroom quantity ratio to the other ingredients was overpowering so they didn't turn out so well. Also the recipe says to boil 18 noodles and it makes 9 servings. I'm not sure if it's just me but I could only fit 12 rollups in my 9x13 glass pan. I made them by having the noodle flat adding filling along the middle and rolling it up so it was layered (kind of) and very fat! If it is supposed to be done another way please let me know! I think the best part of this recipe was the combination of tomato and alfredo sauces with all the cheeses - absolutely delicious! Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bailey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3453239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-17T14:55:42.403Z",
                "reviewBody": "This was really tasty! My boyfriend and I absolutley LOVED it! A few tips to share: #1 If you cook the noodles ahead of time place them separately on top of wet paper towels to prevent them from drying out. #2 Cook the spinach and mushroom mix in white wine. It really adds a bit of great flavor #3 I thought it could use a little bit more ricotta and spinach. This is just personal taste however as I LOVE lasagna filling! #4 make sure the chicken is cut up really small to make it easier to eat as well as easier to roll up!! Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AmyG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3747921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-14T17:19:12.18Z",
                "reviewBody": "This recipe is unbelievable! I followed the recipe exactly as it was written (pine nuts and all) and it was out-of-this world!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JennyC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3843073/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-04T20:04:56.94Z",
                "reviewBody": "Wow! This was delicious! My boyfriend (who doesn't like spinach or mushrooms) had three servings (and I had two!)...I didn't use the pine nuts because I didn't have any. I used low-fat alfredo sauce and 2% milk mozarella. I also used a little more parmesan than called for (mostly because I wasn't paying attention when I put it in...but it still tasted wonderful). I served it with some homemade garlic bread. The marinara and alfredo go together VERY well...it gave the roll-ups a completely different taste than they would have had with either sauce alone. I will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3534814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-01T21:21:53.693Z",
                "reviewBody": "Oh my goodness this was YUMMY! I didn't expect my husband to love it because he's not a big spinach fan but he had THIRDS when I made this. The only change I made was to add extra sauce based on other reviews. I think this recipe could actually be made without chicken and still be good if you're trying to make a vegetarian dish. Next time I might add some caramelized onions to the spinach mixture or maybe sautee some garlic with it. This would be just to experiment and not because the recipe wasn't wonderful exactly as written. THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TROOPDOOP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/864998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T20:07:50.907Z",
                "reviewBody": "I was gonna give this three stars until I ate it leftover. It was so much better the second day it was like a new meal. Okay here's the thing. It was too dry. Just my preference I guess. I like sloppy saucy lasagna. This may have been perfect if I had added a jar of alfredo (or even marinara) to the chicken/spinach mixture. Maybe even mix some mozzarella or substitute cottage cheese for the ricotta. That being said the second day I poured about half a jar of marinara on top and put it back in the oven and it was awesome. I was going to dump the leftovers but now I'm looking forward to having it for dinner again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Neely Swob Ursery",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1423621/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-01T17:25:51.817Z",
                "reviewBody": "These were absolutely delicious! I made a couple changes. First I added 2 eggs to the filling. There was no way the filling was going to stick together without something to bind it and eggs are a standard in lasagna filling so two were just right. Second I used all marinara sauce instead of the marinara/alfredo combo. My husband and I could not get enough of this meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T17:34:17.56Z",
                "reviewBody": "Absolutely delicious! Everyone loved it! I used fresh spinach instead of frozen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2554279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-03T20:56:54.47Z",
                "reviewBody": "I didn't add the mushrooms or pine nuts but it still turned out delicious! Word of advice: COVER and bake for 40 mins (it will keep your noodles from getting tough). Then uncover add cheese and finish baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "allicat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3784993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-23T16:45:24.543Z",
                "reviewBody": "Followed the recipe almost to a T. Only thing I did different was use fresh spinach. (chopped sautéed and squeezed dry) Used garlic flavored Alfredo and my boyfriend and I still thought this was just OK. Even the next day we didn't find it any better. With all those yummy ingredients we thought this was going to be a lot more flavorful. OH... and that prep time is way off. With all the chopping and cooking of the chicken and mushrooms... it was more like an hour prep!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "booboo9999",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6112781/"
                }
            }
        ]
    }
]