[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13293/main-dish/seafood/salmon/",
                    "name": "Salmon",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15846/main-dish/seafood/salmon/baked-salmon/",
                    "name": "Baked Salmon Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/103802/citrus-salmon-in-parchment/",
        "name": "Citrus Salmon in Parchment",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1133069.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-02T06:48:16.000Z",
        "description": "My mom taught me this trick for baking fish while keeping the moisture and flavors in. It is nearly foolproof and adapts easily; substitute regular oranges or other citrus, herbs and oils to your taste. Parchment paper is available in most grocery stores.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 (4 ounce) wild salmon fillets",
            "3 teaspoons olive oil",
            "4 (12 inch) squares of parchment paper",
            "1 blood orange, sliced into rounds",
            "1 lemon, sliced into rounds",
            "1 lime, sliced into rounds",
            "1 bunch fresh dill weed",
            "½ teaspoon lemon pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 450 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush each piece of salmon on both sides with a light coating of olive oil. Fold each sheet of parchment in half and use scissors to round out the corners so that it is almost a circle. Open the sheets back up.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the salmon fillets skin side down onto the center of each piece of parchment. Sprinkle with lemon pepper, then place a sprig of dill onto each fillet. Cover with one slice of orange, one slice of lemon and one slice of lime per serving. You may add more to taste. Lay another sprig or two of dill over the citrus slices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold each piece of parchment up and over the fillets. Holding both edges of the parchment together, roll the edge down making several folds as you go until the fish fillets are tightly sealed in their packets. Place packets on a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 12 to 15 minutes in the preheated oven, or until fish is able to be flaked with a fork. You may need to open one of the packets to check. To serve, place packets onto serving plates and use scissors to cut an X in the center, being careful not to cut the food.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Salmon",
            "Baked Salmon Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BenevolentEmpress"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.481481481481482,
            "ratingCount": 54,
            "itemReviewed": "Citrus Salmon in Parchment",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "273.1 calories",
            "carbohydrateContent": "10.2 g",
            "cholesterolContent": "67 mg",
            "fatContent": "16.1 g",
            "fiberContent": "2.9 g",
            "proteinContent": "23.7 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "130.5 mg",
            "sugarContent": "0.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-24T03:05:02.36Z",
                "reviewBody": "My family loved this salmon. The only change I made was as someone else said dried dill for the fresh because I failed to tell my husband that it should be fresh. Hehe. One thing you should try is to squeeze the citrus slices over the fish after it's cooked. It really added a punch to the flavor! I also had to make a modified lemon pepper because I didn't have any. I used lemon and lime zest and pepper but I think I needed salt too. All in all it was great! I'll use this cooking method for fresh fish again it came out better than any I've ever made! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joy Higginbotham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1318917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-23T16:11:21.247Z",
                "reviewBody": "I cooked salmon several times using this recipe. The first time I had it in the oven too long. I wanted to make sure the fish was completely cooked. Even with the parchment paper the result was a dry and somewhat tough fish. The second time I cooked the fish for 15 minutes the time stated in the recipe. What a difference! The fish was incredibly tender and juicy! The blood orange lemon lime and fresh dill provided a wonderful subtle flavor. Other times I used dry dill from McCormick and a standard Florida orange due to the unavailability of fresh dill and blood oranges. Even with these ingredients I found the salmon still had an incredible amount of flavor. I can confidently say this is the best salmon I ever had! This was also the first time I ever used a blood orange. I was shocked to see after slicing the orange a purple color not the familiar orange. Instead of throwing out the orange I did a Google search for blood oranges and discovered this is a normal color. I ate the left over blood orange and was pleasantly surprised by its exquisitely wonderful flavor. I also learned blood oranges are more popular in Europe than in the United States. I only found the blood orange available during the winter/spring. Bottom line I highly recommend this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steve Z",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2803316/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-15T00:14:02.1Z",
                "reviewBody": "Kudos to the author of this recipe! This is an excellent method for fish which produces beautiful results. The flavors are subtle and will depend on the quality of ingredients used. My only recommendation is to lightly salt the fish along with the pepper. Thank you for such a well written recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "opheliascout",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-28T01:30:41.047Z",
                "reviewBody": "This was excellent. It was my first time making fresh fish and it turned out so well! It was also a big hit with my family including the \"fish haters\". I used regular oranges and it worked out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin Jade",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1789492/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-16T12:48:50.553Z",
                "reviewBody": "I have made this on several occasions now and have gotten rave reviews. No need to go crazy with size or shape of parchment - just cut a piece big enough to make a package out of it. I often use a sprig of rosemary as the herb -tastes and smells fantastic. This is a great meal to bring to someone elses house - just make the packets at home and bake them when you get to the house. - serve with green veggie and couscous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gardengirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/662673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-08T23:17:36.04Z",
                "reviewBody": "I just prepared this recipe tonight for dinner and couldn't wait to review! This is so yummy - definitely a keeper for my family! I followed the recipe except added sea salt in addition to the lemon pepper seasoning. I love fresh ground sea salt with all of my fish recipes! This was no exception - it really brought out the flavor of the salmon. I loved using the parchment paper - made the salmon so tender and juicy! This is an awesome recipe to add to summer dinners! I added roasted red potatoes and sauteed asparagus as side dishes. I also poured the juices left over in the parchment paper over the salmon and we used fresh sliced french bread to dip in the juice - yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tiffany B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2276656/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-26T14:46:21.81Z",
                "reviewBody": "We really liked this salmon. The only alteration to the recipe I made was to use dried dill instead of fresh and I think my dill needs to be replaced as it wasn't very flavourful. The lemon pepper is needed for sure because the fresh citrus doesn't really impart a huge amount of flavour...we found it was primarily for presentation. A nice light dish which I will very likely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kelcampbell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kelcampbell/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-14T19:55:24.657Z",
                "reviewBody": "I couldn't find a blood orange anywhere around me but a regular orange fits as a perfect substitute. I have made this about 4 times and it hasn't lasted very long in the fridge not once. This takes some time to prepare but once it is finish it is worth it. I am not a big fish person but this recipe is a winner. Make sure to rub in seasoning before you place citrus pieces on the fillets. This one is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3062788/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T21:22:03.323Z",
                "reviewBody": "The salmon in this recipe came out so moist and so flavorful. (I cooked it for 15 minutes.) The orange lemon and lime flavors were very fresh and delicious. I only had dried dill weed but I didn't see where it made a difference in the final dish. I served the fish out of the parchment on a bed of baby spinach tomato wedges and carrot matchsticks. The sauce made a nice citrusy \"dressing\" for the spinach. Thanks for a great recipe Empress!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KOALAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-14T19:23:17.207Z",
                "reviewBody": "I used a regular orange and added some salt. Joe loved it. Said it didn't need the salt. I served it with sauteed mushrooms and rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie b",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2563463/"
                }
            }
        ]
    }
]