[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2258/side-dish/sauces-and-condiments/marinades/",
                    "name": "Marinade Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/106124/northwest-steakhouse-steak-marinade/",
        "name": "Northwest Steakhouse Steak Marinade",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2457544.jpg",
            "width": 2447,
            "height": 2447
        },
        "datePublished": "2019-04-02T06:48:22.000Z",
        "description": "I had a steak with this marinade, and it was the best steak I ever had.",
        "prepTime": "P0DT0H5M",
        "cookTime": null,
        "totalTime": "P0DT0H5M",
        "recipeYield": "1 /2 cup marinade",
        "recipeIngredient": [
            "1 pinch seasoned salt",
            "1 pinch garlic powder",
            "1 teaspoon Greek seasoning",
            "1 cube chicken bouillon, crushed",
            "½ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir the seasoning salt, garlic powder, Greek seasoning, and bouillon cube into the melted butter. Mix until the bouillon cube dissolves. Pour the marinade into a wide and shallow dish and place a steak of your choice into the marinade, turning to coat both sides. Cook or grill as desired.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Marinade Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tammy Prescott Heginger"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.670588235294118,
            "ratingCount": 85,
            "itemReviewed": "Northwest Steakhouse Steak Marinade",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "208.6 calories",
            "carbohydrateContent": "0.8 g",
            "cholesterolContent": "61.2 mg",
            "fatContent": "23.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": "14.6 g",
            "servingSize": null,
            "sodiumContent": "627.4 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-02T04:27:00.74Z",
                "reviewBody": "I have a question for the submitter:\n\nWould this by chance be from the Northwestern Steakhouse in Mason City, IA?\n\nIf it is, you are my new best friend.  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Blanchard Angell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dianea/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-30T19:19:56.877Z",
                "reviewBody": "A winner! Hubby loved this one and he's my toughest critic when it comes to what goes on his meat besides S&P. This was really good. I was going to have my husband charcoal this but he didn't have enough so I cooked this on the stove top in my favorite cast iron skillet. This would have been better had I used a better cut of meat than just an inexpensive round steak. I'm looking forward to having this on the grill next time. Thanks!!!  3-29-09 UPDATE: Hubby grilled some NY Strips and these were the BEST EVER! Steak house quality for sure. I was informed this is OUR new steak and everything else seasoning for evermore so don't lose the recipe. I agreed with my husband, this is FABULOUS!!! CAUTION: These will flare up when you place them on the grill. Apparently impressively enough for hubby to excitedly come in and ask me what I put in the \"exploding steak\" marinade?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~TxCin~ILove2Ck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T20:45:33.463Z",
                "reviewBody": "Wow, fantastic!  I used Emeril's Steak Rub since I was out of Greek seasoning, and it was great (I'm sure any seasoning combo you like would work just fine).  The BUTTER is the key ingredient here.  I would never have thought of trying it this way.  I pour this over steaks in a ziploc a day or two ahead and then set on the counter about 20 mins prior to grilling.  I use a gas grill and let it heat on hi about 10 mins, then reduce to medium and add the steaks.  It will flare like crazy, so keep an eye on things (but, unless it's obviously badly burning, don't pull the steak off the fire since that gives it great flavor).  After a couple mins, I turn the steaks 90 degrees to get the nice grill marks.  After a couple more minutes I flip and repeat on the second side.  Be aware that whatever temp you use, the steaks will cook more quickly due to the flaring.  FWIW, medium thickness steaks take about 8 mins total on medium setting on my grill to reach medium doneness.  Once removed to plates, we top each steak with a very thin pat of butter, tiny sprinkle of kosher salt and fresh cracked black pepper, then cover with foil and let rest about 5 mins to let the juices reabsorb.  I can't speak to other cuts, but for ribeyes (we look for ones with nice marbling, which always helps) -- absolute perfection!  Thanks so much for sharing, Jetta! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DISCOBUNNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-07T19:37:54Z",
                "reviewBody": "The restaurant from which this recipe originated is known for their AMAZING meals in North Iowa.  I've had this recipe for years but have honestly never 'marinaded' with it.  Usually, I mix this up & pop in immediately into the oven.  I use it mostly with chicken breast & pork chops & it never fails to produce unbelievable meals.  We seldom buy steaks, but got some real good petite sirlions at a great price & decided to make the \"real thing.\"   I did allow to marinade for about 5 hrs prior to grilling (again, I usually just bake my chops for about 45 mins @ 350) Ooolaalaa, Yummynummy!   I took a large sheet of foil & folded the sides up to create a pan-like area, flipped the meat onto the the foil (marinaded in a 9x13(had enough meat I had to double the recipe) & solidified into a perfect rectangle that I flipped onto foil & then placed foil on grill) The meat 'cooked' in it's juices as well as marinade, flavor explodes. At the restaurant, they also use this warmed sauce over spaghetti noodles.  I love it also stirred into my mashed potatoes that I serve with the meal or bread dipped into it.  Oh, the uses are endless & alway delicious.  Anyway you make any kind of meat with this recipe, marinaded or not, it always turns out so tender, juicy & out of this world!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "toodlebutt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3172633/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-28T16:31:26.283Z",
                "reviewBody": "Love it! I was wondering if anybody had any tips as far as when you pour the mixture/roll the steaks in it. The butter hardens almost immediately after touching the steaks as well as when you pull the steaks out to BBQ. I ended up breaking a bunch of the marinade up and sprinkling it onto the steaks. Still turned out great but looking for tips!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aweemawut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3508263/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-04T07:03:24.473Z",
                "reviewBody": "This is really good. My greek seasoning had both salt and garlic in it, so I skipped those 'pinches' of this and that. I used it on flat iron steaks and sea scallops. I hit them with a little lemon at the end, which woke everything up a bit - so that might be worth a try for you, as well. Thanks for the recipe - we'll use it again. ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-01T23:18:02.603Z",
                "reviewBody": "Wonderful! A keeper! Like someone else stated the butter hardens on cold meat. Rachael Ray says let meat 'rest' 20 minutes before cooking it to allow the muscle structure to relax to lessen toughness; so that may help I'll try that next time. We just melted the extra butter marinade as Hubby turned the steaks on the grill. They did cause flare up but no burning so don't get too worried. Taste is just like the high-end steak houses cause they use BUTTER!!! Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LNREED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-28T21:42:56.587Z",
                "reviewBody": "Really good! I softened the butter (rather than melting) and mixed in the rest so I could rub it into the steaks. I let them set at room temp for about 20-30 minutes before cooking them in a grill pan. I did use montreal steak seasoning in place of the greek seasoning (I was out) but will try it the way it is posted soon. I used this on thin cut six New York strips to make sandwiches. Simple and delicious. Thanks for sharing the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crazycatlady -  \"CCL\"",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1226023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-11T18:22:32.183Z",
                "reviewBody": "This was wonderful! My whole family loved it. I couldn't find Greek seasoning at the store so I made my own using one on AR. I used nonstick foil on the grill and turned the edges up so I wouldn't have flare ups. The steaks were perfect; a little crispy on the edges and juicy in the middle. I grilled them on medium for about 5-7 min on each side. I also saved about a third of the marinade to brush on the steaks while I grilled them. Definitely will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2082387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-04T20:29:25.963Z",
                "reviewBody": "Tried again and with a good cut it was better. More of a sauce than a marinade but really easy to mAke which is always nice",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1542483/"
                }
            }
        ]
    }
]