[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/657/soups-stews-and-chili/stews/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/107613/pollo-chicken-fricassee-from-puerto-rico/",
        "name": "Pollo (Chicken) Fricassee from Puerto Rico",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F296866.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:48:24.000Z",
        "description": "This is the authentic way to make Pollo Fricassee in Puerto Rico. You can either make in on the stove or in your slow cooker. It is delicious and very easy to make! Serve with white rice, tostones, and a nice salad. This tastes even better when you prepare the night before; just take it out of the refrigerator the next morning set it to cook.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound chicken drumsticks",
            "1 tablespoon adobo seasoning",
            "½ (.18 ounce) packet sazon seasoning",
            "½ teaspoon salt",
            "5 large red potatoes, peeled and thickly sliced",
            "1 large red bell pepper, seeded and chopped",
            "1 large green bell pepper, seeded and chopped",
            "1 large onion, chopped",
            "5 cloves garlic, minced",
            "1 bunch fresh cilantro, chopped",
            "2 tablespoons olive oil",
            "½ cup dry red wine",
            "1 teaspoon ground cumin",
            "1 teaspoon dried oregano",
            "2 fresh or dried bay leaves "
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Wash the chicken and pat dry; place into a large bowl.  Season with adobo seasoning, sazon seasoning, and salt.  Place the legs into a slow cooker, and cover with the potato slices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Puree the red pepper, green pepper, onion, garlic, cilantro, olive oil, wine, cumin, and oregano in a blender.  Pour over the chicken and add the bay leaves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low for 6 to 8 hours, until the chicken is easily removed from the bone.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MarisLatinTwist"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.290816326530612,
            "ratingCount": 196,
            "itemReviewed": "Pollo (Chicken) Fricassee from Puerto Rico",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "643.4 calories",
            "carbohydrateContent": "85.2 g",
            "cholesterolContent": "91.9 mg",
            "fatContent": "17.9 g",
            "fiberContent": "11.2 g",
            "proteinContent": "32.7 g",
            "saturatedFatContent": "3.9 g",
            "servingSize": null,
            "sodiumContent": "520.8 mg",
            "sugarContent": "9.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-18T18:54:34.603Z",
                "reviewBody": "Being a true Boriqua (from Puerto Rico) I can truly attest that this is the real thing.  I've been cooking from Cocina Criolla (the authentic PR cookbook) & there were no hints on how to adapt this recipe to a slow cooker.  So I was thankful when I found this. With the following adjustments my home smelled like it did when growing up and it tasted exactly how I remembered!  The few adjustments I made: 1) I cooked a whole chicken cut up into pieces that was about 4 pounds (basically straight from the store) so I increased the amount of adobo I used 2) I used one entire can of beer instead of the wine (any kind will do, I used Miller light this time) 3) I used the authentic frozen Goya sofrito instead of making the puree mix (again purchased from the store - DON'T buy the glass jar because it's not the real thing).  I used about as much sofrito as I would have had if I made the puree.  3) I added one entire can of tomato sauce 4) I happened to have canned diced and sliced potatoes, so I used that instead of cutting up the ones I had just purchased (I forgot I had them)....and I think that's it.  The adobo and sofrito are key to PR  cooking & unless you have this, it won't be authentic.  My family practically inhaled the meal because it was SO good.  Thanks to whomever originally posted this.  Now that I know I can make it in my slow cooker, it will be a frequently made dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "2kids",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2776768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-28T01:33:31.187Z",
                "reviewBody": "I have been making Fricassee this way for years and it is wonderful. The only difference is that I use white wine, a couple tablespoons of olives with their brine (about 8 olives), and an 8 oz can of tomato sauce or occassionally toss in a can of Rotel or other similar tomato and chile product. Hey, my grandmother makes it with white wine and tomato sauce so that's how I learned to make it many years ago, but this way is good too. Otherwise the measurements of ingredients are identical to what I have always used. Not only is it wonderful made in the crock-pot, but on the stove top as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peanutty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1533448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-04T21:22:38.893Z",
                "reviewBody": "Excellent dish! I'd describe this dish as extremely flavorful, moist, saucy and actually quite healthy. I served it alongside a salad. Its very filling and tasty even without a carb alongside it. I made only slight changes:\n1) To make it healthier, I substituted the chicken legs for skinless, boneless, chicken tenders (I used 3 packets, so I also doubled the potatos).\n2) The chicken rub calls for sazon seasoning  which I did not have. So, I looked it up online and made my own version of it: 1/2 tsp dried oregano, 1/2 tsp coriander powder, 1 tbl paprika, 1/4 tsp salt, about 1 tbl tabasco sauce, about 2 tbl white wine or rice vinegar. These ingredients are some of the ingredients included in the actual sazon. Other ingredients were already in the Adobo seasoning, so I didn't bother duplicating those. \n3) I thought the original recipe needed to be a bit saucier, so I added 2 cups chicken broth. \nThis dish gave me a whole new perspective on puerto rican food and could actually turn into a staple in our household! By the way, I wanted to mention that I think you could easily make-ahead the sauce in the blender to save time.\n\nSecond time I made it: I roasted the peppers, garlic and onion for about 24 min. using 1/2 the evol called for in the recipe. I did everything else the same. It was amazing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPICEGIRL2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1078445/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-05T01:01:21.593Z",
                "reviewBody": "This is a delicious, authentic Puerto Rican dish.  The recipe uses fresh ingredients and native spices.  My husband is Puerto Rican and LOVES this dish.  It is FAR from bland (didn't quite understand that review).  This is as authentic as it gets!  I needed two pounds of chicken drumsticks, so I just doubled the Adobo and used an entire packet of Sazon.  It was fantastic!  I have never been able to cook Puerto Rican food like my husband does, due to the fact that most of their cooking is done by taste, not measurements (and I could never quite master that way of cooking, LOL).  So thank you very much for posting a recipe that us \"non-natives\" can make!!!  Delish!!!!  8-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/728399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T01:32:34.73Z",
                "reviewBody": "This recipe is right on.  Reminded me of my mom's recipe.  My only changes were:  1)  added 1/2 can (4 ounces of tomato sauce) 2)used sofrito (check out recipe on this site and omit the tomatoes, salt, and pepper) in place of the cilantro, peppers, onions, and garlic.  I thought the it was very flavorful but although my husband liked it a lot, he felt it lacked a bit of salt.  So, for those who think it is bland, just adjust the salt/sazon/adobo to your taste because this recipe is a definate keeper! By the way, I made this awesome recipe in the slow cooker and also in a pressure cooker and got awesome results all the time.  My 6 year old daughter is amazed by the fact that the meat literally fell off the bone and left it dry.  Thank you for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "India520",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1590933/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T19:42:25.317Z",
                "reviewBody": "Great flavor and pretty easy (though time-consuming) to make. Tip: - Cook in dutch oven for 3 hrs on low heat instead of using a slow cooker - reduce the liquid. I used the amount specified in the recipe for 1.8 lb chicken (even though recipe calls for 1 lb) and still ended up w/ way too much sauce",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3554690/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-28T14:21:42.363Z",
                "reviewBody": "O My Goodness!!! There are not enough stars here to rate this recipe. It is amazing!! I used a 2 and a half pound bag of drumsticks skin removed. Two packets of sazon and two tablespoons of adobo. I used a 12 oz can of tomato sauce and a whole bottle of miller lite for this recipe. I did not use a crock pot and made it on my stove top instead. I first made the sofrito (blended veggies) then i seasoned the chicken with sazon and adobo and browned them in olive oil. I added all the sofrito, tomato sauce, and bay leaves and simmered on low for 45 minutes. It was perfect and the flavor was phenomenal. Will definately be making this over and over at my house .",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "andy68w",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7673122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-12T23:16:55.283Z",
                "reviewBody": "I thought this was pretty good and a great starting point! I am lucky enough to be from a Puerto Rican family so I used my aunt's homemade sofrito instead of all the peppers, cilantro, etc.. In my opinion this was way too salty from the all the adobo seasoning but this can obviously be adjusted and my hubby loves all that sodium anyway.... I did use a 4 oz. can of salt free tomato sauce and about 1/4 c. of white cooking wine. I did cut the potatoes into chunks from the reviewers suggetions and this worked out great. It would be good to add some pinto beans next time also. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MSPAX1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1403374/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-04T13:29:28.387Z",
                "reviewBody": "This was good I did play around with the spices a bit to get it just right but this was a good base. Next time I will make sure to cut my potato slices thicker as by the time this was done cooking the potatoes had mostly all turned to a mushy sauce. This didn't affect the taste at all just the presentation. Taste was very good. Next time I might try with a can of diced tomatoes as other reviewers have suggested.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "stphard212",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2152510/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-15T21:57:42.373Z",
                "reviewBody": "It was was way too much a potato fest without additional chicken; so I added 4 thighs. Otherwise I made it exactly as written. By the time this dish was finished cooking though it was way overcooked. The potatoes were mushy and falling apart and the chicken wasn't very tasty (or appealing) either. If I were to ever make it again I'd do it on the stovetop rather than rely on the prescribed time in the slow cooker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Love2Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2931928/"
                }
            }
        ]
    }
]