[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/200/meat-and-poultry/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
                    "name": "Steaks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/130995/steak-and-ale-pie-with-mushrooms/",
        "name": "Steak and Ale Pie with Mushrooms",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2591462.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-02T06:48:41.000Z",
        "description": "Beef and mushrooms simmer in a rich ale sauce before going into a hearty, flavorful pie guaranteed to warm you up on cold winter evenings.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 ¼ pounds cubed beef stew meat",
            "1 onion, diced",
            "1 (12 fluid ounce) can pale ale or lager beer",
            "2 cloves garlic, minced",
            "½ teaspoon dried thyme",
            "1 ½ teaspoons chopped fresh parsley",
            "2 tablespoons Worcestershire sauce",
            "salt and pepper to taste",
            "2 cups peeled and cubed potatoes",
            "1 ½ cups quartered fresh mushrooms",
            "1 tablespoon all-purpose flour",
            "1 pastry for double-crust pie"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the beef stew meat, onion, and ale in a large saucepan. Simmer over low heat until the meat is tender, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season the beef with garlic, thyme, parsley, Worcestershire sauce, salt and pepper. Mix in the potatoes and mushrooms. Cover and simmer over medium heat until potatoes are just tender enough to pierce with a fork, 10 to 15 minutes. Whisk a small amount of the sauce together with the flour in a small bowl, and stir into the beef. Simmer until slightly thickened.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fit one pie crust into the bottom and up the sides of a 9 inch pie plate. Spoon the hot beef mixture into the crust and top with the remaining pie crust. Cut slits in the top crust to vent steam and crimp the edges to seal them together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until the crust is golden brown and gravy is bubbling, 35 to 40 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Beef",
            "Steaks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mrs. L"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.260869565217392,
            "ratingCount": 69,
            "itemReviewed": "Steak and Ale Pie with Mushrooms",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "473.4 calories",
            "carbohydrateContent": "32.4 g",
            "cholesterolContent": "47.5 mg",
            "fatContent": "28.7 g",
            "fiberContent": "2.9 g",
            "proteinContent": "17.5 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "319.5 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-12T02:46:19.07Z",
                "reviewBody": "This was a hearty meal but I did need to adjust a bit as it was a bit bland.  I added some carrots, a cup of beef broth (as there was not enough liquid to cook the potatoes and tenderize the stew meat) and lastly I thought to add some tomato flavor.  I did not have tomato paste but added 2 Tbsp of ketchup and I immediatly knew it just what the dish needed.  I had to cook it longer than 30 minutes to get the meat to a stew type tenderness.  I only used a top pie crust to make it easier.  It cut down the time in the oven and seemed perfect and not overpowering.  I would make this again but with the modifications.  My husband being more of a meat and potato guy would want it again for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/662897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T01:18:14.217Z",
                "reviewBody": "Fantastic recipe!! I browned my diced stew meat first to add that \"brown\" flavor to the dish then deglazed the pan w/onions and 2 T minced garlic. Readded the meat and a bottle of Killian's Irish Red. I did not have a problem with too little liquid perhaps because I kept the dish covered as it simmered. Only other additions were a spoon full of beef base (no additional liquid) and a dash of liquid smoke. Great and flavorful even my grandson loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily Henderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1787725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T20:53:11.81Z",
                "reviewBody": "This was delicious and easier to make than I had expected.  I used a ready-made pie crust and a deep dish 9\" pan.  I took the advice of other reviewers and left the saucepan covered during all of the simmering steps to preserve the fluids, and I used a bunch of cornstarch (which works better for me with gravies) instead of the flour when making the rue.  Overall a big Superbowl Sunday hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "xayide",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1482937/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-12T00:19:21.3Z",
                "reviewBody": "I've made a pie just like this except using red wine instead of ale for years! My family and friends love it. Being British I used to use lamb's kidneys instead of mushrooms but they have not been available for ages so I began using the mushrooms and the pie has been a hit with everyone! I also use the rolled prepared pie crusts in a box as they bake to a very light flakey crust that many people can't achieve from scratch. Other than that the ingredients in my pie are the same and it's one of the best ever!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roni Mendez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2371799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-26T01:41:52.56Z",
                "reviewBody": "My boyfriend and I LOVED this! We used Guinness and it turned out great. The first time I followed the recipe but also added a few things such as basil and garlic and herb seasoning and some extra onion not because it needs it but because we really like onions. The second time I took a roast and put it in the crockpot with the onions Guinness and seasonings and let it cook all day. I used the juices to cook the mushrooms in and then combined everything. I made a package of beef gravy to top it with on our plates.Thanks so much for this great recipe! I think it will be a new staple in my house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2265296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-19T00:38:26.597Z",
                "reviewBody": "Definitely the best beef pie filling I've ever made. I followed the recipe closely with minor changes: I used fresh thyme fried the onions and simmered the beef gently for an hour (with lid on). I added 2 small carrots sliced with the potatoes. Because we're trying to lose some weight we gained over Christmas I used a mashed potato topping in stead of the pastry (and reduced the amount of potato in the filling). The whole family gave it 5 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNALIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1384277/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-01T17:57:06.327Z",
                "reviewBody": "This was Awesome! I didn't quite follow the recipe as written but I didn't change much. I used an imported beer from the UK (boddingtons). It came in a pint can and after reading some of the reviews about too little liquid I used all of it. I put the beef onions and beer into a casserole and cooked in the oven for about 2 hours at 300f. I did this in the morning and left the meat in the cooling oven. This made the meat extremely tender and allowed the flavor from the beer to be fully absorbed. I transferred the meat onions and beer to a saucepan and continued to follow the recipe exactly. I didn't change anything else and it was absolutely delicious! My husband had been waiting for me to make this pie for some time and he was not disappointed. He has not stopped talking about how good it tasted. This will definitely be a favorite in our family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ginny005",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5073915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-09T02:59:29.557Z",
                "reviewBody": "Thank you Master Chef L!! This was fabulous! It was my first time tasting steak&ale pie so it really did leave an impression. (I'm from Thailand they don't make it here) Also thanks to everyone who commented because they were very helpful. I made 2 pies so I kept one pot covered and the other not. The covered pot had more flavor than the uncovered. I also used Guinness for ale and marinated the meats in Soy Sauce (it's a Thai thing) before browning it and it was pretty good. Everyone at my office is raving about it and that's saying a lot because it's very difficult to please Thai people with Western food. My British friend said it was amazing. Again thank you Mrs. L! You're the best!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bunny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3189905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-18T22:03:40.933Z",
                "reviewBody": "Good. Added carrots and beans. Also used 2 bottles pale ale (and a bit of water) because not enough liquid. Used thyme basil and oregano.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Christine Shaver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3229398/"
                }
            }
        ]
    }
]