[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/258/main-dish/roasts/",
                    "name": "Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/139890/restaurant-style-prime-rib-roast/",
        "name": "Restaurant-Style Prime Rib Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3029959.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2019-04-02T06:48:57.000Z",
        "description": "This rib roast recipe took years to formulate. It makes the most out of this cut of meat. It is perfect for any special occasion.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT5H40M",
        "recipeYield": "1 prime rib roast",
        "recipeIngredient": [
            "1 (14 pound) roast-ready prime rib roast (ribs cut off and tied to roast)",
            "¾ cup all-purpose flour",
            "2 teaspoons freshly ground black pepper",
            "2 teaspoons salt",
            "2 teaspoons paprika",
            "1 teaspoon onion powder",
            "½ teaspoon garlic powder",
            "¼ teaspoon celery seed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove prime rib from refrigerator and allow the meat to come to room temperature, about 3 hours depending on the size of the roast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Line a roasting pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Unwrap the roast and place onto roasting pan; blot with paper towels. Sift together flour, pepper, salt, paprika, onion powder, garlic powder, and celery seed into a small bowl. Coat the roast all over with the flour mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in preheated oven until cooked to your desired degree of doneness; about 4 1/2 hours (20 minutes a pound) for medium-rare. Roast to an internal temperature of 120 degrees F (49 degrees C)  for medium-rare; 130 degrees F (54 degrees C) for medium; or 140 degrees F (60 degrees C) for well done.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the roast has finished cooking, take it out of the oven, and cover with aluminum foil. Allow to rest in a warm spot for 30  minutes to 1 hour before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Barbara Conrad"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.488069414316703,
            "ratingCount": 461,
            "itemReviewed": "Restaurant-Style Prime Rib Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "870.4 calories",
            "carbohydrateContent": "5.7 g",
            "cholesterolContent": "170.6 mg",
            "fatContent": "73.4 g",
            "fiberContent": "0.4 g",
            "proteinContent": "43.5 g",
            "saturatedFatContent": "31.1 g",
            "servingSize": null,
            "sodiumContent": "457.8 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-29T16:22:51.64Z",
                "reviewBody": "I made a prime rib roast that weighed 9 pounds ( it was a 3 rib roast) As per these exact directions. I just wanted to make sure that I properly explained it. It came out great. It did not burn in the slightest. The seasoned flour that gets rubbed in seals the meat and crisps the fat on the top and bottom. I even used a rack to lift the roast off the pan, so that the under side would be roasted nicely. This procedure works like a wood fired oven . It seals the juices in while crisping up the fat . You will notice in the roasting pan after you pull it out from the oven that the only thing in there is the rendered fat that came off the top and bottom. There will be no beef juices. When You coat the roast in flour dont be afraid to really coat and press down the flour in to all of the meat as well as the fat. This coating will protect all those wonderful juices.This is how you get prime rib at all those great steak resturants.You can vary the spices in the flour mix last night I used herbs de provence. as well as salt and freshly ground white pepper. It cooked at 15 mins. a lb as instructed. and after taking it out at 120 and letting it rest it was 140 after about 30 mins of resting with a linen towel . So please give this recipe a try before you give a review. It took quite a few years and quite a few roasts to develop this  manner of cooking this exact roast. You will be pleasently surprised.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara Conrad",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1965371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-24T23:39:46.32Z",
                "reviewBody": "Okay I needed to cook a prime rib steak and saw the arguement here over this recipe so decided to try it and figure out who is correct. The results were wonderful and I followed the recipe exactly. The temperature of 425 degrees turned out to be perfect.  I let the meat come to room temperature, I seasoned the meat as suggested, and put it into a 425 degree oven for 15 minutes. Now this is important, I was cooking one pound of prime rib, so I used only 15 minutes to cook it perfectly. The recipe is for 12 servings so while I assume that it is correct I can only attest to the one pound for one serving experience. And the results were as good as any restuarant. Which is particularly amazing because frankly I have always wondered how they were able to get the meat fully cooked in a restaurant without drying it out. And now I know. Thanks to the reviewers who persisted in insisting that the recipe was correct and to the woman who origionally posted it. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Richard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2857922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-22T09:03:08.51Z",
                "reviewBody": "425 deg. is way too hot to roast at 20 minutes per pound.  It  is fine for an initial 15 to 20 minutes,  but the oven temp should then be turned down to somewhere around 350 deg for the duration of the cooking time",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "aerie3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2556090/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-15T15:58:31.51Z",
                "reviewBody": "I tried this recipe for my niece's graduation party.  I cooked a 12 lb. prime rib at 425 for 15 minutes per pound.  I planned on taking the \"medium rare\" roast out, cutting it in half, and  putting half of it back in the oven, in order to have a \"medium well\" roast and a \"medium rare\" roast, so my guests could have their choice.  However, when I removed the roast after 3 hours, it was \"medium well.\"  My guests had no choice between \"medium rare\" or \"medium well.\"  I was disappointed, but the roast was still a success.  The flour mixture sealed all the juices in the meat, so even though it was cooked \"medium well,\" it was still juicy and delicious.  Today I am going to use the same recipe on an 8 lb. roast for Father's Day.  I will cook it at 425 for 15 minutes per lb. because my immediate family likes \"medium well.\"  If anyone wants a \"medium rare\" roast, I have to agree with the other reviews, use a lower temperature.  But if you like \"medium well,\"  this is GREAT recipe! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2984428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-22T03:20:27.093Z",
                "reviewBody": "I am online to look over recipes for the Prime Rib Roast of the meat butchered.  Barb, thank you for elaborating more on your directions.  The rest of you did nothing to mention how the meat was when you tried Barb's instructions, so I can only assume you did not.  \nThe butcher's instructions on my 6 + roast states:  Preheat and cook 30 min in a 400 degree oven, then 20 minutes per pound at 350 degrees.  The butcher states that medium rare is 130 degrees internal.  If the roast is over 10 lbs to cut time down to 15 min. per pound.\nPerhaps different locations (humidity, arrid and altitude) makes differences on exacts?  I do not like to read argumentive reviews, I like facts of what occurred when YOU tried someones recipes - matter of fact and respectfully.  I am sure I am not alone.  I will take seriously anyone's review that sounds like they are not playing nice. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pjdxxxwa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/759053/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-24T13:14:08.873Z",
                "reviewBody": "Great recipe and excellent au jus! But I would recommend adjusting the ingredients to the size of the roast. I had a 9-pound roast and followed the recipe accordingly (for a 14-pound roast) and had LOTS of ingredients left over. Another word of advice with this recipe: be sure to add at least a cup of water every hour and baste the roast every half-hour. I didn't do this at first and the drippings burned and smoked until I added water. Adding water also adds more gravy for extra flavor. A definite must recipe for prime rib lovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wende Fazio",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2602321/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-27T17:41:21.977Z",
                "reviewBody": "Roast should be cooked at 200-250 degrees F. then seared at the end at 500 for 20 minutes. meat should be removed from the oven at 125F and rested for 20 minutes. the temp will rise about 10 degrees and you will have a lovely even red warm roast that is extremely tender and juicy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris J",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-28T23:52:48.297Z",
                "reviewBody": "I tried this recipe out for my mom's birthday and it turned out fantastic. I looked over a lot of different recipes before settling on this one and I'm really glad I did. I made a 12 pound rib and everyone said it was better than the restaurant. However, that could be because they didn't need to pay for it. \n\nAnyway, one really, really helpful item that people reading this review might want to pick up is a meat thermometer. I used an electronic one and took the roast out when it was about 125 - 130 degrees. The amount of time it spent outside the oven (uncut) cooked it the rest of the way. \n\nOverall I highly recommend this recipe. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nathantw",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3107057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-19T13:35:57.453Z",
                "reviewBody": "very good recipe my roast got so many compliments 'better than restaurant'. first prime rib roast I have ever made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dakotamar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2947778/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Restaurant-Style Prime Rib Roast",
            "description": "See how to make the perfect special-occasion roast.",
            "uploadDate": "2013-04-01T16:23:21.517Z",
            "duration": "PT3M4.226S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F42318716-1f2b-45a1-b7a9-59c7650f9eb5%2Fc6cb0928-2872-4ad0-9345-240282d2e749%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2270052430001"
        }
    }
]