[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/139891/homemade-plain-yogurt/",
        "name": "Homemade Plain Yogurt",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F830846.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:48:57.000Z",
        "description": "For us DIY-ers, this is an easy way to make creamy, smooth yogurt at home!  It tastes GREAT, and it works!  It is yummier and cheaper than store-bought.  When you read it, you might think it is too involved... but really, you just let it sit in the warm water, checking the temp every now and then.  It actually does its own work - kind of like letting bread dough rise.  I use the time to get other things done around the house. Don't be scared off - it's really pretty easy.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H20M",
        "recipeYield": "1 quart",
        "recipeIngredient": [
            "1 quart 1% milk",
            "¼ cup dry milk powder",
            "3 tablespoons plain yogurt with active cultures"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place a large pot on the stovetop and place sterile 5 half-pint canning jars inside. Fill with enough water so that the jars are immersed up to their necks. Set the burner to low heat. The goal is to be able to maintain a consistent temperature between 110 degrees F and 115 degrees F (45 degrees C) for 4 to 6 hours. Check the temperature using a candy or meat thermometer periodically.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, pour the milk and dry milk into a large saucepan. Stir to dissolve the powder and set over medium heat. Heat until just steaming; your thermometer should read 180 degrees F (82 degrees C). Remove from the heat and place the pan so the bottom is sitting in a bowl of ice water. Cool until the temperature has dropped to 115 degrees F (45 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "When it reaches the temperature, remove it from the heat and stir about 1 cup of the milk into the plain yogurt until thoroughly blended. Stir this mixture back into the pan of milk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the milk mixture into warm glass jars to within 1/2 inch of the rims. Set in the warm water bath. The water level should be up to the level of the yogurt in the jars. Cook uncovered and be sure to maintain the temperature at 110 to 115 degrees F (45 degrees C) for 4 to 6 hours. I like to do 6. Do not stir or poke the yogurt at all during this time - even if you are tempted! Doing this may cause it to become watery.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the time is about up, you can check the yogurt by pressing gently on the top or tipping the jars to see if it is set. It is done when the yogurt is firm and there is a thin layer of yellowish liquid on the top. Remove the jars from the water and dry off. Seal with clean lids and rings. They should be good to keep in the refrigerator for 1 to 2 weeks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Be sure to save a little extra out as a starter for the next batch. Over time your homemade yogurt will start to lose it's potency as starter (like making a copy of a copy of a copy), so every fourth or fifth batch you may want to use store-bought yogurt as starter. Just make sure it says ''live active cultures'' on the container. Good luck!\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Naomi Witzke"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.631578947368421,
            "ratingCount": 38,
            "itemReviewed": "Homemade Plain Yogurt",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "118.9 calories",
            "carbohydrateContent": "12.9 g",
            "cholesterolContent": "16.2 mg",
            "fatContent": "3.6 g",
            "fiberContent": null,
            "proteinContent": "8.8 g",
            "saturatedFatContent": "2.3 g",
            "servingSize": null,
            "sodiumContent": "116.8 mg",
            "sugarContent": "12.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-05-29T20:38:43.777Z",
                "reviewBody": "**I have an easy way to keep it warm without using the stove..but first I'll say I .....I have made this tons of times...as long as you use the powdered milk, it will be thick enough. I follow the directions, but once it hits 115 degrees and I've added the live cultures, I pour it in jars, and set on a heating pad on low, with the jar wrapped in a towel and a metal pan over it. 7 or 8 hours works great. (I learned the heating pad trick from the book \"the complete tightwad gazette\") and it ALWAYS works. If you go for a longer time, it gets more tart. I have used it in place of sour cream in recipes, and when I make some, I put some in an ice cube tray and freeze, so I have some to use as the starter for my next batch. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "energygirl2013@yahoo.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2953955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-23T22:07:24.567Z",
                "reviewBody": "I made three batches right away and we like it. I left one plain to use in place of sour cream and then added about two teaspoons of honey and about a teaspoon of vanilla to the milk mixture of the other two after I stirred the yogurt in before pouring into jars. I then used my crock pot to keep the mixture at the right tempurature. I covered the jars with warm water and set it on low uncovered. I watched the temperature and turned it off and covered it when it reached 110 degrees. If it dropped to low I would turn it back on. It was ready in four hours. Very good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "colesmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2480374/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-27T21:39:38.55Z",
                "reviewBody": "I use whole milk and skip the milk powder. I increase the yogurt starter to 1/2cup. I sterilize everything that touches the yogurt before I start. For incubation I pour the yogurt into a glass casserole dish wrap it with a towel and leave in the oven with the pilot light on between 7-8 hours. Very easy to make and the yogurt turns out well every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DUESER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/238135/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-26T19:02:13.817Z",
                "reviewBody": "I too used a crock pot on low and then \"keep warm\" setting once a temp of 115 was met.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bbrewer1094",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4500980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-19T18:04:45.92Z",
                "reviewBody": "Very easy base recipe. It looks difficult but with an instant thermometer the process is made so simple. I used my slow cooker to maintain the warm water bath and the yogurt was ready in 4 hours. The process is long but very low maintenance so I was able to get school work done - I just had to take a minute periodically to check the water temperature. Thanks for sharing! As an aside: this recipe also makes a great start for something like cream cheese. Just add a few pinches of salt and pour it into a muslin cloth or cloth table napkin. Tie the top with a rubber band and let it drain over a bowl in the fridge for a couple days (use a strainer to keep the cloth out of the drained whey.) I ate my cream cheese on crackers and it tasted so clean and fresh! The drained whey I added in place of water to soup for added protein.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3191720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-24T11:07:23.487Z",
                "reviewBody": "For reviewer purists I changed the recipe slightly but feel the general information is very useful never-the-less. I used half the liquid (don't need that much yogurt at on time) but used 1 and a half cups of powdered milk (since I was experimenting on getting a thicker consistency). I also did not use my oven to keep it warm but rather put it in a cooler with other bottles of hot water and covered in towels to super insular the lot. It seemed to pretty quickly even out at 104 degrees and let it go from 4pm to 5am (13 hours). Consistency was a lot thicker than last time not runny. now only complaint is it was a wee bit grainy which I have lined up for experiment #3: less powder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2526280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-25T21:23:58.743Z",
                "reviewBody": "This is really easy to do and very forgiving. I didn't take the time to make sure the temp was exact and still turned out great. I need to make some more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Naomi Meyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1879160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T15:17:41.05Z",
                "reviewBody": "My first attempt at homemade yogurt came out great! I used a large thermos as an incubator for the yogurt. It worked perfectly! My batch was ready in 5 hours. Added 1 tbsp vanilla extract and 2 tbsp Splenda. My second batch turned out a little lumpy and more sour because I had to leave it out all day while I was at work. The next day I strained it through cheese cloth and stirred until it was smooth. I wanted to make it vanilla flavored but I was out of extract. I had a packet of sugar-free vanilla pudding mix so....I stirred in 1/3 of of the packet and.....it came out SO GOOD!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WorldRoamer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3130977/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-06T20:34:33.197Z",
                "reviewBody": "I made this first following the recipe exactly. The flavor was perfect but I wanted something just a bit thicker. The 2nd time I made it I added 1/2 cup of dry milk powder and added about 1 tsp of gelatin. The texture was just about perfect. The third time I added a bit more powdered milk and gelatin and it turned out perfect! The taste didn't change much but the texture was thicker - just how I like it. I add fresh or frozen fruit and fresh honey to this and make a healthy dessert! YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JLILLY19",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1015646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-23T16:36:48.28Z",
                "reviewBody": "This was not to my liking! it was lumpy and grainy textured and I did not care for the taste. This is my second attempt at making yogurt the first time i used real milk this time i used the powdered milk. i will definitely stay with the real milk it was really good i don't even know why i was thinking about changing recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "renaduck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5090774/"
                }
            }
        ]
    }
]