[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/692/soups-stews-and-chili/soup/turkey-soup/",
                    "name": "Turkey Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/140516/pressure-cooker-italian-chicken-soup/",
        "name": "Pressure Cooker Italian Chicken Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7453159.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:48:59.000Z",
        "description": "This recipe was given to me by my mom, but I've also tweaked it. I can't guarantee that it isn't from a cookbook somewhere--mom can't remember where it came from--but it's an old family favorite and a great soup for a fall day. Made in a pressure cooker, it takes approximately 20 minutes for a full, hearty meal. This soup also freezes beautifully.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 teaspoons olive oil",
            "4 Italian turkey sausage links, casings removed",
            "1 medium onion, diced",
            "3 cloves garlic, minced",
            "½ cup pearl barley",
            "1 cup green lentils",
            "1 bone-in chicken breast half, skin removed",
            "½ cup chopped fresh parsley",
            "3 cups chicken stock",
            "1 (15 ounce) can chickpeas (garbanzo beans), drained",
            "1 (16 ounce) bag fresh spinach leaves, chopped",
            "1 cup mild salsa"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "heat 1 teaspoon olive oil in a pressure cooker over medium heat. Add sausage meat, and cook until browned, breaking it into crumbles. Remove sausage to a plate and drain oil. Add another 1 teaspoon of olive oil to pressure cooker; cook onion and garlic until onion is transparent. Add barley and stir 1 minute. Return sausage to pressure cooker. Add lentils, chicken, parsley, and chicken stock to cooker, adding enough stock to completely cover chicken. Close cover securely; place pressure regulator on vent pipe. Bring pressure cooker to full pressure over high heat (this may take 15 minutes). Reduce heat to medium high; cook for 9 minutes. Pressure regulator should maintain a slow steady rocking motion; adjust heat if necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pressure cooker from heat; use quick-release following manufacturer's instructions or allow pressure to drop on its own. Open cooker and remove chicken; shred meat and return to soup. Add garbanzo beans, spinach and salsa; stir to blend and heat through before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Turkey Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Julie M"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.822429906542056,
            "ratingCount": 107,
            "itemReviewed": "Pressure Cooker Italian Chicken Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "244.7 calories",
            "carbohydrateContent": "37.3 g",
            "cholesterolContent": "16.2 mg",
            "fatContent": "3.3 g",
            "fiberContent": "12.5 g",
            "proteinContent": "17.4 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "527.1 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-06T03:08:04.073Z",
                "reviewBody": "Dont mess with the pressure cooker. I think in this instance it is way too much work. Plus having a soup simmering in the kitchen in the winter--sending its fragrance thru the house is a huge plus. The package of sausage (sweet italian) I bought had 5 in it...the package of chicken had 3...so I kinda scaled up from there. I sued the same ammt of barley and lentils. Also the same ammt of stock. I also used a cube of Mexican chicken/tomatoe boullion and that gave the stock a richer flavor. I simmered everything together for about 3.5 hours and everyone at the house said it smelled \"heavenly\" (my 14 year old) Next time I will leave out the barley--I dont think it contributes anything to the soup. I will also leave out the spinach--it was kinda slimey. Some carrots in the next batch and a bean mixture instead of the 'banzos. The stock was delicious and it is a definate base for experimentation. With potatoes I think it will be very similar to the zuppa Toscana soup at the big olive chain restaurant.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "shelteredrose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2703068/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-08T16:09:19.667Z",
                "reviewBody": "I love this - used my trusty and favorite cooking method - the pressure cooker, absolutely wonderful.  Very flavorful, and very quick.  I was unsure about the barley and lentils - I added them dry from a package and it turned out beautiful, not mushy.  The only change I made was frozen spinach - worked great - also I did not add the green salsa till I served it and it was a really nice garnish.  Looks beautiful, and tastes really great!  Also, I made my own chicken stock in the pressure cooker about 15 minutes prior to making soup - this makes such a nice soup base, better than any store bought!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Vidler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4766386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T18:10:18.013Z",
                "reviewBody": "This soup is very rich and healthy! I used 5 Italian turkey sausage links and added black pepper and red pepper powder. It gave it a hint if spicyness. I also added one can of diced tomatoes with no salt added and with garlic, oregano and basil.   Since the recipe as is is very high in sodium per serving, I boiled the lentils and the garbanzo beans myself in water with no salt. I added one cube of chicken bouillon and it turned out perfect and even healthier. The barley helps to reduce cholesterol and by boiling the beans myself, it was low in sodium too. Perfect!  Also, one tip: don't add the parsley until you are ready to turn off the heat. Parsley is a great antioxidant; however, if you boil it, it loses all properties. The same for the spinach.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3897461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-06T01:31:26.163Z",
                "reviewBody": "First let me say I do not have a pressure cooker so used a slow cooker. Also I was lazy and rather than sautéing anything I sliced the sausage and threw all of the ingredients into the slow cooker. I used fresh garbanzos that I had soaked for about four hours. I cooked on low for 6 hours. Chopped up the spinach in the food processor and added it and cooked another hour. Very satisfying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOMMYTO2BOYS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/188517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-25T20:12:52.65Z",
                "reviewBody": "Excellent!  No modifications as mentioned by others.  It's great just the way it is.  The pressure cooker makes quick work of the chicken!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Matthew & Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/defenseengineer/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-16T21:57:54.59Z",
                "reviewBody": "I made this for three on the stove top I sautéed a small onion 2 clv garlic 1/4c chopped bell pepper and some chopped hamsteak (instead of sausage) in olive oil. I transferred this mix to saucepan with 4c preheated chicken broth uncooked chicken breast half 1/4c chopped celery 1/4c chopped carrots 1/2 can corn just over 1/4c chopped parsley (go fresh it's worth it!). I left it on the stove simmering covered for 1 1/2 hrs till the boys were hungry (except to remove chicken breast shred meat and return to pot). I added 1/2 can chickpeas a pureed 7.5oz can of spinach a few handfuls of dry rotini (didn't have lentils or barley) and 1/2c medium salsa and a few dashes of hot sauce. This made just enough for three adults (two of which got seconds) and it was wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Iggy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5111711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-07T01:03:31.883Z",
                "reviewBody": "My husband loved this soup. It makes a very large portion & I only used 1/2 of the spinach (it seemed like a lot). After I thought I should of added all 16oz since it cooks down so much...duh!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elsa D",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4413121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-21T21:26:58.773Z",
                "reviewBody": "I have made this a few times a few slightly different ways but it's ALWAYS yummy! I admit I've never used a pressure cooker but I have used a SLOW cooker leaving it all day to cook and it was amazing. Last night I made it on the stove in a regular pot (without the chicken) in less than 30 minutes and it was still very good. So MAKE IT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Trommeshauser-Butt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3186262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-17T17:24:43.767Z",
                "reviewBody": "Very nice suggestion for using up a pound of hot Italian turkey sausage. Tasty even with a few substitutions because I didn't have some of the ingredients on hand (red lentils for green cannelini for chick peas Italian petite diced tomatoes for salsa). Since I like to make a LOT of soup if I'm going to go to the trouble I added a lot more chicken and water. Figuring it might need a little spice I added some extra Italian seasoning (Penzeys Tuscan Sunset) and I found a jar of chili paste in the cupboard and used only about 1/2 tsp for the 12 cups of water I used with Better Than Turkey bouillon (out of chicken). Still very tasty. Wish I'd had a little more spinach than I'd had on hand but it looks beautiful just the same.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cmartcookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21649/"
                }
            }
        ]
    }
]