[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20964/oven-kalua-pork/",
        "name": "Oven Kalua Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F17034.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-09-11T23:45:03.000Z",
        "description": "Fire up the tiki torches -- it's time for a luau! This delicious slow-roasted pork is rubbed with sea salt and liquid smoke to recall the glorious flavors of pig cooked in a traditional Hawaiian imu. Once cooked and cooled, it can be shredded and served with poi, yams or even on a bun. You may use ordinary sea salt for this recipe if the Hawaiian variety is unavailable.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "5 pounds pork butt roast",
            "1 tablespoon liquid smoke flavoring",
            "2 ½ tablespoons Hawaiian sea salt, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Rub liquid smoke and 1 1/2 tablespoons of the salt into the skin of the pork. Wrap well in foil, and seal completely. Place in a roasting pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until an internal temperature of 145 degrees F (63 degrees C) is reached, about 5 hours. Remove from oven and let cool before shredding. Sprinkle the shredded meat with the remaining 1 tablespoon of salt.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ben S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.602564102564102,
            "ratingCount": 156,
            "itemReviewed": "Oven Kalua Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "251.4 calories",
            "carbohydrateContent": null,
            "cholesterolContent": "74.4 mg",
            "fatContent": "18.8 g",
            "fiberContent": null,
            "proteinContent": "19.2 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "1494.8 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-23T01:28:56.17Z",
                "reviewBody": "This is an ok recipe.  I have been living in hawaii for the past 6 years and have made oven kalua pork lots of time.  You need to add minced garlic, minced ginger and soy sauce (as much as you think your family will like).  Cook the pork as directed in this recipe. I add the sea salt after shredding the pork, because of the saltiness of the soy sauce. Then place in oven to combine the flavors.  I got my recipe from a lovely Hawaiian grandmother.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ladonna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1840881/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-24T03:21:36.943Z",
                "reviewBody": "Being born and raised in Hawaii (now living in DC), my husband and I always keep an eye out for recipes that remind us of our time there.  And, this one comes pretty close.  Total prep time is a few minutes and clean up, because of the foil, is a breeze.  Pork butt is also an inexpensive cut of meat.  I've made this recipe using only Kosher salt (because sea salt wasn't available) and I've also used regular sea salt (as opposed to Hawaiian sea salt).  If you decide to use Kosher salt, you may have to sprinkle a little more onto the cooked pork before serving.  In the end, there's really no noticible difference.  The Kalua pork is also VERY tender.  I recommend this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dino II",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/837568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-11T22:37:40.493Z",
                "reviewBody": "Born and raised in the Islands and in the NW for 35 years, I rate this recipe OK.  The authentic Hawaiian style combines garlic powder and Hawaiian salt to rub any meat used (pork, chicken, beef).  The pan is lined with foil, then layered with banana leaves (frozen at Asian markets) which have been washed.  The meat is placed on the leaves, liquid smoke sprinkled over top and then wrapped well.  Leaves, then foil tightly enclosed.  Couple cups of water at the bottom of the pan.  Slow roast for hours, check water only.  Only open foil near end to check doneness.  Serve with sweet potato, poi, rice, long rice and/or poki, pineapple, haupia.  We start roasting at 9pm and leave until 9am at 300 degrees.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CinnamonGramma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6769006/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-23T17:09:07.64Z",
                "reviewBody": "This is the only way I cook my kalua up here in the states.  Pork, cooking in its own juice instead of water.  No need to measure....Just slap liquid smoke around the meat, then salt, and follow direction.  Tip: for best flavor, insert slices of fresh garlic around the roast.  Dont even need to check temperature.  Bake in 400 degree for first hour, then 350 for another 3-4 hrs. depending on size.  Bring it out of oven and check the old fashion way.....open, see, and feel....If its tender and almost falling apart.....its ready.   If not, throw it back in. However, if you want that greasy, roasted, underground flavor....here's the secret:  \"sesame oil\"  ohhhyeaaaaaaah!!  Save all the liquid in foil.  You should have alot of liquid, if not, then its overcooked.  Dont know why people add water instead of using real thing.  In baking pan, combine shredded pork & liquid from foil, drizzle few drops of sesame oil, add more salt if needed, black pepper as needed. Mix well and heat in 350 oven, covered, for 30-40 mins. or till thorouly heated thru. For big parties, I would refrigerate in ziploc bags after mixing,  then continue with last step the next day.  Throw some chopped green onions for flavoring & color. Good with baked sweet potatoes.  Its \"ONO\"LICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JadeM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4990236/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-14T03:53:36.973Z",
                "reviewBody": "Oh my gosh!! I had never tried to cook anything like this and I have to say I was really surprised at how delicious this turned out. My family almost gave me a standing ovation (ok, maybe not) and I really have to say that I don't have to go to any expensive BBQ places anymore to get a wonderful pulled pork platter which by the way, you can only get one plate for the cost of the entire pork roast when you buy it and make it yourself. I was soooo happy with this recipe. THank you so much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathiees",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2285546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-10T23:16:08.39Z",
                "reviewBody": "I recently made this for a party, and it was a HUGE hit. I've been waiting for months to try a Kalua pork recipe, having visited Hawaii and had real Kalua pork.  This recipe is delicious and perfect for a crowd or party - as it makes a lot of food with minimal effort!  I did make modifications based on other reviewers suggestions, and have prepared this two different ways.  This recipe is best in the oven, NOT a slow cooker - the oven method was much more tender and flavorful.  I did make modifications, which I think added tothe recipe. My modifications were as follows:  3 T. minced garlic, 1 T. minced ginger AND increased the Liquid Smoke to 2 T.  The additional Liquid Smoke really makes this recipe pop! I will definitely be making this again and again!  Several people asked for the recipe.  I've tried this both ways - once wrapped with tinfoil (the BEST!) and once wrapped with banana leaves.  Both were very, very good.  You can't go wrong with this one with the modifications.  Be SURE to use Hawaiian Sea Salt... it makes all the difference!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/460691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-21T15:36:38.977Z",
                "reviewBody": "I used this recipe because I liked the idea that it is cooked in the oven. I also used the advice of the review that said to add ginger and garlic so I added both but I used ginger powder because I didn't have any fresh and I also added a sprinkling of brown sugar...MMMMMM it was sooooo good!! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "seattle stacey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1827624/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-09T23:37:19.047Z",
                "reviewBody": "This Easy Moist and Flavorfull pork took me back to my memories of Maui and the food! I prepared this for my son's wedding (60) people it was simple and was the hit of the reception! We made a mango pinapple chutney to serve on the side Yum..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Hines",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/544514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-01T19:00:39.35Z",
                "reviewBody": "My husband and I both thought that this was VERY close to the \"real deal\" however when I made it mine did not come out as moist/ greasy as it is when in Hawaii. Any ideas on how to get that?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3206146/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Oven Kalua Pork",
            "description": "Amazing Hawaiian luau-style slow-roasted shredded pork.",
            "uploadDate": "2013-04-18T21:47:12.203Z",
            "duration": "PT2M34.863S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6634a0a6-2e74-4fc6-986a-fa4f4a491a85%2F526d4917-ae86-4222-a8c9-79397e6e7353%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2310648650001"
        }
    }
]