[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141155/rolled-flank-steak/",
        "name": "Rolled Flank Steak",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F415855.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:49:03.000Z",
        "description": "I searched and searched for just the right rolled flank steak recipe and couldn't find it.  So, I created my own!  This was a big hit when I made it for company.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT5H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (2 pound) beef flank steak",
            "¼ cup soy sauce",
            "½ cup olive oil",
            "2 teaspoons steak seasoning",
            "8 ounces thinly sliced provolone cheese",
            "4 slices thick cut bacon",
            "½ cup fresh spinach leaves ",
            "½ cup sliced crimini mushrooms",
            "½ red bell pepper, seeded and cut into strips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the flank steak on a cutting board with the short end closest to you. Starting from one of the long sides, cut through the meat horizontally to within 1/2 inch of the opposite edge. (You can also ask your butcher to butterfly the flank steak for you instead of cutting it yourself.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the soy sauce, olive oil, and steak seasoning together in a gallon-sized resealable plastic bag. Marinate flank steak in the refrigerator 4 hours to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a glass baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lay out the flank steak flat in front of you with the grain of the meat running from left to right. Layer the provolone across the steak, leaving a 1-inch border. Arrange the bacon, spinach, red pepper, and mushrooms across the cheese covered steak in stripes running in the same direction as the grain of the meat. Roll the flank steak up and away from you, so that when the roll is cut into the pinwheel shape, each of the filling ingredients can be seen. Roll firmly, but be careful not to squeeze the fillings out the ends. Once rolled, tie every 2 inches with kitchen twine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place in prepared baking dish, and bake in preheated oven for one hour, or until the internal temperature reaches 145 degrees F (65 degrees C). Remove from the oven and let rest for 5 to 10 minutes before cutting into 1 inch slices. Be sure to remove the twine before serving!\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ANGELSHARK"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.705882352941177,
            "ratingCount": 221,
            "itemReviewed": "Rolled Flank Steak",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "472.5 calories",
            "carbohydrateContent": "3 g",
            "cholesterolContent": "66.7 mg",
            "fatContent": "36.9 g",
            "fiberContent": "0.5 g",
            "proteinContent": "31.4 g",
            "saturatedFatContent": "12.3 g",
            "servingSize": null,
            "sodiumContent": "1421.5 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-24T20:58:41.443Z",
                "reviewBody": "Wow this is a great recipe! I was a little worried while it cooked because it smelled like nothing but soy sauce but once it was done my DH was using a spoon to get all the juices out of the baking dish! I used a little less EVOO and only marinated for two hours and I think that was plenty. I used about half the cheese called for and no red bell pepper (hate that stuff!) I took other reviewers advice and left out the bacon and secured it with toothpicks instead of twine. I thought all that olive oil kept it moist enough without adding more fat with bacon grease! I cooked it for 50 minutes at 350 degrees and it was a tiny bit on the dry side so watch your oven and don't go over the 145 internal temp recommended by the poster of this recipe. I can't wait to make this again we loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrieh82",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2147772/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-24T01:15:03.593Z",
                "reviewBody": "First of all, this is a 5 star recipe all the way.  I made a few minor changes that I feel make a huge difference.  Cook your bacon first.  I cooked mine to the point of almost crispy.  Then I wilted my fresh spinach leaves in the bacon grease.   I also roasted and peeled the skin on my red peppers prior to slicing.   I cooked my rolled contraption in the oven until 142 degrees internal temp (145 would be too done for our taste) and let rest for 15 minutes.  Sprinkle parsley over the top and serve.  The meat was SO tender you didn’t need a knife to cut it.  These simple changes make such a difference in this dish.  It turns it into something you’d expect to see at a very nice restaurant.   This is an absolutely wonderful recipe and SO easy to make.  Thank you so much for sharing this with us!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "McDee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2921123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T22:45:56.36Z",
                "reviewBody": "I'm sure this is great as is but I didn't have some of these things so this is what I did: I had some milanese steaks (SUPER thin-cut steak) lined them with thin sliced provolone lined that with fresh baby spinach rolled it up tight wrapped it tightly with raw bacon pinned it with toothpicks and laid it in the casserole dish on its side. Then I drizzled it with worcestershire and sprinkled it with garlic powder fresh ground black pepper a pinch of thyme and paprika. Then just cook to temp. Absolutely delicious!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kris Swiggum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1160604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-11T17:47:52.307Z",
                "reviewBody": "What a great dish! The flavors combine perfectly and the steak just melts in your mouth. I will definitely be making this again it was a huge hit with my entire family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn Polk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241365/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-09T20:23:40.443Z",
                "reviewBody": "Followed recipe exactly and it was amazing. Everyone enjoyed. The only recommendation I would make is to cook the bacon a bit before as it won't cook all they way once rolled into the steak. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hettielti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1609117/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-01T20:28:28.617Z",
                "reviewBody": "I made this for dinner last night and it was awesome! I'm sure it would have been even better if I'd followed the directions exactly but I didn't have all the ingredients on hand so I had to improvise a little. And I only marinated it for 1 hour before cooking and it was still great. Can't wait to try this again- thanks so much for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SURFSOLAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/368060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-23T17:59:57.693Z",
                "reviewBody": "Delicious! I'm not a fan of provolone so I used cream cheese with chives and onion instead. I can't imagine eating this any other way.   It took 50 minutes in my oven. Next time I will cook the bacon slightly but other than that and the cheese change, we loved it! Thank you for an amazing recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHARRIGAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T20:44:51.887Z",
                "reviewBody": "I used the teriyaki marinade recipe from the Teriyaki-Flank-Steak recipe and then followed this recipe's directions for making the roll. It was both delicious and eye-pleasing. \n\nTIP: Make sure you have a meat thermometer because there's no other way to correctly determine if the dish is done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pjr12345",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2714728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-10T20:54:10.79Z",
                "reviewBody": "These were fantastic! I was going to take a picture but we ate them too fast. I do have a couple of suggestions though. I used a package of thin cut flank steak that was cut into individual servings (super cheap). I think it took a little more time because I had to roll each individual steak but it was definitely worth it. I used toothpicks to hold them together three for each. They were easy to put in and easy to take out. The bacon didn't cook all of the way so I would suggest cooking the bacon half-way first and then layering it on top of the steak pieces. The flavors were outstanding the presentation was beautiful and we will be making this again! Thank you for developing and sharing this recipe with us!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tiffany",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3440158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-19T01:12:30.237Z",
                "reviewBody": "Used what was left to make a salad the next day. Was devine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela Rigsbee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3559082/"
                }
            }
        ]
    }
]