[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
                    "name": "Gumbo Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141114/cajun-chicken-and-sausage-gumbo/",
        "name": "Cajun Chicken and Sausage Gumbo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F-0001%2F11%2F30%2F1088072.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-02T06:49:03.000Z",
        "description": "This is a Cajun-style gumbo made with a seasoned roux, a classic from the bayous of south Louisiana. I revised the recipe after many, many trials. Serve it hot over cooked rice or with potato salad.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT3H15M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 cup vegetable oil",
            "1 cup all-purpose flour",
            "1 large onion, chopped",
            "1 large green bell pepper, chopped",
            "2 celery stalks, chopped",
            "1 pound andouille or smoked sausage, sliced 1/4 inch thick",
            "4 cloves garlic, minced",
            "salt and pepper to taste",
            "Creole seasoning to taste",
            "6 cups chicken broth",
            "1 bay leaf",
            "1 rotisserie chicken, boned and shredded"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a Dutch oven over medium heat. When hot, whisk in flour. Continue whisking until the roux has cooked to the color of chocolate milk, 8 to 10 minutes. Be careful not to burn the roux. If you see black specks in the mixture, start over.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir onion, bell pepper, celery, and sausage into the roux; cook 5 minutes. Stir in the garlic and cook another 5 minutes. Season with salt, pepper, and Creole seasoning; blend thoroughly. Pour in the chicken broth and add the bay leaf. Bring to a boil over high heat, then reduce heat to medium-low, and simmer, uncovered, for 1 hour, stirring occasionally. Stir in the chicken, and simmer 1 hour more. Skim off any foam that floats to the top during the last hour.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Gumbo Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jodi Hanlon"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.694668820678514,
            "ratingCount": 619,
            "itemReviewed": "Cajun Chicken and Sausage Gumbo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "479.9 calories",
            "carbohydrateContent": "14.5 g",
            "cholesterolContent": "56.3 mg",
            "fatContent": "39.5 g",
            "fiberContent": "1.1 g",
            "proteinContent": "16.1 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "1182.6 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-14T14:52:34.337Z",
                "reviewBody": "Hi everyone, I am the author of this recipe and from reading the reviews I thought I would add...the roux color is really dependent on how you would like it.  I used milk chocolate as a reference as that's our family preference.  If you would like it darker then you would just keep a stirrin until it's a color you would desire-it also intensifies the flavor. Also, if you do not like it thick then reduce the flour/oil ratio to maybe 1/2 c. flour to 1/2 c. oil.  Thanks to everyone for trying the gumbo!!\n\nJodi ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi Hanlon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-15T02:05:11.843Z",
                "reviewBody": "Great \"authentic\" gumbo - I've lived on the bayou all my life and I just cringe when I read a recipe for gumbo that includes tomatoes - a true gumbo does not have tomatoes!!!  This is very close to the gumbo I make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Josie_James",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1938327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-19T00:25:00.88Z",
                "reviewBody": "Really delicious. I only used half the roux because I like my gumbo thicker. I needed about 3 pounds of meat (chicken and sausage)to make this a stew-type gumbo. I also added 1/2 lb of frozen okra during the last 30 min. I only cooked mine for about an hour, but sauteed the veggies and chicken for 15 min before adding to the roux. A few tips for those new at making a roux: careful when you add the vegetables to the roux, the roux will splatter like hot oil. at medium heat this took 30 min. to turn the color of chocolate milk. I would recommend medium high heat, but watch the roux.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Islander",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1493223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-16T18:09:21.523Z",
                "reviewBody": "This is the BEST gumbo!  I've been making this for over 20 years from my mom's recipe that she got from a cajun neighbor when she lived in Lafayette LA in the early 60's.  And this recipe is almost exactly like the one I make.  The changes I made was I did not add bellpepper (personal preference) and I added 2 cans of okra (drained) and added 1 tbs of file (optional).  Plus I boiled a chicken and deboned. I darkened my roux more like chocolate pudding.  Otherwise, I was tickled to see this recipe posted.  It truly is \"THE BEST EVER GUMBO!  Once in a while, I'll add some canned drained oysters too.  Thanks YoYo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carrie clayton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2197033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-19T01:59:07.85Z",
                "reviewBody": "I don't really measure my green peppers, onions, or celery when I make gumbo anymore, unless it is a really fancy recipe. I just eye it. For this recipe, I used 1 medium/large green bell pepper, 1 medium onion, and 3 celery stalks and chopped them up. I also used 1 pound of browned smoked turkey sausage, 1 pound of diced, cooked chicken breast, 1/2 pound of large shrimp, 1 can of clams, and 1 can of crabs. The only problem I had with this recipe is that it said \"Creole seasoning to taste.\" A little vague, don't ya think? So, for my seasoning, I used 1/2 t. dried basil, 1/2 t. dried thyme, 1/2 t. dried oregano, 1 t. of ground black pepper, 1 t. of cayenne pepper, 3/4 to 1 t. of salt, 1 t. of paprika, some file powder (add according to your taste) and 1 t. of pepper sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-29T20:19:06.507Z",
                "reviewBody": "This is the real deal.  Gumbo is my favorite thing to cook and eat.  The only differences I make is I add 3 celery stocks because I like celery a couple jalapeno peppers for heat, two tablespoons of Worcestershire sauce \"preferably Lea and Perrins\" and a bottle of dark beer like a stout or porter.  Also I prefer to make my own chicken stock then shread the chicken for the gumbo or you can just use a large package of whole skinless bone in chicken thighs which works best.  Theres a great youtube video of Justin Wilson on making gumbo.  Check it out if you can.  And remember to constantly stir your roux, when you think it's going to burn cook it for 15 minutes longer just make sure to keep on stirring and you'll be alright, it should look like dark chocolate with a redish tint to the head  A wood spoon works best wisks can't get the edges right.  Serve with tobasco, and white rice cooked in chicken stock and you'll be in heaven.  Ok now im definatly making this tomorrow.  Ymmmm",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kingbing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2976363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-25T22:35:23.697Z",
                "reviewBody": "This recipe is fantastic! I had been looking for a tomato-free gumbo recipe for a while! A note to anyone who said that it turned out too greasy because of the full cup of oil: it probably needs to cook longer. A lot longer. I recently stumbled upon an easy oven roux recipe that changed my life (my gumbo-making life, that is). Pre-heat the oven to 375 degrees. In a cast iron dutch oven, heat 1 cup of oil. After heated, slowly add a cup of flour and whisk thoroughly and heat through. Then, just transfer the whole dutch oven into the pre-heated oven and cook for 1 1/2 to 2 hours (your preference, I like my roux DARK). All you have to do is take it out every 20 minutes and whisk it a little. BEST roux I've ever made. Ever. And no standing over a hot stove all day! 8-10 minutes on the stove is just not enough, not even close. Everything else in this recipe is spot-on though. If the roux is cooked properly, you won't see any oil or grease floating to the top because it's been fully cooked and incorporated into the flour. Oh! And I added about 1 1/2 cups of frozen okra the last 10 minutes or so. Just a personal preference... I love okra!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "April",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1522417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-07T15:48:55.567Z",
                "reviewBody": "I've made this twice in the last 6 weeks, the second time by request.  I haven't even tasted it because it's gone so fast.  I was asked to make again but I just passed on the recipe.   I made it a day ahead, added shrimp when I rewarmed it.  Roasted the bones from the chicken and the chells from the shrimp and added to chicken broth to make stock  - I here it was the best gumbo ever! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOYSMAMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2797554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-06T03:47:32.05Z",
                "reviewBody": "I've only eaten gumbo once in New Orleans and this was so much better than I remember. I used corn oil and cooked the roux until closer to the color of milk chocolate rather than chocolate milk as recommended in other Gumbo recipes on this site. Used mild Italian sausage and 1 lb boneless chicken breast. Used 2 Tbsp Cajun Seasoning I brought back from New Orleans which might make it a little spicy for kids. Chopped 1/3 red 1/3 yellow and 1/3 green peppers. Will remember next time to have all ingredients cooked chopped and ready before starting my roux. I added the chicken the same time I added the other ingredients and only simmered uncovered for 1 hour stirring often. Gumbo was even better the next day. Thanks so much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Irene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/132657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-04T19:21:20.030Z",
                "reviewBody": "I don't know where I went wrong but the 1 cup of oil just ruined this dish for me.  It had a very oily feeling in my mouth that I did not care for.  I used Canola oil and had no problem achieving the chocolate color that other reviewers said was a must after 25 minutes of cooking the roux.  I followed the recipe  exactly and it smelled delicious but I just could not stomach the oily feel and taste in my mouth when I ate it. Tried serving the leftovers with rice but that didn't help it.  I will try using a recipe with less oil next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sandy weltman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2211479/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cajun Chicken and Sausage Gumbo",
            "description": "A southern Louisiana inspired gumbo full of flavor and history.",
            "uploadDate": "2018-06-28T19:41:00.569Z",
            "duration": "PT1M38.792S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0e847566-87ca-438f-90d4-489cb3bc1452%2F3fc5dac3-ab33-4171-8c3e-930e6c434aaf%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5803243975001"
        }
    }
]