[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/927/side-dish/vegetables/sweet-potatoes/",
                    "name": "Sweet Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/142390/orange-ginger-sweet-potato-casserole/",
        "name": "Orange-Ginger Sweet Potato Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F381870.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:49:10.000Z",
        "description": "This is my version of a traditional Thanksgiving favorite. I love sweet potatoes, but find I don't need any sweetener, so I substituted orange juice. You'll find yourself serving this casserole quite often! You can cut the prep time on serving day by cooking the sweet potatoes up to two days in advance; simply remove their skins and store in the fridge in an airtight container until needed.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 sweet potatoes, scrubbed",
            "1 tablespoon orange zest",
            "2 teaspoons finely minced fresh ginger root",
            "2 egg yolks",
            "salt and ground black pepper to taste",
            "¼ cup orange juice, or to taste",
            "½ cup 2% low-fat milk",
            "⅓ cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C). Place oven rack in middle position. Lightly grease a 1 1/2 quart baking dish, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a rimmed baking sheet with foil. Pierce each sweet potato several times with a fork, and place on the prepared baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast the sweet potatoes in preheated oven until easily pierced with a fork, 1 to 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove sweet potatoes from the oven, and cool about 15 minutes. Lower oven temperature to 375  degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "When sweet potatoes are cool enough to handle, cut in half, and scoop flesh into the bowl of a food processor. Discard potato skins. Add the orange zest, ginger; and egg yolks; process to make a smooth mixture. Season to taste with salt and pepper. Pour in the orange juice and milk; if desired, add more orange juice to taste. Spoon sweet potato mixture into prepared baking dish. Sprinkle top with pecans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until heated through and pecans are toasted, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Sweet Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Grover P."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.517241379310345,
            "ratingCount": 29,
            "itemReviewed": "Orange-Ginger Sweet Potato Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "181.8 calories",
            "carbohydrateContent": "31.2 g",
            "cholesterolContent": "52.4 mg",
            "fatContent": "5.1 g",
            "fiberContent": "4.8 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "86.5 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-28T19:09:09.6Z",
                "reviewBody": "Great alternative to the overly sweet sweetpotato dishes! I do suggest that you do not waste time in roasting the potatoes - way too much time and effort. If you have a pot with a steam basket try this: Fill pot with water (up to about 2 inches below basket) & start heating it up on the stove. While your water is heating peel and cut your potatoes into pieces - as uniform as possible - so it cooks evenly. By the time you are done prepping the water should be just about boiling. Just fill up the basket with your potatoes and place the lid on. It took me about 10 minutes to steam mine because I cut it into about 1/2 inch squares. You will be able to tell when they are tender enough to mash in the processor and you don't have to wait for them to cool down like you would with baking! Makes the whole first step take about 20 minutes versus 90. I also added about a dozen drops of red pepper sauce (tapatio or you could use tabasco) - not enough to make it spicy just to impart more depth to the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda J.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2120247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-26T01:07:10.26Z",
                "reviewBody": "I also dislike the all-too sweet and rich yam casseroles. This was a wonderful and healthy change of pace! I wrapped the potatoes in foil and put them in the oven while my turkey was baking. After taking out and resting the turkey I popped the casserole into the oven to bake making this so convenient to make and not taking up oven space. I loved the subtle sweetness and the blend of flavor with the orange and ginger. I did add some candied ginger to the food processing of ingredients and liked that alot. With the addition of the egg this puffed up nicely. The crunch of the roasted pecan added wonderful flavor and texture. I was tempted to sub out some of the oj for some bourbon but I decided I will try that next time. I love sweet potatoes with a holiday meal but up to this point I usually baked them because of being so turned off by 'dessert casseroles'. One could add honey if the sweet potato was not sweet enough. I also used fat free plus milk which is skim but has the taste and appearance of 2%. Thanks so much for this wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-26T21:47:18.547Z",
                "reviewBody": "I made this casserole for Thanksgiving and highly recommend it. I dislike over-sweetened sweet potatoes on the dinner table (too much like dessert). This recipe was exactly what I was looking for. It is similar to the old standard combination of sweet potatoes and orange juice but has some added body from the eggs and milk. I used the juice and zest from two whole oranges and the casserole had a nice orangy flavor. Next time I might add more ginger as I didn't taste that much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alison J.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2639922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-01T03:31:25.7Z",
                "reviewBody": "The 4 star review is for the recipe not the dish. I followed the recipe exactly and I think it has a lot of unneccessities that could be removed to streamline it. For instance when the potatoes came out after they were roasted the great roasted flavor ws there but after mashing them with eggs oj and rebaking it left so I think even microwaving it instead of roasting would make no difference to cut down on the time. Additionally I don't feel the egg made any contribution. The sweet potatoes didn't taste any different or puff up for me...so I think they could have been omitted. And the ginger could be tripled at least to make it come out more( candied ginger sounds like a great idea) I'm a sweet potato freak but I always only eat it plain with a little coconut or spicy onions and so I was expecting my first casserole to taste vastly different but this was nice subtly orange mashed sweet potatoes. I love the orange flavor...in the morning topped with leftover cranberry sauce...fabulous breakfast:) Oh and I eat it cold...orange flavor's much more pronounced. I tried it few other ways...with butter( didn't like that) and with plain yogurt and a drizzle of molasses. Molasses was unnecessary but the yogurt was very good with the potatoes...but then again I'm a plain yogurt freak;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "foodlover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1801673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-25T09:51:29.96Z",
                "reviewBody": "Thanks for a lower-calorie alternative! My quick tip? Microwave the sweet potatos let them cool a few minutes and the potatos \"shrink\" from the skin making peeling a breeze. Also I whip my potatoes rather than put in the blender--gives a little more body.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UNCgal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2490459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-30T15:37:57.097Z",
                "reviewBody": "This was the best recipe that I have ever made off of this website. It was AWESOME! I made this for THanksgiving with my family yesterday and it was a HUGE hit. I did make one adjustment. I doubled the Ginger it was perfect as my family really likes the flavor of it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber Purvis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4193174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-01T01:11:49.83Z",
                "reviewBody": "This is a keeper! I have never liked the traditional candied sweet potatoes. All the sweet potato recipes I have tried are way too sweet. This is so much better! I didnt like the idea of milk and orange juice together so I used 3Tbs of butter instead. I used 2 large sweet potatoes and kept the amounts of everything else the same. I used the whip with my stand mixer instead of a food processor. I served this for Thanksgiving dinner and it was a huge hit. Most of us agreed that leaving off the pecans would be better but that is just a personal preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CEEJAYDEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1110721/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-13T16:28:25.137Z",
                "reviewBody": "This was a great healthy alternative to the regular sweet potato casseroles that are loaded with sugar. Since I made it just for me I used two cups of sweet potatoes and then kind of guessed on the quantities of the rest of the ingredients. I think it was even better the next day. Thanks for sharing this yummy recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "grainfreegirl96",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7348732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-06T00:15:39.213Z",
                "reviewBody": "Made for Thanksgiving this year and Easter! Even the kidlet loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CoastMama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3871215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-03T13:47:28.78Z",
                "reviewBody": "I followed the recipe but I just wasn't happy with the result. It tasted like an orange creamsicle to me. Others at the table were happy with it but I think it needed nutmeg allspice or cinnamon. It was way too orange for my taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny N.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1742431/"
                }
            }
        ]
    }
]