[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/758/desserts/candy/nut-candy/",
                    "name": "Nut Candy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/142723/pure-maple-candy/",
        "name": "Pure Maple Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F776186.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2019-04-02T06:49:12.000Z",
        "description": "Pure, creamy, melt-in-your-mouth maple candy using only pure maple syrup! It's a treat almost like fudge. Add anything you want like chopped nuts. Use small maple leaf molds or other pretty shapes.",
        "prepTime": "P0DT0H1M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H51M",
        "recipeYield": "18 maple leaves",
        "recipeIngredient": [
            "2 cups pure maple syrup",
            "½ cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large heavy-bottomed saucepan, bring the maple syrup to a boil over medium-high heat stirring occasionally. Boil until syrup reaches 235 degrees F (110 degrees C) on a candy thermometer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat and cool to 175 degrees F (80 degrees C) without stirring, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir mixture rapidly with a wooden spoon for about 5 minutes until the color turns lighter and mixture becomes thick and creamy. Stir in chopped nuts, if desired.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour into molds. Set aside to cool. Once cool, unmold candy. Store in airtight containers up to 1 month.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Nut Candy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Islandgirlchef"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.37719298245614,
            "ratingCount": 114,
            "itemReviewed": "Pure Maple Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "113.2 calories",
            "carbohydrateContent": "23.9 g",
            "cholesterolContent": null,
            "fatContent": "2.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "3.2 mg",
            "sugarContent": "20.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-28T23:21:27.583Z",
                "reviewBody": "I give this 3 stars because the directions were off, not because of taste. The taste was very good, how can you go wrong with pure maple syrup? Here is what happened. I used just 1 1/2 cups of syrup because that was all I had, but it took no where near 5 minutes of stirring to change color and get creamy, more like 30 seconds. I kept stirring, thinking it this couldn't be the creamy consistenecy the recipe was talking about, since it was no where near 5 minutes. Dopey me, I was left with stiff, unmanageable maple sugar. No way it was going in a mold, I put it in a small rectangular dish hoping to cut it into little cubes to serve. But, when I went to cut it, the whole thing crumbled. Now it is a mess of crumbled maple sugar, although it is very tasty. \nMuch of this was my error, I realize, but beware of the stirring time...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SJRJA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/836514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-02T17:22:15.897Z",
                "reviewBody": "This is an excellent recipe, and it works well.    For those who are having trouble, I suspect (but don't know) you have never, or rarely, made candy or fudge.  It takes practice.  The person who ended up with bricks crumbling over-boiled the syrup.    The person who ended up having to use a mixer under-boiled it.    The latter is easily corrected by putting the syrup back on the stove for probably another minute.    The first thing I'd check is the thermometer, if you were using one.  It may be off -- try it in boiling water, as that is something which is consistent in temperature.  If it is off there, then it is off for everything else.  If you are not using a thermometer (it is not needed) the timing and mixing will come with practice.    Try making fudge first -- it is a bit more forgiving.  Also, try leaving out the nuts the first couple of times.  This will allow you to learn the proper consistency of the mix for moulding.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RedMtl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3443761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-26T19:55:45.363Z",
                "reviewBody": "By far the easiest and most accurate description of how to make maple sugar candy.  This is the soft candy style, not the rockhard style.  Follow the directions to the letter and you'll get this right.  If the syrup starts to bubble over the pot, add a drop or two of vegetable oil.  I made this without nuts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NADROJ451",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/440313/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-14T17:28:49.757Z",
                "reviewBody": "Yummy.  Be ready at step 3...as soon as it changes color add the walnuts and pour into molds.  Do not hesitate or you will have maple sugar!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LMNOATP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2311334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-05T21:51:44.51Z",
                "reviewBody": "This is the best recipe I have found for Maple Candy (which is my favorite!)  Be advised though!  It takes practice to determine the correct time to pour off.  This is my third batch and I am still getting the hang of it.  The candy turns out perfect for me, but my goal is for it to taste great and look beautiful.  I am still working on beautiful... my first few candies look great but they get a little lumpy as the sugar starts to harden. I recommend making small batches in a small pot until you get the hang of it.  Thanks so much for the recipe! Where I live I pay as much for a small box of this candy as I do for a large 32 ounce jar of syrup, and 32 ounces makes a lot of candy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2465410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T18:13:35.72Z",
                "reviewBody": "YUM! I cannot believe that we did it! My sisters and I decided to give this a try with 1/2 cup of maple syrup because we have never made any candy. We used a 1q pot and stirred occasionally until the thermometer read 235f. As soon as the temp hit 175f we stirred quickly and as soon as the color started to look creamy we started pouring it into a small glass dish covered in parchment paper b/c we were worried that we wouldn't be able to get it out of molds after some of the reviews. Apparently we waited too long b/c we ended up with a delicious lump of maple sugar candy which we ate quickly. 2nd time we used about 1 1/2 cups and it took 2 tries (we had to move to a larger pot b/c it was boiling over the little one) to hit the right temp boiling and then we poured it onto parchment paper lying on the table - it poured out better this time and spread itself into a pancake before hardening. The one we tried in a mini muffin cup came out just fine once totally cooled. Can't wait to continue to perfect and beautify this special treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Foley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stephpap/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T20:14:15.457Z",
                "reviewBody": "Maple candy is delicious, but part of what makes it so festive is the kind of mold.  I haven't made a bunch of candy and didn't realize that the best mold would be small and rubber--this candy is too soft to unmold easily from rigid candy molds. Here's some trouble-shooting that worked for me: I live at high altitude, so I had to reduce the temperature to make it turn out ok (I found the boiling temp of water in my kitchen using a candy thermometer.  I subtracted the difference between that temp and 212 F and subtracted the same from the suggested temperature).   Before doing the adjustment, I overheated my candy ended up with sugar, so I added water to the sugar make a simple syrup in 2 sugar:1 water ratio and re-heated the syrup to candy temps and went through the recipe again. It worked.  I also found the candy set up before I could get it all molded, so I reheated it gently, just until it was pourable again and molded it--it worked.    Overall: fun chemistry product that resulted in yummy candy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ruth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6186290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-23T17:23:41.307Z",
                "reviewBody": "This is a very easy recipe. Some suggestions: 1- use a candy thermometer with a setting for soft ball stage. 2- lightly grease the sides of your pan, it keeps the syrup from boiling up 3- do not stir while bringing to 235' then turn off the burner and let cool 4-cooling down time depends on how good your pans are, the better the pan the longer it takes 5- if putting into molds first grease them! (I did not add nuts.) Then figure out the measurement per piece, as you fill the molds keep the syrup on or near a burner that is on low. You can lightly reheat the candy syrup to a workable stage as you are filling the molds. Let cool, they pop right out and are the softest most texture of any maple candy I have eaten! Just wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "goostrey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11427935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-25T03:34:12.297Z",
                "reviewBody": "The directions are slightly misleading. It took me four tries, but on that fourth try, oh man, the resulting candy was delicious. So here are my suggestions from a first time candy maker: 1. Make sure the candy thermometer isn't touching the bottom of the pot. 2. It doesn't take nearly 10 minutes for the syrup to cool from 235 to 175 so don't walk away 3. After it cools to 175, stir until the mixture becomes cloudy. For me it didn't turn a lighter color until I poured it into the molds but it did become cloudy and I noticed sugar crystals starting to form on the bottom of the pot. I tried with darker and amber syrup and had much better luck with the amber syrup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sydneyee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8458273/"
                }
            }
        ]
    }
]