[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/143081/slow-cooker-marmalade-curry-chicken/",
        "name": "Slow Cooker Marmalade Curry Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2004664.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2019-04-02T06:49:15.000Z",
        "description": "This is a gloriously awesome, easy, and flavorful slow cooker recipe that will leave your guests wanting more and asking for the recipe",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT3H0M",
        "totalTime": "P0DT3H10M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "5 (6 ounce) boneless skinless chicken breasts",
            "salt and pepper, to taste",
            "1 (12 ounce) jar orange marmalade",
            "½ cup chicken stock",
            "1 ½ teaspoons curry powder",
            "½ teaspoon ground cayenne pepper",
            "1 pinch ground ginger"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season the chicken breasts with salt and pepper, and place into a slow cooker. Whisk together the marmalade, chicken stock, curry powder, cayenne pepper, and ground ginger in a bowl. Pour over chicken breasts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on High for 3 to 4 hours, or on Low for 5 to 7 hours. Make sure to flip over the chicken breasts once during cooking.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ASHCRONE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.671875,
            "ratingCount": 128,
            "itemReviewed": "Slow Cooker Marmalade Curry Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "342 calories",
            "carbohydrateContent": "45.3 g",
            "cholesterolContent": "88 mg",
            "fatContent": "3.6 g",
            "fiberContent": "0.8 g",
            "proteinContent": "33.5 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "178.6 mg",
            "sugarContent": "40.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-20T06:13:30.073Z",
                "reviewBody": "This was beyond exceptional - I loved it! As other reviewers suggested I added a can of coconut milk an hour before it was finished cooking. The flavors in this dish are layered and complex and yet simple to prepare. I tasted every spice and nothing more prominent than the other this was simply fabulous. I know I will make this again as we finished all of the chicken tonight and thats unusual for a first time dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chloe's Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/345064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-16T19:50:15.893Z",
                "reviewBody": "This recipe is so wonderful my husband loves it I love it not only for the taste but for the sheer fact I can start it at noon and not have to worry about it. The only change I made was in the last 30 mins to an hour of cooking I add coconut milk which gives the sauce a wonderful creamy texture. I serve with brown rice naan bread mango chutney & chopped onions. Definitely a keeper. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATRONALE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/628578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T01:33:02.313Z",
                "reviewBody": "It's hard to find good slow cooker chicken recipes without a lot of added fat (creamy soups, sour cream, cream cheese, etc.)  This recipe is low fat AND very yummy!  I dredged the chicken in flour as others suggested, and used only 1/4 tsp. of the cayenne pepper because I was afraid my kids would think it was too spicy.  It turned out very well.  My husband had seconds and my 6 yr. old said I should make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LA ESPOSA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/871279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-15T14:35:08.673Z",
                "reviewBody": "Made for a church pot-luck and got raves especially from the former India missionaries! Definitely: flour the chicken; add the coconut milk; increase the amount of curry powder and ginger. I also added a hefty dose of dried sage a couple of dashes of garlic powder and a couple of Tbsp dried onion flakes and served with jasmine rice from my smaller slow cooker (ratio of 1 cup rice to 1 1/4 cups water on Low for an hour or so). Even better the next day. Ethnic and comforting! Thx much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CarolCoe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2230759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-11T00:56:36.69Z",
                "reviewBody": "We loved this recipe. We added the coconut milk and a thing of frozen spinach since I am always looking for ways to sneak in veggies. I shredded the chicken and served it over rice- it was stew-like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lexy Edelen Boudreau",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1683908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-09T14:24:49.677Z",
                "reviewBody": "This was an awesome recipe!! I'm not a huge fan of rice...so i use a great pasta called Orzo...it looks kinda like rice but i like the texture much better. I also added a can of coconut milk near the end which was great! I'll probably use half the cayenne pepper next time...it was too spicey for us. It kinda over powered the other flavors but over all it was a great dish!! (also i may add more currey next time it wasn't a very strong flavor. The sweet orange was the best!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2579994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-03T13:58:04.073Z",
                "reviewBody": "I was a little put off by the negative reviews but I tried this recipe anyway. The result? I loved it and it is the first time after a year of using recipes from this site that I have been motivated to leave a review. I always get annoyed at people who review a recipe and talk about the changes they made to it but I did make some changes to conform with my tastes and what I had on hand. Instead of the boneless skinless chicken breasts I used 2 large chicken breasts with bone and skin (about 2 lbs.). I also used a 15.5 oz. jar of marmalade (Publix low sugar no artificial sweetener) a little bit less than a cup of stock 1 Tbsp of curry powder 1/2 tsp of cayenne and no ginger. I cut 3 Yukon gold potatoes into eights and put those in the bottom of the slow cooker. Then I cut the breasts into thirds rubbed them with salt and pepper and put those in. I poured the other ingredients on top and then added a sliced large yellow onion and a chopped red pepper. I let it cook on low for 7 hours. The chicken was delicious but slightly dry; 6 hours would have probably been better. The skin and bones came right off. The sauce had a wonderful flavor. In fact I refrigerated the liquid skimmed off the fat and will use it to make rice. The most pleasant surprise was the flavor the onions and potatoes had. The onions were sweet/savory and the potatoes were like the perfect marriage between a potato and sweet potato. I love this recipe. It's a definite keeper for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BMSTPAFL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6514858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-21T19:45:22.663Z",
                "reviewBody": "In the end I really liked this. I say it that way because when I got home and lifted the lid on my crock pot the first thing I thought was oohhh this is way to sweet and I thought I have to cut back on that flavor somehow. I started off with the original recipe with the addition of the coconut milk right away (I wasn't going to be home 1 hour befor supper)I had also cut the cayenne way down to begin with so I added about 1/8 of a tsp. more at a time. I think I ended up with about 3/4 of a tsp. in total. The heat of the cayenne helps with the sweet of the jam I think. The other things I used to cut back on the sweet flavor were chopped onions and a tsp. or so of toasted cumin seeds. I know other had used garlic but I didn't want to stray too far from the original recipe. It does lack color if you serve it with white rice so I will serve it with a green veg. of some sort and a cucumber yogurt dip of some sort to cool the pallet. In the end I'm left with a sweet spicy dish that reminds me of India which I'm happy with and will make again. It took a bit but I'm happy with the result.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LORALEIGH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/385390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-29T18:52:41.71Z",
                "reviewBody": "I combined this recipe with another and made a couple of changes. I cut the chicken into chunks and tossed it in flour before I put it in the slow cooker. It cooked a lot faster this way - probably about 3-4 hours on low. I also left out all of the spices except for the ginger since I didn't have them in the cupboard:). The sauce was a little runny but I didn't measure the ingredients exactly so I might have put a little too much chicken stock in. My family really liked the flavor. It was sweet but not too much. I served it over rice which turned out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "YAMMY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/350632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-13T18:07:33.67Z",
                "reviewBody": "recipe was good but seemed way too orange-y for my hubs and I. I also used boneless chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Pamela Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2777860/"
                }
            }
        ]
    }
]