[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/203/meat-and-poultry/lamb/",
                    "name": "Lamb",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17299/meat-and-poultry/lamb/ground/",
                    "name": "Ground",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/150725/whitechapel-shepherds-pie/",
        "name": "Whitechapel Shepherd's Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F71599.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:49:36.000Z",
        "description": "This comfort food casserole is guaranteed to warm you over. It originates from eating establishments that serve those seeking respite from the streets of London. It's so hearty, you won't even realize its mostly vegetables.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 stalk celery, chopped",
            "3 carrots, peeled and chopped",
            "1 parsnip, peeled and diced",
            "1 small rutabaga, chopped",
            "¼ cup frozen green peas",
            "1 pound ground lamb",
            "1 onion, chopped",
            "1 clove garlic, chopped",
            "1 (8 ounce) can tomato sauce",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "¼ teaspoon dried thyme",
            "¼ teaspoon dried sage",
            "½ cup milk, or as needed",
            "3 cups prepared mashed potatoes",
            "2 tablespoons grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the celery, carrots, parsnip, rutabaga, and peas into a large saucepan and fill with 1 inch of water. Bring to a boil, cover, and steam for 15 minutes, or until vegetables are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, crumble the ground lamb into a large skillet set over medium heat. Add onion and garlic; cook and stir until lamb is no longer pink. Drain off any grease. Stir in the steamed vegetables and tomato sauce. Season with salt, pepper, thyme and sage. Transfer everything to a greased 7x11 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix enough milk into the mashed potatoes to make them spreadable. Spread them over the top of the casserole and garnish with a sprinkling of Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 minutes in the preheated oven, until the top is browned and the casserole is heated through.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Lamb",
            "Ground"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "G.G."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.556818181818182,
            "ratingCount": 88,
            "itemReviewed": "Whitechapel Shepherd's Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "476 calories",
            "carbohydrateContent": "51.4 g",
            "cholesterolContent": "83.7 mg",
            "fatContent": "18.1 g",
            "fiberContent": "8.5 g",
            "proteinContent": "27.5 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "1529.2 mg",
            "sugarContent": "14.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-18T20:47:56.51Z",
                "reviewBody": "I made this for my husband and we both loved it! I would recommend cooking the vegetable seperately since the rutubaga needs more time to cook and the other vegetables need less. I didn't pre-cook the peas at all and just added the frozen peas directly to the meat along with the other vegetables. I also would use a 15 oz. can of tomato sauce rather than 8 oz. because it didn't seem saucy enough (I added some left over pasta sauce we had in the fridge and it worked great). For the potatoes I used a whole package of the frozen Ore Ida steam and mash potatoes and they worked great:) Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AFGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/820475/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-05T01:25:46.68Z",
                "reviewBody": "This recipe made a quick cheap meal that fed four people. To speed things up a bit I used a frozen peas/carrots mix instead of fresh carrots and parsnips. I also used ground turkey instead of ground lamb. Be sure to use enough milk that the mashed potatoes are slightly runny.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "justanothercook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2970957/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-16T01:17:11.49Z",
                "reviewBody": "I have been looking for a traditional version of Shepherd's Pie- this one was the closest I found. I used all the named ingredients, but I prepared them a little differently. After I browned the lamb, I took it out and drained it. Lots of fat. :) Then, in the pan I browned the lamb in, I added about 1/2 c white wine and threw in the other vegetable ingredients to cook through. I ended up adding about 1 cup of chicken stock as things progressed. I didn't want things dried up and I wanted a stew like consistency underneath the potato topping. I also went very heavy on the thyme, as the absolute best Shepherd's Pie I have ever tasted was at O'Lourdan's in Westminster and I racked my brain for days before identifying the most distinctive flavor as the lamb combined with thyme. I hate to be second guessing the original cook, but my question is, \"Why, after going through all this to make an authentic SP, would one use instant, or prepared mashed potatoes?\" I chose to do homemade, as have some others. The results were most astounding. And, if O'Lourdan's is in the least authentic, we got pretty close here. Thanks for a GREAT base recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SLHSCHNEIDER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1435669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-07T23:52:55.513Z",
                "reviewBody": "My husband and I loved this recipe as did my mother and father. I baked the pie in a 13x9 pan. I used hamburger in place of ground lamb. I think it would also be good with deer burger. The \"with meat\" review is based on the feedback of 3 family members. I also made a small dish without meat for myself and I review that at the bottom of this post. The pie is very filling so I gave some of the pie to my mom and kept some of it for my husband and myself. All told we got four (2 person) meals out of it. It also freezes well. I'm making it again tonight and my mother requested the recipe. You do taste the rutabagas alot as I was hoping. It's a bit of a strange taste if you've never had them but they are very good. (I had a rutabaga sandwich in London but since I couldn't find a recipe for that I decided on the Whitechapel pie.) I highly recommend this recipe as it is good for you filling rather cheap to make and freezes well. It takes some time to cut up all the vegetables but the result is well worth it. VEGETARIANS: the recipe is great with soy \"burger\" crumbles. I've made it that way several times now and I love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "phoenix__rising",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1580761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-07T17:00:55.263Z",
                "reviewBody": "Curious - why do so many people substitute beef for lamb? It is called shepherd's pie for a reason. Look for Cottage pie recipes if you want to use beef. I like the modern method of using fresh ground lamb as most of us don't cook a roast so don't have the leftovers to grind for making this later in the week.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Fran",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3773608/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-25T18:46:55.1Z",
                "reviewBody": "I actually substituted Ground beef for the lamb and used frozen peas with pearl onions and added a small can of portabella mushrooms as well as twice the tomato sauce. Wow!!! It's wonderful and easy to make. It will become a regular at our house Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jaafallon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1318775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-27T03:18:35.957Z",
                "reviewBody": "It was really good I ground pork and beef and rinced the meat and I used garlic instant Potato cause it has less starch it turned out rally good'",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lexus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2624190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-25T16:34:25.227Z",
                "reviewBody": "Made it with half lamb and half beef. I was afraid all lamb would be too strong. Added extra tomato sauce as suggested. Cooked the parsnip and rutabaga in a separate pot for 15 minutes as suggested. Having never eaten these I was a bit nervous about using them for a dinner party but they were good. Made the potatoes a little runny as someone suggested but do not recommend this. I probably used more than 3 cups of mashed potatoes. It's a good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5616026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-21T21:38:59.093Z",
                "reviewBody": "This was good but it bears repeating that this dish is only going to be as savory as the spices you use to flavor it. I used garlic powder liberally as well as onion powder and about 1/2 tsp. of Old Bay. I also added a little soy sauce dry mustard (NOT the same as prepared mustard) chili sauce and a TB of brown sugar to the beef and I let the meat sit overnite in the fridge so the spices could really meld together. To the beef and veggies mixture I added some of the starch water drained from the taters and I topped it with cheddar as Parmesan is just too bland to put on top of such a hearty dish. I'll definitely make this again - it's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Senator",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6506750/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-18T02:00:54.03Z",
                "reviewBody": "be generous with the amount of mashed potatoes you put on top...i did not use enough",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Adriana Suriano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8752014/"
                }
            }
        ]
    }
]