[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/151997/alicias-aloo-gobi/",
        "name": "Alicia's Aloo Gobi",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8187504.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:49:41.000Z",
        "description": "This is hands down the easiest and most delicious curry I have ever made. It's my own personal twist on Aloo Gobi, a traditionally dry Indian dish consisting of potatoes and cauliflower. The coconut milk adds the extra sauciness; my favorite part of curry. Serve with basmati rice or, better, with breads such as roti, naan, or pita.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "¼ cup olive oil",
            "1 medium onion, chopped",
            "1 tablespoon minced garlic",
            "1 teaspoon cumin seeds",
            "1 (15 ounce) can diced tomatoes",
            "1 (15 ounce) can coconut milk",
            "2 tablespoons ground coriander",
            "1 tablespoon salt",
            "1 tablespoon ground turmeric",
            "1 tablespoon cayenne pepper",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground ginger",
            "1 teaspoon ground cardamom",
            "3 large Yukon Gold potatoes, peeled and cubed",
            "1 medium head cauliflower, chopped into bite size pieces",
            "1 (15 ounce) can garbanzo beans, drained",
            "2 tablespoons garam masala"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large pot on medium-high heat and add onion. Cook until softened, about 4 minutes, then stir in garlic and cumin. Continue to cook until onion begins to brown.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in tomatoes and coconut and  the coriander, salt, turmeric, cayenne pepper, cinnamon, ginger, and cardamom. Stir until mixture begins to boil, then put in the potatoes, cauliflower, and garbanzo beans. Blend well. Reduce heat to low and cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Simmer until the potatoes are tender, 45 minutes to an hour (this will depend on the size of the potato chunks). Sprinkle in the garam masala, stir, and cook for an additional 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Alicia"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.444976076555024,
            "ratingCount": 209,
            "itemReviewed": "Alicia's Aloo Gobi",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "622.1 calories",
            "carbohydrateContent": "64 g",
            "cholesterolContent": null,
            "fatContent": "39.2 g",
            "fiberContent": "14.9 g",
            "proteinContent": "13.1 g",
            "saturatedFatContent": "22.4 g",
            "servingSize": null,
            "sodiumContent": "2172.4 mg",
            "sugarContent": "6.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-06T21:00:03.967Z",
                "reviewBody": "Yummy!  It does have a bit of a kick (equivilant of say, a 3 star), so I'd suggest backing down on the cayenne a tad if you can't tolerate the heat.  This is the first indian dish I haven't bombed thus far.... so I definately count this as an easy meal!  Relatively cheap, too.  If you already have all of the spices on hand, the rest of the ingredients add up to about $10.  ***updated***  I previously forgot to mention that I omit the garam masala (it changes the flavor and I like it better without).  Additionally, cutting the cayenne pepper by about half allows one to be able to taste the wonderful flavors instead of mostly just feeling the heat.  Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristina Ryding",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2253603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-20T23:37:44.433Z",
                "reviewBody": "i replaced coconut milk with plain yogurt and water -- turned out great and lowered the calories! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mythuntold",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2522851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-16T17:09:26.23Z",
                "reviewBody": "This was a good recipe. The next time I make it, I will not add the garam masala. As the dish cooked, it smelled great, just like traditional Aloo Gobi, up until I added the garam masala. The masala overtook the rest of the flavors and altered the dish. I also used only half the required cayenne and still found it way too spicy. Otherwise, a tasty dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1557488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-23T15:34:10.947Z",
                "reviewBody": "This is GOOD.  It would be 5 stars, but it was too spicy!  I halved the amount of cayenne, and should have reduced it even more.  I knew better, but what can I say, I'm just an idiot.  I didn't use an entire can of coconut milk either, as I wanted to see if it needed all those extra calories.  It didn't; it was plenty creamy and saucy with just half the can.  I will definitely make this again, but reduce the cayenne even more.  Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "My4NonBlondes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rebecca/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-02T22:55:18.02Z",
                "reviewBody": "I used about half of the cayenne that the recipe called for and it was the perfect heat for me. I served it over quinoa. Even though I diced my potatoes small, it took almost an hour for them to cook through.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jenny/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-08T15:52:35.637Z",
                "reviewBody": "I loved this!My family and I enjoyed this a lot! It didn't have the heat I was expecting though which surprised me with the ingredient list. But for my first time making this particular dish I was very pleased! Thanks for the great recipe!: ) update made this again and it had much more heat..maybe used old cayenne last time not sure... but thought I'd mention it... so yummy one of my favs from this site!: )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thamesarino",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1828670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-01T23:36:44.593Z",
                "reviewBody": "A very good vegetarian curry, especially if your feeding a big (or very hungry!) family. I made a few adaptions, i used half/half natural yoghurt and vegetable stock instead of coconut milk,  left out the cinnamon, and added the garam masala at stage two. I will make again, next time with lots of chopped fresh coriander for extra oomph.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie Booth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2161920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-19T00:53:56.7Z",
                "reviewBody": "This was really good... like Alicia I love a saucy curry and though Aloo Gobi is meant to be a dry curry I liked this wetter version a lot. I can't put my finger on it but there was something missing from this recipe. It was really good and I will make it again and play with the spices a bit (definitely cut back the garam masala and the cayenne too if you don't want it too hot!). I think I may saute the spices next time with the onions and garlic maybe that will bring out their flavor more? The heat of the cayenne seems to overpower the other flavors here. I also agree that the full can of coconut milk is a bit much it probably does only need half unless you like it really wet/saucy. Overall we really enjoyed this! And it made A LOT of food have frozen half to see how well it keeps for a future meal! And there's still plenty left for lunch today. So great as this was a very inexpensive meal to make. Served with basmati rice and naan great dinner! Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNYLYN1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1352672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-06T23:22:22.073Z",
                "reviewBody": "When I was reading the recipe I said to myself; \"A TBSP of salt? Really?\" But yes a TBSP of salt. Really. It's all that salt that really opens up your taste buds and then ALL that cayenne makes you want to cry from the fire-hot sensation coated across your tongue. To be clear I didn't mind this dish but I agree that there is something not quite right about the spices. The salt should be cut at least half and that a TBSP of cayenne is waaay too much. Honestly I'd probably only add a TSP since all you can taste is heat past the first bite. Garam Masala is pretty much just an exact repeat of the spices that are already in this dish but it also has some clove and nutmeg. I didn't mind it but it's not a necessity for this dish. UPDATE: Okay... I was totally dreading the leftovers but I enjoyed this WAY more after it had been sitting in the fridge for a couple of days. The flavours worked a lot better but it was still too salty and too hot. I decided to try this dish again. Given how saucy the dish is it is perfectly adaptable to the slowcooker. Follw step 1 then everything into the slowcooker. Frozen cauliflower and potatoes slightly smaller than 1\" cubes on high for 5 hrs cooked everything to the point that some was stuck on the the sides. Could have cut cook time to 4 hrs and been fine. Used about 1 tsp salt and about 1 tsp cayenne and used the garam masala. Much preferred the heat but had to add salt after cooking. Great to be able to do this in the slowcooker:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "A & R's Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2953283/"
                }
            }
        ]
    }
]