[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/154317/hamburger-spinach-quiche/",
        "name": "Hamburger Spinach Quiche",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F533837.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:49:47.000Z",
        "description": "A friend of mine says the unsophisticated ingredients disqualify this recipe from being a TRUE quiche, but it's got eggs, spinach, cheese, and a pie crust, so you tell me! Whatever it is, it's delicious, and my picky kids even eat it!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "1 9-inch quiche",
        "recipeIngredient": [
            "1 (9 inch) unbaked deep dish pie crust",
            "1 pound ground beef",
            "½ cup diced onion",
            "2 large eggs",
            "¾ teaspoon salt",
            "¼ teaspoon pepper",
            "⅛ teaspoon ground nutmeg",
            "1 cup heavy cream",
            "2 (10 ounce) boxes frozen chopped spinach, thawed and drained",
            "1 cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 375 degrees F (190 degrees C). Chill the pie crust at least 20 minutes before baking to prevent shrinkage.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prick the pie crust with a fork and line with a double layer of aluminum foil and a layer of pie weights or dried beans. Bake in the preheated oven until edge of crust is golden, about 10 minutes. Carefully remove the foil and weights and bake until the crust has set, about 5 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook and stir the ground beef and onion in a large skillet over medium-high heat until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Beat the eggs in a mixing bowl with the salt, pepper, and nutmeg until smooth. Whisk in the heavy cream, followed by the spinach and the beef mixture. Pour into the prepared pie crust and sprinkle with Cheddar cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until a knife inserted into the center comes out clean, 35 to 45 minutes. Let stand 5 to 10 minutes before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "bethze"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0625,
            "ratingCount": 16,
            "itemReviewed": "Hamburger Spinach Quiche",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "558.3 calories",
            "carbohydrateContent": "20.5 g",
            "cholesterolContent": "183.4 mg",
            "fatContent": "42.2 g",
            "fiberContent": "4.1 g",
            "proteinContent": "25.8 g",
            "saturatedFatContent": "19.8 g",
            "servingSize": null,
            "sodiumContent": "716.1 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-16T16:54:30.643Z",
                "reviewBody": "ALERT - their must be a typo in the recipe should only be one 10 oz box of frozen spinach. Otherwise GREAT dinner. I used a pre-made pie crust (thawed overnight in fridge) and barely fit the mix with just one box of spinach included (two boxes would have been crazy). Very filling and yummy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4319552/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T21:47:01.873Z",
                "reviewBody": "this was really good... I didn't have spinach on hand, but I did have chopped broccoli which made a wonderful substitution.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SKC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3042195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-15T21:12:03.983Z",
                "reviewBody": "I am the poster of this recipe. There is no typo on the two boxes of spinach. It fits! :) Also, my recipe calls for Heavy Whipping Cream (not Heavy Cream). For some reason, Allrecipes changed the directions I submitted. There is no need to chill the crust when it's coming out of the freezer, and no need to mess around with foil and pie weights (completely unnecessary). Follow these instructions, and you'll end up with a hearty, delicious, comfort food meal: Heat oven to 350. Prick pie shell with fork and bake for a few minutes to firm the crust. Brown beef and onion. Drain off fat. Squeeze spinach to remove moisture. Mix with beef and onion. Beat eggs. Add cream and spices. Combine this mixture with beef mixture. Pour into the baked pie shell. Sprinkle with cheese. Bake about 25 minutes until filling is set. (It takes longer in my oven. I loosely cover with foil to prevent the cheese and crust from burning for those first 25 minutes, and then bake it another 10 minutes or so uncovered to get everything nicely browned.) Let stand 10 minutes before slicing. (We never wait that long.) :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bethze",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1605138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-29T16:52:11.3Z",
                "reviewBody": "I made a recipe based on this yesterday and it turned out to be quite delicious! I used ground breakfast sausage in place of the hamburger 1c onion and fresh spinach in place of frozen. After browning the sausage & onions i put the spinach into the pan & covered it for it all to steam until the spinach wilted. Drain it well! The sausage I used was incredibly lean and didn't make any grease so i added a tbsp of bacon drippings to the pan before adding sausage and onion. I had a deep baking dish and smaller eggs fresh from a farm so I used 6 eggs and 1 1/2 c. milk. Left out the nutmeg but added shredded grana padano cheese (can use parmesan instead) into the mix. Topped it with shredded Colby instead of cheddar. It was incredibly good. My husband called it the best quiche he's ever had!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2419922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-13T17:11:53.35Z",
                "reviewBody": "This turned out tasty with some modifications. I added about a cup of mashed butternut squash to add more veg. Ended up using 3 eggs to boost the protein some more. I put the ground beef and veg mixture into the bottom of the pie pan sprinkled the cheese and poured on the eggs and milk. I added the seasonings in and added some red pepper too into the meat mixture while it was cooing.Also forgot to prebake the crust but it turned out fine baking @ 375 for 1 hour. Overall really yummy. I am just awful at following a recipe as written.;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2431214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T21:52:25.143Z",
                "reviewBody": "Very hearty meal that's for sure. I added some chopped orange pepper just to add more veggies and I used goat cheese instead of cheddar. I didn't put in as much spinach as called for--it really is a lot just with one package trust me! If this had ham in it it really would be green eggs and ham! The submitter is correct--this really isn't a true quiche but that's okay. Very similar. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-26T23:08:04.507Z",
                "reviewBody": "DELISH!! Not having the ground beef I used 8 leftover large meatballs coated with sauce diced into cubes instead and stirred the 1 cup of cheese into the egg mixture. I only covered the pie crust with 2 layers of foil and put it into the oven for 10 minutes total before adding the egg/meat/spinach/cheese filling. I had no weights or beans. This quiche was SOOOO good. Will definately make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3244701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-19T22:04:37.963Z",
                "reviewBody": "I made this without the crust to keep it low carb. It s a good solid recipe. Not fancy or outstanding but it does give you a different option for hamburger than the usual standbys. I added 2 additional eggs and baked it in a greased pie plate. It is worthy of keeping it in my favorites for future use!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Yancando",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7305415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-05-27T21:52:00.54Z",
                "reviewBody": "Love it! I used 1 box spinach and 3 eggs. Half made and discovered I had no milk of any kind but canned milk. So I diluted it a bit and the quiche was great. Also I did not precook the crust and it was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12601712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-06T21:25:03.367Z",
                "reviewBody": "I've been cooking for over 50 yrs. and thought I'd try this. 2 boxes of spinach is way too much and it leaked all over--good thing I put it on a cookie sheet in the oven. The cheese should have been sprinkled on the last 10 minutes or so--had to cover with foil to keep it from burning. The kids didn't like it although they love different kinds of quiche. So much for that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Marcia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11243317/"
                }
            }
        ]
    }
]