[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16425/meat-and-poultry/chicken/chicken-breasts/healthy/",
                    "name": "Healthy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/157872/winter-chicken-bake/",
        "name": "Winter Chicken Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6269062.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-02T06:49:54.000Z",
        "description": "This is an easy recipe that is warm, hearty, healthy, and colorful. The tartness of the cranberries compliments the sweetness of the barbecue sauce and the mellow sweet potatoes. Homemade barbecue sauce is what I used, but your favorite barbecue sauce will work too.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "1 sweet potato",
            "½ medium sweet onion, chopped",
            "1 medium apple - peeled, cored, and chopped",
            "3 carrots, peeled and chopped",
            "2 skinless, boneless chicken breast halves",
            "2 tablespoons barbecue sauce",
            "1 cup cranberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Lightly grease a baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pierce the sweet potato several times with a fork and cut in half. Place in a microwave-safe dish; pour water to about 1/2-inch deep. Cook in microwave 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the onion, apple, and carrots into the bottom of the prepared baking dish. Brush the barbecue sauce on both sides of the chicken breasts and lay atop the vegetables. Peel the sweet potato and cut into large chunks; scatter into the baking dish. Sprinkle the cranberries over the dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the chicken is tender and no longer pink in the center, 45 to 55 minutes. Allow to cool 5 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Healthy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CAGEINCALI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.996415770609319,
            "ratingCount": 279,
            "itemReviewed": "Winter Chicken Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "318.8 calories",
            "carbohydrateContent": "46.3 g",
            "cholesterolContent": "68.4 mg",
            "fatContent": "2 g",
            "fiberContent": "9.3 g",
            "proteinContent": "29.8 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "353.3 mg",
            "sugarContent": "21.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-10T20:41:53.12Z",
                "reviewBody": "I've prepared this recipe a number of times, and I've made some changes that we think improved it.  First, I omit the sweet potato (we don't like them). I add one chopped apple for each person (instead of one apple/two persons).  I use baby carrots and cook them on the stove until they're about halfway cooked through, then drain them and toss them with the chopped apples.  I omit the onion because it upsets our stomachs, but I season the apples and carrots with onion powder and pepper.  A few times, I've added small red potatoes that I've quartered (depending on size) and tossed with the seasoned apples and carrots, but the last time I made this I baked potatoes (not sweet potatoes) to serve alongside.  One thing I do now that I think is crucial to making this dish moist is to add some apple juice approximately halfway through baking. I pour it into the apple/carrot/potato (if using) mix in the bottom of the pan and stir it around. I check it again about 10 minutes later and add more juice, if needed. This keeps everything from drying out.  I also use dried cranberries instead of fresh, and the apple juice helps a lot with 'plumping' them.  All in all, both my husband and I really enjoy this dish in the winter.  It's easy to prepare and compared to many other recipes, fairly healthy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "marysary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2254816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-17T01:34:08.41Z",
                "reviewBody": "I chose this recipe because I was looking for something tasty that my family would enjoy that had a \"red\" theme for Valentine's Day. My wife & I have 4 daughters that have grown up and their taste pallets have matured but they are not big red meat fans. Chicken fit the bill. I used whole chicken breasts instead of halves. After reading several other reviews, I noticed many concerns about the cranberries and general dryness of the dish so I used the canned whole cranberries which would increase the moisture content. also Besides just brushing the breasts with bbq sauce, I used honey BBQ sauce and increased the amount to 1 1/4 cups & poured the remaining sauce over the dish. the result was fabulous. It not only increased the moisture content of the chicken, but it melded nicely with the onions , apples, carrots and sweet potatoes and made a delicious semi-thick sauce that could be spooned over the chicken at serving. Although I love onions, I will decrease the amount to one onion for a yield of six servings next time. Carrots were a bit much as well. I used 8 rather than the 9 that the recipe called for. I will decrease these to six. The sweet potatoes presented enough orange color and flavor for this dish. I needed 2 baking dishes to handle the large chicken breasts. (we love left overs) I served this with long grain and wild rice, a perfect compliment. All in all, this was a very tasty, well received meal and a keeper. I will make this again when we have guests over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MrK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4583198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-07T01:07:55.087Z",
                "reviewBody": "Next time I make this recipe I will use more BBQ sauce (use Head Country if you can it's the best!) and I will choose a smaller sweet potato than the one I did. I ended up needing to cook this for about 55-65 minutes but that was because my chicken was not as thawed as I thought. Also..... I left the apple peels and potato peels on in order for the fiber and I enjoyed this dish just the same I forgot I had done that in fact... So leave the peels on:D Overall VERY tasty very unique recipe that is what I think.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KEI8HT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1406961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-14T18:03:49.62Z",
                "reviewBody": "I'm confused. All the other reviews are stellar but my socks weren't knocked off. It needs something-like a sauce. There is little to no moisture when its finished cooking and makes the overall impression of the dish less appealing. I will make it again however. It was tasty easy and healthy. I think next time I will pour 1/2 C. apple cider over everything befor baking to create more of a juice/sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JunkyVanRobot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2769830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-19T00:50:52.413Z",
                "reviewBody": "Perfect for winter nights. My only problem was the sweet potato dried out a bit. I used dried cranberries--careful to place them on top of the chicken/veggies if they are on the bottom they burn too easily. Quite a different type of dish for me I liked it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rosemarie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-15T20:36:17.78Z",
                "reviewBody": "I LOVED this recipe. The flavors were amazing and the chicken turned out perfect. I didn't have carrots on hand so I used red and yellow peppers. I also served with rice and it was absolutely delicious! I can't wait to make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JLHLISW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1675572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-17T01:20:26.447Z",
                "reviewBody": "Oh my goodness this is a great recipe! The chicken is tender and juicy and the whole dish has a great taste. I only made a few minor changes... I added less than half a head of red cabbage instead of the onion (it's what I had so I used it!) Also I went ahead and boiled the carrots with the sweet potatoes and then I used canned whole berry cranberry sauce instead of plain cranberries. The recipe wasn't specific about what kind to use but since there were a couple of reviews that mentioned the dish was dry I went ahead and used the canned. My husband and I love to cook and we agree that this is one of the best recipes ever... perfect for a cold winter day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "flyingredcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7716147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-18T18:28:56.027Z",
                "reviewBody": "I made this recipe for 2 adults who like chicken sweet potatoes and cranberries. I really liked the whole dish the other person did not appreciate the cranberries with her vegetables. I used a lg. sweet potato that I peeled but did not precook and my chicken breasts were added right from the freezer to the recipe. I put the chicken on top of all the vegetables. and covered the casserole dish. Everything was ready in 60-75 minutes and the chicken was not dry because it was cooked covered. I will certainly make this again. Because my sweet potato was quite large and both carrots and sweet potatoes are orange starches the carrots were omitted this time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "normal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4069956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-07T00:52:57.26Z",
                "reviewBody": "Very tasty! I didn't realize that it was scaled for two so I only used one sweet potato and one apple for my family of 6...still it was delish! Next time I will definitely add what I left out:-) I sprinled some garlic powder cinnamon and chili powder on top used dried cranberries and served over brown rice. I was very happy with this dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tisha Goldsmith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1087319/"
                }
            }
        ]
    }
]