[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/158703/sweet-bacon-wrapped-pork-loin/",
        "name": "Sweet Bacon Wrapped Pork Loin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5245662.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2019-04-02T06:49:58.000Z",
        "description": "This juicy, tender pork loin is wrapped in bacon and roasted with a sweet honey balsamic glaze.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "1 pork loin",
        "recipeIngredient": [
            "1 (3 pound) boneless pork loin",
            "salt and pepper to taste",
            "8 slices bacon",
            "2 tablespoons honey",
            "2 tablespoons balsamic vinegar",
            "2 tablespoons dry red wine",
            "1 sweet onion, minced",
            "1 tablespoon chopped fresh rosemary",
            "2 tablespoons golden raisins"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Line a shallow roasting pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season pork loin with salt and pepper. Wrap the bacon slices around the pork loin and secure with toothpicks. Preheat a large skillet over medium-high heat, then add the pork loin. Cook until golden brown on all sides, about 10 minutes, then place onto roasting pan. Stir together honey, balsamic vinegar, red wine, onion, and rosemary in a small bowl; spread over pork loin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast the pork loin in preheated oven for 15 minutes, then sprinkle with raisins. Continue cooking until the internal temperature of the pork loin reaches 145 degrees F (63 degrees C), about 15 minutes more. Remove from the oven, and allow to rest for 5 minutes before removing toothpicks and slicing.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "prettykitty_0000"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.452229299363057,
            "ratingCount": 157,
            "itemReviewed": "Sweet Bacon Wrapped Pork Loin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "334.9 calories",
            "carbohydrateContent": "8.5 g",
            "cholesterolContent": "92.9 mg",
            "fatContent": "18.7 g",
            "fiberContent": "0.4 g",
            "proteinContent": "31 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "272.6 mg",
            "sugarContent": "7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-09-23T01:37:29.46Z",
                "reviewBody": "Well, I just got up from the table after fixing this for dinner, and it was just superb! We don't get nice large pork loins around here, but we get the 2-in-a-pack type with the both of them weighing about 2-1/2 to 3 pounds. I prepared both of them, using 8 strips of bacon to do so. As recommended below, I quadrupled the sauce (1/2 cup each of honey, balsamic and red wine, 1 large yellow onion and 2 teaspoons dried rosemary) and doubled the raisins (1/4 cup). I basted at 15- and 30 minutes then added the raisins. It took another 25 minutes to finish it to 160° for a total cooking time of 55 minutes. Served 4 medallions each with broccoli and cheesy noodles and had enough to serve 6 or 7. Comment from the guest: \"This would cost $50 at a good New York restaurtant...and you'd get only 3 medallions!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WileyP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1775667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-13T18:52:43.21Z",
                "reviewBody": "This was really good. It might be helpful to know that you cook 15 minutes per pound or to 160 degrees. I used wrights applewood bacon and used 1/2 cup of red wine and 1/2 cup of balsmic vinegar and 1/2 cup of honey. 1 lg. yellow onion and 1 tablespoon of fresh rosemary. I left off the raisins. The night before I seasoned pork loin with salt and pepper and browned in iron skillet and covered with the sauce to let marinate over night. I used my pamper chef roaster, without foil. It took my 4 pd. loin about and hour and 15 minute. Put remaining sauce in gravy dish for individual use. Served with scalloped potatoes and Foo Foo salad.    USE HEMOSTATS OR NEEDLE NOSE PLYERS FOR REMOVING TOOTHPICKS.I USED STATS AND IT WAS VERY EASY TO DO. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Benita Zumo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3683416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-29T16:45:53.87Z",
                "reviewBody": "Unfortunately I was disappointed with this recipe.  After the baking time of 30 minutes, the roast wasn't even close to being done.  I had to cook another 15 minutes then finally microwave it (yikes!) because the family was starving!  The sauce didn't add anything to the roast.  I had high hopes as I love everything in the sauce, but all it did was make a huge blackened mess in the pan, as I don't think any of it stayed on the roast.  The only saving grace was the bacon - what isn't made better with bacon? I won't be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "WHIRSCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/258415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T17:24:13.24Z",
                "reviewBody": "The best Pork Loin roast I have ever made or eaten! I used 1/4 cup honey, 1/4 red wine, 3 tbs of balsamic vinegar, 3 tbs of olive oil, 1 tbs maple syurp put over the top just before baking. After browing the roast in the frying pan. I put all other ingredients in skillet and brought to a boil and poured over the roast and refrigerated for 2 hrs and basting every 1/2 hr. when baking I basted it every 15 min. I kept it covered for the first 1/2 hour. I can't wait to make this one again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Randal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6444213/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-10T00:06:03.81Z",
                "reviewBody": "This was delicious!  Only changes I made...I doubled the sauce and added a splash of red wine.  I marinated for about 4 hours.  I seared in my dutch oven,removed the pork, deglazed with the marinade, put the pork back in and scooped sauce over top of it.  I cooked with the lid on the dutch oven for 1 hour.  That's how long it took for mine to be done.  Was very good!  Thanks for a great recipe! SAFETY TIP: Count the toothpicks you put in because when it's done they are kind of hidden!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TARAB1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/982554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-04T05:20:55.017Z",
                "reviewBody": "I really really enjoyed this. I made about triple the amount of sauce (but just one large onion) and I think next time I'll make even more. I used boneless pork chops and cooked for about 45 minutes in a 350 degree oven basting every 15 minutes and turning once halfway through cooking. Great submission thank you! Oh and no raisins for me. Update: EVEN BETTER the next day. Next time I'll marinate the pork in the sauce overnight first.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1974401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-11T16:57:27.747Z",
                "reviewBody": "This recipe was great...the pork was very moist the bacon crisp and the sauce delicious.   The only tweak I would make next time  would be to cover with foil for the first 30 minutes (this takes at least 45 minutes to an hour to cook...NOT 30 minutes) because the sauce got a little too brown. Also, wait longer to add the raisins...they were hard as rocks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jennwright",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3547324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-08T21:14:11.357Z",
                "reviewBody": "I have to admit I was skeptical about this recipe but I had a pork loin roast in my freezer from angelfoodministries.com that I wanted to use and I'd never cooked one before. I did an ingredient search and found this recipe. I had to substitute red wine vinegar for the balsamic vinegar and red wine because I don't keep those on hand. I also had no rosemary so I substituted Italian seasoning. Also I left out the raisins...and WOW it was SO good! My entire family ate it and liked it which is very unusual around here. My 3 and 6 year old daughters kept cleaning their plate then pushing it toward me saying \"More please!\" Unbelievable! I actually thought it was very simple to make. One thing I will suggest is that before you slice it move it to a slicing platter or you'll end up with aluminum foil bits all over your roast. I think the most difficult part of the recipe was taking the toothpicks out. lol. GREAT recipe; I will make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet Corbin Sportsman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2677360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-20T23:55:36.303Z",
                "reviewBody": "This was tasty.  I used white instead of red wine--mainly because this was what I had open.  I also used my cast iron grill top for the sear.  I'd love to try this on the grill.  My hubby loved this--porky goodness is always a hit in our house.  I did use some extra white wine to keep the glaze liquid during roasting.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "fruitfiend",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2491382/"
                }
            }
        ]
    }
]