[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/163590/muenster-bacon-stuffed-chicken-breast/",
        "name": "Muenster-Bacon Stuffed Chicken Breast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F72051.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:50:19.000Z",
        "description": "This is an awesome recipe that incorporates some of my favorite foods!  This recipe has it all, Muenster cheese, provolone cheese, bacon, chicken and a wonderful crispy bread coating!  This dish goes nicely with some marinara sauce and some pasta!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "3 sandwiches",
        "recipeIngredient": [
            "6 slices bacon",
            "1 cup dry bread crumbs",
            "1 tablespoon dried parsley",
            "2 teaspoons Cajun seasoning (such as Emeril's Essence™)",
            "1 ½ teaspoons salt",
            "1 ½ teaspoons garlic powder",
            "1 teaspoon onion powder",
            "1 teaspoon paprika",
            "½ teaspoon ground black pepper",
            "2 large eggs",
            "1 tablespoon hot pepper sauce",
            "3 slices Muenster cheese",
            "3 (6 ounce) skinless, boneless chicken breast halves",
            "3 slices provolone cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep, cast iron skillet. Cook over medium high heat until evenly brown, then crumble and set aside, reserving the bacon fat in the skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, stir together the bread crumbs, parsley, Cajun seasoning, salt, garlic powder, onion powder, paprika, and black pepper in a shallow dish. Whisk together the egg and hot pepper sauce in a separate bowl, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut a pocket into the side of the chicken breasts using a thin bladed knife. Stuff each breast with a slice of Muenster cheese, and 1/4 of the crumbled bacon; reserve the remaining bacon for later. Secure the chicken breast pockets with a toothpick or skewer, then dip into the egg mixture, letting excess egg drip off before pressing into the bread crumb mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reheat the bacon fat in the cast iron skillet over medium heat. Once hot, add the chicken breasts, and cook until golden brown on one side (about 2 minutes), then turn the breasts over, and place the skillet into the preheated oven. Bake until the chicken is no longer pink in the center, and registers 165 degrees F ( 75 degrees C) on a meat thermometer, 20 to 25 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the chicken has cooked, top each piece with a slice of provolone cheese, and sprinkle with the remaining bacon. Return to the oven, and cook until the cheese has melted, about 1 minute more.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nikki Johnson "
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.527777777777778,
            "ratingCount": 72,
            "itemReviewed": "Muenster-Bacon Stuffed Chicken Breast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "698.3 calories",
            "carbohydrateContent": "30.7 g",
            "cholesterolContent": "288.1 mg",
            "fatContent": "33.3 g",
            "fiberContent": "2.5 g",
            "proteinContent": "65.9 g",
            "saturatedFatContent": "15.4 g",
            "servingSize": null,
            "sodiumContent": "2853.1 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-10T07:38:08.087Z",
                "reviewBody": "Though I did things a little different, this recipe looked so good that I really wanted to try it without all the fat content. \n\nThis still came out very good.  I used the recipe for cooking bacon in the oven from this site, bacon for a crowd which I must say I think is wonderful, make sure you use a pan with sides for the drippings, or check out the reviews for some great tips.  Though I do use the thick bacon I think this could do well with thin bacon if the heat is cut back and watched carefully.  I also have used parchment paper and overlap the bacon so it curls less.  Add parchment or foil to the top so it don't splatter.   Heated olive oil in a skillet and browned both sides of chicken then put in oven to finish.  So yummy.  Thanks so much for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cooking 101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1793893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-17T00:55:21.2Z",
                "reviewBody": "This was good. I have to say though that it was an overkill on the cheese and bacon. I don't think it needs the provolone or bacon sprinkled on top. Stuffing the chicken with muenster and bacon was enough for me. It was also quite spicy. Not bad spicy but relatively spicy so I'd probably either not use the hot sauce with the egg or not use the cajun seasoning with the bread crumbs. I made my own cajun seasoning with the Simple Cajun Seasoning recipe from this site. I used turkey bacon and I didn't like cooking the chicken in the same pan as the bacon. The pan was a burned mess (maybe bc I used turkey bacon?) before I transferred to a baking dish (I have a skillet that can be put in the oven but I misread the directions). I'd cook the bacon separately next time. I also think the breading and egg could have been used for 4 chicken breasts not 3. Overall I liked it and with less cheese and spice would be excellent. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pomplemousse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1532140/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-18T18:34:44.54Z",
                "reviewBody": "Wow. I don't know where to begin. I'm giving this 2 stars only because it was SOOOOO SALTY! This is a heart attack waiting to happen and I had to pull all of the stuffing out to even eat the chicken. I seriously feel the need to guzzle a gallon of water as I type this. My face is puckering from all of the salt I just consumed. However the basics are good and this could be a nice dish if tweaked. The salt is completely uncessary due to the salt in the massive amount of bacon called for. The creole seasoning is also 90% salt. I will make this again with the following changes. Completely omit all salt use 1/2 of the bacon and use smoked gouda instead of whatever cheese is called for in this receipe. I will also cut the creole seasoning into at LEAST half. As far as the bread crumbs use Panko. MUCH better. I'm now going to drink a gallon of water and try to recover from my salt attack meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "McDee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2921123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-17T04:39:31.807Z",
                "reviewBody": "This is really good!! I skipped the egg and just breaded with crumbs and seasoning. I tripled the recipe and left 1/2 provolone-free (for my son that is picky about gobs of melted cheese - but like pomplemousse I did think there was a bit of overkill - it would be fine with \"just\" the muenster & bacon in the middle). I probably won't make this often because it's kind of messy time-consuming and deadly fattening but we really enjoyed it tonight! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-08T15:52:31.407Z",
                "reviewBody": "I made this recipe as stated and LOVED it! I did not think it was too cheesy as we like cheesy at our house. Everyone agreed it was a keeper. I little messy and time consuming and calorie loaded but still good enough to endulge in occasionally.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheila LaLonde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mibeingmi/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-25T02:48:49.48Z",
                "reviewBody": "amazing! definitely took others suggestion and didn't add salt. skipped the cajun (ran out) but added a bit of cayenne and Parmesan cheese to the breadcrumb mixture. since some cheeses are a bit more pricey I just used cheddar and a bit of cream cheese that was on hand. It turned out great and my husband says that its a recipe to keep.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Yummy Yummy!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1743459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-21T22:50:20.713Z",
                "reviewBody": "I thought the flavors here were great. I took away a star because I made changes to make it more likable. First I pounded the chicken thin and rolled it. Second I season the chicken itself not the breadcrumbs. (also I used italian breadcrumbs and ommited the hot sauce) lastly I baked these the entire time. Really no need to fry and add even more fat to this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Corey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2137203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-15T17:32:55.02Z",
                "reviewBody": "Ummm...Wow really really good... Totally worth the time to make this. Other reviewers said that it was a little overwhelming-I disagree..But I love cheese and I love Bacon. Really good.Thank you for this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crazyjenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1933596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-30T19:26:41.26Z",
                "reviewBody": "I have to give this 5 stars because my hubby & kids rated it 10! However it does have a kick-I think I'd leave the hot sauce out next time just because I don't feel it really complimented the rest of the flavors. I used 1 1/2 tsp of garlic salt in place of the salt & garlic powder. The muenster completley melted out of the chicken so it was kind of a waste but I disagree that it was cheese overkill. Since the muenster melted we were left w/just the provolone & it needed more cheese imo. I was hoping for a really rich cheesy chicken breast & it wasn't. It WAS very good tho! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730569/"
                }
            }
        ]
    }
]