[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/663/meat-and-poultry/chicken/chicken-wings/",
                    "name": "Wings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15837/meat-and-poultry/chicken/chicken-wings/buffalo-chicken-wings/",
                    "name": "Buffalo",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/166638/baked-buffalo-wings/",
        "name": "Baked Buffalo Wings",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F01%2F30%2Fbaked-buffalo-wings-photo-by-psychedilemma-1132784.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2008-05-06T21:09:22.000Z",
        "description": "These easy to make hot wings are crispy without being fried. Always yummy to snack on. They only take 10 minutes for prep, but need to be refrigerated for about an hour so the flour coating is firm. You can add more cayenne or use a higher hot sauce to butter ratio if you like them spicier! Enjoy.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "20 chicken wings",
        "recipeIngredient": [
            "¾ cup all-purpose flour",
            "½ teaspoon cayenne pepper",
            "½ teaspoon garlic powder",
            "½ teaspoon salt",
            "20 chicken wings",
            "½ cup melted butter",
            "½ cup hot pepper sauce (such as Frank's RedHot®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with aluminum foil, and lightly grease with cooking spray. Place the flour, cayenne pepper, garlic powder, and salt into a resealable plastic bag, and shake to mix. Add the chicken wings, seal, and toss until well coated with the flour mixture. Place the wings onto the prepared baking sheet, and place into the refrigerator. Refrigerate at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk together the melted butter and hot sauce in a small bowl. Dip the wings into the butter mixture, and place back on the baking sheet. Bake in the preheated oven until the chicken is no longer pink in the center, and crispy on the outside, about 45 minutes. Turn the wings over halfway during cooking so they cook evenly.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Wings",
            "Buffalo"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Leesah"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.462156731413262,
            "ratingCount": 1493,
            "itemReviewed": "Baked Buffalo Wings",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "125.4 calories",
            "carbohydrateContent": "3.8 g",
            "cholesterolContent": "31.5 mg",
            "fatContent": "9.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "257.6 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-05T00:36:32.58Z",
                "reviewBody": "Make sure your wings are dry before dredging in the flour, should help with them not be so soggy if that's the issue you are having. Also, this recipe is pretty easy to customize to your taste, you can add different sauces and herbs. You can bake these wings on a roasting pan if you want. I've been getting lazy and using parchment paper so that I don't have to use cooking spray, kind of messy, haha. Thanks for everyone's input, I'm so glad you like the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leesah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2930706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-26T18:40:21.093Z",
                "reviewBody": "Excellent! My suggestions to avoid soggy wings (1) Make sure to dry wings before flour dredge, (2) \"Rest\" wings uncovered in fridge for longer time (3) Line baking sheet or broiler pan with aluminum foil and place cooling rack or equivalent on lined pan, then bake wings on the rack. The grease will drip down into the pan and the wings will cook without soaking in the grease. This is an excellent alternative to fried wings, and being from the Buffalo area, I can say with confidence that these are comparable to those served in this area. Well done!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aaron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3419238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-25T03:06:07.493Z",
                "reviewBody": "I have always baked my buffalo wings, but this is the first time I've drenched them in flour prior to baking them. I only added 3 tsp of cayenne pepper to the flour because 5 tsp seemed excessive. The wings were crispy and juicy on the inside. Definitely the best wings I've ever made. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alyssa78",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1592766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-23T00:30:31.29Z",
                "reviewBody": "I have to stop the madness on this board!  This recipe is INCREDIBLE!  Here is what you need to do in order to feel like I do, post-meal:  \nPut paper towels down and dry/squeeze your raw wings.  Dredge them in the flour mixture, leave them in the fridge for 45 min-1 hr.  You DO NOT need to leave them in for longer/overnight...I promise. Place them on a cooling rack or a griddle pan (I took my \"racks\" from my panini press).  Do not dip in the hot sauce mixture and bake wings at 425F for 25 minutes one one side, and then flip for 25 another minutes.  Take them out, dredge them in the sauce mixture (I turned mine twice) and then put them back in the hot oven, under the broiler on low for 5 minutes on each side. If you want to wipe down your pan with paper towels so you're not putting them back into the grease, do it!  I promise they will be amazing!  Re: sauce.  Taste it before you dredge! If you like it hotter, with soy sauce, more garlic and salt, add it! This recipe is great with these additions.  Took longer, but WELL worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vandygirl29",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5603034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-30T18:01:28.63Z",
                "reviewBody": "Wings were good, but not outstanding.  Based on 200 + reviews, I decided to chill the wings with the flour coating overnight as other reviewers suggested.  Right before baking I dipped in the butter/hot sauce and placed on a wire rack to cook.  Baked these the required 45 minutes and they were, soggy, soggy, soggy with not much flavor.  Pulled them out of the oven and re-dipped in straight hot sauce and then baked an additional 30 minutes with the last 20 minutes at 450 and they FINALLY started crisping.  Once they crisped, they were delicious.  3 stars based on the soggy factor and modification of the recipe to make it \"work\".  4 stars for taste with the re-dipping!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-18T23:50:37.59Z",
                "reviewBody": "This recipe offers a good alternative way to make buffalo wings than the traditional deep-fried. It's easy and tastes great. It's good to make ahead for parties. If your wings didn't end up with crispy skin or came out soggy it may have to do with the wings aren't dry enough. My suggestion is to dry your wings on a drainer after rising. Then pat dry (or even squeeze a little) with paper towel. If your wings are dry enough they should coat nicely with the flour. Refrigerate without the plastic wrap can also help drying the wings. Do not soak your wings into the butter and hot sauce mixture for too long. If juice comes out during baking drain it. This should make the crispy skin. I might also try making them in different favors such as lemon pepper or honey lime etc.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CookingMaMa08",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2723363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-02T11:45:18.45Z",
                "reviewBody": "I made these for my spice-loving Louisiana husband and he liked them however he brought to my attention the fact that a similar recipe is actually printed on the bottle of Frank's Red Hot Sauce....only difference is that the wings are baked first, THEN dipped in the sauce. Either way, it's a good recipe for spice lovers. The sauce was enough to liberally coat about 9 large chicken wings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2869422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-18T20:34:01.613Z",
                "reviewBody": "These wings were really quite tasty.  I'm not ready to say that they're the best I've ever had, but they certainly rival that of most restaurants and we were very pleased with them.  I think there are a few musts with these if you want them to be crispy: 1) pat your wings dry before coating with flour and let them sit in the fridge.  Ours sat for an hour and that was perfectly fine.  2) Don't line your pan with foil. While it might make clean-up a little easier, it does nothing to help crisp your wings.  We spread a little olive oil on a cookie sheet and spread them evenly. At about the 30 minute mark we drained any oil or juices off and then put them back in the oven.  3) Don't put the sauce on right away.  We baked ours for about 25 minutes, flipped them, baked for another 15 or so, and THEN rolled them in sauce before putting them back in for another 10 minutes or so. Our wings were crispy and delicious.  Hopes this helps some!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lonimuse",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1832362/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-26T03:42:02.427Z",
                "reviewBody": "I really love Buffalo Wild Wings (a buffalo wing restaurant & bar)!! I don't have one near me unfortunately but whenever I am in a city that has one I always stock up on their spicy sauces!! I used the BWW sauce that I have and just tossed it with finished wings that I baked at 425 for 20 minutes on one side and 15 on the other. Other than that they were cooked as the recipe said with the flour and butter and they were so awesome!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shagen McBride",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2017032/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Baked Buffalo Wings",
            "description": "See how to make delicious Buffalo wings in the oven.",
            "uploadDate": "2012-04-17T17:40:45.119Z",
            "duration": "PT2M46.5S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0aedf87f-244a-4789-8f2c-6b8753e8046b%2Fc43e140e-f8e8-4ea0-a250-521ee60be460%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1567265764001"
        }
    }
]