[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/167972/momma-moots-pork-and-pierogies-casserole/",
        "name": "Momma Moots' Pork and Pierogies Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1043499.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T06:50:41.000Z",
        "description": "Delicious, creamy, and easy, super-filling casserole that the whole family will love!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (16 ounce) package frozen pierogies",
            "1 tablespoon olive oil",
            "1 pound pork loin, cut into 1/2 inch cubes",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 cup sour cream",
            "¾ cup milk",
            "1 (15.25 ounce) can whole kernel corn, drained",
            "½ cup diced onion",
            "½ teaspoon chopped fresh rosemary",
            "¼ teaspoon ground black pepper",
            "½ cup Cheddar cheese, shredded"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot with lightly salted water and to a rolling boil. Stir in the frozen pierogies and return to a boil. Cook uncovered, stirring occasionally, until the pierogies float to the top and the filling is hot, 5 to 7 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a skillet over medium-high heat. Add the pork and cook, stirring occasionally, until the pork is no longer pink in the center, about 5 minutes. Transfer the pork to a large mixing bowl along with the cooked pierogies. Add the cream of mushroom soup, sour cream, milk, corn, and onion. Season with rosemary and pepper; stir. Pour into a 2-quart casserole dish and sprinkle with Cheddar cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the cheese has browned and the casserole is heated through, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marsha Leigh Bogardus"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.230769230769231,
            "ratingCount": 39,
            "itemReviewed": "Momma Moots' Pork and Pierogies Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "400 calories",
            "carbohydrateContent": "32.1 g",
            "cholesterolContent": "61.6 mg",
            "fatContent": "21.9 g",
            "fiberContent": "2.2 g",
            "proteinContent": "20 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "672.7 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-26T17:28:50.65Z",
                "reviewBody": "WOW! Am I glad I stumbled across this recipe today. Started out thinking I was going to make the same tired pork roast; then found this recipe! Followed almost exactly; with the exception of omitting the sour cream as I was out but adding 1/4 cup more milk. Was plenty creamy though with the milk and cream soup. Also used thyme as I don't care for rosemary. And finally I chopped up fresh spinach for a healthier bite and some color! This was a great casserole for a healthy and unique choice. WILL CERTAINLY MAKE AGAIN!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3237379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-02T14:46:43.513Z",
                "reviewBody": "I stumbled upon this recipe while searching high and low for a new dish to make for dinner for myself and my husband.  After going over the ingredient list and the directions, I decided to give it a whirl.  Guess what??  IT WAS AWESOME!!  The prep stuff and cooking process was easy as can be.  The hardest part was waiting for it to be finished so we could scarf it up!! The only thing that I will change the next time I make this (and I can guarantee you that I will definitely make this recipe again) is to sweat out the onions out for just a few minutes in a saute pan before adding them into the casserole mixture, as we found the onions to be a bit strong as they were listed in this recipe.  Otherwise, it is pure casserole perfection!!  Thank you so much for sharing this wonderful recipe with the universe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3785036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-31T17:59:05.37Z",
                "reviewBody": "My whole family really enjoyed this! I used light sour cream and added some chopped fresh spinach like another reviewer suggested. I also sauteed the onions with the pork and mixed it all together in the same pan I cooked the pork and onions in. Incredibly good and definatly a keeper! Its sort of a different take on chicken and dumplings! Thx for the recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2901899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-16T16:42:45.393Z",
                "reviewBody": "I made this to take to the field during harvest and it was a hit.  Don't we love to tweak recipes!! I doubled the meat and perogies, sauted the onions after the meat and sprinkled the top with French's Fried Onions.  I used Mrs. Dash and pepper as seasoning. This is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Redhatter1943",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4004062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T17:26:46.9Z",
                "reviewBody": "My rating may be just a little off as I changed the recipe to fit my familys likes and dislikes. Chives not rosemary added some broccoli I had leftover from the stuffed pork dinner the night before to add some color. I used the cooked pork cut into cubes cream corn because that is what I had on hand. I have never cooked pierogies befor I'm glad I found them. The family loved it and I have a new goto casserole.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robograndma Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/robograndma/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-02T00:10:00.923Z",
                "reviewBody": "Made according to recipe. Tasty and something different that everyone in the family enjoyed. Everyone felt that the pierogies needed to be doubled for next time. Would also be very good with chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELEOT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/658665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-17T22:54:33.227Z",
                "reviewBody": "I used ground pork and thyme instead of loin and rosemary but really who cares because this was just so very very good. My husband asked me to make it again the next day! I do lots of cooking and this recipe is cheap, quick, and tastes amazing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Roberts Barnhardt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2060761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-01T23:54:29.8Z",
                "reviewBody": "We just aren't fans of the  taste of canned soups. So I made a very basic cream soup using chicken stock, leaving it on the thick side, so as not to thin it out too much when the sour cream was added. I eliminated the milk, as it was in the cream soup I had made. I cut up boneless pork loin, removing all the fat. After browning off the meat, I then carmelized the onions. This eliminated the slight crunchiness that can result from onions in a casserole that have not been precooked, which can be off-putting to many. Additionally, caramelizing them lends a powerhouse of depth to the flavor of almost any dish. It was delicious - comfort food on steroids!  Cheesy, starchy, stick-to-your-ribs goodness. Eliminated the corn, as we had it last night. It's not a deal-breaker; I'll add it the next time. The fresh rosemary was lovely, and complemented the pork. To sum it up,  the recipe has many good things going for it, but replacing the canned soup with something made fresh, as well as carmelizing the onions both represent a huge advance in flavor. As is, it's a respectable, if unexciting option when pressed for time. Could only give it a 5 if it needed no tinkering, which we felt this did, in order to make it great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-12T03:52:37.09Z",
                "reviewBody": "What a great recipe to use up leftover pork loin which is what I used. I used all the ingredients the recipe called for just in different forms. My pork was leftovers I made Cream of Anything Soup a personal recipe from AR mine happened to be Cream of Pepper Soup using green and yellow peppers as we do not care for mushrooms corn that I had froze rather than canned and Pepper Jack Cheese as I was out of Cheddar cheese. This came together quickly since my pork was already cooked. I just mixed up everything in the pan that I boiled the pierogies in and poured it in a casserole dish. This was hot and delicious in 35 minutes. I did let it rest for about 8 minutes before serving to let the cheese and soup set up just a little. I served this with Coleslaw with Grapes and Spinach from AR and we had a wonderful dinner. DH & DS already called dibs on the leftovers. Thanks 3Scorpios for sharing this recipe. We love pierogies and I m always looking for new ways to fix/serve them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-07T18:12:03.443Z",
                "reviewBody": "To went with all the reviews and decided to try something new. We really didnt like it. The rosemary give it a funky taste. And it was really THICK. There was no texture. Not to mention I never liked mushroom and corn put together.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSSPARKLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4053273/"
                }
            }
        ]
    }
]