[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/172234/orzo-with-kale/",
        "name": "Orzo with Kale",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F969127.jpg",
            "width": 909,
            "height": 909
        },
        "datePublished": "2019-04-02T06:50:54.000Z",
        "description": "A light summer dish. Great with white wine.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "5 cups",
        "recipeIngredient": [
            "1 teaspoon ground turmeric",
            "2 cups uncooked orzo pasta",
            "2 tablespoons olive oil",
            "4 cloves garlic, sliced",
            "1 bunch kale, stems removed and leaves coarsely chopped",
            "1 large lemon, juiced",
            "¼ teaspoon ground nutmeg",
            "¼ cup grated Parmesan cheese, or to taste",
            "salt and black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly-salted water to a boil; sprinkle the turmeric over the boiling water and stir in the orzo; return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes; drain. Scrape into a mixing bowl and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large skillet over medium heat. Cook the garlic in the hot oil for a few seconds until it begins to bubble. Stir the kale into the garlic, cover the skillet with a lid, and cook for 10 minutes. Remove the cover and continue cooking and stirring until the kale is tender, about 10 minutes more. Stir the kale mixture into the orzo along with the lemon juice, nutmeg, and Parmesan cheese. Season with salt and pepper. Serve warm or at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sunaina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1125,
            "ratingCount": 160,
            "itemReviewed": "Orzo with Kale",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "205.6 calories",
            "carbohydrateContent": "36.1 g",
            "cholesterolContent": "1.8 mg",
            "fatContent": "4.2 g",
            "fiberContent": "2.8 g",
            "proteinContent": "7.9 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "52.5 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-07T20:10:33.207Z",
                "reviewBody": "Quiet mellow flavors. Perfectly understated just as I like it just as I wanted it. Well balanced combination of the flavors and I particularly liked the additions of nutmeg and lemon juice which I didn't measure just added to taste probably less than what was called for. The turmeric gives the orzo a brilliant yellow color which in combination with the green kale (I used arugula because I grow it) gave this a striking appearance. (Note to self: this might make a great dish for a Green Bay Packers party with its vivid colors of green and gold!) Other than seasoning to taste rather than adhering strictly to the given measurements I wouldn't change this recipe at all and have absolutely no criticism. It's lovely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T21:04:26.517Z",
                "reviewBody": "The flavors were delicious.  If i make it again I would put a little chicken stock with the kale and garlic while it is cooking.  My garlic burned and the kale was not soft and tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ecoshu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4124682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T18:53:22.69Z",
                "reviewBody": "I have never had kale before and I got a bunch in my bountiful basket this weekend.  I found this and we LOVE orzo so I thought I would give it a try.  Not sure why you need the turmeric other than it makes your orzo a pretty color.  This makes a HUGE side dish.  I normally only make half a pound, but I wanted to follow the recipe.  Make sure you stem the Kale- it doesn't get soft and I was glad I did a good job on all but one leaf.  Kale is not bad, but I think the lemon juice and parm is a little on the light side for this much orzo.  I also found my kale starting to burn with no water just the evoo to cook it in and my garlic was clearly on the brown side.  If I did this again I would cook my garlic then add a little water or stock to steam my kale instead of cooking it in the oil.  Some of the pieces got really crispy.  Thanks for sharing overall it was good I would just make a few minor changes next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETJAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/745460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-17T15:30:44.513Z",
                "reviewBody": "This is one of those recipes where you really wish there was a 10 star rating option. We absolutely loved this. The flavors are amazing. I added some halved cherry tomatoes right before serving. Thank you so much!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinBug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinbug/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-12T00:52:09.273Z",
                "reviewBody": "Love this recipe. I boiled 1 cup water add chicken bouillon cube and then added chopped kale to water to let it simmer until it softens. Meanwhile I sauteed mushrooms carrots red pepper and onion and added garlic crushed red pepper nutmeg and lemon juice seasoning salt and cumin. Cumin and lemon juice are excellent together. Drain kale and mix w/veggies and orzo. Fabulous. I used only one cup orzo and it made 4 lunch sized meals.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "morgy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2283536/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-08T17:41:06.443Z",
                "reviewBody": "DELISH! i took the suggestions of adding beans and cherry tomatoes and it makes the dish more filling for a main course. I also added red pepper flakes to the oil and garlic before adding the kale and it gave it a lovely kick!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "zoe261",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4288656/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-03T02:38:29.603Z",
                "reviewBody": "I don't like Kale but my boyfriend makes me eat it because it is good for me.  So I was happy to find this recipe that combines orzo (which I love) with kale.  I followed some of the suggestions given by others.  I cooked the orzo the way we always cook orzo, cooked the kale the way we always cook kale, then combined them with the turmeric, lemon juice, nutmeg and parmesan cheese as a last step.\n\nWe normally cook orzo by cooking minced garlic in oil for a few seconds until fragrant, then we put the dry orzo in and toast the orzo for a few short minutes.  We also add some chili flakes, which some other suggested as well.  Then we add slightly more chicken broth than orzo and bring to boil then lower the heat and cook covered until the broth is absorbed and the orzo is soft.\n\nAs for the kale, we cook garlic in oil until fragrant, add a half cup broth, then bring to boil.  Once boiling we add the kale and heat until the kale is wilted and the liquid is absorbed.\n\nThe dish was good when I followed those steps and we both enjoyed the combination.  We will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4716432/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-28T22:15:56.13Z",
                "reviewBody": "this was really quite lovely. I added some white beans and pine nuts and later when I had leftovers I added some sauteed mushrooms. actually used the full amount of kale for half the orzo by accident but it worked out fine. nice recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "turtledonkey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3867038/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T18:29:34.28Z",
                "reviewBody": "I thought two cups of orzo to be a bit much so I cut it in half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pixi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3251412/"
                }
            }
        ]
    }
]