[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/174247/cream-cheese-and-prosciutto-stuffed-chicken/",
        "name": "Cream Cheese and Prosciutto Stuffed Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F266655.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:51:00.000Z",
        "description": "This cheesy stuffed chicken will impress everyone, whether it's your family on a weeknight or your guests at a dinner party. You can even prepare the chicken the day before and cook it quickly when you need to! So easy and delicious!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "4 chicken breasts",
        "recipeIngredient": [
            "1 (8 ounce) package reduced-fat cream cheese",
            "½ cup minced red onion",
            "3 cloves garlic, minced",
            "½ teaspoon ground black pepper",
            "4 skinless, boneless chicken breast halves",
            "8 slices prosciutto",
            "8 leaves fresh basil",
            "3 tablespoons olive oil",
            "3 tablespoons butter",
            "3 tablespoons all-purpose flour",
            "½ cup white wine",
            "2 cups chicken broth"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix the cream cheese, red onion, garlic, and black pepper together in a small bowl; set aside. Place the chicken breasts between two sheets of waxed paper on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of 1/4 inch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the cream cheese mixture over the flattened chicken breasts, then place two slices of prosciutto and two leaves of basil over the cream cheese on each breast. Roll the chicken breasts over the filling, and secure with toothpicks. Cover, and refrigerate 1 hour to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large skillet over medium-high heat. Add the chicken breasts; cook until browned on all sides, about 10 minutes. Remove the chicken from the pan, and set aside. Whisk the butter and flour into the skillet until the butter melts and the flour turns golden, about 1 minute. Stir in the white wine, and cook for 1 minute. Pour in the chicken broth, and return to a boil. Reduce heat to medium-low; simmer for a few more minutes. Return the chicken breasts to the skillet, and cover; cook until the chicken is no longer pink in the center, about 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "StacyD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.388888888888889,
            "ratingCount": 36,
            "itemReviewed": "Cream Cheese and Prosciutto Stuffed Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "588.3 calories",
            "carbohydrateContent": "12.2 g",
            "cholesterolContent": "144.6 mg",
            "fatContent": "40.7 g",
            "fiberContent": "0.6 g",
            "proteinContent": "36.3 g",
            "saturatedFatContent": "17.5 g",
            "servingSize": null,
            "sodiumContent": "845.5 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-06-01T18:46:26.417Z",
                "reviewBody": "This recipe was really good, as written, but it needs a bit of tweeking on the cooking time.  It took MUCH longer than stated for the chicken to cook with everything inside, and mine never got to the stated temp (but the chicken was cooked through...just the stuffing wasn't at that temp- which may be a food hazard!  I think a way to remedy that would be to follow the first steps up to after you make the sauce.  Then, I'd pour the sauce over the chicken, cover it, and cook it in the oven for 20-30 mins at 375.  That would also ensure that the raw onions and garlic in the cream cheese were cooked.  On taste, this recipe is five stars- just not quite the right way to make it!  I'll definitely make it again!  I served it over rice, and as another reviewer said, there's a TON of sauce, but it helps with the cooking and keeping the meat moist, I'm sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bethsanchez23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-28T20:44:20.02Z",
                "reviewBody": "It was a five star for us. The recipe says cook time at the top of the recipe. 30 minutes. That is pretty much true. I did as it directed when I was simmering it in the sauce. I simmered it for about 20 to 25 minutes. I don't understand why it says 5 minutes when you return it to the sauce. It should be about 20 to 25 minutes. I served it with a great tossed salad while our Fettuccini was cooking I served it with the Fettuccini and Asparagus. We both loved it. I will make it many times again. I got the Prosciutto at Wal-Mart for 3.00. Very tender not overcooked. It leaves a wonderful aftertaste. You can roll them and refrigerate them (I tied them with string) and just do the cook them while you are making your salad and Vegetable. I am eager to have them for dinner tomorrow. Just the two of us so I have good leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NORMA47",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1283093/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T18:01:41.85Z",
                "reviewBody": "Very tasty! My local market was out of prosciutto so I improvised and use bacon. I was concerned that the chicken might be lacking in flavor by doing so but it was great even with the substitution. To cut calories; I used cornstarch for my thickening agent which allowed me to omit the butter. The gravy was quite flavorful this way. I boiled angel hair pasta and added it to the sauce once it was done. I topped the pasta with the chicken and served with a side of asparagus. I think a sundried tomato pesto would be excellent added to the cream cheese mixture. Also would like to try topping it with mozzarella cheese and baking it as opposed to finishing it on the stove. A great recipe the way it is but I believe will lend itself to a host of variations.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Hinds",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3450510/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-24T17:46:51.073Z",
                "reviewBody": "Some people care about their diet but for me it comes down to how good something tastes so when I saw that this recipe called for low fat cream cheese I substituted with regular instead. After trying the dish I realized that having the heavier cream cheese did not seem to add any punch to the dish. Because of the way that the sauce cooks the cream cheese is really an after thought compared to the wine and basil flavoring. While the recipe is a little bit more work the dish has rich flavors and creates an impressive impression on guests. When cooking this recipe I'd recommended boiling the chicken for closer to 7 - 10 minutes vs. 5 minutes and to make sure that the chicken is covered during the simmer/boiling stage of the cooking. Because the stuffed chicken breasts tend to be pretty thick there is a tendency to undercook the inside meat if you're not careful about how long it stays in the skillet. I'd also recommend using a big pan for your skillet instead of a traditional frying pan because four of these monster sized pieces of chicken will have trouble fitting in a traditional frying pan all at once. Overall I give this one a four out of five but make sure that your guests enjoy basil or else this dish will end up as leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Davis Freeberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3539684/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-07T21:51:27.787Z",
                "reviewBody": "Very tasty!! I made this for company and they had to cancel at the last minute. Needless to say I was not sad to have leftovers of this entree. It is even better the second time around! The cream cheese flavored with garlic and onion gives this dish such a distinctive flavor. I was surprised by how much gravy this recipe made. I will have to find another use for it because no one could eat all the gravy in one sitting. If you are looking for a new twist on an old favorite TRY THIS RECIPE! You'll be glad you did.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms January",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3291109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-10T18:46:49.77Z",
                "reviewBody": "It didn't come out like I expected. I think it's because I thought the cream cheese overpowered the rest of th meat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2740187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-07T23:52:58.84Z",
                "reviewBody": "WONDERFUL! The only thing I did different was used dried Italian seasoning as I didn't have any fresh basil. My husband loved it thought it tasted like something he could have gotten in a restaurant in Europe when he was stationed there. A definite keeper just as it is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PEGLYF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795656/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-04T02:59:35.28Z",
                "reviewBody": "This was very tasty and not too difficult to make on a weeknight. I took the advice of other reviewers and cooked the chicken in the oven for 20 minutes instead of the recommended 5 minutes on the stove and it turned out well. The chicken was still moist and I think baking it (covered) for the extra time allowed the flavors of the sauce to develop even more. Next time I will probably add more (and probably dryer) wine as well as a bit more salt (recipe didn't call for any but I added some and still felt it lacking) but overall this is a great dish that I will definitely add to my recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "WorkingWarden",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/818454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-30T20:53:31.597Z",
                "reviewBody": "I think this is my favorite chicken. The sauce is heavenly and tastes like I got it in a restaurant!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susie Ginther Brauns",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/850948/"
                }
            }
        ]
    }
]