[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/174/soups-stews-and-chili/chowders/",
                    "name": "Chowders",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/174755/sheryls-corn-and-crab-chowder/",
        "name": "Sheryl's Corn and Crab Chowder",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7216852.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:51:02.000Z",
        "description": "You don't have to run to a fancy restaurant to enjoy this delicious corn and crab chowder!",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "5 slices bacon",
            "1 tablespoon clarified butter",
            "¾ cup chopped onion",
            "¼ cup chopped green bell pepper",
            "½ cup chopped celery",
            "1 ½ teaspoons minced garlic",
            "¼ cup dry white wine",
            "1 teaspoon brandy",
            "1 ½ teaspoons dried basil",
            "1 teaspoon ground white pepper",
            "¼ teaspoon cayenne pepper",
            "½ teaspoon dried thyme leaves",
            "2 teaspoons Worcestershire sauce",
            "3 cups fresh corn kernels",
            "4 large potatoes, peeled and diced",
            "1 ½ quarts chicken stock",
            "½ cup butter",
            "½ cup all-purpose flour",
            "3 cups heavy cream",
            "1 cup half-and-half cream",
            "1 pound peeled and deveined small shrimp",
            "1 tablespoon Creole seasoning",
            "1 pound fresh lump crabmeat, shell pieces removed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon, and reserve the grease. Allow the bacon to cool, then crumble, and set aside with the grease.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, heat 1 tablespoon of clarified butter in a large pot over medium heat. Stir in the onion, green pepper, celery, and garlic. Cook and stir until the onion has softened and turned translucent, about 10 minutes. Pour in the white wine and brandy, and bring to a simmer. Season with the basil, white pepper, cayenne pepper, thyme, and Worcestershire sauce. Add the corn and potatoes, then pour in the chicken stock. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the soup is simmering, melt 1/2 cup of butter in a small saucepan over medium-low heat. Stir in the flour, and cook, stirring constantly, until the flour has turned the color of peanut butter to make a roux, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the roux into the soup, and pour in the heavy cream, half-and-half cream, reserved bacon and grease, and shrimp. Return to a simmer over medium-high heat, and cook until the shrimp are no longer translucent in the center, the potatoes are tender, and the soup has thickened, about 15 minutes. Season to taste with Creole seasoning, and stir in the crab meat to serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chowders"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sfarrish"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.782051282051282,
            "ratingCount": 156,
            "itemReviewed": "Sheryl's Corn and Crab Chowder",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "709.3 calories",
            "carbohydrateContent": "46.1 g",
            "cholesterolContent": "240.2 mg",
            "fatContent": "48 g",
            "fiberContent": "5.3 g",
            "proteinContent": "25.1 g",
            "saturatedFatContent": "27.3 g",
            "servingSize": null,
            "sodiumContent": "1016.2 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-04-27T20:24:40.093Z",
                "reviewBody": "If you are searching for recipes for this type of chowder, STOP RIGHT HERE.  Just reading the recipe with a \"chef's eye\" you can tell this is far superior to the other ones posted on this site.  i don't give out many 5 star ratings, but this is most definitely one of them.  i was searching for a crab/corn chowder recipe because my husband and i enjoy Bonefish Grill's version so much, but it is pricey - $6.50 for a bowl.  I searched the internet for a bonefish grill copycat chowder recipe, no luck. Came on reliable all recipes, and I was just hoping this chowder would taste good, as it seemed like it would - but it tasted IDENTICAL to bonefish grills (if you are the author reading this, please take this as a compliment!)   The changes I made were as follows:  omitted celery and the shrimp (personal preference). no clarified butter - didnt have time - just used a regular tablespoon of butter, worked fine.  Cajun seasoning instead of Creole (I'm sure its next to the same thing).  and canned golden corn and canned jumbo lump crab instead of fresh.   It was, ABSOLUTELY PERFECT.  Try this, I promise you won't be disappointed.   (unless you don't like spicy - it does pack a little heat! ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MomSavedbyGrace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1366670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-27T22:15:05.85Z",
                "reviewBody": "Normally I try to stay true to the original person’s recipe unless the masses have agreed to some changes but I had to re-work this recipe for 3 reasons.  #1.  Everybody who is eating my chowder agreed that the Bonefish grill was WAY too spicey (in ALL their dishes, not just the chowder).  I’m a spice light-weight, and my wife is a total spice wuss so I just couldn’t make it as-is based on the other reviews.  #2. I don’t have the alcohol required in my house (I’m more of a Jim Beam kinda guy) and it’s Sunday in PA and I can’t buy it.  I don’t think I’ll bother next time either since it doesn’t call for much so I would be wasting it.  #3. Corn is now out of season and the only small shrimp I liked at the market was cooked/pieces so I went for it – and crab around here sucks right now.  So here is the Spice Wuss/Alcohol Free/Out of Season Variation:  I replaced the cayenne with double the amount of Old Bay and dropped Creole seasoning completely.  I replaced the white wine with pure motts apple juice and the brandy with apple cider vinegar.  I used a 1 lb bag of frozen white corn/yellow corn mix partly thawed in the fridge.  Since my shrimp was cooked I left it out until the potatoes were cooked then tossed them in and let it come back up to a simmer then added the crab meat (which was canned chicken of the sea premium crab meat..all real crab).  I then left the whole thing on the stove on warm until dinner time (about an hour) so by then everything was a perfect temperature.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Fizz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1422502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-13T22:08:20.693Z",
                "reviewBody": "This recipe is superb! Like the 1st reviewer, I was looking to duplicate Bonefish Grill's chowder and I am very happy with the results! I omitted he cayenne pepper since I didn't have any- the creole seasoning added just enough heat.  Thank you for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kriss629",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1543908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-19T19:13:21.92Z",
                "reviewBody": "Prep time is way more than 35 minutes, however well worth it.  This recipe filled a large crockpot.  I made the soup and let it cook on low all day in the crockpot.  After letting it sit in the fridge all night, I let it cook one more day on low until we enjoyed it that evening.  I think soups are much better after they have had time to marinate.  Instead of small size shrimp, I used petite shrimp for salad or shrimp salad.    This soup is delicious and definately worth making. I am from Maryland and love cream of crab soup.  This is a lot more than just corn and crab soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steph",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4686203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-04T04:42:08.82Z",
                "reviewBody": "So... this recipe isn't cheap to make if you follow exactly and the prep time is way off (takes twice as long).  I'm sorry but I really wanted to rate this well based on the previous reviews.  I have been to Anthony's and Duke's (fine seafood restaurants) and they have had a corn, crab and bourbon bisque that is to die for and is very similar to each other.  I have been searching and thought this recipe was similar.  I followed this recipe EXACTLY and it ended up VERY bland.  I didn't want to waste so much money with the crab, shrimp, etc. that I ended up going back to the store just to liven it up.  I added more shrimp, creole, brandy, wine and even after all that, it still seemed bland that I put in a tablespoon of vanilla.  After all that, it only tasted fair.  I'm sorry but this is not worth the time and money (at least for me). :( I will keep searching.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JGrogan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8535776/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-12T21:18:54.817Z",
                "reviewBody": "Great recipe! There is a little local eatery here on the Outer Banks that has the best corn and crab chowder that we've ever eaten. This recipe may be better! If you want to carry it to the next level add sea scallops and clams.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3333764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T18:49:47.03Z",
                "reviewBody": "This is my 1st recipe review... but I just had to! \nWe have a monthly soup and salad group so I am always on the lookout for great soup recipes. When I served it the other night, all the gals said that it could never be topped. All the guys asked for seconds. My husband, the Chowder Connoisseur, who has ordered chowder in every city we have ever vacationed at, said it was the best he ever tasted. I did reduce the cayenne pepper for him though. hubby doesn't do hot. AND, I completely forgot to put in the bacon, which I did fry, but I'm a Senior- what can I say.  \n\nAfter cooking the bacon crisp, I sauteed the veggies in the bacon fat- I really think that was enough of the \"fat\". but, next time, I will definitely add the bacon. This is one of the best soup recipes I have ever come across.\n\nThanks Sheryl!\n\n\nNext time, I will put in the bacon, but not the grease... I think it is enough if you just saute the veggies in the reserved bacon fat. Then",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Geri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6646182/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T18:53:21.603Z",
                "reviewBody": "Used two cans crab meat instead of fresh and ham instead of bacon. Very good stuff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2155565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-09T23:09:29.74Z",
                "reviewBody": "I made this for my family last night and it was a disappointment.  Sorry, but it really ended up tasting like straight cream with a little spice.  My husband and I went back to double-check we added everything and we did.  The crab wasn't cheap and it took a lot longer to make than expected.  We ended up pouring it down the drain. :(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne1010",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8581051/"
                }
            }
        ]
    }
]