[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1976/side-dish/sauces-and-condiments/sauces/",
                    "name": "Sauces",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/182298/romesco-sauce/",
        "name": "Romesco Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F237633.jpg",
            "width": 1200,
            "height": 1200
        },
        "datePublished": "2008-11-20T01:51:37.000Z",
        "description": "A wonderful versatile Latin sauce originating in Spain with amazing flavors. It can be served with grilled chicken, fish and seafood, as a sauce for pasta, or alone as a dip. Once you try this, you will be hooked! Try using hazelnuts instead of the almonds. Can be stored in the refrigerator for 1 week. Tastes are enhanced if allowed to sit for a few hours.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "2 1/2 cups",
        "recipeIngredient": [
            "6 roma (plum) tomatoes, halved",
            "1 large red bell pepper, quartered",
            "12 cloves garlic",
            "⅔ cup olive oil",
            "kosher salt to taste",
            "1 slice bread",
            "½ cup toasted whole almonds",
            "½ cup red wine vinegar",
            "½ teaspoon Spanish paprika",
            "1 pinch crushed red pepper flakes, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tomatoes, bell pepper, and garlic cloves onto the prepared baking sheet. Brush the vegetables with some of the olive oil, then sprinkle with kosher salt. Bake in the preheated oven until the garlic has turned golden brown, 15 to 20 minutes. Remove from the oven, and allow to cool for 10 minutes. While the vegetables are cooling, bake the bread slice on one of the oven racks until golden brown. Remove and allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape the vegetables and any juices from the pan into a food processor or blender. Break the bread into pieces, and add to the food processor along with the toasted almonds, vinegar, paprika, and red pepper flakes. Puree until finely ground, then drizzle in the remaining olive oil with the machine running. Season to taste with additional salt if necessary.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Sauces"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "AngieItaliano"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.551724137931035,
            "ratingCount": 58,
            "itemReviewed": "Romesco Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "196.2 calories",
            "carbohydrateContent": "7.3 g",
            "cholesterolContent": null,
            "fatContent": "18.3 g",
            "fiberContent": "1.8 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "2.3 g",
            "servingSize": null,
            "sodiumContent": "60.6 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-06-08T14:38:08.61Z",
                "reviewBody": "Thanks all for trying out the Romesco Sauce. Just a note that I should have had in the recipe. The garlic can be peeled or unpeeled at roasting time. I peel mine. The biggest complaint from reviewers has been that it's too vinegary. Please use less vinegar to start with, since some vinegars are stronger than others, and then if you are a vinegar freak like me, add more :] Cheers! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AngieItaliano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2967880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-08T22:11:49.22Z",
                "reviewBody": "I kept thinking \"What? No onions? No basil or oregano?\" but after one taste I realized this sauce doesn't need a single thing added to it!  Simply PERFECT!  My only changes were to reduce the vinegar - I probably used 3 1/2 tbsp. or so, just added a little at a time and kept tasting, then at the end I probably ended up drizzling in 1/4 cup of olive oil.   Had a little with some toasted baguette and crackers, and then on top of pasta for dinner.  Just delicious!  I think next time I'll try pulsing the almonds first, though, as my food processor is old and tired and I ended up finding a couple large chunks.    I really didn't want to blend the sauce any further as it was just the right texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-20T04:36:58.097Z",
                "reviewBody": "So Spanish & so delicious! All 3 world travelers who tasted this LOVED it. We each want to make this again & again! I made it & personally LOVED it exactly as written though the vinegar is noticeable so you may want to start with a little less vinegar taste & then decide if more's wanted. Although I served this as an appetizer on baguette slices it is also a great dip for savory empanadas (such as cheese shrimp or potatoes & chorizo) for dipping celery & carrots or as a sauce for pasta chicken shrimp...you'll find many ways to use this full-flavored adaptable sauce! Bravo AngieItaliano! (Maybe your \"nom de plume\" should be AngieEspanola!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-08T01:15:58.207Z",
                "reviewBody": "THIS SAUCE IS AMAZING! Used it for pizza sauce with the Honey Wheat Pizza Dough from this site topped with goat cheese and lots of fresh basil. I'm so happy this was the sauce I picked! I changed this a little based on my personal preferences and what I had on hand but it would be great just as written. I used 1 1/2 bell peppers added a few more tomatoes included 2 shallots sub'd basil oil for the olive oil and sub'd spicy balsamic vinegar and a little rice wine vinegar (didn't have red wine vinegar). I didn't add the bread or almonds - might add toasted pine nuts next time. Lots left over which I froze for my next pizza.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elisa Stamm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2561233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-09T17:45:41.933Z",
                "reviewBody": "Oh Baby Come To Mamma. I've been munching on this with toasted baguette slices and veggie dippers. I just wanted to try it as a snack before I started dinner. Now I have to push back dinner because I keep eating this! So you say this gets better after sitting? I'm in trouble I'm cooking only for myself and thought I'd have a bunch for the freezer. Kept to the recipe except for being heavy-handed with the pepper flakes and paprika (used sweet Hungarian my Spanish paprika is smoked maybe I'll try that next time since I bet that goes with the roasty goodness). I did end up using the entire amount of vinegar it was perfect for me. I think some brands are more sharp and others more smooth so I bet that makes a difference. I asked in the Recipe Exchange if the garlic should be peeled before or after roasting and the submitter herself answered (also Rhianna) within just a few minutes that peeling before hand works better but either way is okay. I used parchment instead of foil on the baking pan and got perfect consistency with a food processor. Just got a great idea since I have more baguette to use up: Make a pizza-type thing with baguette sliced horizontally and toasted topped with romesco then olives artichoke hearts and parmesan! I know what is for lunch (okay maybe breakfast) tomorrow. Thanks Angie this is one of the best things I've tried in a long time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cjucoder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2614139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-09T18:50:49.503Z",
                "reviewBody": "This is freakin' insane. A flavor explosion. I made exactly according to recipe only adding the red wine vinegar by tbsp. until it felt right. I just dipped a spoon into it to taste it before dinner. A couple times. And I'm about to go again. I'm planning on serving this on whole wheat pasta for my family with fresh parm but for me I'm having it over roasted vegetables. Awesome recipe Miss Angie. This one's a keeper. For sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-14T15:30:59.63Z",
                "reviewBody": "Oh boy! this is definitely different whether that's good or bad depends on your tastes. this sauce did not work for me and my family and i will not be making it again too bad too cuz i really wanted to like this sauce:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "alley_cat13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3036399/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-28T17:28:41.357Z",
                "reviewBody": "WOW! That was delicious! I served it with roast chicken breast pan-seared asparagus thyme roasted potatoes and french bread. I couldn't decide what to slather it on. So I slathered it on everything. There's more for tomorrow and I'm looking forward to it! I used a few tablespoons of vinegar to start then added to taste. Didn't roast the garlic but it was fine raw (if you like that sort of thing) and didn't have tomatoes so I used some leftover marinara sauce and leftover dried bread crumbs instead of stale bread. I used two red bell peppers and one fresh pasilla pepper roasted. I used regular paprika because it's all I had and less olive oil than called for. I love the versatility of this sauce! Oh and did I mention it was amazingly delicious?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "suzyhomemaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4686529/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-23T21:30:36.87Z",
                "reviewBody": "This was SPECTACULAR and came out exactly as described. I found that using the same amount of vinegar called for was a bit tangy at first but by the next day it had mellowed perfectly! I made semolina toasts spread with romesco topped with finely chopped black olives artichokes and parsley and then a dollop of goat cheese. Made 30 of these and they were all gone in 15 minutes of guest arriving. Triple batch next time for sure. Thanks for such a versatile delicious recipe that I will make for years to come with my own touch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maddmaxx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4167764/"
                }
            }
        ]
    }
]