[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/183577/sesame-beef-bites/",
        "name": "Sesame Beef Bites",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F267688.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2019-04-02T06:51:25.000Z",
        "description": "A really quick-yet-elegant finger food perfect for holiday parties!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "1 pound",
        "recipeIngredient": [
            "2 tablespoons sesame oil",
            "1 tablespoon rice vinegar",
            "1 green onion, minced",
            "1 clove garlic, minced",
            "2 teaspoons hoisin sauce",
            "¼ teaspoon chili garlic sauce",
            "1 pound beef tenderloin, cut into 3/4 inch cubes",
            "¼ cup teriyaki sauce",
            "½ teaspoon sesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together the sesame oil, vinegar, green onion, garlic, hoisin sauce, and chile garlic sauce in a large glass or ceramic bowl. Add the beef tenderloin cubes and toss to evenly coat. Cover the bowl with plastic wrap and marinate at room temperature for 10 minutes, or in the refrigerator up to 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Line a baking sheet with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the beef cubes onto the prepared baking sheet. Bake in the preheated oven until cooked to your desired degree of doneness, about 8 minutes for medium-well. Transfer to a bowl and toss with teriyaki sauce. Skewer each piece of beef with a toothpick and place onto a serving platter. Sprinkle with sesame seeds to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "KerriJ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.48051948051948,
            "ratingCount": 77,
            "itemReviewed": "Sesame Beef Bites",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "166.8 calories",
            "carbohydrateContent": "2.3 g",
            "cholesterolContent": "47.6 mg",
            "fatContent": "9.8 g",
            "fiberContent": "0.1 g",
            "proteinContent": "16.3 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "405.7 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-15T17:35:25.18Z",
                "reviewBody": "These were tasty. I used london broil and marinated for 2 hours. I would recommend a longer marinating time than that as the flavor did not penetrate the meat as much as I would have liked. I think 4 hours would do the trick well. I also had more than 1lb of meat so I doubled the marinade as well as the garlic and garlic chili sauce since we like things hot. I only added about 2 tsp of sesame oil since I don't LOVE it and it can quickly overpower the flavor of a recipe but that is certainly personal taste. I broiled mine for about 5 mins on each side and also cut some larger than others as I like my beef \"mooing\" off my plate. I would certainly say to toast the sesame seeds before garnishing as it adds a wonderful flavor. Also as a side note dont forget to let the meat rest for a few minutes before you go poking em with toothpicks (I didn't use toothpicks in mine) to let the juices settle a bit otherwise they are gonna run all over the plate instead of staying in the meat like they need to. All in all a good solid recipe they will make a great appy or a great meat for dinner!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ladybuggs5224",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ladybuggs5224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-18T14:44:12.847Z",
                "reviewBody": "This recipe received mixed reviews from my very picky family...some loved it and some hated it. Because beef tenderloin is SO expensive I used some rib eye steak from the freezer. Rib eye is not quite as expensive as tenderloin but it is still an excellent cut! I had two pounds of meat so I doubled the marinade but only used 1/3 cup of teriyaki sauce later on. I also used fresh chives from my garden instead of green onion. Because of my picky family who hates anything remotely spicy I skipped the chile garlic sauce. I marinated the beef for 2 hours before I broiled it. After the beef was cooked through I transferred everything to a large skillet and brought the liquid to a boil. I whisked about a teaspoon of cornstarch into the 1/3 cup of teriyaki sauce that I used poured this into the skillet and brought it back to a boil. This way the juices adhered to the beef and locked in all that flavor. This beef does offer a beautiful presentation...I put rice into the bowls topped it off with some of the beef sprinkled it with sesame seeds and chopped fresh chives and served with Ginger Veggie Stir-Fry from this site...it was the perfect accompaniment! Thanks for sharing this recipe...it is very tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "larkspur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3097894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-16T16:42:45.3Z",
                "reviewBody": "These are yummy! I used sirloin (because tenderloin is pretty expensive here) and it came out good. I marinated for about 2 hours and the flavour was noticeable - next time I will marinate longer. Made my own teriyaki sauce and ended up putting the finished bites into a saucepan with the teriyaki (because I wanted the sauce to stick more.) Added a bit of cornstarch to thicken it up - Worked perfectly! Must have taken a few minutes to do. I didn't serve it as an appetizer but instead served this over vegetable lo mien which I stir fried in some teriyaki sauce to compliment the bites. It was great! Yummy! I will definitely make this again - just as an appetizer or to serve with another dish. Great both ways. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Roxanne J.R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-17T18:56:00.363Z",
                "reviewBody": "I couldn't see any reason to use tenderloin in this recipe. I used a boneless chuck steak cut into 1\" cubes but any flavorful cut of beef would work. I ended up marinating it for 24 hours because something came up and I couldn't cook it when planned. It had no ill effect. We are not teriyaki fans so I made double the amount of the marinade and heated it while the meat cooked. I poured that over and sprinkled with toasted sesame seeds. I also served this as a main course over wide egg noodles cooked with fresh spinach. The plate looked good and tasted good. We will have this again. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-01T23:42:15.093Z",
                "reviewBody": "I marinated overnight and panfried instead of baking. I also mixed in teriyaki right into the marinade. Served with Udon noodles. Very yummy - the bf went back for seconds!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Raquel Teixeira",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3165226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-18T14:36:58.877Z",
                "reviewBody": "This was really good- I followed the recipe all the way except I used sirloin instead of tenderloin due to the price- I also took the advice to marinate it for about 4 hours in the fridge. It was delicious! I served up some stir-fried fresh green beans with mine- this was so easy to make I will make it again:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "McBacon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/crunchy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T18:54:44.207Z",
                "reviewBody": "I used meat labeled London Broil (=flank I think) marinated for 12 hrs. The marinade's flavor did penetrate throughout. I tasted the broiled meat before adding the teriyaki. Tender enough but I wanted something else in the flavor.... Once the teriyaki was added its sweet taste overpowered most of the beef's taste. I think broiling the meat again in the last minute with only some of the teriyaki would be better making it a sticky glaze but not so drippy sweet. Either way do keep an eye on the broiling in case the juice/meat catches fire. (Mine did catch on fire. No problem: I pulled the sheet out of the oven for a few seconds until the fire went out. Maybe prevent that by having the rack actually 6\" away from flame - instead of only 3-1/2\" away like I'd done!) This was served as an appetizer. It was alright but I would've preferred it over rice & vegetables. The sesame seeds & green onions added great flavor & visual appeal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-08T02:47:40.413Z",
                "reviewBody": "Made as written. I'll use it again. I served it with rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2342108/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T15:40:11.493Z",
                "reviewBody": "I used skirt steak marinated it and grilled the steak for dinner. Lots and lots of flavor!! Easy Peasy and it reminded me of my beef jerky just not as dry:) I will make this again! Thank you very much for sharing a part of you Kerri:) Very Nice! Patty",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty Cakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ilovecarlos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-24T00:08:17.897Z",
                "reviewBody": "This recipe lacked all sense of flavor and needs some major changes. I will go back and read other reviews to see what others changed if I ever decide to try it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sileste",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418948/"
                }
            }
        ]
    }
]