[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17048/soups-stews-and-chili/stews/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/190100/porkolt-hungarian-stew-made-with-pork/",
        "name": "Porkolt (Hungarian Stew) Made With Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1085826.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2019-04-02T06:51:44.000Z",
        "description": "A flavorful stew, P&ouml;rk&ouml;lt is redolent with the fragrance of paprika and bell peppers. It has few ingredients, and is surprisingly easy to make. Save time by using boneless pork chops and cubing them after they are browned. There should be enough salt in the canned tomatoes to season the stew, but if not, add more to your taste. Use best-quality, real Hungarian paprika for best results. We prefer to serve it with noodles, but galuska (Hungarian dumplings) or rice are good, too.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H55M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "14 servings",
        "recipeIngredient": [
            "5 slices bacon, diced",
            "2 large onions, diced",
            "¼ cup Hungarian paprika",
            "1 ½ teaspoons garlic powder",
            "¼ teaspoon ground black pepper",
            "5 pounds boneless pork chops, trimmed",
            "1 large yellow bell pepper, seeded and diced",
            "2 (14 ounce) cans diced tomatoes, with liquid",
            "⅔ cup beef broth",
            "2 cups reduced-fat sour cream",
            "2 (6 ounce) packages wide egg noodles"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a large, deep skillet, and cook over medium-high heat until evenly browned, about 10 minutes. Drain, and reserve the drippings. Add the onions to the bacon and cook together until the onion is translucent. Remove skillet from heat and stir the paprika, garlic powder, and pepper into the bacon mixture. Transfer the mixture into a large stockpot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a small amount of the reserved bacon drippings in the skillet again over medium-high heat. Cook the pork chops in batches in the hot drippings until evenly browned on both sides. Use additional bacon drippings for each batch as needed. Remove the pork chops to a cutting board and blot excess fat off the surface of the chops with a paper towel; cut into bite-sized cubes and stir into the bacon mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a small amount of the bacon drippings in the skillet; cook and stir the bell pepper in the hot drippings until softened and fragrant; drain on a plate lined with paper towels. Stir the cooked pepper into the bacon mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the tomatoes with liquid and beef broth into a stockpot and place the pot over medium-high heat. Bring to a simmer and reduce heat to medium-low. Cook until the stew begins to thicken, stirring occasionally, about 90 minutes. Stir the sour cream into the stew just before serving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a pot with lightly-salted water and bring to a rolling boil; add the egg noodles to the water and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink. Ladle the stew over the drained noodles to serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Fishwrap"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.377049180327869,
            "ratingCount": 183,
            "itemReviewed": "Porkolt (Hungarian Stew) Made With Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "322.8 calories",
            "carbohydrateContent": "22.9 g",
            "cholesterolContent": "86.4 mg",
            "fatContent": "13.2 g",
            "fiberContent": "2.5 g",
            "proteinContent": "26.9 g",
            "saturatedFatContent": "5.3 g",
            "servingSize": null,
            "sodiumContent": "348.7 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-01-09T03:23:49.107Z",
                "reviewBody": "When Hubs remarks “This is another of those dishes I really like that I’ll never see again,” you know you have something here!  (Except for family favorites I rarely prepare the same dish twice)  This is just excellent; a flavorful and satisfying comfort food that doesn’t bog down in an overload of spices or any processed ingredients.  I started off with boneless country-style ribs that I cut into small pieces before browning them in bacon grease.  I cooked the onion separately, a good long while before continuing on with the recipe, and used fresh garlic rather than garlic powder.  Given that I scaled this down to three servings (one pound of meat) for Hubs and me, it wasn’t practical for me to open up a can of beef broth for the small amount called for.  Red wine filled in nicely (I happened to have a glass handy :)  I used twice the amount of tomatoes called for (a full can for the 3-serving recipe I made) and in my view it was just right.  Rather than stirring the sour cream into the mix I gave each plate a dollop of it upon serving and when I make this again I’ll do it the same way.   I served this over buttered wide noodles and garnished it with chives.  I’m not sure just what made this so darn good, the bacon maybe or the sweet Hungarian paprika, but this humble dish was a real sleeper hit tonight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-21T18:28:34.183Z",
                "reviewBody": "Almost like mom's. I made a few changes to what I remember being in the dish as a child. I halved the recipe. Skipped the bacon and opted to use canola oil instead of the bacon grease. Sauteed onion a few cloves of minced garlic handful each of frozen diced green and red bell pepper. Added the diced pork (used a 1/4-1/2 pork loin roast relatively lean) then tossed in the seasonings including a beef bouillon cube for the beef broth. I also squeezed in a generous teaspoon or two of sweet red (bell?) pepper paste. Let it cook down until pork was nearly fully cooked. Added the can of diced tomatoes and water mixed with enough browned flour to thicken (this is the liquid part used combined with the beef bouillon cube to replace the beef broth). I let this practically come to a rolling boil and 'simmered' for about 30 minutes then added half a small container of sour cream and 2-3 generous shakes of Parmesan. Lowered the heat to a light simmer just enough to meld the cheese and sour cream into the sauce. Served over linguine (not traditional but that's all we had) and had the shaker on the side if anyone wanted extra cheese (you could say the addition of the Parmesan is an American touch/take on the dish). I'm half Hungarian and this is comfort food at its best (for me at least!). As a side note there are two types of Hungarian paprika- The 'hot' being spicy and 'edes' being mild (not spicy). It is still different from regular grocery paprika.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-20T15:54:09.507Z",
                "reviewBody": "This recipe was quite good, I did add some cayenne pepper (1tbsp) as I had no Hungarian Paprika on hand. Hungarian Paprika is usually \"spicier\" than normal grocery store paprika",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2444394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-15T21:25:26.397Z",
                "reviewBody": "I have made this more than a few times, and every time it comes out delicious  :))) I follow the recipe exact everytime, sometimes I add more bacon because we love bacon in this house... I usually serve it over some sort of rice (white/jasmin/basmati) instead of the egg noodles but that's just personal choice  ;))  my bf loves pulled pork sandwiches, so when I buy a pork rib roast, I cook up the meat in my slow cooker.. I save half of the meat (about 3 or 4 Lbs), and shred it, and put it in a ziploc freezer bag in my freezer.. when I get the craving for this recipe, I just pull out the meat from the freezer and use that... I add it to the pot after I saute the bacon, onions, paprika... another thing I have done is with the left overs from this recipe the next evening, it is GREAT rolled up in a flour tortilla and baked in the oven with some extra sauce + cheese, as a enchilada! (I have added some black beans into the porkolt mixture and/or some kibblet corn, with the rice mixed in - not the noodles) is a really good way to put a spin on the leftovers... thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel RedVelvet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6836179/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-20T17:34:16.723Z",
                "reviewBody": "nagyon finom volt!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JerseyLady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3567759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T19:34:25.32Z",
                "reviewBody": "This was a different recipe for us! I was pleasantly surprised with the outcome. I followed the recipe exactly as stated. I had to add flour to the sauce mixture because it didn't thicken up the way I would have liked. Other than that it was a great recipe. Definitely a weekend recipe for the all the steps and the amount of time involved.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly MacDonald",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/k-dub1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-17T00:09:12.54Z",
                "reviewBody": "I wanted something that wasn't beef or lamb stew, and something different from those styles. This recipe looked really interesting.\nI made only a couple changes: first I had to lean it down to serve 3 people. Second I wanted to cheapen the cost down by using a lesser cut and cooking itnlonger. \nI kept the bacon at 5 slices, because we love bacon. Used 3/4 of large onion.\n1/2 Green Pepper, 3/4 Red Pepper.\n2/3 cup of broth was great for this quantity.\nAs for the pork I used 2 lbs. of pork butt; gristle & fat removed, and cut into 1 inch pieces, and I didn't change the seasoning.\nI took the cook time to 3 hours to insure that the butt was tender and cooked through.\nThis was a excellent recipe that I had to gear towards my family and costs.\nI made the Hungarian dumplings and let them cook in the sauce for the last 45 minutes.\nDefinitely a \"keeper\" recipe and will do this one again. Added to my Comfort Food recipe box!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RCHEISS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/598946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-01T14:50:35.28Z",
                "reviewBody": "Wow thats all I can say-we LOVED this! I had only 1/2 lb lean pork meat but with the bacon there was plenty of meat and flavor; I used peeled fresh tomatoes from our garden rather than canned and I had rich Labanese yogurt instead of sour cream. Oh and I used two big cloves of garlic rather than powdered. Hubby just keeps raving about how much he liked it and I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2205269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-06T04:25:30.483Z",
                "reviewBody": "Porkolt = \"roasted\". Since I love my slow cooker AND I'm trying to eat healthier I decided to skip the stove method and add my own personal touches. I omitted the bacon and bell pepper altogether (bacon for fat/cal content; bell pepper because my family detests) used fire roasted diced tomatoes and 2 large cloves of fresh minced garlic dumped all ingredients into my 6qt. Crock Pot used diced pork stew meat stirred and let it ride for 4 hrs on LOW. I uncovered for 30 min. to let the sauce thicken. I tried it without sour cream and then with. It's absolutely delicious both ways but if you're trying to trim as much fat/cals as you can while still having a succulent meal I'd say skip the sour cream - you really won't miss it. Prepare to have your home filled with a mouthwatering aroma while it stews in its own juices. We served it on quinoa as it's what I had in my pantry (not to mention the boost in nutrition). This is can stand alone however; you do not need a starch/filler. The only thing it seemed to lack for me was spice which is why I didn't give it a full 5 stars. I used authentic Hungarian Paprika and it gave a savory punch but I like a little kick so next time I'll add a dash or two of chili powder. So easy! Can be frozen. Serve with crusty bread and a big bowl of fruits/veggies. Tastes even BETTER the next day. Highly recommend - this is comfort food at its best! =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mesa Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4757764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-22T18:56:22.32Z",
                "reviewBody": "I made this recipe EXACTLY per the instructions. This felt like it should be great based on the ingredients but...this was bland and tasteless. Not even my kids who only eat non-spicy food though it was a keeper. Since there were several meals worth of leftovers and I hate to waste food I added cayenne pepper to it and it was thereafter passable. The cayenne pepper raised it to a 3 star recipe. I would NOT make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Steven M,",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5743492/"
                }
            }
        ]
    }
]