[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/535/main-dish/dumplings/",
                    "name": "Dumpling Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/192605/pierogies/",
        "name": "Pierogies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8055951.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:51:49.000Z",
        "description": "My great-grandmother's recipe. A little bit of work, but well worth it. We make about 200 every Christmas Eve, and everyone can't wait. The amounts for the ingredients is an estimate, because my great-grandmother does not measure! Serve with a side of sour cream.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "48 pierogies",
        "recipeIngredient": [
            "1 (16 ounce) container sour cream",
            "3 cups all-purpose flour",
            "2 cups cold mashed potatoes",
            "½ cup butter",
            "2 large onions, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the sour cream in a large bowl, and mix in flour to make a dough. Roll the dough out on a floured surface about 1/16 inch thick, and cut rounds about 3 1/2 inches across using a cookie cutter or a glass. Re-roll the unused dough to make more rounds, up to 4 times -- after that, it gets hard to work with.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place about 1 teaspoon of mashed potatoes in the center of each dough round, fold over into a half-moon shape, and press and seal the edges with a fork. Set the filled pierogies aside under a towel to prevent drying.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large skillet over medium-low heat, and cook and stir the onions until translucent, 4 to 5 minutes. Remove the cooked onions and set aside, leaving butter in the skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large saucepan of water to a boil, and carefully drop a few filled pierogies at a time into the boiling water. After they float to the surface, allow them to gently boil for about 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Re-heat the butter in the skillet over medium heat. Gently scoop the pierogies out of the water (they break easily) and place them in the skillet to brown on the bottom, about 3 minutes. Place the fried pierogies on a buttered baking sheet, sprinkle them with the cooked onions, and keep warm in the oven on low setting until served.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Dumpling Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "gclark"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.267605633802817,
            "ratingCount": 71,
            "itemReviewed": "Pierogies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "226.2 calories",
            "carbohydrateContent": "25.5 g",
            "cholesterolContent": "28.3 mg",
            "fatContent": "12.1 g",
            "fiberContent": "1.3 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "136.4 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-10-09T15:53:47Z",
                "reviewBody": "I married a Ukrainian so I KNOW pierogies lol We make hundreds of them at a time a few dozen times a year. To add some actual flavor to this recipe add onion powder to the dough at least 1/2 teaspoon and some PEPPER to the potatoes I added tellicherry fresh cracked pepper and some chives as well. With the onions omg add them to the potatos themselves!! Carmalize them and add them to the mashed potatoes ,and make sure to season the potatoes with sea salt and pepper and once u add the carmalized onions they will pop with flavor.  I also use dry curd cottage cheese to which carmalized onions have been added as well. If you want to make a cream soup ,save the water u boil the pieriogies in and reduce it by half,then add some cream and pop back in some unfried pierogies and you have a nice cream soup recipe for the next day. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Zhinka Chunmee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2956924/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-13T18:17:44.177Z",
                "reviewBody": "I do make this recipe, but I let the sour cream come to room temp. first and I add about a cup and a half more flour. Once made,I wrap well and freeze first, then when I need to make perogys I thaw the dough in the fridge. It has a better texture after being frozen. I use quite a few different fillings but our fav. is potato and cheddar cheese. It has to be old cheddar though, this gives it more flavour. I use five pounds of potatoes and 1 1/2 pounds of grated cheddar, that  needs to be put into the potatoes when they are hot when mashing, also lots off fresh ground pepper to taste.  I also do not roll the dough and cut. I cut strips, roll into snakes and slice of pieces to flatten with a rolling pin. this way there is no waste and the dough does not become tough from over working.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3478128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-06T16:28:07.963Z",
                "reviewBody": "The dough gets an \"A\" for simplicity.  It calls for 2c mashed potatoes.  I take that to mean already prepared mashed potatoes, so how you make your potatoes is up to you. I added cheese and onions to mine.    ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DIZ&#9829;",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/diz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-01T17:44:51.557Z",
                "reviewBody": "I loved how easy it was to make the dough and the sour cream gave it a really yummy taste. I used a big upside-down cup to cut out the circle shapes from the dough. The only suggestion I would make would be to add more flavor to the filling. Maybe some spices or garlic mashed potatoes would give it a bit more flavor. But overall a really good recipe and somewhat easier than other pierogie recipes I have made in the past.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Tanner Garlick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3241203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-08T15:49:58.237Z",
                "reviewBody": "My mother makes these weekly - she adds cheddar cheese to the filling with salt & pepper or makes it the traditional Ukrainian way by adding bacon & onions that have been fried to the potato mixture. We usually eat them boiled and not fried with sour cream! My comfort food.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Gail Paul",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3032841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-09T20:09:21.673Z",
                "reviewBody": "I agree it's not my family's Polish recipe but who's to say it's not polish? Many cooks change and adapt recipes and this could have been the same. You can stuff these like any dumpling with a variety of different fillings. Sauteed mushrooms and onions stewed prunes or other fruits a slightly sweet filling made from hoop cheese (can be special ordered from many delis or can use farmers or ricotta cheese for a similar taste) sugar cinnamon and raisins (my favorite) etc. We always served our pierogis with melted butter. They are a little on the bland side but you can jazz them up to your own preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "1JOHN513",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1016363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-05T19:10:13.287Z",
                "reviewBody": "This recipe is Definitely NOT the Polish recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3557975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T21:52:17.507Z",
                "reviewBody": "THE 5 STARS ARE FOR THE DOUGH!! I AM POLISH AND UKRAINIAN AND I WAS AFRAID TO WASTE THE INGREDIENTS (SOUR CREAM) IF IT DID NOT COME OUT. BUT...WOW!!! SO PLIABLE! I ROLLED PIECES INTO A \"ROPE\" APPROX 12\" LONG THEN CUT INTO 1\" PIECES. I USED MY FINGERS TO MAKE A CIRCLE AND FINISHED IT OFF WITH A ROLLING PIN. AS FOR THE FILLING I MADE 2 KINDS - I CUT POTATOES INTO CHUNKS BOILED UNTIL TENDER WHEN SLIGHTLY COOLED I ADDED FARMERS CHEESE AND LOTS OF ONION THAT I SAUTEED IN A GOOD AMOUNT OF BUTTER. THE SECOND FILLING IS MY DAD'S ABSOLUTE FAVORITE I USED FARMERS CHEESE ONION WHICH I SAUTEED IN BUTTER AND FRESH DILL!!!! TO EACH MIXTURE I ALSO ADDED SALT AND PEPPER. AFTER I BOILED THEM I SAUTEED THEM IN BUTTER /ONION MIXTURE UNTIL THEY WERE GOLDEN AND CRISPY ON EACH SIDE.PASS WITH PLENTY OF SOUR CREAM.MMMMMMMM.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMBAKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3942814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-07T16:05:23.257Z",
                "reviewBody": "This is basically the same dough my family uses except we use ice cold water and some salt with the flour and sour cream its a very good dough",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rklukowski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4062081/"
                }
            }
        ]
    }
]