[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/150/breakfast-and-brunch/meat-and-seafood/",
                    "name": "Meat and Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2427/breakfast-and-brunch/meat-and-seafood/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/193287/chicken-and-waffles/",
        "name": "Chicken and Waffles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3616323.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-02T06:51:50.000Z",
        "description": "This recipe has crunch, sweet and spicy, savory all in one.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 sandwiches",
        "recipeIngredient": [
            "4 eggs",
            "¼ cup heavy cream",
            "2 tablespoons cayenne pepper",
            "1 tablespoon salt",
            "1 tablespoon ground black pepper",
            "2 cups all-purpose flour",
            "1 cup cornstarch",
            "1 tablespoon salt",
            "1 quart peanut oil for frying",
            "8 chicken tenders",
            "1 cup mayonnaise",
            "¼ cup maple syrup",
            "2 teaspoons prepared horseradish",
            "1 teaspoon dry mustard powder",
            "12 slices bacon",
            "8 thin slices  Cheddar cheese",
            "8 plain frozen waffles"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together the eggs, cream, cayenne pepper, 1 tablespoon salt, and black pepper in a large bowl.  In a paper bag, shake together the flour, cornstarch, and 1 tablespoon salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip the chicken into the beaten egg mixture, then place into the flour mixture and shake to coat.  Place the breaded chicken onto a wire rack; do not stack. Let the chicken rest for 20 minutes to allow the coating to set.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat about 3 inches of oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). In small batches, fry chicken 5 to 8 minutes until golden brown. Remove chicken, and drain on paper towels. Set aside or keep warm in a a low oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the mayonnaise, maple syrup, horseradish, and mustard powder in a medium bowl. Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble the sandwiches: Place 4 waffles on a cookie sheet, top each waffle with 2 chicken tenders, 3 slices of bacon, and 2 slices of Cheddar.  Broil the sandwich for a 3 to 5 minutes until the cheese melts.  Spread 3 tablespoons of the maple mayonnaise on the remaining 4 waffles and place on top of the sandwich.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Meat and Seafood",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Switzer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.704545454545454,
            "ratingCount": 88,
            "itemReviewed": "Chicken and Waffles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1793.4 calories",
            "carbohydrateContent": "127.1 g",
            "cholesterolContent": "396.8 mg",
            "fatContent": "109.9 g",
            "fiberContent": "4.8 g",
            "proteinContent": "72.9 g",
            "saturatedFatContent": "27.5 g",
            "servingSize": null,
            "sodiumContent": "5234.2 mg",
            "sugarContent": "17 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-07T21:08:17.857Z",
                "reviewBody": "Mercy!  Good eatin'! I served with french fried sweet potatoes dusted with sugar and cinnamon; creamy coleslaw with some chopped jalepenos, celery seed and green onion.  Might want to have an antacid around....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teresa Rahn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4597989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-10T20:08:49.173Z",
                "reviewBody": "This is a very good recipe, especially the chicken coating.  I put buffalo sauce on the chicken and omitted the horseradish.  Was excellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peggy Jane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pegjane/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-28T00:27:24.57Z",
                "reviewBody": "This recipe is good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Switzer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2984813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-03T23:33:32.087Z",
                "reviewBody": "5 stars plus.  This is a very different, yet incredibly awesome recipe, and it falls under the category of so odd that it has to be good.  The sauce is what intrigued me about this one.  It is absolutely tremendous.  DO NOT change this recipe at all, or skimp and buy el cheapo chicken strips, even if you think they are good.  Make this recipe exactly how it says to make it, with the exception of the waffles.  Make fresh waffles.  Frozen waffles have no flavor, and if you get a nice, sweet waffle mix, the contrast between the sweetness of the waffles and the sauce, and the saltiness of the bacon along with the heat of the chicken is an awesome combination.  I have made this for many many groups of friends, and everyone says it is absolutely delicious, and wonderfully unique.  If you get complaints on this one, you made it wrong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rhino70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8533326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-23T15:45:46.743Z",
                "reviewBody": "This is actually pretty darn good. I even made my own waffles though I think store bought ones would be just as good (and easier). The sweetness of the maple syrup contrasts really well with the spicy chicken. I will definitely make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kori Lavertue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/korilynne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-30T20:16:57.977Z",
                "reviewBody": "Wow! This was a big hit with the entire family. The kids were full of ummmm's and yumm's and my husband couldn't stop raving about it. My husband gave it 11 out of 10 stars and my baby girl said it deserves infinity stars. Granted it is not the most healthy meal but it doesn't hurt to indulge every now and then. I made my own 9\" waffles using one of the recipes on the site. I also used 4 good sized chicken breast that I cut into about 16 chicken tenders. From there I followed the recipe however I substituted horseradish for baconaise sauce, buttermilk instead of heavy cream, and 3 teaspoons of regular mustard instead of 1 teaspoon of dry mustard powder. We didn't have any bacon to go with these but it wasn't needed. Slapped some velveeta on these babies, broiled them, added the yummy sauce, a lil bit of lettuce, then pressed them down and sliced each one in half. Because I used 9\" waffles they turned out HUGE!!! My husband was the only one that was able to finish his but not for lack of trying. I almost finished half of one, my 5 year old eat about 1/4 of one and my 7 and 13 year old also eat half. Between the 5 of us we could have gotten away with just 3 waffles instead of 4. I was skeptical about putting the mayonnaise sauce with spicy chicken and waffles but it was a delicious, flavorful, and unique experience. Excellent for a fathers day breakfast/brunch or any special occasion that requires a hearty meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melicious",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4199931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T19:55:02.613Z",
                "reviewBody": "yea",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "xweezy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6548949/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-31T23:53:37.96Z",
                "reviewBody": "I used 4 chicken breasts that were cut smaller and lightly pounded instead of chicken tenders (or is that the same thing?). For the egg mixture I only used a teaspoon of each seasoning as using a tablespoon of each seemed wasteful and unnecessary flavour-wise. That said I would probably use an egg or two less next time and substituted soy milk for the heavy cream. For the dry mixture I omitted the salt. Next time I'd use a 1:1 ratio for the flour and cornstarch as there was plenty leftover even after double dipping. I didn't have peanut oil so I used vegetable oil. I did not deep-fry; I did them chicken in a pan with the oil as needed and did them in batches. The sauce is delicious! I probably used only a half cup of mayo (whatever was left in my small jar) and added everything it and shook it to combine. I didn't have prepared horseradish but had the dry (powder) kind so I used two teaspoons of that; I'd probably do 1:1 ratio for the mustard and horseradish powders next time. The maple syrup was spot on. Had to skip the bacon and used processed cheese slices. I used regular waffles this time around but would use Belgian ones next time as they are larger and easier to grip (maybe make homemade cornmeal Belgian waffles? I seriously have to get a waffle-maker!). I also added lettuce and tomato to my sandwich. DELICIOUS! Served it with some cinnamon-spiced sweet potato fries from AR. Definitely going to make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-21T01:30:57.847Z",
                "reviewBody": "When I first saw this recipe I really wanted to make it. I've heard about chicken and waffles for years but never tried them. What held me back was the hi calories of the recipe so I used lower fat cal versions of the same items in this recipe and it was awesome. I used a morningstar farms chicken patti nutrigrain waffles weight watchers cheese and fat free mayo and turkey pepper bacon I add the cayenne that would have gone inthe chicken coating in the sauce. This turned out really well.. I loved it. I can only imagine how awesome it is with the higher cal ingredients.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-21T00:32:25.68Z",
                "reviewBody": "Way too much breading left over. I was reluctant to put all that cayenne pepper in for fear it would be too spicy but it was good. Top waffle cold (frozen) and bottom waffle soggy. Chicken tasted great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "misstoni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10997126/"
                }
            }
        ]
    }
]