[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/202881/homemade-chicken-cacciatore-sicilian-style/",
        "name": "Homemade Chicken Cacciatore, Sicilian-Style",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8808102.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:52:06.000Z",
        "description": "This recipe was shown to me by my Sicilian employer years ago in Lynchburg, VA. It is made from scratch with tomatoes, onions, peppers, wine, and seasonings. Do not cook chicken before adding to this recipe; it must all blend together to get this particular flavor. Leaving the skin on the chicken helps the flavors to blend together while cooking. You can remove the skin after cooking.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H55M",
        "totalTime": "P0DT2H25M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon butter",
            "1 large onion, chopped",
            "1 large green bell pepper, sliced thin",
            "1 teaspoon crushed garlic",
            "2 (14.5 ounce) cans diced tomatoes, drained and juice reserved",
            "1 cup Burgundy wine",
            "1 ½ tablespoons Italian seasoning",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "½ teaspoon garlic salt",
            "1 whole chicken, cut into pieces",
            "2 tablespoons all-purpose flour",
            "1 (16 ounce) package spaghetti"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large stockpot over medium heat. Cook the onion, bell pepper, and garlic in the melted butter until they begin to soften, about 3 minutes. Add the tomatoes, wine, Italian seasoning, salt, pepper, and garlic salt; cook and stir until the mixture just begins to boil. Reduce the heat to medium low; add the chicken and cook until the meat is tender enough to fall off the bone, about 1 1/2 hours. Remove the bones and skin from the chicken, returning the meat to the pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 3/4 cup of the reserved liquid from the tomatoes in the microwave until just warmed. Stir the flour into the tomato liquid until thick. Add to the stockpot and stir continually until the mixture begins to thicken. Remove from heat and allow to sit for about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the chicken mixture rests, bring a large pot of lightly-salted water to a boil. Stir the spaghetti into the water and return to a boil. Cook until the pasta is slightly tender but still firm to the bite, about 12 minutes. Drain. Ladle the chicken mixture over the drained spaghetti to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kim Shepheard"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.564814814814815,
            "ratingCount": 108,
            "itemReviewed": "Homemade Chicken Cacciatore, Sicilian-Style",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "874.8 calories",
            "carbohydrateContent": "68.1 g",
            "cholesterolContent": "175.3 mg",
            "fatContent": "37.5 g",
            "fiberContent": "5.1 g",
            "proteinContent": "54.1 g",
            "saturatedFatContent": "11.3 g",
            "servingSize": null,
            "sodiumContent": "932.5 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-02T23:01:05.03Z",
                "reviewBody": "If you are like me, you might sometimes take a pass on recipes with a few number of reviews, feeling that there is strength in numbers.  This is the recipe that should make you change your mind! It is an easy cacciatore recipe that saves you the work and effort of browning the chicken and you don't lose an iota of flavor.    I stayed closed to the recipe but added one red pepper as well as a package of sliced mushrooms. I am told that isn't traditional but something called hunter's stew should have mushrooms....very earthy ;-)  I added six cloves of fresh garlic and omitted the garlic salt.   I used fire roasted  diced tomatoes and they really added a depth of flavor.  Because I added veggies, I also added a 14.5oz can of fire roasted crushed tomatoes and the sauce simmered itself to a really thick state.  I didn't have to add flour. Just threw the tomatoes in with their juices from the beginning.  In fact, the leftovers will probably need another can of tomatoes to get some sauciness back.  I did as the writer said and left the skin on the chicken which was a bit problematic as the chicken cooks until is falls off the bone so I had to chase out skin bits throughout the sauce.  I used 2 breasts and a package of thighs.  Next time, I will remove the skin.  Excellent recipe... served over egg noodles.  So good that I hid the leftovers in the back of the fridge where hubby might not find them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HLyn76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2634247/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-30T16:43:36.39Z",
                "reviewBody": "Great! I changed it a bit though...I made it all in the slow cooker, which made everything SO easy. I used skinless thighs. I didnt sautee anything...just put the chicken on top of sliced onion and bell peppers in the crock pot, mixed the sauce in a separate bowl and added on top of the chicken. I added a can of tomato paste and left out the flour. Next time I'll try a little red pepper to give it a kick!  Served over mashed potatoes, which was a nice change :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "junglepilotwife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2797118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-06T20:57:18.22Z",
                "reviewBody": "Made this tonight and it was excellent! Used frozen boneless/skinless chicken breasts and just added them to the sauted garlic & onions. Added spices, then liquids.  Used 1 cup of beef stock, 1 can of chicken stock and 1 cup of wine for the liquid. Also used LOTS of fresh chopped garlic, but then again there is no such thing as 'too much garlic' in our family.  Cooked the chicken most of the way, then added 1 red bellpepper and 2 small zuchinis.  Excellent way to sneak in extra veggies. ;-) Will definitely make again.  Hubby asked me to put it on the menu to make at least  monthly. :-)  5 stars from my family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stormychick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3851259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-13T18:49:59.71Z",
                "reviewBody": "This was really great! I modified it to work in a crockpot - but hands down one of the best cacciatore's I've had in ages! Sauteed the veggies in butter and set aside. Added two chicken breasts two thighs and two legs to the crock pot added salt and pepper. Poured in the wine added the sauteed veggies and italian spices (I had garden fresh basil oregano and rosemary) then topped with one drained can of tomatoes and one undrained can and a can of tomato sauce. I added the extra can of sauce because I needed a little more liquid for the crockpot - but I reserved (like it said i the recipe) the drained juice. And used that with flour to thicken at the very end. 4 hours at high pulled the meat out and shredded off the bone added back in for another 1 hour on low. it was fabulous and I am thrilled I have so much leftover!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2683147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-28T01:18:16.777Z",
                "reviewBody": "Fanfreakintastic! I used basil, garlic, & oregano diced tomatoes and added a bit of italian dressing mix and served over linguine. I'll definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KungFuJimmyChoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3955227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-09T01:00:05.943Z",
                "reviewBody": "Excellent recipe.  Followed the directions almost exactly.  Didn't do the flour thing and it didn't need it.  Also I served it over Polenta instead of spaghetti.  Thanks for a nice recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3808074/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-07T21:16:01.063Z",
                "reviewBody": "This recipe was awesome! I threw everything in the crock pot (did not saute the onions/peppers) used boneless skinless thighs and cooked on high for 4 hours. The only 'problem' was that the 6 thighs practically disintegrated and I could barely find enough chunks of chicken for the 3 of us. I'll definitely cook it less next time but the flavor was fabulous! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "floridalinda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3215733/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-18T21:48:50.337Z",
                "reviewBody": "Very good recipe. The picture is what made me want to try it. It looked like the meat was taken off the bone after cooking - I had never taken it off the bone or used boneless. I tried it this way and will be making it this way from now on. I made some minor changes by browning my chicken first in the same pan and used colored peppers. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kd/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-08T19:52:25.61Z",
                "reviewBody": "I too made this in the slow cooker. It was ok not great. I wouldn't make this again. Thanks anyways.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RALWATTAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1281438/"
                }
            }
        ]
    }
]