[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/211830/bada-bing-bada-banged-potatoes/",
        "name": "Bada Bing Bada Banged Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F642584.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2019-04-02T06:52:25.000Z",
        "description": "These potatoes are easy to prepare and are a great crowd pleaser.  The herbs and cheese really bump up the flavor.  You can prep them ahead then finish them on the grill or oven.  The name of the dish makes people laugh--until they taste them.  Then all you'll here is ooo's and aaah's.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "5 pounds small new potatoes",
            "¾ cup olive oil",
            "¼ cup melted butter",
            "1 cup grated Parmesan cheese",
            "1 tablespoon dried basil",
            "1 tablespoon dried oregano",
            "½ teaspoon dried thyme leaves",
            "½ teaspoon dried rosemary, crumbled",
            "½ teaspoon garlic powder",
            "1 teaspoon crushed red pepper flakes",
            "1 teaspoon salt",
            "½ teaspoon black pepper",
            "3 tablespoons minced fresh parsley",
            "½ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the potatoes in a large saucepan of water.  Cover; bring to a boil over high heat. Reduce heat; gently cook potatoes until tender but still firm, about 20 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place potatoes on a greased, rimmed baking sheet. Smash the warm potatoes with the heel of your hand or a small pan to flatten slightly and break the skin.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together the olive oil, butter, 1 cup Parmesan cheese, basil, oregano, thyme, rosemary, garlic powder, red pepper flakes, salt, and pepper in a large bowl; add the potatoes and toss well.  Return coated potatoes to baking sheet, leaving 1/2 inch space between each potato.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast potatoes in the preheated oven until lightly browned and slightly crispy; about 30 minutes. Place hot potatoes on a large platter; sprinkle with parsley and the remaining 1/2 cup Parmesan cheese.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CJ McD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.616393442622951,
            "ratingCount": 305,
            "itemReviewed": "Bada Bing Bada Banged Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "207.4 calories",
            "carbohydrateContent": "20.5 g",
            "cholesterolContent": "11.4 mg",
            "fatContent": "12.3 g",
            "fiberContent": "2.7 g",
            "proteinContent": "4.7 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "231.8 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-08-04T16:01:07.29Z",
                "reviewBody": "Hi, It's CJ McD, recipe author.  Just wanted to add an additional note and that is to \"gently\" break or smash the potatoes, just to break them open, but not to smash to pieces.  I will try to be more clear with the next recipe I submit.  This was my first attempt.  *learning*",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CJ McD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1659160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-08T17:49:39.98Z",
                "reviewBody": "I've rated lots of recipes on this site, (which I am addicted to by the way!), but I have never wanted more to have the option of rating higher than a 5.  How about a 10, a 20, or perhaps a 60.  I had no idea that potatoes could be this good.  I did follow some of the reviewers advice and tossed the potatoes with the butter and oil and then sprinkled the cheese and spices on and tossed the potatoes on the  cooking tray.  Worked great.  I did also turn the potatoes half way through the cook time.  Oh my, so good.  The crunchy bits left on the cooking pan were particularyl good.  Will make this often.  Thanks so much for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KONWAL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/934854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-29T18:26:33.793Z",
                "reviewBody": "We LOVED the flavor and crispness of these potatoes!!!  Definitely a recipe that will be repeated and soon!  Although we loved the taste of these, I did significantly change the process. For starters, when I mashed my potatoes they just fell apart into clumps, so I realized immediately that there would be no \"tossing\" of these or they would have completely fallen apart.  I also didn't like the idea of combining the oil, butter, parmesan and spices.  Instead I combined the oil and butter, and I separately combined the parmesan and spices.  I drizzled half the oil mixture over the potatoes and then sprinkled with half the parmesan mixture.  I carefully turned the potatoes over and repeated the drizzling and sprinkling.  I assembled this ahead, covered and refrigerated until I popped it in the oven.  After baking for 30 minutes I sprinkled the remaining parmesan cheese on top and broiled for about a minute, then added the parsley.  The potatoes were creamy on the inside and wonderfully crispy on the outside!  YUM!  Since my \"mashing\" skills are apparently not up to par, I will skip that entirely and just cut my potatoes into chunks.  Mashed or chunked give these a try!!!  UPDATE:  I made these again cutting my potatoes into chunks which was much easier for me.  Still tasted great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bellepepper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4452392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-29T18:48:38.21Z",
                "reviewBody": "This has got to be one of my top 3 recipes from this site. I LOVED these potatoes! I did not smash mine and used ground red pepper (cayanne) versus crushed due to preference in taste. They turned out FANTASTIC! I had scaled down the recipe because only 2 of us were going to eat these and I found myself wishing I would have just made the entire batch. OMG sooo Good! This would also be great as seasoned hashbrowns for breakfast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "My4boys",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/my4boys/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-19T18:09:13.79Z",
                "reviewBody": "Absolutely Out-of-this-World Delicious! We had 10 for dinner this evening and every single person commented on how good these potatoes were! Followed the recipe with no alterations. These are so easy and extremely flavorful. Excellent. We will enjoy these again very soon. Thanks for sharing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-10T04:52:41.903Z",
                "reviewBody": "A potential problem with this recipe is it's designed for 20 servings. I only wanted it for a simple weeknight meal to serve my family of four. I tried scaling it to 4 servings but that produced wonky measurements. 5 worked though. I found that once I had smashed the potatoes they fell apart so tossing them in the cheese and spice mixture at that point was not going to work. I just spread the mixture on the potatoes while they were on the baking sheet which was fiddly - it was hard to get it to do anything other than stay in little clumps. It would make more sense to me to just smash them as indicated on the baking sheet drizzle the olive oil over (skipping the butter altogether) then sprinkle the cheese and spice mixture on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-05T20:24:03.1Z",
                "reviewBody": "Ok, first off I need to say I've made every recipe on the \"Top 20\" list...this deserves its place at the top! You can make the recipe as is, or follow the directions only adding whatever spices you want, just make sure you have enough to coat all the potatoes. I adjust the recipe according to how many potatoes I want to have, usually 1 pound. I didn't use the butter, just increased the olive oil. While my potatoes are boiling I mix up my olive oil and spices in a bowl. My favorite mix; basil, oregano, red pepper (or chili spice), tons of garlic and parmesan cheese. As another writer noted, I too, add some cheese on top at the very end and broil. When my potatoes are done parboiling (don't overcook-just enough to spear with a fork), I drain, smash slightly, and mix in a bowl with the olive oil mixture...spread on a cookie sheet, and bake. You can dress this recipe up by using white/red/purple small potatoes...BEAUTIFUL! THANKS for this recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mish56",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3382637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-26T20:06:23.323Z",
                "reviewBody": "My family loved these! Great aroma when baking and great flavor. I stuck to the recipe and had great results. I do agree with other reviewers to keep a light touch when flattening my young daughter helped and my potatoes were really smooshed. I ended up pouring on the coating over the pieces that could not be tossed and even then still had great results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "twinsr2xfun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4754173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-17T17:29:37.563Z",
                "reviewBody": "I made these potatoes last night for company. Everyone really liked them. I thought the seasoning might be too much but it works really well with the Parmesan cheese. Everything crisps up nicely in the oven. I did omit the rosemary for personal preference. My potatoes did seem to fall apart somewhat no matter how carefully I smashed them. I think next time I will quarter them and see how that works. Good simple recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "elizakf",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3488531/"
                }
            }
        ]
    }
]