[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/249/main-dish/casseroles/",
                    "name": "Casserole Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212511/slow-cooker-tamale-pie/",
        "name": "Slow Cooker Tamale Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F467823.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:52:28.000Z",
        "description": "This is a simple tamale pie recipe that tastes very similar to authentic tamales without all the work! I sometimes double this recipe and make it in a large slow cooker. This recipe is a big hit with my husband. Serve with various toppings such as sour cream, more cheese, salsa, green onions, tomatoes, etc.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT5H10M",
        "totalTime": "P0DT5H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 pound ground beef",
            "1 (15 ounce) can kidney beans, drained and rinsed",
            "1 (10 ounce) can enchilada sauce",
            "1 ½ teaspoons garlic powder",
            "1 (8.5 ounce) package corn bread/muffin mix",
            "⅓ cup milk",
            "1 egg",
            "2 tablespoons melted butter",
            "½ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the ground beef in a skillet over medium heat, and cook and stir the beef until it is browned, about 10 minutes, breaking up the meat as it cooks. Drain the beef, and place it into the slow cooker. Stir in the kidney beans, enchilada sauce, and garlic powder.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, combine the corn bread mix with milk, egg, and butter, and stir until just mixed. Stir in the Cheddar cheese. Spoon the corn bread mixture over the beef mixture in the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set the cooker to Low, cover, and cook until the corn bread topping is cooked through and set, about 5 hours.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Casserole Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Brandy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.969465648854962,
            "ratingCount": 262,
            "itemReviewed": "Slow Cooker Tamale Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "462.9 calories",
            "carbohydrateContent": "41.7 g",
            "cholesterolContent": "99.1 mg",
            "fatContent": "22 g",
            "fiberContent": "5.1 g",
            "proteinContent": "24.3 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "1056.9 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-16T22:04:20.267Z",
                "reviewBody": "This is very good. I did tweak it a little since we like things spicy. First, I doubled the recipe since I have a large oval slow cooker. I added some sauteed diced onions and bell peppers plus some chopped jalapenos (from a can) to the meat mixture. I also added jalapenos to the cornbread mixture. Also, 2/3 cups of milk for 2 packages of corn bread mix was not enough so I just kept adding until it looked like the right consistency. Finally, because the topping didn't brown in the slow cooker, I removed the crock and put it in the oven on \"broil\" for a couple of minutes. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "YellowBird",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2835816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T22:21:03.6Z",
                "reviewBody": "thanks everyone.. I also \"tweak\" this recipe. This recipe was given to me by a friend and what I do to tweak it.. I double the meat, double the enchilada sauce, add chilli powder & garlic powder and double the cheese. Sometimes I also add chopped green chili's to the meat mixture. Sure, its just as easy putting this in the oven however, I like cooking things in the slow cooker so I dont have to sit there and watch it... I can throw it in early and have it ready by dinner. Thanks for the reviews this is my first recipe submitted! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3076371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-18T19:54:40.57Z",
                "reviewBody": "I made Sals' Red Enchilada Sauce (which hubby said smelled wonderful, and I didn't think to taste before I put it in the meat mixture) for this, then did everything by the recipe. I put a towel over the crockpot under the lid, to keep moisture from dripping back down onto the top. (Thanks to Scotdog? for the tip) There was more muffin mix  than the meat mixture. Hubby and I alone ate half of it. It has a good flavor, not quite spicy enough for us and the meat mixture tasted almost sweet to me. Not sure where that came from. Another crockpot recipe that I don't see any point to. This could be made faster and easier in a 13x9 pan and wouldn't be so hard to get out. Onions and garlic added to the meat while browning would help and maybe some cumin also. Next time it goes in the oven and I double the recipe for the meat mixture and maybe the muffin mix too. Thanks Brandy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-20T18:27:39.28Z",
                "reviewBody": "As a kid I loved tamale pie BUT it had NO beans So did not use them I did use whole kernal corn. I included chilies I also added black olives.I live alone so I eat it for a couple days. It gets better I froze the left overs. I'll let you know how that comes out. I liked it and will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2953646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-01T16:09:56.597Z",
                "reviewBody": "Brandy thank you so much for this recipe. Its a great recipe to easily customize to anyones likes and dislikes. We cooked the hamburger as making taco meat added 1 can (drained) Ro Tel and a choppd green and red pepper. Servied with extra cheese and sour cream once all cooked in the slow cooker. I have both a large oval and stand up 5qt crock pot i used my stand up to make this recipe and only needed the 1 package of cornbread if using an oval crock pot i see needing the 2nd package of corn bread to make 1 layer on top. Again thank you this was great!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2857760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T22:21:03.66Z",
                "reviewBody": "This was good! My husband and I ate about 2/3 of the meal ourselves. However like the others I would double the recipe. It tasted more like chili but definitely good. Here's what I did: 1 lb. beef & 1 lb. ground turkey 1 can original Rotel 2 cans of kidney beans 1 can of enchilada sauce (I don't care for it) 2 pkg Martha White sweet yellow cornbread mix 2/3 c. milk 2 eggs 4 tbsp melted butter 1 cup shredded 2% cheddar I browned the beef and turkey with adding garlic powder black pepper and onion powder. Once browned I added the rotel with most juice drained so the meat could absorb the flavor. Did that for 10 minutes while mixed up the cornbread milk eggs and butter with the cheese. Put the meat mix in the bottom of the crockpot added the bean and sauce. Mixed up really well. Then poured cornbread mix on top. cooked for 5 hours on low. warmed up nicely the next day in the oven on 400 for about 20 min.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Becca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2919779/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T17:59:19.687Z",
                "reviewBody": "I made a few changes I added diced onion in the ground beef and used fresh garlic. I also substituted chili beans for the kidney beans. It didn't quite take the full 5 hours to cook it was GREAT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jamiecapehart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4025458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T17:33:17.807Z",
                "reviewBody": "This recipe is a keeper.  I will make this often.  I tweaked it a little.  Someone suggested adding jalapeno peppers so I cut and diced two fresh.  I also sauteed an onion and 1/2 green pepper in with the ground beef.  I didn't have enchilada sauce so I used 1 jar of mild salsa and 1 jar of peach salsa.  It gave it a slightly sweet taste.  I also added about 1/2 cup of kefir (similar to sour cream).  This recipe is so versatile and wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wendyb1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3349732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-23T19:45:50.9Z",
                "reviewBody": "I liked this recipe. I do think it needs more seasoning as it tasted kind of bland. My crockpot is pretty big so the cornbread layer was kind of thin so next time I make it I'll double the cornbread mix. Also mine only took 2 1/2 hours to cook all the way. So I threw it on warm to hold it for dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-15T00:16:02.577Z",
                "reviewBody": "Did not taste at all like a tamale more like a bland dry chili.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "newhobby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3596316/"
                }
            }
        ]
    }
]