[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/672/meat-and-poultry/pork/sausage/",
                    "name": "Sausage",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212759/kielbasa-with-brussels-sprouts-in-mustard-cream-sauce/",
        "name": "Kielbasa with Brussels Sprouts in Mustard Cream Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4557692.jpg",
            "width": 1441,
            "height": 960
        },
        "datePublished": "2019-04-02T06:52:32.000Z",
        "description": "Any German can tell you that wurst and cabbage go hand in hand. Any Spaniard will say the same of chorizo and beans. But it takes a special, international inclination to make the case for kielbasa with Brussels sprouts, white beans, and mustard. I'll tell you that it works wonderfully! The saltiness of the pork combined with the bitter, gentle crunch of the Brussels sprouts and mildness of the beans is well-balanced perfection. Plus, it's cheap, easy, and looks good on a plate!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 shallot, peeled and quartered",
            "4 large garlic cloves",
            "2 tablespoons extra-virgin olive oil",
            "kosher salt to taste",
            "1 ½ pounds Brussels sprouts, halved",
            "2 tablespoons coarse Dijon mustard",
            "1 teaspoon olive oil",
            "1 pound kielbasa sausage, cut on the bias into 1/4-inch slices",
            "1 tablespoon olive oil",
            "¼ cup heavy cream",
            "1 cup white kidney beans, drained and rinsed",
            "ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place shallot and garlic cloves over two layers of aluminum foil. Coat with 2 tablespoons of extra-virgin olive oil and season with salt. Wrap the shallot and garlic with the foil, creating a pouch. Bake in the preheated oven until the garlic is tender, about 30 minutes. Place shallot and garlic in a bowl and mash using a fork. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil. Add the Brussels sprouts, cover, and steam until just tender, 2 to 6 minutes depending on thickness. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 teaspoon olive oil in a large, deep skillet over medium-high heat. Lay the kielbasa into the hot skillet and cook, turning occasionally, until evenly browned and crispy, about 3 minutes on each side. Remove the kielbasa from the skillet with a slotted spoon to retain the grease in the skillet; drain the sausage slices on a paper towel-lined plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add 1 tablespoon of olive oil to the skillet. Cook the mashed shallot and garlic in the hot oil for 1 minute. Stir in the mustard and cream. Reduce the heat to medium-low and add the Brussels sprouts and beans. Toss to coat and season with salt and pepper. Continue cooking until heated through. Serve the kielbasa over the Brussels sprouts and beans.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Sausage"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Seattle Food Geek"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4974358974358974,
            "ratingCount": 195,
            "itemReviewed": "Kielbasa with Brussels Sprouts in Mustard Cream Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "769.4 calories",
            "carbohydrateContent": "54.8 g",
            "cholesterolContent": "95.3 mg",
            "fatContent": "48.8 g",
            "fiberContent": "14.4 g",
            "proteinContent": "32.4 g",
            "saturatedFatContent": "15.7 g",
            "servingSize": null,
            "sodiumContent": "1372.4 mg",
            "sugarContent": "7.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-30T22:08:04.813Z",
                "reviewBody": "I followed this recipe with the small substitution of half-and-half for the heavy cream and it was delicious.  It's nice to have a tasty way to cook Brussels sprouts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JJO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2182378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-24T22:43:56.253Z",
                "reviewBody": "This is now officially my favorite brussel sprouts recipe.  I love it!!  I didn't do the garlic and shallot in the oven part.  That would take too long.  I just sauteed them in olive oil in a skillet, added the sausage, steamed the sprouts, then mixed that all together with the beans and the creamy mustard sauce.  What a delicious combination!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "catycool",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2069225/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-22T02:01:46.213Z",
                "reviewBody": "I have no clue what the origin of this dish is.  It might just possibly be a classic ethnic dish as the recipe for this is everywhere!  I like kielbasa and Brussels sprouts but I wouldn’t have thought to put the two together.  I didn’t have high expectations for this – after all, it was just a humble mix of a few simple ingredients.  I even went to the market just to buy the coarse ground Dijon it called for.  Well, Hubs and I were both surprised and impressed. This was just excellent and we marveled at how much it exceeded our expectations.  I skipped the step of roasting the shallots and garlic as I couldn’t see heating up the oven for it.  Sautéing those before I added the mustard and cream obviously worked just fine, as this was one, delicious sauce!  It got a little thick, so rather than adding more cream I thinned it out with half and half, which worked well.  I’m wondering if half and half would have worked well in the first place – and then I wouldn’t have had to open a carton of cream for this. The combination of the kielbasa, the Brussels sprouts, the beans (which I almost skipped and I’m SO glad I didn’t!) and the mustard cream sauce produced a flavor, a dish, unlike anything either Hubs or I ever had before.   And we enjoyed it thoroughly.  I served this alongside parsley buttered noodles with a tossed green salad.  Maybe it was BECAUSE of the few and simple ingredients that this was so good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T20:48:05.91Z",
                "reviewBody": "I tried this last night and thought it was delicious. My husband doesn't like brussel sprouts but he ate this and liked it. What a great recipe when you want something different!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARMIK124",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/765939/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-03T17:16:41.937Z",
                "reviewBody": "I made this last night and thought it was very good. I did follow other reviewers suggestion to increase the cream to 1/2 cup and found that to be the right amount. Also I served the meal over egg noodles which I thought worked out well. The only thing I'd do differently next time is to skip the white beans. They were ok I just didn't feel like they added much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RCONNOR20",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/867478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-14T19:33:04.437Z",
                "reviewBody": "Great recipe! I follwed the recipe exactly and served it with bread freshand warm from the machine. Next time I will double the sauce so we can sop more up with the bread. As a mom of two young kids I may have an hour to spend cooking dinner but never all at once. I prepped the reciped over the course of the day (roasting garlic slicing etc) as I found time. Then right before dinner time it took me about ten minutes to throw it all together. This recipe is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shannonW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3870693/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T18:28:48.54Z",
                "reviewBody": "Everyone liked this recipe when I tried it. I made it exactly as written except I didn't measure the cream so definitely put more in than was called for. The only thing I would change is that I would maybe add even a little more sauce and I would definitely cut the brussels sprouts in half before adding to the sauce. The sauce would then seep more inside the sprouts and would give a more even flavor. I can't understand why reviewers are reviewing the recipe based on the picture not the taste. Really my dish turned out looking edible and besides that's not the point anyway! I always look at reviews before deciding to try a dish. People who give bad review based on a picture are dragging down the average score of a dish they didn't even try unfairly. I think the site should remove those reviews and ban those reviewers. This is not a photography site. In short the recipe is good and worth trying for a unique dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LaurelL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/laurell/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T23:43:12.997Z",
                "reviewBody": "I served the whole dish over Pierogies. Awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Natdiamond",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6326422/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-13T20:08:49.76Z",
                "reviewBody": "This is the second recipe I've made by SFG and I'm very impressed. This is delicious! Only change was to increase the amount of cream (used 1/2 cup) as many reviewers recommended. This would be great served over roasted potatoes. Definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-22T18:25:31.713Z",
                "reviewBody": "For me this was a solid three stars as is. For 5 stars I reconstituted dried white kidney beans rather than the canned. This cut down on some of that sticky white ick that even thoroughly rinsing doesn't remove from canned beans. Reconstituting dried beans also makes for firmer beans so the dish is not as mushy. Secondly it was just a bit on the bland side for my taste so I added about a tablespoon of red wine vinegar to the sauce and it gave it that little extra kick I was looking for. Also try this with Thai sweet and sour sausage instead of the kielbasa for a different taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JVN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1475245/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Kielbasa with Brussels Sprouts in Mustard Cream Sauce",
            "description": "A well-balanced meal using kielbasa in a fresh way.",
            "uploadDate": "2017-12-14T18:15:56.922Z",
            "duration": "PT1M34.461S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe26b8d05-2e3c-4187-a1bc-adac77182173%2F61466804-f3ce-406d-b17b-5ec9665e0845%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5680331179001"
        }
    }
]