[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22647/stuffed-artichokes/",
        "name": "Stuffed Artichokes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F425498.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2000-06-29T04:56:48.000Z",
        "description": "A delicious stuffing for a special change from ordinary boiled or steamed artichokes.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 whole artichokes",
            "3 slices Italian bread, cubed",
            "1 clove garlic, minced",
            "⅛ cup chopped fresh parsley",
            "¼ cup grated Romano cheese",
            "½ teaspoon dried oregano",
            "5 tablespoons vegetable oil, divided",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Snip the pointed tips of artichoke leaves, and cut off the stems.  Wash and drain.  Holding artichoke firmly by base, firmly rap the top of it on a hard surface; this will open it so it can be stuffed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl combine bread cubes, garlic, parsley, Romano cheese, oregano,  2 tablespoons vegetable oil, salt and pepper; mix well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Press about 1/2 cup of stuffing into each artichoke.  Tightly pack stuffed artichokes together in a large heavy saucepan or Dutch oven.  Add enough water to reach half way up artichokes and add 3 tablespoons oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring to a boil over high heat; reduce heat to low and simmer, covered, for 1 hour, or until leaves pull out easily.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Michele O'Sullivan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1923076923076925,
            "ratingCount": 104,
            "itemReviewed": "Stuffed Artichokes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "175.4 calories",
            "carbohydrateContent": "11.6 g",
            "cholesterolContent": "5.2 mg",
            "fatContent": "13.2 g",
            "fiberContent": "4.8 g",
            "proteinContent": "4 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "149.4 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-05-04T23:45:23.373Z",
                "reviewBody": "Yum! I did prepare the artichokes slightly differently. I thought the stuffing would get really soggy by the time the artichoke was fully done so I blanched the artichokes for 20 minutes over medium heat, removed and drained off excess water then cut off the stem and tops and removed the choke (the prickly center, do not remove heart). Then I mixed the remaining ingredients in a bowl and stuffed each artichoke with mixture, spreading leaves to stuff. Arranged them in pan with about 1 inch of water, covered with foil and baked for 30 minutes at 450 degrees then uncovered and baked 10 minutes more. Serve with a slice of lemon and sprinkled with more cheese and parsley. I would definitely suggest using olive oil or even butter in the recipe not just plain vegetable oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-22T13:43:25.873Z",
                "reviewBody": "This is my dad's specialty, with a few changes! --->First, to make the stuffing use half Italian seasoned bread crumbs and half parmesan cheese with a little salt, pepper and one clove of garlic per choke.  Then, MOST important, DO NOT, I repeat, do not use vegetable oil!  You will make my poor Italian Nana spin in her grave!  Use extra virgin olive oil (look for it to say cold press on the label). Drizzle the oil over the top of the stuffed chokes and steam until done.  *~*How to eat the choke: Scrape the meat and stuffing off the leaves with your teeth until you get to the thin papery leaves.  At that point you take a knife and cut at an angle around the edge of the paper white leaves.  Take you fork and remove all the white feathery part and what you have left is the heart of the artichoke.  Cut that into bite size pieces and enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BaysChick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-31T19:28:07.53Z",
                "reviewBody": "There are many variations to this recipe and this is a good one. Be \"generous\" when stuffing separating the leaves with your fingers. Stuff the center as well as between the leaves. This takes patience. When simmering the artichokes may sure the globes all fit snuggly together in the saucepan. The key is to prevent them from toppling over so that you do not have a soggy mess. You want to steam them so that the bread crumbs and cheeses meld together (SEE MY PHOTO). Make sure you used the grated Romano cheese and not the kind in the green can. The latter will \"clump up\" and not melt. TY for the recipe!! BTW I used Italian seasonings instead and dipped the leaves in olive oil upon partaking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LucyDelRey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1349933/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-04T20:05:22.063Z",
                "reviewBody": "I haven't seen any mention of the thick stems that are on the artichokes. I look for the longest stems and I peel away the outer skin and then chop them up and mix them in the bread crumb and cheese mixture. What a treat! They get just as tender.Also I apply chopped garlic as well.Been making them for years.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOLLYM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1111650/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-16T19:11:47.75Z",
                "reviewBody": "These were soooo good although I must delegate at least 2 of these stars to the other reviewers. I followed another users advice and boiled the artichokes for about 20 minutes so that I could scraped out the prickleys and the hairs. For the stuffing I substituded the italian bread crumbs for the cubed bread much easier. Extra virgin olive oil trumps vegetable oil. Also I added chopped pine nuts and basil. Then I stuffed and baked them in pan with about an 1 1/2 of water. Everyone LOVED them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOHANNAJOY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/682488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-10T18:05:46.687Z",
                "reviewBody": "this recipe is excellent. It is how my great grandparents used to make them with just a couple alterations to make it easier for the cook and just as delisious. First instead of using cubes of bread use Italian style bread crumbs so then the seasonings of parsley and oregano are already in the bread crumbs so you don't have to add them. Second slice the garlic very thin instead of mincing. The slices if sliced thin enough melt into the artichoke as it steams. Third use olive oil instead of vegetable oil and just drizzle slowly over the stuffed artichoke after stuffing. Fourth use a mixture of parmesean and romano cheese to sprinkle over the top after the olive oil drizzle. This makes a wonderful kind of crust over the entire artichoke that is excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "francinesmail",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2105703/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-17T14:14:50.497Z",
                "reviewBody": "This recipie is just like my grandma makes. The only thing I did differently was add a bit of chopped up salami in the stuffing (like grandma). I also used half chicken broth and half water with lots of garlic cloves to simmer them in. We use the juice to pour on them after. Thanks for helping me come close to home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bear Claws",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1700306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-05T12:37:16.673Z",
                "reviewBody": "This is an excellent recipe for stuffed artichokes (\"i carciofi ripieni\") - a classic Italian dish whose proper preparation can at times be frustrating. An artichoke is the bud of a member of the thistle family. Tn the USA global artichokes cultivated in California are those most frequently available. The really successful end result of a cooked stuffed artichoke should provide leaves that are coated with almost homogeneously melted or amalgamated stuffing. However all too often the end result may be disappointing. Although the heart of an artichoke is almost always delicious the quality/ tenderness of the leaves may be otherwise. The ultimate success of any artichoke recipe (stuffed or non-stuffed)is absolutely dependent on the quality of the artichoke itself. Globe artichokes from California are available year round. However I limit my guarded purchases to the peak season - from March through May. I seek fist-sized (no larger) artichokes that are deep green - not brown are heavy for their size and have a tight leaf formation. The globe should squeak when the leaves are pressed together. Lack of satisfaction with your preparation of stuffed artichokes does not mean that you cannot enjoy artichokes - there are non-stuffed artichoke recipes that are simpler to prepare. Remember to include the trimmed stems in the recipe. When cooked they will be as delicious as the artichoke heart itself - the cynosure of all artichoke lovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "William Chas.Caccamise Sr, MD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/617576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-03T02:03:45.357Z",
                "reviewBody": "Excellent!! Excellent!! Excellent!! I was looking for a recipe similar to the one my mom makes and this was the closest I came. Only thing I changed was I used 1 & 1/2 cups of seasoned bread crumbs and 2 cloves of garlic and I just added the oil a little at a time until I got the right \"stuffing\" consistency. I never knew how unbelievably easy these are too make! The whole family devoured these!! Including my 6 year old!!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GIGI9801",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1153821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T22:29:07.14Z",
                "reviewBody": "This is my second time trying a \"stuffed artichoke\" recipe and neither has turned out very good - so I think I'll stick to steaming them in the future. =( I've been making artichokes for years and never knew you could rap them on a hard surface to get them to open up (so thanks for this wonderful tip!!) I followed the recipe exactly and while the 'stuffing' was tasty my artichokes (which started out nicely wedged in the pot) seemed to shrink as they cooked ultimately tipping over in the water and making a soggy mess of my stuffing. I also cooked them for an hour and they were tough... Guess I did something wrong - but they certainly didn't turn out like I expected. =(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Somertyme08",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3260630/"
                }
            }
        ]
    }
]