[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213269/easy-spicy-thai-slow-cooker-chicken/",
        "name": "Easy Spicy Thai Slow Cooker Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F727506.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:52:49.000Z",
        "description": "This is an inexpensive, time-saving recipe for anyone who loves spicy Thai but can't always afford to get carry-out.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT4H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (16 ounce) bottle Asian-style toasted sesame salad dressing (such as Kraft® Asian Toasted Sesame Dressing & Marinade)",
            "1 tablespoon Thai chili paste, or more to taste",
            "1 tablespoon ginger garlic paste",
            "2 tablespoons peanut butter",
            "6 pieces skinless, boneless chicken (such as breast halves and thighs)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together the sesame salad dressing, Thai chili paste, ginger garlic paste, and peanut butter in a bowl until the mixture is well combined. Dip chicken pieces in the mixture, and place into a slow cooker. Pour the remaining sauce over the chicken. Set the cooker to Low, and cook 4 to 6 hours, until the chicken is very tender.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "jescookin"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.230769230769231,
            "ratingCount": 52,
            "itemReviewed": "Easy Spicy Thai Slow Cooker Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "564.1 calories",
            "carbohydrateContent": "10.7 g",
            "cholesterolContent": "48.5 mg",
            "fatContent": "51.1 g",
            "fiberContent": "0.3 g",
            "proteinContent": "17.5 g",
            "saturatedFatContent": "8.6 g",
            "servingSize": null,
            "sodiumContent": "1171.3 mg",
            "sugarContent": "6.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-02-09T22:23:41.677Z",
                "reviewBody": "This had a really nice flavour, I followed recipe exactly, I was a little apprehensive of the heat of the thai chilli paste, I licked a little off the spoon, before I threw it in the sink, it was really Hot!  But I went ahead and made. I had to use Kikkoman Brand Toasted Sesame Marinade, 345 ml size, as the kraft one mentioned is not available in Ontario, but I think this was comparable. I made the ginger/garlic paste as supplied, I couldn't find it in the store, I used boneless breast and bone-in skinless thighs (for more flavour). I left this on low while I went to work (I made the sauce the nite before and food processed it and stuck it in the frig), great smell when I got home. I took chicken out of pot and took out bones and roughly sliced and set aside. Turned up crock pot to high with lid on (10 to 15 min.), then I mixed  about 2 tablespoons of cornstarch and water, and stirred this into sauce in the pot, it thickened up nicely. I used some Thai stick pasta (very thin pasta, that you just soak for 10 minutes in boiling water, drain and its ready) I  mixed everything, including some green beans cooked to still crisp and  mushrooms ) (Get those veggies into meals) This was excellent heated back up the next day, and the next day....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mik",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2404887/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-03T17:04:02.88Z",
                "reviewBody": "This is really good. I made it last night for dinner but wanted to cut calories so used 1/2 bottle of light Kraft Asian dressing. It turned out great with complex flavor that was not overpowered by the Chili sauce. Despite using 1/2 the dressing we still had 2 cups of liquid in the slow cooker when it was finished that made a great dipping sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Larry161",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3312620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-08-18T19:06:22.67Z",
                "reviewBody": "I didn't like the flavours. They didn't seem to marry well. Not a recipe I will try again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "prittykitty74",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2064809/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-05T15:45:57.317Z",
                "reviewBody": "Husband says 3 I say 4. I halved the recipe but left the chile paste ginger garlic paste and peanut butter the same. I really couldn't taste any of those seasonings distinctly which was fine. I think this would benefit from the addition of a sweetener (like honey or orange marmalade) and red pepper flakes (or whole dried red peppers like restaurants use). My husband wasn't wowed by the flavor and I wasn't really exactly impressed either. But this was ready to eat at 5:30 but I had to turn it to \"warm\" and leave it for several more hours due to a family emergency. That this recipe survived being overcooked by 2-3 hours and still gets a 4 says good things for it. Give it a shot if you like these flavors. Served this chopped up over brown rice as written makes PLENTY of sauce. Thanks for the recipe! (Photo coming soon.) P.S.--I too tested this recipe using the LIGHT version of this dressing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JARRIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jarrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-25T19:17:49.56Z",
                "reviewBody": "The first thing out of my husbands mouth was \"YUMMY\" so I know it was a hit. Fixed it exactly as written(found the garlic ginger paste at Woodmans). I did take the juice put it in a saucepan add cornstarch and cooked it until thick. Poured that over the chicken that I served over rice. It was delicious and the recipe will go into my Favorites folder! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cabinluvn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cabinluvn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-14T20:44:40.637Z",
                "reviewBody": "I made this dish this week for my son and my Thai exchange student. I wanted to cook something that would meet our American taste as well as satisfy his Thai cravings. I followed the recipe exactly. It was promptly named \"nasty chicken\" by my exchange student and my son and has been the joke of our house for a week. It did get eaten with generous amounts of BBQ sauce. I'm giving it 2 stars because if you are not looking for a \"Thai\" dish it is palatable for most American tastes. It was easy to make as the title says. However if you are looking for a \"Thai\" meal this does NOT do the trick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacy McVay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/stacyc/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-16T21:59:48.81Z",
                "reviewBody": "This was absolutely delicious! I used 6 whole breasts of chicken and still had a lot of sauce left over. I also added extra chili paste (it wasn't nearly spicy enough for us) and served it over asian noodles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "cpauze",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3662751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-17T21:44:57.313Z",
                "reviewBody": "This was tasty and oh so easy! I only used half the bottle of salad dressing and doubled the chile paste. I found ginger garlic paste in my grocery's Indian section (Laxmi Brand). I used skinless chicken thighs and marinated them overnight in the fridge in the sauce. Cooked on low for 6 hours--1 hour before serving I deboned the chicken and put it back in the sauce on low. It pretty much thickened up on its own. Served with seasoned sushi rice and an Asian veg medley. Not authentic but good nonetheless. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "margaux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2459403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-19T17:58:37.407Z",
                "reviewBody": "Good and easy. I love thai peanut chicken and my family loves it. I think I would rather have it cooked in a wok w/ bell peppers and to make my sauece from scratch but for a quickiet this recipe was okay. I did add cilantro green onions additional minced garlic red pepper flakes soy sauce and cornstarch to thicken the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kac2research",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2432861/"
                }
            }
        ]
    }
]