[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1785/soups-stews-and-chili/stews/irish-stew/",
                    "name": "Irish Stew Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213340/beer-braised-irish-stew-and-colcannon/",
        "name": "Beer Braised Irish Stew and Colcannon",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F807159.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-02T06:52:51.000Z",
        "description": "This is a recipe I shared with my girlfriends from my recipe club last year! It is a yummy alternative to corned beef for St. Pat's Day and a wonderful anytime dish!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "1 (3 pound) beef chuck roast, trimmed of fat and cut into 1/2-inch cubes",
            "2 tablespoons all-purpose flour",
            "1 cup coarsely chopped onion",
            "1 cup coarsely chopped carrot",
            "1 (12 fluid ounce) can or bottle dark beer",
            "2 bay leaves",
            "1 teaspoon dried thyme",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "2 cloves garlic, minced",
            "2 tablespoons Worcestershire sauce",
            "3 slices bacon",
            "2 pounds russet potatoes, peeled and cut into chunks",
            "2 cups thinly sliced cabbage",
            "¼ cup milk, warmed",
            "2 tablespoons butter",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "2 tablespoons minced fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a large Dutch oven over medium-high heat until very hot, and brown the meat in 2 batches, stirring to brown the cubes on all sides. Return all the meat to the Dutch oven, sprinkle with flour, and stir lightly to coat the meat with flour. Stir in onion, carrots, dark beer, bay leaves, thyme, 1 teaspoon salt, 1/2 teaspoon pepper, garlic, and Worcestershire sauce. Bring the mixture to a boil, and cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the Dutch oven into the preheated oven, and cook for 45 minutes; uncover, stir the stew, and cook until the beef is very tender and the liquid is reduced by half, about 45 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble the bacon and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "About 30 minutes before the stew is ready, make the colcannon: Place the potatoes into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cabbage into a microwave-safe bowl, and add 1 or 2 tablespoons of water. Cover and microwave on High for about 2 1/2 minutes; uncover (watch out for steam) and stir the cabbage. Cover and microwave for about 2 1/2 more minutes, until the cabbage is slightly tender but not mushy. Drain excess liquid, and set the cabbage aside, covered.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the potatoes into a large bowl, and add milk, butter, 1/2 teaspoon of salt, and 1/4 teaspoon of pepper. Beat the potatoes with an electric mixer until smooth and creamy. Stir in the cabbage, crumbled bacon, and parsley until well combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, place a scoop of colcannon onto a plate, make a hollow, and fill with braised beef stew.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Irish Stew Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Maureen Kelly-Nikolaisen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.711111111111111,
            "ratingCount": 315,
            "itemReviewed": "Beer Braised Irish Stew and Colcannon",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "452.8 calories",
            "carbohydrateContent": "30.2 g",
            "cholesterolContent": "89.4 mg",
            "fatContent": "24.4 g",
            "fiberContent": "3 g",
            "proteinContent": "25.3 g",
            "saturatedFatContent": "9.9 g",
            "servingSize": null,
            "sodiumContent": "650.9 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-19T18:01:07.167Z",
                "reviewBody": "Excellent! I made this recipe as written, except I doubled it and sauteed the cabbage for the Colcannon in my bacon pan instead of microwaving. The stew will thicken and reduce, so be careful with the salt - I added half before putting in the oven and then (very lightly) salted to taste when it was done. The Colcannon is perfect! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-25T21:27:44.953Z",
                "reviewBody": "This was a fantastic recipe! I made the stew with a can of Guinness beer. After browning the meat in a skillet, I threw everything in the crockpot and cooked on low for 7 hours. The meat was very tender. The colcannon was delicious. I made the entire dish ahead of time and microwaved it when we were ready to eat. The stew and colcannon combination is really good together. The adults loved it and my kids ate it without complaints!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "momoffive",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3558762/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-22T18:01:39.873Z",
                "reviewBody": "I never rate a recipe as I rely on the women to tell if its good or not. But this stew has to be spoken up about. It is purely a mans stew. Strong and robust I made this on a hunting trip with my buds they just loved it. It realy is great",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "baxter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1781239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-13T19:56:04.28Z",
                "reviewBody": "Holy moly, this recipe is amazing. I only had 2lb of meat on hand, but treated the recipe as the original 8 servings for the remaining ingredients. This is so delicious. I used 4 cloves of garlic because I love it, and since I had ground thyme instead of dried leaves, used 1/2 tsp. When browning the meat, I salted and peppered the meat to impart flavor throughout the cooking process, but still added the salt and pepper called for later in the recipe. For the colcannon, I used about 3 times the milk called for. These changes are all minor, and I would trust this recipe over and over! It's wonderful! Can't wait to eat it again, and I'm still finishing my plate. :) **Update: Don't use Guinness! I used Guinness the 2nd time I made this and the bitterness was overwhelming for my 2lbs of meat and really ruined the dish for me. Using a less bitter beer is the way to go.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2884745/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T21:15:01.067Z",
                "reviewBody": "This is perfect! I wanted some good old fashioned comfort food due to the cold weather today and got to thinking about my Grams irish stew ofcourse i dont have her recipe so i came here.Glad i did!She served hers over colcannon also and this was what i wanted and this recipe is perfect as is!I felt like i was back in Grams kitchen eating dinner!Love it! and my kids both loved it as well!No leftovers! The only thing i did differantly was i cooked it in the crock pot & throw in peas becuase she always had peas in hers :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tarasb70/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T20:21:24.803Z",
                "reviewBody": "This was excellent! I didn't have any dark beer so I just used regular beer but added a bit of molasses. I also only had a pound of stewing beef so decided to try something completely different - I added about a pound of boneless skinless chicken thighs cut into cubes. Used red cabbage instead of green because that's what I had in the fridge. Gave the potatoes a unique colour. Overall the flavour of the whole meal was superb - especially the potato cabbage bacon combination. And like others I did not cook the cabbage in the microwave - I sauteed it a bit in the bacon pan. Definitely a keeper! (My mouth is watering just thinking of this dinner - we had it last night and I could eat it again tonight but alas no leftovers!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DANAAMCMILLAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/695516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-22T17:49:11.257Z",
                "reviewBody": "Excellent! As someone who is not a fan of corned beef I was looking for another main dish I could serve. This was it! I did brown the meat and coat it in flour as the recipe directs but then I put all ingredients in the slow cooker for 7 or 8 hrs on low. Perfect! Also didn't want to hear it from my critics about \"ruining\" their mashed potatoes with cabbage so I pureed the cooked cabbage and then blended it into the potatoes. It did have a very light green tint but I made no replys to the comments and no one was the wiser!:) I also held out the bacon pieces and let those who like bacon add it at the table. If everyone likes bacon I would definately not leave this out as it gave the colcannon a finishing touch. This is definately a keeper! Thank you for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JenNV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3672754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-12T01:26:18.77Z",
                "reviewBody": "I made this last night for supper and my five year old(who never likes anything I cook)not only finished everything on her plate but asked if I would make it again tonight!!!I made the recipe exactly as written. Everyone loved this dish. Thanks for fantastic recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "syphira",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1246069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-08T00:17:01.43Z",
                "reviewBody": "Word to the wise. Do not use Guinness Stout. My guinness loving husband and I found it so bitter as to be inedible. I have strained off the broth and I am trying to rescue it with beef broth and seasonings. This seems unfair to rate since it appears the beer is at fault. i have had several friends who made it and they loved it, but they did not use a bitter stout. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            }
        ]
    }
]