[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
                    "name": "Frozen Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22728/hot-fudge-ice-cream-bar-dessert/",
        "name": "Hot Fudge Ice Cream Bar Dessert",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F329947.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2000-09-11T22:13:00.000Z",
        "description": "This is an incredibly easy rich and satisfying ice cream dessert made with ice cream sandwiches and fudge sauce.  This keeps in the freezer very well and can be eaten straight from the freezer.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H2M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "1 9x13 inch dish",
        "recipeIngredient": [
            "1 (16 ounce) can chocolate syrup",
            "¾ cup peanut butter",
            "19 ice cream sandwiches",
            "1 (12 ounce) container frozen whipped topping, thawed",
            "1 cup salted peanuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour the chocolate syrup into a medium microwave-safe bowl and microwave until hot, about 2 minutes on high, stopping every 30 seconds. Do not allow to boil. Stir peanut butter into hot chocolate until smooth. Allow to cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line the bottom of a 9x13-inch dish with a layer of ice cream sandwiches. Spread half the whipped topping over the sandwiches. Spoon half the chocolate mixture over that. Top with half the peanuts. Repeat layers. Freeze until firm, at least 1 hour. Cut into squares to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frozen Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JONAR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.755344418052257,
            "ratingCount": 842,
            "itemReviewed": "Hot Fudge Ice Cream Bar Dessert",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "575.3 calories",
            "carbohydrateContent": "70.7 g",
            "cholesterolContent": "31.3 mg",
            "fatContent": "28.1 g",
            "fiberContent": "3.8 g",
            "proteinContent": "11.9 g",
            "saturatedFatContent": "12.5 g",
            "servingSize": null,
            "sodiumContent": "257.4 mg",
            "sugarContent": "47.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:31:38.23Z",
                "reviewBody": "I made a mistake and purchased hot fudge sauce rather than regular chocolate syrup. Though I don't know how it would have turned out using the syrup, the hot fudge sauce was a happy mistake. Very rich and smooth textured. I thinned the mixture a bit with some chocolate syrup because it was quite stiff after mixing with the peanut butter but it still wasn't easy to spread. I think the earlier reviewer's suggestion of putting the chocolate/peanut butter layer onto the ice cream sandwiches first, then the whipped topping would have made my assembly MUCH easier if I'd thought of it! Everyone loved this and it was so simple to make. The possibilities of other combinations of sauce and \"sprinkly things\" are endless and I am sure I'll make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T22:38:18.793Z",
                "reviewBody": "Quick,easy and Yummy! It looks and tastes like you slaved over this dessert. My ice cream sandwiches must have been the perfect size, because I used 19, just as the recipe called for. I used (Dove) milk chocolate topping and crunchy peanut butter. As suggested by another reviewer, I put the syrup/peanut butter mixture on the ice cream sandwiches first,(plus I drizzled some caramel topping onto that) and then spread the cool whip, it was easier to spread, and no one would be the wiser, because when sliced, it had nice layers. I probably added about 1/2 of a jar of the caramel (for both layers) and will more than likely add more (all) next time. I used chopped pecans in place of the peanuts and dusted the top with cocoa. I wanted to add toffee pieces in place of the nuts, but my stores didn't have them. I will try that though when I find them again. I passed this out to all the neighbors..thumbs up from everyone!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RONAMAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/658770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-13T21:45:32.583Z",
                "reviewBody": "Yummy!  The fudge/peanut butter part was very good!  Used peanut butter cups like others suggested b/c the kids don't like nuts.  I halved this recipe and it took 11 ice cream sandwiches per 8x8 inch pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "C_WHITES_",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/796439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:31:38.64Z",
                "reviewBody": "UNBELIEVABLE! This was so easy and very good. Thank you so much for this. Everyone that has tasted it has thought is it great. I think the secret is the peanut butter in the chocolate sauce. Yum! My only problem was finding a 9X13 dish that was deep enough to hold all the layers. Super recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THETIFF4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/864500/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T00:31:38.09Z",
                "reviewBody": "This was AWESOME! Quick and easy to make!! I used No Frills No Name Ice Cream bars and they were the perfect size. Used NO Frills No Name chocolate syrup. Took previous advice and layered chocolate sauce first then the whipped topping! Big hit at party! Definately make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZABETH61",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T07:45:35.403Z",
                "reviewBody": "This is a great and easy dessert.  I combined caramel and hot fudge together instead of chocolate syrup and peanut butter.  It was great for a summertime dessert.  Our guests and my whole family loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANCALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/534920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T19:22:55.093Z",
                "reviewBody": "I made this for company and served it to 8 kids...they all LOVED it!!! (which is an absolute miracle because my kids are extremely picky)  I have already been asked for the recipe twice!!  The only thing I will do different next time is put the chocolate sauce on first and then the Cool Whip, as I found that it made a big mushy mess on top when I tried it the other way.  5 stars for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori Guilderson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/372015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-11T12:59:13.35Z",
                "reviewBody": "This recipe has already become a favorite at our house.  It is a wonderful dessert if you are working with little chefs as there is no real heat involved.  I don't make any changes, other than maybe to increase the number of ice cream bar used.  It may just be the brand I use is smaller.  Really, the dessert is much more impressive than it should be since it is so simple, but even the pickiest of critics give it rave reviews at our house.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-03T19:28:54.52Z",
                "reviewBody": "I switched out the choc. syrup for hot fudge. I mixed the hot fudge with the peanut butter without needing to heat anything. That way I didn't have to wait for any cooling before assembling the dessert. My pan had enough room for 24 ice cream sandwiches. DEFINITELY spread the chocolate mixture on before the Cool Whip. I added some caramel on top of the Cool Whip which made for a nice presentation. Since this was being served to a party with kids, I feared they wouldn't eat it with nuts. So, I used 8 crumbled Reese's cups in place of the peanuts. Next time I'll use more Reese's cups because everyone wanted a piece of the dessert with lots of the cups on it. When beginning the second layer, make sure you push down on the ice cream sandwiches to eliminate any air pockets in the dessert and to give yourself more room in the pan. I used a 9x13 cake pan, which is deeper than my 9x13 Pyrex dish, and the dessert filled it to the top. This is a super easy recipe. It's easy enough for beginning cooks and kids to make. The options for different tastes are plentiful. Well done!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kym's Kitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1705118/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-30T02:51:47.440Z",
                "reviewBody": "I made this cake as written last year and felt is was okay but nothing special, thus a 3 star rating.  I decided to try it again this summer after reading dozens of ice cream cake recipes - and incorporated some of the other recipes into this basic idea.  The new and improved version is a 4.5.   I made a home made chocolate peanut butter fudge sauce, used lots of chopped up salted dry roasted nuts (sprinkling them generously over the chocolate fudge layer) and made sure to use a deep pan to accommodate the layers adequately.  I also put a thin layer of the chocolate fudge sauce on the bottom of the pan before starting the first layer of ice cream sandwiches.  These changes improved the cake immensely in my opinion.  It feeds a lot of people - a 13x9 pan can definitely feed 15+.  You can definitely make this a week or more ahead of time, just cover very tightly in the freezer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "elsa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3072550/"
                }
            }
        ]
    }
]