[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22729/spinach-lasagna-iii/",
        "name": "Spinach Lasagna III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F964074.jpg",
            "width": 1268,
            "height": 1272
        },
        "datePublished": "2000-06-13T10:21:15.000Z",
        "description": "Fresh spinach and plenty of ricotta, Romano and mozzarella make this a cheesy and hearty dish. This lasagna can also be made without the spinach.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "20 lasagna noodles",
            "2 tablespoons olive oil",
            "1 cup chopped fresh mushrooms",
            "1 cup chopped onion",
            "1 tablespoon minced garlic",
            "2 cups fresh spinach",
            "3 cups ricotta cheese",
            "⅔ cup grated Romano cheese",
            "1 teaspoon salt",
            "1 teaspoon dried oregano",
            "1 teaspoon dried basil leaves",
            "½ teaspoon ground black pepper",
            "1 egg",
            "3 cups shredded mozzarella cheese",
            "3 cups tomato pasta sauce",
            "1 cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add lasagna noodles and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a skillet over medium-high heat, cook mushrooms, onions, and garlic in olive oil until onions are tender. Drain excess liquid and cool. Boil spinach for 5 minutes. Drain, then squeeze out excess liquid. Chop spinach.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine ricotta cheese, Romano cheese, spinach, salt, oregano, basil, pepper, and egg in a bowl. Add cooled mushroom mixture. Beat with an electric mixer on low speed for 1 minute. Lay 5 lasagna noodles in bottom of a 9x13 inch baking dish. Spread one third of the cheese/spinach mixture over noodles. Sprinkle 1 cup mozzarella cheese and 1/3 cup Parmesan cheese on top. Spread 1 cup pasta sauce over cheese. Repeat layering 2 times.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover dish with aluminum foil and bake in a preheated oven for 1 hour. Cool 15 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Robbie Rice"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.673611111111111,
            "ratingCount": 720,
            "itemReviewed": "Spinach Lasagna III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "360 calories",
            "carbohydrateContent": "41.2 g",
            "cholesterolContent": "47.6 mg",
            "fatContent": "13.5 g",
            "fiberContent": "3.5 g",
            "proteinContent": "19 g",
            "saturatedFatContent": "6.2 g",
            "servingSize": null,
            "sodiumContent": "875.4 mg",
            "sugarContent": "8.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-08-04T10:06:00.59Z",
                "reviewBody": "Fantastic! Our new favorite lasagna recipe.  A few changes: I chopped the raw spinach and sauteed it with the onions, mushrooms, and garlic until onions were tender-crisp.  I was skeptical about using a whole onion, but it really provided extra flavor and texture. Also, I omitted the parmesan (which appears in the directions but not in the ingredient list) and just sprinkled extra romano on the last layer.  I wasn't sure where I was supposed to end up with the layering process, so after the romano, I topped it off with a layer of noodles, my last bit of sauce, and a good sprinkling of mozzarella cheese. For the sake of evennness throughout, next time I will alter the layering portions to 2c filling (three inside layers), 3/4c cheese (three inside layers plus top), and just over 3/4c sauce (three inside layers plus top). Thanks Robbie for the recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAHWILKERSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1152919/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-17T20:25:39.797Z",
                "reviewBody": "This is an excellent recipe if you make adjustments to the amount of the ingredients. To me, you cannot call this recipe Spinach Lasagna if you use only 2 cups of fresh spinach. I believe I ended up using at least 10 cups. I had a 1 lb. tub of baby spinach and used almost all of it.  I also increased the mushrooms to 4 cups.  For the ricotta I bought a pound and a half from the deli.  I did not boil the spinach. I sauted it with the onions, mushrooms and garlic. This saves a step and a pot.          I have no idea how you use up 20 lasagna noodles in a 9 x 13 pan. I always use nine noodle and make 3 layers. For this recipe I layered a little differently than the direction.. I just mixed the ricotta cheese, Roman Cheese, egg and spices. I did not add the mushroom mixture. I layered as follows: Sauce at bottom of pan, layer of noodles, spread half of the ricotta mixture, sprinkled 1 cup of mozzarella, spread half of the spinach mixture, spread 1 cup of sauce and sprinkled 1/3 cup parmesan. I repeated this layering one more time.  Then I placed the top layer of noodles, I put the remaining mozzarella and parmesan on top of the noodles and then topped it with the remaining sauce. I found it took longer than 1 hour to cook.         This recipe turned out great. I am not so sure I would have liked it as well with the amount of spinach and mushrooms called for. This received excellent reviews from everyone who tried. it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARY DOMAZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/278426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T20:58:03.39Z",
                "reviewBody": "I made this for a dinner party, and it was a hit!  I did make a few changes, though.  I substituted 1 14-oz can chopped artichoke hearts (non-marinated) for the mushrooms.  Also, I did not pre-cook the noodles, but instead just ran them under hot water before layering them and added about 1/3 cup water to the cheese mixture.  They turned out perfectly.  I was also very generous with the tomato sauce.  I will probably add more spinach next time.  There were no kids at the party, so I'm not sure about the kid-friendly rating...but my husband, who hates all vegetables, ate two helpings!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/611006/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-07T13:51:28.36Z",
                "reviewBody": "I love spinach lasagna, and this one went over quite well. I did add quite a bit more spinach than just 2 cups fresh - that will hardly give you anything once it's cooked. I also tried a new technique and bought baby spinach in a package and didn't cook it. I layered the noodles, cheese mix and spaghetti sauce with the fresh spinach, packing in quite a bit of the fresh stuff. It turned out pretty well! And it saved a step (and a pan). Also used no-boil noodles for the first time, and was surprised to find that they actually do work pretty well (and save another step and pan). I have made lasagna based on this a few times since (not bothering to follow the recipe exactly - just from memory). I've also used frozen spinach and it works well. Thanks for a yummy recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELS MARTINEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-11T09:19:04.06Z",
                "reviewBody": "Can't say enough about this recipe. (I finally registered on this site after years so that I could rate this one!) The Ricotta/Mushroom/Spinach filling was the key. (TIP: This filling is Fantastic used to stuff/ bake with Salmon.) And like others I am sure I used a load more spinach.  Don't worry about people not liking the spinach, because my husband the Carnivore was fighting with his picky brother for the leftovers!  By the way, this freezes well! I froze it uncooked and baked from frozen at temp stated. My only changes: didn't have the romano and added a tad bit of FRESH grated nutmeg to the spinach.  And make sure you use a good (not overpowering) sauce.  Thanks Robbie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chucky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1721594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-10T22:31:54.56Z",
                "reviewBody": "This was delicious. I followed another reviewer's tips and sauteed artichokes with the onions and garlic and also added extra tomato sauce with each layer to keep it moist. I also doubled the boiled spinach and even added fresh spinach to each layer and it was so good. I used 5 pieces of lasagna for each of the three layers. I also removed the foil 5-7 minutes before the end of the hour to let the cheese bubble up and crust a little. Everyone LOVED it and the leftovers were ridiculously good. Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1862987/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-17T22:23:26.707Z",
                "reviewBody": "UPDATE: During Lent 2011, I made this recipe for my boyfriend's Catholic family for dinner on a Friday, and while they were making fun of me for my \"hippie lasagna\" they liked it. I went to grab leftovers out of the fridge for lunch the next day, and they had already been consumed by people who made fun of me and my hippie lasagna. ORIGINAL REVIEW: This was amazing! My roommate is a vegetarian, so we decided to try this one night.  I wasn't keen on the idea because I'd tried many terrible meatless lasagnas in the past. But, one bite and I was hooked.  You barely even notice that it's lacking a meat flavor.  I did make some changes...I used light cheese and had to use cooked frozen spinach because fresh was banned at the time. We used Prego sauce. I also forgot to add the egg. We had a lot of filling left, probably because we like thin layers.  I'd recommend this recipe...even to people who love meaty lasagna!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sweetiekins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1997420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-19T01:23:47.48Z",
                "reviewBody": "My picky-eater girlfriend won't touch mushrooms, so I substituted brocolli.  To spare a few steps and dirty dishes, I sauteed the brocolli with the onions, then added the spinach to cook.  Then, after allowing some time to cool, I stirred the cheeses, egg, and herbs right into the veggies in the pan.  No electric mixer needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "corsi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1545159/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-01T18:56:06.963Z",
                "reviewBody": "After many concerns and no answers on other reviews here are my own answers after finishing the recipe: YES you can make ahead, I stored mine uncooked in the fridge overnight and cooked it next day for dinner, just don’t cook the noodles; buy pre-cooked and add a little bit more sauce. YES you can use cottage cheese, just drain it for a while and press it so most of the water comes off the taste is very similar to ricotta and cheaper. YES you can add a layer of meat, just cook it with a little minced garlic and olive oil. NO the spinach is not enough, add 1 more cup. And finally YES you can cook the spinach with the mushroom/onion mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.Humphreed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mreed/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-14T01:53:03.480Z",
                "reviewBody": "how do you fit five lasagna noodles in the bottome of a 9x13 pan.  This recipe has more noodles than anything else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Maureen Fipke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/maureen/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spinach Lasagna III",
            "description": "This hearty meatless lasagna offers plenty of cheese and fresh spinach.",
            "uploadDate": "2013-03-04T17:57:27.891Z",
            "duration": "PT4M27.434S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fbfa32d99-813d-4200-93aa-99f491cee22f%2F58d6d983-5133-4d18-8447-25abf1ee8904%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2203071691001"
        }
    }
]