[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15455/main-dish/meatballs/",
                    "name": "Meatball Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213742/meatball-nirvana/",
        "name": "Meatball Nirvana",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F397070.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2008-04-28T10:37:20.000Z",
        "description": "These meatballs are a compilation of many, many meatball recipes to finally achieve what I was looking for... Meatball Nirvana! Cover with your favorite red sauce and serve with pasta or in crusty garlic bread rolls.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "12 meatballs",
        "recipeIngredient": [
            "1 pound extra lean ground beef",
            "½ teaspoon sea salt",
            "1 small onion, diced",
            "½ teaspoon garlic salt",
            "1 ½ teaspoons Italian seasoning",
            "¾ teaspoon dried oregano",
            "¾ teaspoon crushed red pepper flakes",
            "1 dash hot pepper sauce (such as Frank's RedHot®), or to taste",
            "1 ½ tablespoons Worcestershire sauce",
            "⅓ cup skim milk",
            "¼ cup grated Parmesan cheese",
            "½ cup seasoned bread crumbs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the beef into a mixing bowl, and season with salt, onion, garlic salt, Italian seasoning, oregano, red pepper flakes, hot pepper sauce, and Worcestershire sauce; mix well. Add the milk, Parmesan cheese, and bread crumbs. Mix until evenly blended, then form into 1 1/2-inch meatballs, and place onto a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until no longer pink in the center, 20 to 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Meatball Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "lovestohost"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6298119964189794,
            "ratingCount": 4468,
            "itemReviewed": "Meatball Nirvana",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "343.1 calories",
            "carbohydrateContent": "15.3 g",
            "cholesterolContent": "94.8 mg",
            "fatContent": "16.8 g",
            "fiberContent": "1.5 g",
            "proteinContent": "31 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "939.9 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-04-06T14:08:41.86Z",
                "reviewBody": "If you want to try bringing this to an even better state of Nirvana: Use only 1/2 lb of beef and add 1/2 pound of ground pork. Also replace skim milk with 1/2 a cup of ricotta cheese. I think you'll find you'll have some moister more flavorful meatballs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ItalianTapas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4158327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-05T21:27:07.4Z",
                "reviewBody": "I've been using LTH's recipe for some time now and its my staple. I have subbed an egg for the milk without any problems. Also, I never have seasoned bread crumbs so I just up the Italian seasoning (can't tell you by how much cause I don't measure this recipe anymore). If I'm just making this for myself, I add some additional sriacha for more heat (or if I don't have the Frank's at home) I bake these on a slightly greased cookie sheet and flip halfway. These freeze great cooked or raw. Oh and I've used 80/20, 90/10, and 95/5 beef with these and they've all turned out great. Thanks for the recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChicagoCookie84-Anita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chicagocookie84/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-05T21:22:09.48Z",
                "reviewBody": "Thank you , everyone, for the glowing reviews!  We at the LTH house LOVE these meatballs!  I almost always at least triple the recipe when I make it so I can freeze a few bags of meatballs.  I bake and then freeze the baked meatballs.  I'm kinda lazy (ok, a lot lazy) and never feel like taking the time to place the cooked meatballs on a cookie sheet, freeze them, then bag them. I'm lucky if I let them cool before I toss them in a freezer bag and chuck 'em in the freezer.  I freeze them in freezer bags without sauce.  It makes for crazy easy meals when no one planned ahead/feels like cooking! These do have a nice bite, so adjust the crushed red and hot pepper sauce (Red Hot at our house) to YOUR tastes.  I also rarely ever feel like dicing an onion (I'm lazy, remember?) so I usually sub dried minced.  I also tend to forget that my aversion to black pepper is generally abnormal, so, if you're not a freak like me, you may choose to add some black pepper, too!  Come as you are and enjoy Meatball Nirvana!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T22:35:34.01Z",
                "reviewBody": "Hubs wanted meatballs as part of our \"SuperBowl Smorgasbord.\"  I have my own way of making meatballs, but since I was using these on their own rather than with spaghetti, I kind of wanted to try something completely different, and in terms of how I make my Italian meatballs, these are different. Italian seasoning, oregano, garlic salt, hot pepper sauce and Worcerstershire sauce are all different additions for me and, other than omitting the red pepper and hot sauce in consideration of Hubs' sensitive innards, I resisted the strong urge to make these more compliant with what I was familiar with.  I popped half of one in my mouth and \"Mmmm!\" ran through my mind. They have a nice balance of flavors that will only get better once the flavors develop even further in my homemade tomato sauce, I thought.  I had Hubs taste the other half and the first word out of his meatball stuffed mouth was, \"Yum!\" (Trust me, he NEVER says \"yum\")  I've got more cooking to do to complete our smorgasbord (Go Pack!!!) but these meatballs are going to be one, fine contribution.  Way to go (again!) LovestoHost!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-13T15:25:28.91Z",
                "reviewBody": "This recipe gets 5 stars for balance of ingredients and flavor... but gets 3 stars for instructions.  The ingredients balance well, and the meatballs have a great taste.  There are a few things I experimented with to improve this recipe.  First, I reduced the salt, and used garlic powder (not garlic salt).  I also did not dice the onion, I grated the onion on a small grater, and grated it over the bowl, so the onion juices blended into the meatballs, and you're not left with large bits of onion.  One of the biggest steps is to combine all the ingredients EXCEPT the beef, and allow this mixture to sit for 5 minute before including the beef.  This way, the bread crumbs absorb the moisture of the milk and the flavors blend.  Once you're ready to mix the beef in, use only your fingertips, and blend gently being careful not to over-blend.  Taking this step, you create a more moist, light and delicate meatball.  The instructions as written in this recipe will likely cause the meatball to get dry, dense, and hard.  Again, delicious balance of flavors, but the method of mixing the meatballs is not the best.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Roberts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1378803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-17T15:19:03.067Z",
                "reviewBody": "Excellent meatball recipe. This is good in homemade BBQ sauce or a good marinara and also in meatball sandwiches. Dosen't matter how you use it, it always turns out fantastic. This also works well with ground turkey or chicken and even adding a little italian sausage is good, too. I do like to use my own homemade italian seasoning and homemade seasoned bread crumbs (brush day old bread with garlic butter, bake until crispy, then run through the food processor until finely ground) in this recipe I also do what LTH does and double it because either my boys eat them all up or I'll make one batch and freeze the other. If you have any leftovers, it's even better the next day. GOOD STUFF.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-19T16:27:45.267Z",
                "reviewBody": "Great recipe for meatballs!  I used minced garlic instead of garlic salt, 1/4 tsp. of red pepper flakes (was adding hot sausage to the sauce as well and didn't want things too spicy), and used an egg in place of the skim milk.  This was a nice change from my usual meatball recipe - thanks LTH!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T22:13:12.26Z",
                "reviewBody": "LOVE! I've never been 100% satisfied with any meatball recipe until now. The kick from the crushed red pepper and hot sauce really make these something special. I served them on hoagie rolls with sauce and cheese. Delicious. I might even go so far as to say that they deserve a fist pump.... ;) Thanks LTH!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinBug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinbug/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-29T23:24:01.85Z",
                "reviewBody": "My kids was served this with Nana's Pasta sauce by EAKE, and my son said it was better then Subway's meatball sub. WOW, is what I thought. 3 of my kids had 2 hot dog size meatball subs a piece. And I tried the meatballs myself and thought it was delicious by slightly on the salty side, I think I would omit the salt the next time I make these(for my prefences) It had such a wonderful aroma of flavors. I really enjoyed it. However, my kids said it was slightly spice on some crunchy pieces but I guess that means the red pepper flakes. But all agreed it was loved. I think possibly use cayenne powder in the place of the red pepper flakes just for them. But I saw no problems with the red pepper flakes....but I have to apease to the children. I will so keep this recipe in my box, because not only was it good, it's the 1st meatball I've ever made that was cooked all the way through and moist, not hard or stiff. Thanks lovetohost.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Meatball Nirvana",
            "description": "See how to make top-rated meatballs.",
            "uploadDate": "2012-10-17T02:28:52.177Z",
            "duration": "PT2M38.367S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5cd0cabb-ea9a-4301-aca4-e0b8e769dc79%2F50b14e4f-f184-4eae-b281-ea3cf593dbac%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1905224217001"
        }
    }
]