[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1984/meat-and-poultry/chicken/chicken-breasts/asian-style/",
                    "name": "Asian-Style",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214010/chicken-shawarmas/",
        "name": "Chicken Shawarmas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1153587.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T06:53:10.000Z",
        "description": "These taste exactly like the ones we used to get at the shawarma stand when I was stationed at Kuwaiti Naval Base, just outside Kuwait City.  Give 'em a try, you won't be sorry!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 shawarmas",
        "recipeIngredient": [
            "1 clove garlic, minced",
            "½ cup mayonnaise",
            "2 tablespoons unsalted butter",
            "2 large skinless, boneless chicken breast halves - cut into bite-size pieces",
            "1 ½ teaspoons garam masala",
            "4 pita bread rounds",
            "4 dill pickle spears"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together the garlic and mayonnaise in a small bowl; set aside. Heat the butter in a skillet over medium-high heat. Cook and stir the chicken in the hot butter until white on the outside. Sprinkle with garam masala, and continue cooking until lightly browned on the outside and no longer pink in the center, about 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the pita rounds with the garlic mayonnaise. Divide the chicken among the pitas, and place a pickle spear into each. Fold and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Asian-Style"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Luke Summers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.439024390243903,
            "ratingCount": 41,
            "itemReviewed": "Chicken Shawarmas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "515.7 calories",
            "carbohydrateContent": "29.7 g",
            "cholesterolContent": "91.6 mg",
            "fatContent": "29.8 g",
            "fiberContent": "1.5 g",
            "proteinContent": "31.2 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "590.6 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-05-19T22:03:06.227Z",
                "reviewBody": "I wanted to give these a better rating, but I felt the chicken was a bit bland.  I also don't like mayonnaise, but prefer a plain yogurt style tzaziki sauce - easy to make with plain yogurt, grated cucumber, garlic & lemon juice.  I made these the second time with the changes and marinated my chicken strips for a couple hours in a bit of olive oil, lemon, fresh garlic, oregano and the garam masala.  We grilled these on the grill and heated the pita on there too.  Added the sauce and they were delicious.  I've never had them with a pickle, but my son thought that was a super idea.  Great summer dish and I added a side of Tabouleh salad as a cool salad sticking to the Middle Eastern theme.  Thanks for submitting - one could do alot with this dish to make it the way they like it.  Thanks for serving!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LemonLush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bellesaz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-18T20:29:36.697Z",
                "reviewBody": "Oh YUM...We LOVED these!!! I have never had/cooked with garam masala, so I wasn't sure what to expect, but it was wonderful! I also seasoned the chicken with salt pepper and garlic powder (along w/ the garam masala) for extra flavor. I opted to use flatbreads because I felt it would hold up better, and I wasn't disappointed. I only had sliced pickles on hand, so I went with it. Oh, and the garlic mayo just put this over the top!  I really couldn't believe how these simple ingredients ended up being such a delicous sandwich...hubby was even impressed! I will definately be making these again, for sure! Thanks for sharing. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-13T22:04:23.217Z",
                "reviewBody": "I did not follow the recipe directions on preparing these. Instead of placing the pita bread flat then piling the ingredients on top folding and serving I placed my Toufayan Pita rounds between two damp paper towels and placed in the microwave for less than a minute. Removed from the microwave laid the rounds flat and cut in half making two halves. I then took my fingers and lifted the cut edges up to form the pita pockets no tears in the pita bread and no mess when enjoying the ingredients inside the pocket. I used McCormicks Gourmet Collection Master Blends Garam Masala and Mt. Olive Deli Style Kosher Dill Relish made with sea salt. Mrs. J another Buzz Recipe Group participant suggested the minced garlic be combined with honey to alleviate the skunky taste\" of the garlic and I followed her suggestion which was spot on. We enjoyed the Chicken Shawarmas and will be making again. Thank you for sharing your easy quick and tasty recipe Luke Summers. Recipe Group Selection on June 7 2014.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JimmyandNancy Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/shearone/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-24T18:52:01.443Z",
                "reviewBody": "I don't have garam masala so I used a combination of cumin coriander ground black peppercorns cinnamon cloves ginger and garlic...and I was supposed to use cardamom too but I didn't have any. I also used a little salt and a pinch of nutmeg. I just used as much as I thought I needed of everything but you can look up a recipe for garam masala online too. Anyway besides that I sliced up some cucumber since I don't have pickles (yes really). I'm sure I will make this again some time! We had it for dinner but it would be great for lunch too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ichigo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3080321/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-14T03:20:03.293Z",
                "reviewBody": "Ohmygoodness! These are delicious. My husband and I were looking for something comparable to our favorite Mediterranean restaurant and I think we found it. The ingredients are so simple that I was honestly surprised at how great it turned out. I am kind of wishing that I had doubled the recipe now so that we could have more leftovers for tomorrow but I will just have to make this again soon. I was leery about the pickles but I really think that this would taste kind of plain if they weren't in it. So good! With as much as we liked this we will probably be making this every week and that is not like me at all. Thank you for this fabulous recipe Luke!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2022938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-13T02:52:23.197Z",
                "reviewBody": "RECIPE GROUP: Yum yum yum. DBF actually said out loud \"it's like a party in my mouth!\" He doesn't really talk like that so obviously this was a huge win. It was super easy too once I got past the garam masala (had sticker shock at the grocery store so decided to make my own using 'Easy Garam Masala' from this site). Somehow managed to run out of fresh garlic so had to use powder:( but that won't happen again! Helped that my pickles were homemade and super garlicky. Loved the ease of preparation and fabulous flavor can't wait to make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ONIOND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1013798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-28T22:05:40.893Z",
                "reviewBody": "I tried this TWICE! The first time, I had to agree with some of the reviews, the chicken is a little bland on the inside. BUT having said that, I think I cut my chicken pieces a little too big the first time. When I did it again, I learned from my mistakes and (1) cut the pieces up SMALLER and (2) marinated the chicken in salt, pepper, oregano, oil and garam masala for a couple of hours. It was delicious! I don't know why there were left overs but when I tasted the chicken shawarma the next day, it tasted even BETTER than the night I cooked it! Since I ran out of pita, I added the chicken to greens and had a CHICKEN SHAWARMA SALAD! :-p",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RU hungry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10471773/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-15T10:56:54.987Z",
                "reviewBody": "This was tasty but not exactly what I know of chicken shwarmas. The chicken was pretty close and I liked the added pickles. The garlic is also a must. However the ones I have tried had the garlic but it was a slightly different garlic sauce. I also think they had tahini in them too. Also from what I remember there was also some vegetables lettuce onions or something. This sandwich though was easy to make. I even used the recipe Easy Garam Masala from AR and made what I needed for the recipe. ty",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-11T23:21:09.257Z",
                "reviewBody": "It was wonderful. I put lettuce in the pita instead of pickles. I also use Creole seasoning instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COACHINGVOLLEYBALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1163527/"
                }
            }
        ]
    }
]