[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17264/soups-stews-and-chili/chili/white-chili/",
                    "name": "White Chili Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22846/michelles-blonde-chicken-chili/",
        "name": "Michelle's Blonde Chicken Chili",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F783691.jpg",
            "width": 2288,
            "height": 1712
        },
        "datePublished": "2000-10-06T16:01:59.000Z",
        "description": "People who have tasted this thick mix of beans, spices and chicken say: 'So good it'll make you perky and stupid!' I've placed in my workplace's annual Halloween chili cook-off for the last three years.  Looks strange -- tastes great! Serve with shredded Monterey Jack cheese and warm flour tortillas.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "10 cups",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "3 pounds skinless, boneless chicken breast meat - cubed",
            "1 cup chopped onion",
            "2 cups chicken broth",
            "2 (4 ounce) cans chopped green chile peppers",
            "5 (14.5 ounce) cans great Northern beans, undrained",
            "1 tablespoon garlic powder",
            "1 tablespoon ground cumin",
            "1 tablespoon dried oregano",
            "2 teaspoons chopped fresh cilantro",
            "1 teaspoon crushed red pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium-high heat, place the vegetable oil and chicken. Cook the chicken, stirring occasionally, until all pieces are evenly brown. Stir in the onions. Cook until translucent. Drain mixture and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium heat, bring the chicken broth and green chile peppers to a boil. Stir in  3 cans great northern beans, garlic powder, cumin, oregano, cilantro and crushed red pepper. Stir in the chicken and onion mixture, and reduce heat. Simmer 30 minutes or longer, adding additional beans from the remaining cans for a thicker consistency as desired.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "White Chili Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MELLOWMARSHMOMMA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.525951557093426,
            "ratingCount": 289,
            "itemReviewed": "Michelle's Blonde Chicken Chili",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "411.9 calories",
            "carbohydrateContent": "46.6 g",
            "cholesterolContent": "79.1 mg",
            "fatContent": "4.1 g",
            "fiberContent": "10.9 g",
            "proteinContent": "47.2 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "361.6 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-30T15:13:09.437Z",
                "reviewBody": "I hate the reviews that state:  this was a great/awful recipe, but I didn't follow any of the directions or use any of the right ingredients.   \n\nThat said, I love this recipe.  However, I use about 4-5 cloves garlic in place of the powder, double the chilies and add celery.  I also saute the garlic, onion, celery, and chilies, add the broth and boil the chicken in the broth.  (Because of this, I usually add a few cups more broth.)  When the chicken is cooked, I shred it and put it back in the broth and add the beans.  I also mash up some of the beans for a thicker soup.  \n\nI've made this the night before, refrigerated and heated in a slow cooker the next morning.  It's very yummy.  This is excellent for left overs also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thadiusspade",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/603044/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-28T18:31:55.05Z",
                "reviewBody": "I submitted this recipe years ago, looked it up on a whim and WOW!  I can't believe so many people have tried this recipe.  Just a few notes on how I have changed it over the years:  \n\nNow I use a combination of navy beans, pinto beans, and great northern beans.  \n\nI use a lot more broth than 2 cups, I periodically add broth to cover the ingredients as I add them.  \n\nIf I have time, I boil the chicken breast whole and then shred it by hand, it really adds good texture.\n\nI no longer use the bean juice.  Instead I take a can of beans, drain, rinse and food process or mash by hand and it makes the broth thicker.   \n\nI'm so glad so many people have enjoyed this chili.  Chili can be a comfort food and healthy at the same time.  Enjoy!\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Colene Marshall",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3003551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T14:09:59.67Z",
                "reviewBody": "Excellent Recipe. I replaced one can of green chili's with a can of jalepenos instead, and it added even more spunk to this recipe. I added garlic as well.. because I love it! This was great, and it sat in my crock pot for 6 hourss on low and maintained perfectly all day. Great as a leftover too. One recommendation *** drain the beans so the slimy consistency is gone, replace liquid by using the remainder of the chicken broth(I used a whole can of fat free chicken broth), then use your blender or a fork to mash the last 2 cans before adding them in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINDY LINEBERRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/301835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-19T16:25:09.483Z",
                "reviewBody": "This was a really good chicken chili. My family loved it!  I always read reviews and make a few changes based on what I read.  Here is what I did:  I made this in the crock pot so I used whole chicken breasts.  They were easy to shred at the end which gave the chicken the texture I wanted.  I also added more garlic, cumin and oregano.  I find that any dish with beans often needs more spice when it cookes so long.  I added a can of Rotel Tomatos (spiced up chopped tomatoes) to it as well.  Before adding the beans, I drained them and rinsed them.  I always drain and rinse canned beans before using them.  I served this with white rice (my husband and son like chili on rice) and grated cheddar cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Snowlvr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2113993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-07T14:42:49.237Z",
                "reviewBody": "\nThis is a great recipe.I do mine with a few changes,instead of browning the chicken,I start with a quart of chicken broth and cook the chicken breasts in it until opaque.Then I remove the breasts and shred the meat,continue boiling the broth until reduced by half.Everything else is the same.A nice garnish is sour cream and seeded and minced fresh jalapeno chilies",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Smokin'Chris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-16T15:59:18.023Z",
                "reviewBody": "I've been searching for a chicken chili recipe. I've tried others that bored me to tears because they were so bland. This one is wonderful! I did poach then shred the chicken. I used one can of diced chili peppers and one can of Rotel tomatoes with green chili peppers because this was what I had on hand and because another member did the same and said it worked. Great recipe! Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Zebroski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/129427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-07T15:46:35.313Z",
                "reviewBody": "This is a favorite receipe at our house especially on Christmas Eve.  I cook it in a crock pot add 8 oz of sourcream and 3lb. of Monterey Jack cheese just before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2643665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-06T01:50:05.67Z",
                "reviewBody": "This was very delicious. I followed other reviews suggestions to poach the chicken breast and shred them rather than cubing them. Definitely worth the extra effort..YUM..love shredded chicken. This receipe has a very generous amount of chicken in it and could make do with less. In fact I didn't put all I had in. The seasonings were just a touch to heavy for my taste and probably would use a little less next time...cumin is a very potent flavor. I substituted dried cilantro as I didn't have fresh and was surprised to find it tasted pretty good. Fresh cilantro would be better though. I would add something to give it a little heat next time as we like spicy foods.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kayster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T20:00:20.18Z",
                "reviewBody": "I was excited to make this because of all the stellar reviews and because I've never had chicken chili and it sounded pretty healthy. This is a TON of chicken and a TON of beans. I wish I had cut recipe in half. I did poach and shred the chicken (which took a while - 3 pounds of chicken!!) and then mashed the last 2 cans of beans. Also added more broth. This stuff might be the most unappetizing looking recipe I've ever made. The little pink wormy things from the great northern beans don't help.:-( And this was very bland to me. This is edible but won't make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "TAURUSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/696173/"
                }
            }
        ]
    }
]