[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214088/real-chiles-rellenos/",
        "name": "Real Chiles Rellenos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5238375.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2019-04-02T06:53:14.000Z",
        "description": "Just like your favorite Mexican restaurant!  This unique, flavorful sauce and light, crispy batter will make it worth the little effort and time to prepare this cheesy classic at home.  The steps are easy, and you can find Mexican oregano and comino in the Mexican spice section of any grocery store.  Stuff and freeze the peppers in advance to save time!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "4 stuffed peppers",
        "recipeIngredient": [
            "4 large poblano peppers",
            "½ cup shredded mozzarella cheese",
            "½ cup shredded Monterey Jack cheese",
            "½ cup shredded Cheddar cheese",
            "¼ cup all-purpose flour for dredging",
            "1 (14.5 ounce) can Mexican-style stewed tomatoes",
            "1 tablespoon vegetable oil",
            "½ onion, chopped",
            "1 clove garlic, minced",
            "1 ½ cups chicken broth",
            "2 tablespoons distilled white vinegar",
            "1 teaspoon dried Mexican oregano, crushed",
            "½ teaspoon ground cumin",
            "½ teaspoon black pepper",
            "½ teaspoon hot pepper sauce (such as Cholula®)",
            "⅛ teaspoon ground cinnamon",
            "⅓ cup all-purpose flour",
            "½ teaspoon salt",
            "5 egg whites at room temperature",
            "1 egg yolk, beaten",
            "¼ cup all-purpose flour for dredging",
            "1 cup oil for frying, or as needed",
            "sour cream for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil, and place the peppers onto the prepared baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook under the preheated broiler until the skin of the peppers has blackened and blistered, 8 to 10 minutes per side. When the peppers are about 80 percent blackened, place them a plastic bag, seal, and allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard. Cut a slit lengthwise into the side of each pepper, and remove seeds and veins. To reduce spiciness, rinse out any remaining seeds with water. Pat the peppers dry with paper towels.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together the shredded mozzarella, Monterey Jack, and Cheddar cheese in a bowl until thoroughly blended. Divide the cheese into 4 portions, and squeeze each portion lightly in your hands to make a cone shape. Insert a cone into the slit in each pepper, and pin the openings closed with toothpicks. Dredge each pepper in flour, dust off the excess, and place on a small baking sheet lined with parchment paper or waxed paper. Place the peppers in the freezer for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make sauce, blend the stewed tomatoes in a blender until pureed, and set aside. Heat 1 tablespoon of vegetable oil in a saucepan over medium heat, and cook and stir the onion until translucent, about 5 minutes. Add the garlic, cook and stir for about 30 seconds, and pour in the pureed tomatoes, chicken broth, vinegar, oregano, cumin, black pepper, hot pepper sauce, and cinnamon. Reduce to medium-low, and simmer the sauce until reduced by half and thickened, about 20 minutes, stirring often.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 200 degrees F (95 degrees C), and warm a platter in the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make batter and finish the chiles rellenos, mix 1/3 cup flour with salt in a bowl. In a separate bowl, beat the egg whites with an electric mixer until the whites form stiff peaks. Lightly mix the egg yolk and flour-salt mixture into the egg whites to make a fluffy batter. Remove peppers from freezer and coat them in flour again; shake off excess flour, and dip each pepper into the egg batter, using a spoon to gently but completely coat each pepper with batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat frying oil in a heavy cast iron skillet over medium-high heat until the oil shimmers. Gently lay the coated peppers into the hot oil, and fry on both sides until the batter is golden brown and the cheese filling is hot, about 5 minutes per side. Remove peppers to warmed platter while you finish frying. To serve, ladle a generous spoonful of sauce onto plate, and place pepper on sauce. Serve peppers hot with a dollop of sour cream.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "*Fat~Dog~Lane*"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.715736040609137,
            "ratingCount": 197,
            "itemReviewed": "Real Chiles Rellenos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "423.7 calories",
            "carbohydrateContent": "34.3 g",
            "cholesterolContent": "91.1 mg",
            "fatContent": "23.1 g",
            "fiberContent": "4.9 g",
            "proteinContent": "21.3 g",
            "saturatedFatContent": "9.3 g",
            "servingSize": null,
            "sodiumContent": "1239.5 mg",
            "sugarContent": "6.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-09-24T03:48:43.603Z",
                "reviewBody": "Oh, it is me again, Ellie May! I LOVE this recipe, it is a pain to do it all right but SO worth it!\nIf you are going to do 4 chiles, go ahead and do 8-12, depending on size; eggwhites in the original recipe will allow for this. I make this 2-5 times a year, but mostly when Hatch, NM chiles are in harvest. We roast 20-40 lbs. of green chiles on our grill then freeze them, setting aside BIG fleshy/straight ones for this recipe so we can cook these all year. Best tip: cheese/flour them on all sides and freeze individually on cookie sheets. Once they are frozen, dump in a freezer bag so you can finish anytime in the winter when fresh isn't available. Cover again w/flour right before dipping in eggwhite then frying. I cook them slightly frozen so the cheese won't melt in the frying pan!\nI usually cook the sauce and only put in the food processor AFTER cooking it all together, so it will be smooth. And I save THAT too, in a freezerbag! When defrosting sauce, I may add fresh lime juice, or other spices to spark it up. MOST IMPORTANT, make sure egg whites are ROOM TEMP before whipping, and oil in frying pan is so hot in an iron skillet, that it is SCARY! Stay on top of it and turn with tongs; drain oil off on paper towels. Serve with sour cream and/or avocados for those that cannot take the heat, plus some hot sauce from MEXICO to keep authentic for those who want more! Nothing is better with this than a slice of lime, and a Negro Modelo Beer in a frosty glass. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ellie may",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3578288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-04T19:52:19.49Z",
                "reviewBody": "I use the side of a spoon to scrape/remove the charred skin from the chilis & it works great without tearing the soft chili!  Be sure your oil is hot when you start to batter the chilis so you can lay them directly into the pan.  The batter is kinda delicate, treat it gently  :o)  You can also remove the 1 egg yolk completely & just use the egg whites...I like it either way.  Have fun!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Fat~Dog~Lane*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2697863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-09T15:39:17.39Z",
                "reviewBody": "This is an excellent recipe:  very clearly written with step by step directions  that won't let you fail.  And the final dish???  Superb and very authentic.  It's not a super difficult recipe, but will take some time and probably suited for at least the intermediate cook.  But definetly try this one.  Make your sauce while the chiles sit for a bit in the freezer.  I usually tweek recipes that I read, and the only thing I did differently here was to use long cubes of mexican melting cheese (queso quesadilla) instead of the shredded mix, because that is what I had in the frig.  But really, I wouldn't change a thing.  This recipe is PERFECT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janlyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3959758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-15T22:19:06.057Z",
                "reviewBody": "Great recipe! Don't pass this up because of the length of the ingredient list (you will have most of them in your cupboard) or the length of instructions. They are just very detailed so the recipe is fool proof. Not that it isn't time consuming; I will be taking the advice to make the peppers ahead of time and freezing them to cut down on prep time the day of. Worth the effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "laurmoore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5007233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T23:09:15.467Z",
                "reviewBody": "The sauce for this recipe is outstanding!  I love the warmth that the touch of cinnamon brings to it.  I made the recipe exactly as written and it was awesome.  the only thing I would change next time would be to switch up the filling - but that's just personal preference.  it does take a bit of time, but this recipe is a great one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Graham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1012265/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-18T22:41:03.807Z",
                "reviewBody": "THIS RECIPE IS FABULOUS! I have made it at least seven times and it comes out perfectly. The red sauce is so tasty I always double the recipe on the sauce so I can use it in other recipes during the week! I also have added some ricotta to the cheese/stuffing mixture to help hold it all together. I have also found success in using a deep bowl to batter the chilis before fryiing dipping the chili all the way in and using a spoon to drege the batter up the chili. Try this recipe you won't be disappointed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6750604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-03T18:55:43.533Z",
                "reviewBody": "I recently made this dish for a cooking contest and WON!!  We served the Rellenos with Black bean Salsa over Fried Cornbread!!  The sauce is to die for!!  I substituted cornmeal for flour in all applications for a little crunch...it worked great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7789852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-28T20:29:03.617Z",
                "reviewBody": "My husband would order Chiles Rellenos every time we went to any Mexican resturaunt. After tasting \"mine\"... this recipe...we no longer have to go OUT for his favorite dish. I will stage peppers frozen so they can be cooked at any notice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-28T20:11:52.29Z",
                "reviewBody": "There is truly no way to describe how delicious this is! The only thing I did differently was I blackened the peppers on the flame of the gas stove. Everything else was followed. I love this recipe. You can add pepper jack cheese to give it a little kick. I have played around with different types of cheeses. I don't it gets better than this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cook and a half",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookandahalf/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-23T00:55:18.220Z",
                "reviewBody": "I was so excited to make these after reading all the reviews.  I kept trying to tell myself that all the mess and effort would pay off, but in the end, I was disappointed.  The sauce was delicious on its own, and I plan to keep that part of the recipe for other things, but the finished relleno was missing something, and didn't really have the flavor of a restaurant chile relleno.  A lot of effort that I don't plan to expend again...next time, will just go out for these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "eksthompson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6321729/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Real Chiles Rellenos",
            "description": "Crisp, light and full of cheesy homemade goodness.",
            "uploadDate": "2017-09-06T20:53:32.836Z",
            "duration": "PT1M59S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F9ecac271-e005-4919-afd3-b8c31a4d3165%2Fd876437a-2cac-4d1a-9680-65beae2b6e81%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5566842153001"
        }
    }
]