[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16371/side-dish/potatoes/potatoes-au-gratin/",
                    "name": "Potatoes Au Gratin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214162/spinach-caramelized-onion-and-muenster-au-gratin-potatoes/",
        "name": "Spinach, Caramelized Onion, and Muenster Au Gratin Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6033115.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2019-04-02T06:53:16.000Z",
        "description": "A creamy cheesy au gratin potato dish with added spinach and caramelized onion goodness.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "8 red potatoes, cubed",
            "5 ounces fresh spinach leaves",
            "¼ cup butter",
            "1 onion, sliced",
            "1 teaspoon minced garlic",
            "3 tablespoons all-purpose flour",
            "½ teaspoon salt",
            "1 cup milk",
            "1 cup heavy cream",
            "2 cups shredded Muenster cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C). Combine the potatoes and spinach in a 9x13-inch baking dish; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 3 tablespoons of butter in a saucepan over medium-low heat. Stir in the onion, and cook until dark brown, about 15 minutes. Stir in the garlic and cook until fragrant, about 1 minute. Add butter and when melted, add flour. Cook and stir until golden, 2 to 3 minutes. Season with salt, and stir in the milk and cream. Bring to a simmer over medium heat; cook and stir until the sauce has thickened, about 10 minutes. Stir in 3/4 of the Muenster cheese until melted, and pour over the potatoes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover the potatoes with aluminum foil, and bake in the preheated oven 30 minutes. Uncover, and cook 20 minutes more, then sprinkle with the remaining Muenster cheese, return to the oven, and bake until the potatoes are tender and the cheese is bubbly, about 10 minutes more.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato",
            "Potatoes Au Gratin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mrs.Williams"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.669014084507042,
            "ratingCount": 142,
            "itemReviewed": "Spinach, Caramelized Onion, and Muenster Au Gratin Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "426.5 calories",
            "carbohydrateContent": "17.2 g",
            "cholesterolContent": "114.1 mg",
            "fatContent": "34.7 g",
            "fiberContent": "1.8 g",
            "proteinContent": "13.3 g",
            "saturatedFatContent": "21.8 g",
            "servingSize": null,
            "sodiumContent": "538.9 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-29T01:32:32.087Z",
                "reviewBody": "Decadent - a major contributor to tonight's dinner of grilled pork chops and \"Bacon Wrapped Asparagus \" recipe also from this site. I used unpeeled small Yukon Gold potatoes and just a hint of grated fresh nutmeg. The cream sauce spinach and nutmeg was a match made in heaven. I made no other changes in ingredients and none in terms of measurements or in the cooking method. That makes this easy - it's perfect just as is. The spinach was a creative addition and the Muenster lent just enough but not too much flavor. Exquisite.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-25T21:38:09.36Z",
                "reviewBody": "These potatoes are outstanding! I followed the recipe as written, and couldn't be more pleased, even the cook times are spot on! The sauce was perfect in 10 minutes, and the bake time is perfect also. I was a bit skeptical when I poured the sauce over the potatoes and spinach because I didn't think it was enough, but I was so wrong, this recipe is perfect as written. Next time I'm going to use Swiss cheese and add some crumbled bacon, now that sounds wonderful as well! I agree with Christina, I believe many types of cheeses could be used in this with great results. Thanks for the recipe :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cat Lady Cyndi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/catladycyndi/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T22:56:19.82Z",
                "reviewBody": "Hubby said to give this one 6 stars...It was that good! My mom insisted she had a block of muenster cheese but of course she didn't lol so I ended up using Butter Kase but I could totally see using pretty much ANY cheese and this turning out fantastic! Instead of using 1 cup milk and 1 cup heavy cream I just used 2 cups of milk and that worked out perfectly. These were truely delicious and I will be making them again and again! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-14T20:22:33.86Z",
                "reviewBody": "Delicious! My new favorite au gratin recipe. I added a little extra salt just for personal preference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa r",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2594744/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T18:19:49.783Z",
                "reviewBody": "This recipe is delicious and I ve made it several times with modifications in the last few months. Because of the high fat content as written I use olive oil instead of butter and 2% milk instead of heavy cream. And since all I ve had on hand were russet potatoes that s what I ve used. I also leave out the salt as the cheese has plenty and my husband has high blood pressure. As for the cheese I can say that I have made it with many types and mixes and that the Muenster is definitely the best! This is now our favorite potato recipe and although I m sure it would taste much richer as written the basic recipe idea is excellent and still a treat with all the cheese!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AnnieM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1090417/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-26T00:03:02.207Z",
                "reviewBody": "Abolutely Divine! I had no cream so used 1 3/4c milk 1/4c sour cream. Also after baking 30 min covered & 20 uncovered I put back in 300 degree oven covered for about 30 min only because my guys hadn't made it home yet. Then popped back in just to melt the final cheese. These were so fabulous with grilled steaks & roasted asparagus! Everyon went back for seconds! Thanks for a great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Staci",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/staci/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T00:44:19.947Z",
                "reviewBody": "We thought this came out very well. I think I'd use a stronger-flavored cheese in the future and I'd probably caramelize another onion or two as they were lost in mine. The recipe calls for more butter than the instructions say to use -- go with the instructions as they have the correct ratio for a roux. The sauce doesn't seem like it's going to be enough for all the potatoes (I used 4 big Russets) but it is enough once the spinach shrinks in the oven:) Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JARRIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jarrie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-19T21:10:47.017Z",
                "reviewBody": "I made this tonight to go with beef tenderloin. Wow these were really good. My father and husband thought they were great too. I did change a couple things to go with what I had on hand. Yukon golds frozen chopped spinach and Jarlsberg cheese. For the amount of potatoes I cubed them fairly small and put a generous single layer across the bottom of my 9x 13 dish. Thawed and drained the spinach pulled out little chunks and placed evenly over the potatoes. When I added the milk and cream I did it in a few batches instead of all at once and had no problem with clumping. Other than as mentioned I followed the directions for cooking and such. Take the time to caramelize the onions I don't think these would taste nearly as good with just regualr onions. It was a little futzy having to make the cheese sauce but the quality of product makes it so worth it. I think that the next time I will add some cubed ham and make a bit more sauce to make a one dish dinner. My husband said \"bacon bacon bacon\" that would be good too! I so wish I had taken a picture before it was all gone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "boonie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2432477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-09T19:12:52.893Z",
                "reviewBody": "I was torn between four or five stars. I opted to go with four because I believe a different cheese would have been better and alot cheaper too. I couldn't get shredded muenster so I had to buy a 1.11 pound block which worked fine for the two cups. The block cost 8.09 which is too pricey for the results. The cooking directions and times were right on the mark though and my dad just loved them. I love the idea so I will try a different cheese next time because the Muenster was just too mild. Thank you for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4068481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-20T19:48:38.28Z",
                "reviewBody": "This is good but missing something; just don't know what. To be fair I cut the recipe in half and used only whole milk. I'm not sure if that makes a big difference. I will try this again with more sauce to see if that helps. Glad I did a trial run before Easter dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "AREENA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/559256/"
                }
            }
        ]
    }
]