[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214474/stupid-hot-dog-thing/",
        "name": "Stupid Hot Dog Thing",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5133798.jpg",
            "width": 4824,
            "height": 4824
        },
        "datePublished": "2019-04-02T06:53:23.000Z",
        "description": "My mom made this for me growing up. It got its name when she couldn't find her recipe card, got frustrated and asked where the recipe for the 'the stupid hot dog thing' was. The rest is history. We always have used Classico&reg; for the tomato sauce.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 (16 ounce) package elbow macaroni",
            "1 tablespoon butter",
            "1 (16 ounce) package hot dogs, sliced",
            "1 (28 ounce) can tomato sauce",
            "3 ½ cups milk",
            "1 (16 ounce) package process cheese food (such as Velveeta®), cut into small cubes"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a rolling boil; cook the macaroni in the boiling water until cooked through yet firm to the bite, about 8 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large pot over medium heat; cook the hot dog slices in the butter until browned, 3 to 5 minutes. Add the tomato sauce, milk, and cheese food to the pot; cook and stir until the cheese food is melted completely, 10 to 12 minutes. Fold the macaroni into the cheese mixture; continue cooking until thoroughly hot, about 5 minutes. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Muffin Mom N Garlic Girl"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.413793103448276,
            "ratingCount": 29,
            "itemReviewed": "Stupid Hot Dog Thing",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "542.5 calories",
            "carbohydrateContent": "43.2 g",
            "cholesterolContent": "74.4 mg",
            "fatContent": "30 g",
            "fiberContent": "2.5 g",
            "proteinContent": "24.8 g",
            "saturatedFatContent": "15.6 g",
            "servingSize": null,
            "sodiumContent": "1625.5 mg",
            "sugarContent": "8.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-09T17:43:54.277Z",
                "reviewBody": "This review is mainly in response to a previous post. To use such words as \"thoroughly uninspired\" and \"sadly lacking\" to describe this dish, is snobbish and in bad taste. If you are going to compare macaroni and hot dogs to an extensive knowledge on Italy and fine Italian cuisine, then please just avoid this site all together. There is no need for such arrogance. I have worked as a chef in many restaurants, preparing elegant dishes daily. Guess what my lunch often consisted of........ HOT DOGS AND MACARONI!! It's delicious. This recipe is good as is. For some palates you may need a little variation but overall I approve. It hits the spot. Buon Appetito!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bphoenix",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4752263/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T19:30:08.457Z",
                "reviewBody": "Mom made this for us kids but she always used gov'ment cheese instead of Velveeta. (Think of gov'ment cheese as a mixture between Velveeta and mild cheddar cheese....less processed taste.) I get a hankering for it now and then. My kids love it. Sometimes I'll use salsa instead of tomato sauce and it sounds weird but it's pretty good if you saute the hot dogs too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-20T22:48:27.213Z",
                "reviewBody": "Bland & throughly uninspired. My husband was none too pleased, and my children were less than enthused which is a far cry from their usual elation with my Italian cooking. I made this for my family yesterday, and recognized the taste right away as being a recipe I've made before though not from this site The flavor was sadly lacking. While I know that I'm am a tough critic having lived for 3 years in Italy this wasn't even passable to my husband who has only visited there with me. This dish is fine for someone with a bland palate, but if it's flavor you crave then move on to a recipe more original and authentic, LIKE STUPID HOT DOG THING. Wow, what an original and authentic dish that is!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Tim McFarlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3332795/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-11T03:11:34.7Z",
                "reviewBody": "I was torn between three and four stars but I am the first to write a review and I didn't want to start this recipe off on a bad note. For starters I followed the recipe exactly as written in order to be able to write a fair review. The consistency was like soup which I did not find very appealing. I was leery because of all the milk but I wanted to try it as written. The taste was o.k. to pleasant but nothing overwhelming. The most important thing that I discovered was the choice of hot dog to add. I used Sabrett all beef because that's what I had but the taste was too strong for this dish. A simple Oscar Mayer with very little flavor would be much better for this recipe. This is a nice dish to make if you have a large group of children to feed etc but I would be inclined to add about another half box of elbow noodles to this and change the consistency. It was just too soupy. Thank you though for posting this. I gave this four stars based on using a less flavorful hot dog. The flavors need to meld together not fight for top billing. UPDATE: I refrigerated the leftovers and reheated them which changed the consistency dramatically. I have included 2 new photos. My rating remains the same.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4068481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-19T01:23:51.763Z",
                "reviewBody": "I apologize the macaroni should be cooked slightly harder than al dente and finished cooking when added in at the end (this will make it so its not soupy). I suggest using classico as that is the way I intended it to be written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-06T16:33:24.843Z",
                "reviewBody": "Simple flavor; comfort food & kid-friendly! This is a fun dish that you will like if you've even had a hot dog with mac & cheese on the side! :)\nI made a 1/2 batch & I added 1 tsp garlic powder, 1/4 tsp pepper, 1tbsp parsley flakes, & 1/2 tsp onion & herb Mrs Dash. I goofed & forgot to saute the hot dogs & the mix was a tiny bit soupy, so I put it all into a 2Qt casserole dish & baked it with some sharp cheddar cheese on top for 20 minutes. I'd also reccomend increasing the hot dogs...they got kind of lost in the mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Katherine Duweck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5539167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T23:52:49.58Z",
                "reviewBody": "This really wasn't bad. Everyone else in my family really liked it more than I did. My main issue was more about texture than flavor. The flavor was much better than I expected - and to have something that my step-son enjoyed was nice for a change. We followed the recipe closely to get a good idea of what we thought about it. We did use only 3c milk, and whole wheat pasta, but that was the only changes we made. We cooked the macaroni for only 5min separately then drained & added to the cheese mix to let the pasta finish in the mix and absorb some of that liquid & flavor.  I would suggest using a flavorful tomato sauce to give it more flavor, I think that's why my guys enjoyed it as well as they all seem to love pasta. I would really like to use half the velveeta and 1c shredded cheddar next time and see how that affects the texture. Also I would really love to brown onion, peppers & garlic with the hotdogs. We'll have this again, it is quick and the guys enjoyed it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jodi_mae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-10T20:25:59.143Z",
                "reviewBody": "First of all...unless you are the Duggers DO NOT make a full batch. This recipe makes a GINORMOUS amount of food. We have a family of 6 and I doubt we will finish a 1/2 batch. You will be eating this until next week. I am VERY glad I halved it. I read the reviews so right off the bat I decided to cook my noodles to slightly harder than al dente and I also reduced the milk by 1/2 cup. I figured I could always add liquids but couldn't take them back out. I also used about 12 ounces of pasta sauce for my half batch....which is slightly less than called for. Once I got everything together I let it simmer and cook for the recommended 5 minutes and I got a great consistency. I was not wowed by the initial taste or the look of this dish. It is kinda...bland. And it just tastes like it is missing something. It is not really tomato-y and not really cheese-y...just sorta....something. We are about to sit down and give it a try and I will let you know what my husband and kids think of it. So...Kids ate the scoop I served them but did not ask for seconds. Husband said it was \"really bland but ok\". He said to give it 2 stars since it wasn't completely gross. It just isn't our cup of tea but we like spicy really flavorful food.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Jillie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3282402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-04-10T14:50:12.933Z",
                "reviewBody": "Yummy. I need to cut the sauce in half next time it made to much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Matt Colleen Parker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1339398/"
                }
            }
        ]
    }
]