[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214491/mushroom-melt-stuffed-chicken/",
        "name": "Mushroom Melt Stuffed Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1100903.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2019-04-02T06:53:24.000Z",
        "description": "This is my Mushroom Melt Stuffed Chicken. I made it for my girlfriend on our anniversary because every girl loves a guy that can cook, and she was very impressed.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "¼ cup butter",
            "1 large onion, finely chopped",
            "½ pound button mushrooms, chopped",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper",
            "1 cup Italian seasoned bread crumbs",
            "12 skinless, boneless chicken breast halves",
            "12 slices Black Forest ham",
            "2 cups shredded Havarti-pepper cheese",
            "24 slices bacon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat butter in a skillet over medium heat; cook and stir the onion and mushrooms with salt and pepper until the mushrooms are dark and juicy, about 5 minutes. Remove skillet from heat and stir in the bread crumbs. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place each chicken breast half between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to an thickness of about 1/4 inch. Lay a flattened chicken breast out onto a work surface, and place a slice of ham on the chicken. Spoon about 3 tablespoons of the mushroom stuffing onto the chicken breast, and top with about 2 1/2 tablespoons of the Havarti cheese. Roll the chicken breast around the stuffing, wrap 2 slices of bacon firmly around each roll, and secure with toothpicks. Place the rolls into a 9x13-inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the chicken is no longer pink and the stuffing is melted and hot, about 35 minutes. An instant-read thermometer inserted into the center of a roll should read at least 165 degrees F (74 degrees C). Remove the chicken rolls from the oven, and place an oven rack about 6 inches from the oven's broiler heat source. Turn on the broiler, and broil the rolls until the bacon is brown, 5 to 10 more minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kevin Bennett"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.639175257731959,
            "ratingCount": 97,
            "itemReviewed": "Mushroom Melt Stuffed Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "435.3 calories",
            "carbohydrateContent": "9.8 g",
            "cholesterolContent": "113.5 mg",
            "fatContent": "24 g",
            "fiberContent": "1.1 g",
            "proteinContent": "42.1 g",
            "saturatedFatContent": "11.2 g",
            "servingSize": null,
            "sodiumContent": "1257.5 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-02T01:17:10.55Z",
                "reviewBody": "YUMMMM!!!!! I have to say that we totally LOVED this chicken! I made a couple of changes tho :-) I always do... I scaled this recipe down to 6..well I used 3 whole chx breast and cut em in half then pounded them out and had 6 pcs. I used EVOO and 2T butter to saute my cremini mushrooms, onion and garlic in. After the mush turned soft, I added a lil (only a sm amt, bc the bacon will have alot of salt) S&P.  I added about 2T heavy cream to the mush mix then about 2T (ish) It. brd. crumbs.  I didn't shred anything...I used 1 lg garlic clove as well. I used sliced Havarti cheese. (slice BF ham, hav ch, mush mix, then put it on top of my thin chx brst and roll it.) I also used balsamic vinegar to brush on my chicken after I rolled them...it added another depth of flavor. Absolutley use the bacon pcs on the chicken, bc OMG they are PHEONOMINAL!! Be sure to broil for 10 mins after cooking!!! I put my chx on a rack on a foil covered baking sheet...less mess.  We LOVEDDDDD these...I made Easy Mushroom Rice from this site...if you want that to be awesome, also check out my review :-) Thanks sooooooooo much for sharing your awesome recipe, dude, you rock!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mwood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3473256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T22:35:42.557Z",
                "reviewBody": "Due to lack of time I prepared this as more of a casserole and it was fabulous!  I put one can of cream of mushroom on the bottom of a 13x9 pan, hammered out the chicken (salt and peppered) and placed on top of the cream of mushroom.  Prepared the onions and mushrooms as suggested and placed on top of the chicken breasts.  Covered with cheese and baked for 40 minutes @ 350.  It was fabulous this way so I can imagine the original recipe is amazing as well.  Will try the way it is written when time is permitting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lacey1392",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5160397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-12T03:38:17.99Z",
                "reviewBody": "This took a little extra effort than most baked chicken dishes, but with some tweaking to suit my tastes, it was fun preparing it, and we enjoyed eating it. It was nice to have something a little more “fussy” and interesting.  When I chopped up the mushrooms and onions, I did so till the mixture was a fine mince and added some garlic as well.  (I meant to deglaze the pan with a little white wine, which would have been nice, but I forgot) I skipped the bread crumbs entirely and just as I suspected, we didn’t miss them. As for the cheese, wouldn’t you know I had just about everything BUT Havarti in the fridge but there are any number of acceptable substitutes – in a pinch any semi-soft cheese will do.  I used a Pepper Jack for mine, but in consideration of Hubs’ sensitive innards I used just a mild Cheddar in his. Rather than piling the mushroom-onion mixture and the cheese on the chicken in a blob, I spread everything over the surface of each breast and then rolled it up pinwheel-style.  Wrapping each with two slices of bacon was not only too much, it resulted in the bacon underneath staying unattractively fatty and gloppy.  One slice, cut in two pieces and laid over the top, would have worked much better.  Not only did we not miss the bread crumbs, I don’t think I’d miss the cheese either. You wouldn’t be sacrificing any flavor or compromising the dish by eliminating both.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-15T00:57:18.25Z",
                "reviewBody": "This recipe is very easy to make and makes my kitchen smell absolutely delicious. Instead of flattening the chicken and rolling it I stuffed the chicken with the ingredients. I also use crushed bran flakes instead of bread crumbs for a healthier version. DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna Turman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3558400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-09T00:56:16.45Z",
                "reviewBody": "Winner Winner Chicken Dinner! Soo good! Followed the recipe except I didn't have bread crumbs so I used Panko. Worked fine! I also made a basic white sauce with some garlic powder parmesan s&p and parsley. This sauce was really nice over top of it! (I made it for some steamed broccoli and ended up pouring some on the chicken.) I made it with roast potatoes for my boyfriend tonight. He thinks he'll keep me.;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pamw25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8534558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-13T17:39:23.087Z",
                "reviewBody": "A new favorite! However I had no choice but to make some adjustments. 1st I didn't have harvarti cheese and 2nd I didn't want to use the ham I had (intended for another dish). So I didn't wrap the chicken with the bacon but baked and crumbled my thick maple bacon before hand. I followed another reviewers suggestion and added a lil heavy cream to my sauted baby bella's chopped garlic and parmesan cheese along with the seasoned bread crumbs. I stuffed each breast with Munster cheese stuffing mix and bacon bits. Instead of leaving the chicken alone to bake as is I mixed cream of mushroom & cream of chicken soup with sour cream and topped the chicken; added more munster cheese and provolone on top of that! It was excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Huntmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1930742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-21T20:31:05.717Z",
                "reviewBody": "I changed the servings to 4 on the recipe. Imagine my surprise when it called for 76 cups shredded cheese?? I figured out how much to use and it turned out great. It was a bit too salty and I think it might have been because I used a thick sliced bacon. Next time I'll try it with thin sliced bacon. Your girlfriend is a lucky gal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Norma Kuisle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3113304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-07T22:42:35.95Z",
                "reviewBody": "Another great way to serve chicken! I used portabello mushrooms instead of white button mushrooms and the flavor was excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sue doyle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3406741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-29T02:59:58.68Z",
                "reviewBody": "omg this was fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mlee80817",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mlee80817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-13T17:54:40.84Z",
                "reviewBody": "I was really excited about this recipe but was sadly disappointed. I really did not like the mushroom stuffing. I stuffed the chicken breast rather than rolling it but I doubt that made too much difference. I made the recipe pretty much as stated using portabella mushrooms. I used regular havarti (couldn't find havarti-pepper) and it had no impact on the flavor. I would use something with a stronger flavor for sure. I think I didn't like the bread crumbs mixed with the shrooms? I don't know what it was! However I did like the bacon wrap idea and also brushed it with balsalmic vinigar like another reader suggested and that was really good. I doubt I will make this again. It sounded so good and smelled great looked amazing when I took it out of the oven but I pretty much ate around the stuffing so can't say that its a keeper at all. Hubby didn't care for the stuffing either. Thanks though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "love2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2681925/"
                }
            }
        ]
    }
]