[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22991/spaghetti-pie-iii/",
        "name": "Spaghetti Pie III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F33272.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2000-06-19T00:00:30.000Z",
        "description": "Really easy and filling recipe.  Serve with a tossed salad and garlic bread.  Better than lasagna.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "7 servings",
        "recipeIngredient": [
            "1 pound spaghetti",
            "1 pound lean ground beef",
            "¼ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "garlic powder to taste",
            "½ cup chopped green bell pepper",
            "1 (26 ounce) jar pasta sauce",
            "¾ cup sour cream",
            "½ cup chopped green onions",
            "½ (8 ounce) package cream cheese",
            "1 ½ cups shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a skillet over medium heat, brown the ground beef. Drain and crumble.  Put crumbled beef in skillet. Stir in salt, pepper, garlic powder, bell pepper and pasta sauce.  Bring to a boil; reduce heat and simmer for 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl combine sour cream, green onions and cream cheese and set aside.  Coat a 9x13 inch baking dish with cooking spray and add the cooked spaghetti. Spread the cream cheese mixture over it, add the meat mixture and sprinkle with Cheddar Cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and bake for 25 minutes. Uncover and bake for 5 more minutes until the cheese is bubbly.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CHUBS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.420289855072464,
            "ratingCount": 483,
            "itemReviewed": "Spaghetti Pie III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "670.9 calories",
            "carbohydrateContent": "65.8 g",
            "cholesterolContent": "95.2 mg",
            "fatContent": "31.5 g",
            "fiberContent": "5.1 g",
            "proteinContent": "29.9 g",
            "saturatedFatContent": "16.2 g",
            "servingSize": null,
            "sodiumContent": "786.6 mg",
            "sugarContent": "11.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-13T05:03:58.137Z",
                "reviewBody": "This is one of my favorite recipes from this site - here's how I make it: Cut the pasta amount in half and use rigatoni or penne as this heavy sauce needs a sturdier base than spaghetti. Omit the green onions and throw some minced garlic freshly ground black pepper and diced onion in with the ground beef. Stir the cheese mixture into the cooked noodles and place in the bottom of the baking dish. Top with the sauce. Cover and bake for 20 minutes uncover and top with the cheese. Bake for about 10 minutes more or until the cheese is bubbly. This makes a ton of seriously yummy comfort food. Everyone loves it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BODIE358",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1358344/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-16T22:59:45.03Z",
                "reviewBody": "This is the only way I make spaghetti...ever!  My favorite part is the cream cheese/sour cream mixture. Update: I have made this many, many times and have finally perfected this wonderful recipe; I use 1.5 jars of sauce, I mix my cooked noodles with butter and lots of parmesan before putting in the pan, and finally I added about 1/2 cup of ricotta to the cream cheese/sour cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Khristin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2360689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T15:30:46.617Z",
                "reviewBody": "Yummy, yummy, yummy!  I buttered the spaghetti a bit before layering in the pan and I used a jar of Newman's Sausage and Peppers sauce along with 1/2 a jar of Ragu-  it could have used more sauce so I would use two whole jars next time.  I also combined some ricotta cheese with the cream cheese mixture.  We all loved it!  I might skip the cheddar cheese next time and replace it with mozzerella.  You could also scale down the pasta a bit if you don't have a full pound and it would work fine...the pound of spaghetti really filled the pyrex.  This will be something I make at least once a month-  it makes a ton and I always appreciate left overs so I don't have to cook every day.  Thanks for sharing a great pasta dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JERSEYGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1954249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-01T16:34:41.7Z",
                "reviewBody": "I can't wait for lunch to have the leftovers!!! What a delicious hearty meal; so easy and so wonderful! I omitted both the green peppers and green onions and used Bertolli Organic Tomato Basil Sauce--YUM O! I sautéed half a sweet onion in butter until translucent in the same pan browned up quality lean ground beef seasoned to taste. Tossed thin spaghetti noodles w/ butter and parmesan cheese as suggested by Khristin (no dry noodles like others). Added 1/2 cup of low-fat ricotta cheese and substituted a combo of cheddar/jack and mozzarella for the cheddar cheese. After dinner I couldn t stop eating little bites from the casserole dish. Will be making this again soon! Thanks for an awesome recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kandiee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2363817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-06T22:23:26.44Z",
                "reviewBody": "Thank you for this recipe. I made it today for my husband who was coming home for a day from trucking. He raved and raved. But as usual I used it as a skeleton and changed the following...\n1. I didn't measure out the sour cream and cream cheese exactly. I just blended a medium container of SC and 8 oz of CC. Much easier! \n2. I used the 1 lb of spaghettie and added some broken pieces of lassagna I had.\n3. I used 1 lb ground chuck AND 1 lb. roll of sage flavored sausage. I fried it together throwing in the green pepper and 4 cloves of garlic. I also used lots of spices to heat it up like cumin, oregano, garlic salt, seasoned pepper, pepper corn ? (like used at pizza hut to sprinkle on) and minced onion.\n4. I bought 8 oz mozzarella and 8 oz sharp chedder and used all but 2 oz from each. \nIt was delicious!! Since I baked it in a 14x11 pan, there were leftovers of the noodles and meatsauce. There was no extra sour adn cream cheese. I added the noodles to the sauce and froze for spaghetti later. I bagged and froze the leftover pie too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Evon ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindaevon/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-28T03:33:55.793Z",
                "reviewBody": "My husband and I are giving this 4 stars. It was amazing...but the noodles making up the bottom layer really dried up when it went into the oven. We followed the recipe to heart but for future attempts we suggest mixing the meat and noodles together so it dosen't dry up as bad adding the sour cream/chive/cream cheese on the top and then the cheese. We will do this again!! One of my personal favorites omitting the dry noodles. Thank you! Crystal T.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2312950/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T21:27:59.303Z",
                "reviewBody": "This is a good recipe, but I tweak it a bit.  I make my own sauce, and instead of spreading the cream cheese and sour cream over the spaghetti, I mix it in with the noodles.  I've also found that mozzarella cheese is preferred by my family.  But it's a good base recipe to work from.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "greenbeanmama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2471485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-13T20:32:01.3Z",
                "reviewBody": "This was a really good recipe! I did tweak it just a little though. I mixed in some melted butter (about 1/4 cup) 1 egg and some paremesean cheese into the noodles before putting them in the pan. I also used the full 8oz pkg of cream chz instead of the 4oz it called for. I did not have any green onions so I mixed in some italian seasoning with my crm chz and sour cream. Sooooo good! My hubby & kids raved about this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BELONGS2TROY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/492409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-09T23:55:22.14Z",
                "reviewBody": "This was tasty! And fairly easy too although there were more dishes to wash than I like. I omitted the green pepper (personal preference) reduced the spaghetti to approx. 3/4 lb and increased sauce by about another 1/4 jar. I like very saucy noodles and found that ratio to be perfect. I loved the sour cream and cream cheese. In the future I may take a few short cuts and use prepared meat sauce (rather than browning meat and simmering) and chive cream cheese (rather than cutting green onions). Thanks for the yummy recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cardamum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1750427/"
                }
            }
        ]
    }
]