[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/248/main-dish/burgers/",
                    "name": "Burger Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16362/main-dish/burgers/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214578/buffalo-chicken-burgers-with-blue-cheese-dressing/",
        "name": "Buffalo Chicken Burgers with Blue Cheese Dressing",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F415743.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2019-04-02T06:53:28.000Z",
        "description": "This burger delivers the bold flavors of Buffalo wings minus the mess and calories. Serve with additional hot sauce on the side.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 burgers",
        "recipeIngredient": [
            "¼ cup light sour cream",
            "¼ cup reduced fat blue cheese crumbles",
            "¼ teaspoon Worcestershire sauce",
            "1 ½ pounds ground chicken",
            "¼ cup hot pepper sauce",
            "½ teaspoon celery salt",
            "¼ teaspoon poultry seasoning",
            "½ teaspoon paprika",
            "1 pinch cayenne pepper, or to taste",
            "1 tablespoon hot pepper sauce",
            "4 Kaiser rolls, split ",
            "4 leaves iceberg lettuce",
            "½ cup diced celery"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate. Stir the sour cream, blue cheese, and Worcestershire sauce together in a small bowl; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the ground chicken, 1/4 cup hot sauce, celery salt, poultry seasoning, paprika, and cayenne pepper together in a mixing bowl until evenly blended. Form into four 3/4-inch-thick patties.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the chicken burgers on the preheated grill 6 to 7 minutes until well marked. Spray the uncooked top of the burger with cooking spray, and flip the burgers over. Brush the cooked side with 1 tablespoon hot sauce, and continue cooking until no longer pink in the center and the juices run clear, about 5 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble the burgers, place a lettuce leaf on each roll bottom. Top with a burger patty, then spoon on 2 tablespoons of blue cheese sauce, and 2 tablespoons celery. Place the top of the roll on top to finish the sandwich.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Burger Recipes",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Melissa Sweet"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4,
            "ratingCount": 180,
            "itemReviewed": "Buffalo Chicken Burgers with Blue Cheese Dressing",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "374.2 calories",
            "carbohydrateContent": "25.3 g",
            "cholesterolContent": "110.7 mg",
            "fatContent": "8.8 g",
            "fiberContent": "1.7 g",
            "proteinContent": "45.5 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "1110.8 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-05T18:39:24.1Z",
                "reviewBody": "How do you completely change it...then rate it? It's not even the same recipe when your done! This is for almost every review I read...not all...but most. Turkey instead of chicken is one thing...but when you SKIP the blue cheese, and the bun and on and on and on...it's not the same! I have an idea...change it...then submit it as yours. Don't review a recipe you have ALMOST completely changed. And yes..my family of 7 and our friends loved it as is. Well done MELXCLOUD!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Hunter Dye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mightymom4/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-09T19:57:21.307Z",
                "reviewBody": "We thought these were fantastic! Now I must admit I had been drinking prior to eating them so my review may be a bit skewed. However everyone else who ate them also commented multiple times how much they enjoyed them. I didn't have lettuce or celery (we were camping...too lazy to deal w/fresh produce. And I hate celery.) and they were still awesome. I just prepped another batch to freeze for later grilling. In the latest batch I added some minced garlic and parmesan cheese to attempt to recreate our favorite wing sauce (garlic parmesan) taste. I did freeze them prior to grilling as they are quite wet and I imagine would have been a little annoying to deal w/on the grill w/out freezing first. THANKS for a fantastic recipe (one that made me expand my horizons and try ground chicken at that!)! EDIT: The addition of minced garlic and grated parmesan cheese was awesome! We loved them as written and tweaked to mimic our favorite wing flavors. If we're out of dry blue cheese I'll use a little light ranch mixed some hot sauce for a topper instead. These are now ALWAYS in our freezer for quick meals. When we don't have buns I serve them on Lender's frozen bagels (toasted).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-01T18:39:46.107Z",
                "reviewBody": "Mmm delicious. Only big change was I added diced red onion to the burger mixture. I find diced onions keep poultry burgers from drying out. I used Frank's Buffalo wing sauce and served this on a crusty roll. I did add the celery salt and the diced celery.. the diced celery added a nice crunch. I topped this with a little more hot suace when it came time to eat... yum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lindat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-27T15:50:03.56Z",
                "reviewBody": "This is a great burger! I used Franks Red Hot... as there is no other hot sauce! I left out the celery salt & chopped celery as no one care for that flavor in my house. Added a little minced onion and garlic powder to the blue cheese crumbles with mayo & sour cream 1/2 & 1/2 of each for a creamy texture. Let that sit in the refrigerator for about 1/2 hour. Prepared the meat as directed leaving out the celery salt and let them rest for about 1/2 hour in the refrigerator to all the seasons to mingle. Toasted up the buns after grilling the burger; served with extra hot sauce & blue cheese dressing on the side... It was perfect. Thanks for sharing! Will be a summer hit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2394270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-10T18:50:07.07Z",
                "reviewBody": "OUTSTANDING! Made these as written aside from adding a couple of spoons of mayo and a little garlic powder to the blue cheese mixture. These are totally awesome! A definate keeper that I know will be made A LOT in my house! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-25T01:23:04.763Z",
                "reviewBody": "These were super good! Made them with my deli roll recipe from my recipe box. I increased the servings to 16. We did not use the blue cheese crumbles but took a short cut with blue cheese dressing mainly because the kids took one look at real blue cheese and went \"Ewe\". so bottled dressing was the next best thing. The celery is key to these burgers and I mixed it with the bottled blue cheese dressing to hold together and not fall out of the sandwich. Also you HAVE TO watch the cooking time on these as they can get dry quickly. Ours were fine but another minute on one or two of them would have been too much. I might add a bit of EVOO to the next batch and see if that makes any difference. These were a hit with everyone and will now be a regular at our house! Update Have made these several times now! I grind boneless thigh meat and breast meat in my food processor and the result is a very moist patty! I make enough to freeze for 2 additional meals.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-24T17:46:56.2Z",
                "reviewBody": "Well this recipe is one I'm definitely going to keep. I made my own poultry seasoning (thyme rosemary marjoram sage black pepper) and used 1/3 C Frank's Red Hot sauce since we like the taste. Also I combined ground turkey and chicken. I also added some onion powder garlic powder and Worcestershire sauce to the meat mixture. I started them on a griddle pan and finished them in the oven at 350 degrees for about 15 minutes; I served them on buns with low-fat Swiss cheese (less fat than the blue cheese sauce although that looked yummy!). This was delicious and I'll definitely be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "L. Britten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2272876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-25T21:39:40.597Z",
                "reviewBody": "Since ground chicken is so expensive I made my own by thawing 4 BLSL chicken breasts and cutting them into 1 inch cubes. I added a handful of the chicken cubes to the food processor and hit the chop button for about 5 seconds or so scooped out the ground chicken into a bowl and continued until I had all the chicken ground. Be careful not to grind too long as you can easily ruin the chicken. I then proceeded with the recipe and it yielded 4 patties. Easy recipe and would be great to make ahead and freeze. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tahoegirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2297575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-17T17:55:58.687Z",
                "reviewBody": "These were a nice easy meal for a record hot summer evening. We did grill them they seemed really sticky when I pattied them up which I did two hours before grilling so I put them in the freezer on wax paper to make them easier on the grill. The dressing is what makes these so good I followed the ingredients as specified except used celery seed instead of celery salt. Didn't put any real celery on them just Romaine lettuce. Oh and I did mince some sweet onion and put in them honestly they might have been boring without the onion. The sauce was so good and I made extra and we used it as dressing on a salad side dish I did add 2 teaspoons of light mayo and the sour cream and blue cheese were all low fat...couldn't tell the difference. Very good low fat meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T22:29:04.593Z",
                "reviewBody": "thse were good but that being said they were lacking something.Bf said they were just ok which means he really wasnt overly thrilled by the taste.needs more of something.I dont think I will make again.didnt wow us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindalou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2104831/"
                }
            }
        ]
    }
]