[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/219/salad/vegetable-salads/",
                    "name": "Vegetable Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17806/salad/vegetable-salads/cauliflower/",
                    "name": "Cauliflower",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214918/fully-loaded-cauliflower-salad/",
        "name": "Fully Loaded Cauliflower Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F816368.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T06:53:41.000Z",
        "description": "A lower in carb version of my favorite baked potato salad. Most people when I serve this can't tell right away that this is made with cauliflower. Even my cauliflower hating husband enjoys this salad!",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 slices bacon",
            "1 head cauliflower, chopped into bite size pieces",
            "2 tablespoons extra-virgin olive oil",
            "2 cloves garlic, minced",
            "salt and ground black pepper to taste",
            "½ cup fat-free sour cream",
            "½ cup reduced-fat mayonnaise",
            "4 ounces shredded sharp white Cheddar cheese",
            "4 green onions, chopped",
            "1 bunch chopped fresh chives",
            "2 dashes hot pepper sauce (such as Frank's RedHot®)",
            "¼ teaspoon paprika"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. When cool, crumble into bacon bits.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the cauliflower, olive oil, garlic, salt, and black pepper in large bowl. Spread the cauliflower on the foil-lined baking sheet, and roast in the preheated oven until the cauliflower is lightly browned, about 15 to 20 minutes. Cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the cooled roasted cauliflower, sour cream, and mayonnaise in a large bowl; stir.  Fold in the shredded Cheddar cheese, bacon bits, green onion, chives, pepper sauce, and paprika. Adjust salt and black pepper. Refrigerate for 1 to 2 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Vegetable Salad Recipes",
            "Cauliflower"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sarah Jo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 52,
            "itemReviewed": "Fully Loaded Cauliflower Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "200.2 calories",
            "carbohydrateContent": "10 g",
            "cholesterolContent": "29.7 mg",
            "fatContent": "13.5 g",
            "fiberContent": "3.2 g",
            "proteinContent": "11 g",
            "saturatedFatContent": "5.5 g",
            "servingSize": null,
            "sodiumContent": "328.9 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-07-27T09:35:58.757Z",
                "reviewBody": "For the reviewers who are concerned about this recipe being \"healthy\" this is a LOW CARB recipe. Most cream-based salads aren't usually made for the mindset of eating healthy and if eaten in moderation there shouldn't be a concern. The mayonnaise and sour cream should be added to your liking and it's really just a matter of how wet you like it. Fat free plain or greek yogurt can be used in place of part of the sour cream or mayonnaise.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-28T17:30:43.467Z",
                "reviewBody": "At last minute (the morning of Memorial Day) our friends invited us to a cookout. They said they'd make the meat if we brought the sides. I knew they all (including my husband) loved the \"baked potato salad\" from the Fresh Market around the corner from us but I am back on low-carb and needed something that would be similar for me (as I love the baked tater salad too but obviously couldn't eat it...) and...This was AWESOME! I used full-fat sour cream and full-fat mayo as I am low-carb and low-carbers eat FAT (because it's good for you!) No this is not low-calorie as low-carb does not usually (ever) mean low-calorie...it was WONDERFUL! I bought a block of white cheddar and shredded it instead of using pre-shredded cheese. The friends who invited us over USUALLY make fun of my \"low-carb creations\"... and they ate it up! note - if you want this to be low-er fat go ahead and use fat free mayo (or low-fat ff is gross in my opinion but to each their own)...and the same with the sour cream. Otherwise go for the full fat as this was amazing! And I will be making it again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7724735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-07T22:11:57.427Z",
                "reviewBody": "I was intrigued by this recipe because I was amazed that a side dish made from the healthy cauliflower could be 352 calories per serving. It's made with fat-free sour cream and reduced fat mayo after all. Then I looked at the proportions. Even a half a cup of low fat mayo is a lot. And one whole cup of full fat cheese adds on the fat. So I reduced the sour cream and mayo to a total of one half cup and I didn't even use all of it. I cut the olive oil to one tablespoon and used only 1/4 cup of Parmesan instead of a full cup of cheddar. This was delicious and we enjoyed it very much. Thanks so much for the post Sarah Jo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-07T14:38:07.04Z",
                "reviewBody": "I enjoyed this dish. It's not exactly low calorie but it is a great alternative to typical potato salad. The 2 dashes of Frank's Red Hot sauce added a great depth of flavor. I did not have fresh chives on hand but will add those next time as I think they would add even more flavor. I will definitely make this again and plan on bringing it to a potluck soon. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Bloomer Hoerth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lhoerth/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-08T00:10:50.213Z",
                "reviewBody": "Yum - really liked this one. I halved the recipe and made it exactly as written. My husband who loves cooked cauliflower but not raw really enjoyed this salad. I appreciated that it was good as leftovers without getting mushy. This is a keeper - thanks Sarah Jo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-09T16:19:47.893Z",
                "reviewBody": "I brought thi salad when we went camping last year and my extended family about 20 of us has requested it again this year. We loved the flavor of the roasted cauliflower! I used lower fat ingredients for the dressing and cheeses and beefed up the flavor with more green onions herbs and spices. This recipe is flexible and can be tweaked to your liking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shennie A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3353407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-28T21:51:21.437Z",
                "reviewBody": "I just made this for my sons birthday BBQ tomorrow if I could I would eat the whole bowl! Its deeeeelicious! The flavors mix very well I double the recipe and reduced the mayo just a little. This will be my new favorite go to salad! Thanks so much for sharing this recipe its wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12152458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-13T05:28:03.597Z",
                "reviewBody": "I love this recipe! For a normal diet it's not healthy but not horrible but if you're on a low carb diet like I am it's awesome! One of my favorite foods was the fully loaded baked potatoe salad we would get from the local grocery store. When I started the low carb diet this was off limits:( I tried a low carb mashed potatoes type dish before which was also made with cauliflower and very good too but I never thought of making the fully loaded potatoe salad with cauliflower until I read this thank you Sarah Jo! I did make some changes though I used green onions instead of chives and used a lot less and I didn't add the paprika or hot pepper sauce (I don't like spicy food) and it was delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7784874/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-25T11:50:11.057Z",
                "reviewBody": "I had a head of cauliflower to use up and wondered if there existed a salad similar to the usual broccoli salad recipes I tried in the past. This recipe isn't quite the same as other reviewers have mentioned because it isn't quite healthy. That being said I would agree with Dianemwj who suggested cutting the dressing proportions in half (you'll still have plenty & it still won't be healthy - so picky eaters will eat it any ways). This being said it does take the bland cauliflower and make it taste good - bacon-ish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Soleil01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2148516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-28T19:49:19.407Z",
                "reviewBody": "No need for the bacon I'm going to make this but with vegan sour cream and vegan cheese for a low carb zero cholesterol salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Andie Pandie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15955571/"
                }
            }
        ]
    }
]