[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23167/sirloin-tips-and-mushrooms/",
        "name": "Sirloin Tips and Mushrooms",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F277152.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2000-10-20T01:29:07.000Z",
        "description": "Beef sirloin cubes browned with garlic then simmered in tomato sauce and red wine until tender. Great over buttered noodles.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 tablespoons olive oil",
            "3 cloves garlic, minced",
            "1 ½ pounds beef sirloin",
            "1 (16 ounce) can mushrooms, with liquid",
            "1 (8 ounce) can tomato sauce",
            "salt to taste",
            "freshly ground pepper, to taste",
            "¾ cup red wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut beef into cubes. In a large skillet over medium/high heat, heat the olive oil and brown beef cubes with the garlic.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add mushrooms with liquid, tomato sauce, salt, pepper and red wine. Cook for 30 minutes or until beef cubes are tender.  Add a little more wine while cooking if desired.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GRANNYA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.258928571428571,
            "ratingCount": 672,
            "itemReviewed": "Sirloin Tips and Mushrooms",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "257 calories",
            "carbohydrateContent": "7.1 g",
            "cholesterolContent": "49.1 mg",
            "fatContent": "13.5 g",
            "fiberContent": "2.3 g",
            "proteinContent": "21.7 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "555.5 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-29T18:35:44.213Z",
                "reviewBody": "I combined a few different suggestions from reviewers and this turned out FABULOUSLY!!!  I must say that I have only 3 other dishes in my \"favorites\" folder, so it takes a lot to get there.  I'm glad to say I added my 4th after making this!\n\nI used fresh mushrooms instead of canned and added about 1/4 C of water.  I added 1 beef bouillon cube and plenty of bay leaf and thyme.  I used cooking sherry as my wine and also added 2 tbsp of brown sugar.  I browned the beef with the oil and garlic slightly before adding the other ingredients, set the temperature to medium, covered the skillet, and cooked for about 40 minutes.  The sauce cooked down and was thick and delicious.  I stirred in about 2 tbsp of butter after removing from heat. I served this over mashed potatoes.\n\nTHANK YOU for such a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLNARJL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1166019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-18T11:06:16.407Z",
                "reviewBody": "Great also in the Crockpot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SONJA LEDGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/222405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-02T16:15:44.027Z",
                "reviewBody": "I've made this a few times now and my family loves it.I've changed the recipe a bit to suite our tastes.I brown the beef, then add just enough beef broth to cover and a tbsp of worchestershire sauce and simmer for 30-45 min.Then add in the garlic, tomato sauce, black pepper and an 8 oz can of mushrooms w/ liquid.I don't cook with alcohol so I leave out the wine.I let it simmer another 30 minutes and the meat comes out tender and the sauce has thickened.I've made this with sirloin and stew meat and haven't had any problems.I serve with mashed potatoes since my hubby and children prefer it that way...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FOXY1619",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1045837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T21:48:41.943Z",
                "reviewBody": "We loved this recipe!! I made a few slight modifications I increased the wine to one cup (I used cabernet) and eliminated the mushrooms completely as they aren't a favorite around here. Also I found the sauce to be incredibly runny so I added a small can of tomato paste to thicken it and it was perfect. I added a splash of olive oil and I used one cup of Ragu Seven Herb Tomato pasta sauce and I think the chunks of tomato really added to this recipe! It looked and tasted homemade and my husband thought I slaved for hours in the kitchen making it! I served it over buttered noodles as suggested and with some homemade bread and we drank the remaining cabernet. This was wonderful and we will definitely have this again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "caliboo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-01T22:11:31.763Z",
                "reviewBody": "I wanted a nice dinner after cleaning my carpets all day so I put this together in my slow cooker. I used sirloin tips, and huge chunks of mushroom. (Love them).\nI also added chopped onions and very generous garlic. Two bay Leaf, and 1 T of brown sugar which was a great tip from previous reviews. I substituted  1/2C Brandy for the wine and used 3/4C beef broth with the tomato sauce, it was awesome. Whenever I cook stews or something similar to this in the slow cooker, too much liquid can be a problem. My secret is adding 1 good Tablespoon of Tapioca about an hour before it's done. Leave the cover off and let it thicken. It does not cloud the sauce and keeps it very smooth. It keeps it more of a sauce than a gravy.You can always put the lid back on to perfect the amount of thickening you want. I served it with Garden Harvest Rice pilaf and salad. Thanks so much for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. gayle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2408418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-23T23:19:58.183Z",
                "reviewBody": "I added chopped onion and minced garlic to the beef while cooking.  Sauteed fresh baby bella mushrooms instead of canned.  No need to add additional liquid.  Used 17 oz. can of diced tomatoes and 2 8 oz. cans of tomato sauce, 2 bay leaves, 1 TB thyme and 3 TB beef base and simmered for an hour.  Thickened broth right at end and served over noodles.  One cup red wine added a unique flavor and wasnt too salty at all.  Very delicious.  Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mindi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1653190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-10T18:48:24.733Z",
                "reviewBody": "Loved this recipe.My husband raved.Will defenitly make it again.The only changes I made were I put some peppered flour in a large plastic container and shook the beefcubes in the closed bowl.I also added 2 cubes of beef bouilon a sauteed onion and a couple of bayleaves.There was not a drop left.Thanks Anita.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HENNY FRANK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/800986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-12T23:53:33.687Z",
                "reviewBody": "Based upon the many excellent reviews and suggestions, I made some significant changes to the recipe.\r\n\r\nFirst, I fried lots of fresh mushrooms in butter and set them aside.  I used a Papain based meat tenderizer on the steak (I only used 12 pound) before cutting it up.  I browned the steak pieces in Canola oil, then added the garlic plus (as some had suggested) finely chopped onions.\r\n\r\nBecause several reviewers had suggested that the sauce was too thin, I did make an oilflour roux, but turned out I did not need it.\r\n\r\nI used about 20 oz. canned diced tomatoes (again as a result of other reviewers' suggestions) and only about 12 cup wine.  I did use a small 6oz. can of tomato paste, but next time, I would only use half, as it had just a bit too strong a tomato flavour.\r\n\r\nI also added Italian Seasoning and Oregano.\r\n\r\nThe buttered egg noodles are a MUST!!!\r\n\r\nI served this dish with cooked fresh green beans. It was a great hit, and since I am cooking for only two people, half the dish was left over for another day.\r\n\r\nThe next day, I reheated it, added some water as it was a bit too thick and served it over Uncle Ben's Minute Rice:\r\n\r\nI cooked the rice according to microwave instructions, except I deleted the salt, and added finely chopped onion, chopped red and green pepper and frozen \"petite peas\".  I think that this was even better than the first day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alpha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/719729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-30T02:17:02.75Z",
                "reviewBody": "This is a 5 star recipe.  I used paste to thicken and it worked perfectly.  Served with mashed potatoes.  This works really well in the crock pot outstanding!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1578327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:56:04.673Z",
                "reviewBody": "Definitely not something my family or myself enjoyed. Will not make again. The sauce was WAY to strong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "OTTOS2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1416836/"
                }
            }
        ]
    }
]