[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/657/soups-stews-and-chili/stews/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/215916/easy-chicken-stew-with-apple/",
        "name": "Easy Chicken Stew with Apple",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F536507.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:54:08.000Z",
        "description": "This stew is surprisingly delightful. It serves 6 people easily and most of the ingredients are probably in your pantry already. So easy and tasty. This recipe just works.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "3 skinless, boneless chicken breast halves, cut into cubes",
            "2 bay leaves",
            "2 teaspoons salt",
            "1 teaspoon dried thyme",
            "½ teaspoon ground black pepper",
            "¼ teaspoon caraway seeds",
            "1 cup chopped red onion",
            "1 large clove garlic, minced",
            "1 stalk celery, sliced",
            "4 potatoes, cut into cubes",
            "4 carrots, sliced 1/4-inch thick",
            "2 parsnips, sliced 1/4-inch thick",
            "3 Macintosh apples - peeled, cored and chopped",
            "3 cups chicken stock, or more if needed",
            "2 cups apple cider",
            "1 tablespoon cider vinegar",
            "¼ cup chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large pot over medium heat; cook the chicken in the hot oil until it has begun to brown. Add the bay leaves, salt, thyme, black pepper, caraway seeds, red onion, garlic, celery, potatoes, carrots, parsnips, apples, chicken stock, apple cider, and cider vinegar to the pot. There should be enough liquid to just cover the vegetables. If not, add more chicken stock to cover the vegetables.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring the mixture to a simmer and cook, stirring occasionally, until the carrots are tender, about 30 minutes. Remove the bay leaves and garnish with the parsley to serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "knitkat"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.15,
            "ratingCount": 20,
            "itemReviewed": "Easy Chicken Stew with Apple",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "368.2 calories",
            "carbohydrateContent": "62.5 g",
            "cholesterolContent": "32.7 mg",
            "fatContent": "6.8 g",
            "fiberContent": "9.3 g",
            "proteinContent": "16.7 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "1210.7 mg",
            "sugarContent": "23.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-28T19:35:58.89Z",
                "reviewBody": "I agree - it IS surprisingly delightful. I was unsure if we would like a chicken stew with apples and apple cider - I was concerned it would be too sweet. It was not. I did not use the parsnips because we don't care for them but other than that I made it as directed. The only negative is the color. With the white apples potatoes and chicken the only other color was the orange carrots and a little bit of green (parsley). It would have more visual appeal if there were more green maybe. Perhaps some spinach or green beans? I don't know if they would change the taste though. Bottom line is that I will make it again. It's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Glaeser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1159739/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-12T00:31:10.947Z",
                "reviewBody": "WINNER! This was so delicious. Will make this again and again. Like another review said the next time I'll add some green beans just for more color. Thanks for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZenMama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3379112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-01T17:21:45.607Z",
                "reviewBody": "I'm a long-time chef and when I read this recipe had my reservations due to the complexity and variety of the total ingredients. I should have listened to my gut. I made this dish for a special event with some friends and it fell flatter than a pancake under a 20 ton weight. It was actually going along fairly well until I added the tablespoon of cider vingegar - which changed the entire flavor of the dish. And there was no real recovery after that because I didn't have time to mess with it. The texture was mushy and the flavor was uninspired. Some suggestions I would offer are these: Substitute Jerusalem artichokes for potatoes (much more expensive I know but better for diabetics) and add a handful of dried cranberries to sweeten it up. This recipe needs to focus on being on the sweeter side with the use of apples and apple cider but like other reviewers have mentioned it doesn't quite go there (but it should). This recipe sends mixed flavor messages in my view. You can pick this up just by reading the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefGuy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5246384/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-16T22:16:25.08Z",
                "reviewBody": "I really really like this I made a couple minor changes based on the ingredients I had available but I basically followed it bang on and it turned out wonderful! The only major change was I didn't have apple cider so like other reviewers I just added some cinnamon and cloves to give it the right spice:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Niroszyckame",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5003651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-04T13:09:58.17Z",
                "reviewBody": "I used one bone-in chicken breast and a bunch \"leftovers\" from having cut up whole chickens (I always freeze the carcasses as there's still alot meat left on them). I let those boil whole in the soup until fully cooked then shredded and added it back to the soup. I replaced the fresh parsley with dried (that's what I had) and increased the garlic to 2 cloves. Omitted the celery and parsnips, opting for extra carrots, 1 more apple, 1 more potato. Used a yellow onion. The soup is little on the sweet side, which can easily be remedied by using less apple cider and more stock, or using a little hard apple cider with stock instead. I like the tang from the vinegar. I did mash up the potatoes a bit to thicken, and would probably use a few more next time to really make this a stew, as in it's current state it's more like a soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-15T20:11:10.5Z",
                "reviewBody": "Delicious! I did however not add the celery or parsnips (subbed extra carrots); and when I went to my fridge to get the apple cider...gone! So I used enough chicken stock to cover and added 1/4 tsp cinnamon and 1/8 tsp ground cloves to simulate some of the spices in the cider. I would thicken the sauce next time but that's just personal preference. Thanks for a great and interesting recipe for a cold day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BusyBeeTami",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/busybeetami/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-16T23:08:47.887Z",
                "reviewBody": "SO DELICIOUS! I added a few handfuls of peas to add some more color a little more salt and also let it simmer for an hour instead of half an hour so that it would thicken and the potatoes would get more tender. Seriously though this is an amazing recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mostlymango",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4949967/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-21T20:11:10.59Z",
                "reviewBody": "I used this as a base guideline for a stew I made tonight. This alone has some odd things that just do not pair together as it stands it needs to have a balance of savory and sweet and this is not it. If you followed these directions you would end up with a soupy mess with odd ball flavor contrasts. This is what I did since I just received about 48 red apples a couple days ago I cut them up and froze them. I made a base boiling 4 chicken thighs in a pot of water then when cooked through took them out to cut the meat off. I seasoned the water with a tablespoon of soy sauce and then added chicken bouillon till it tasted right. I diced up some baby carrots and a handful of broccoli tossed it in with the diced chicken. I then made some traditional dumplings and added in two tablespoons of corn starch whisked in a half cup of water to thicken it. I added in two cups of diced apples and boiled it for 45 minutes to soften the apples and cook the dumplings. added salt and pepper to taste and it came out great. Why would you add in vinegar? of any kind? that would completely destroy the delicate balance of the sweet and savory! Sweet and Savory not Sweet and Sour!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Robert Gapen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4766491/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-06T12:47:00.687Z",
                "reviewBody": "I just wanted to respond to the CHEFGUY! I haven't made this particular recipe but I have made several others and use the site quite regularly for \"springboard\" ideas. I have never had any negative experiences. I was married to a chef for 8 years and he worked at famous restaurants and hotels. He had a portfolio of tried and true recipes. He NEVER would have resorted to an amateur cooking/ sharing site made a recipe verbatim for the very first time for such an important event as you describe! You sir do not deserve to call yourself a chef and it is YOU that is uninspired not the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Eiler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21154193/"
                }
            }
        ]
    }
]