[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216049/spaghetti-squash-primavera/",
        "name": "Spaghetti Squash Primavera",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1044553.jpg",
            "width": 1938,
            "height": 2594
        },
        "datePublished": "2019-04-02T06:54:11.000Z",
        "description": "This is my version of a recipe that came with my weekly produce basket, which contained several of the ingredients in the recipe. I made a few changes to suit my tastes, and the results were delicious! It makes a great vegetarian main course, or a nice accompaniment to a meat entree.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 spaghetti squash",
            "2 tablespoons extra-virgin olive oil",
            "1 onion, chopped",
            "1 large clove garlic, minced",
            "1 large zucchini, cut into bite-size pieces",
            "1 green bell pepper, chopped",
            "1 tablespoon dried Italian herb seasoning",
            "fresh ground black pepper, to taste",
            "1 ½ cups chopped tomato",
            "¾ cup crumbled feta cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pierce the shell of the spaghetti squash with a fork and place in a microwave-safe dish; cook in microwave on High for 12 minutes. Set aside to cook until cool enough to handle. Slice in half lengthwise; remove the seeds. Use a fork to pull the flesh of the squash away from the shell and place into a large bowl; fluff with the fork to separate the strands as much as possible.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a large skillet over medium heat. Cook and stir the onion in the hot oil until just tender, about 3 minutes. Add the garlic and continue cooking and stirring another 3 minutes. Stir the zucchini and green bell pepper into the mixture; season with the Italian herb seasoning and black pepper. Pour the tomatoes into the skillet. Continue cooking just until the tomatoes are warmed, 3 to 5 minutes. Add the squash to the skillet and toss until evenly mixed. Sprinkle with the feta cheese and toss again to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Joanna Childs Mondragon"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.509803921568627,
            "ratingCount": 102,
            "itemReviewed": "Spaghetti Squash Primavera",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "158.1 calories",
            "carbohydrateContent": "15.9 g",
            "cholesterolContent": "16.7 mg",
            "fatContent": "9.5 g",
            "fiberContent": "2.2 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "238.4 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-10-17T18:41:41.143Z",
                "reviewBody": "As written the recipe needs a little work but with some minor changes it is easily improved to 4-star status.  First, don't assume 12 minutes in the microwave is accurate for your spaghetti squash!  The recipe doesn't specify the size but given the 6-serving yield and fairly large amounts of the other ingredients, I'm assuming the submitter meant \"1 LARGE spaghetti squash.\" If you use anything smaller, microwaving this for 12 minutes will be far too long and you will not obtain the desirable long strands. For ease in preparation and out of curiosity, this was the first time I cooked spaghetti squash in the microwave and I learned just how quickly it can overcook!  I used sweet red bell pepper, rather than green, and with \"primavera\" in its title I didn't find feta cheese the best choice - I used fresh Parmigiano-Reggiano. Also in keeping with \"primavera,\" and since I had them available, I used fresh herbs for the dried seasoning.  Finally, it is not necessary to cook the onions separately, before adding the zucchini and peppers. I cooked all three together, but did not OVERcook, then added the garlic, the tomatoes and finally the fresh herbs. Again, if you use a modest-sized spaghetti squash, DO adjust not only the cooking time, but the amounts of the other ingredients, accordingly. (I didn't use nearly close to 1-1/2 cups of chopped tomato, for example)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-05T00:47:23.24Z",
                "reviewBody": "Quick, easy and healthy! I took some liberties with the recipe based on what I had at hand. I used sliced grape tomatoes, a couple of handfuls of raw spinach, sliced mushrooms, and some marinated artichoke hearts. Also used grated Parmesan instead of the feta. Loved the results!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Helene Pasquin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/456326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T18:54:15.547Z",
                "reviewBody": "I've made this twice. The first time I cooked the spaghetti squash in the oven (see Spaghetti Squash I on this site) because I already had the oven on for something else. This time I followed these directions using an average size squash and it was WAY overcooked after only 10 minutes in the microwave. It was no longer stringy like spaghetti and was very mushy. I didn't have any green pepper so I substituted baby bella mushrooms and that worked so well that I'll use them every time. I also added a bit more seasoning and used only half an onion because we feel like too much onion overpowers the other ingredients. The flavor of this dish was really good even though the dish lacked eye appeal and lost some texture due to the overcooked spaghetti squash. Next time I think I'll cook it for only 8 minutes or in the oven if I have time. BTW you can use canned tomatoes (no added sugar! yuk!) and it's as good as fresh winter tomatoes from the grocery and very economical. (Don't compare with fresh summer tomatoes from the garden or farmer's market of course.) Overall good dish. Just adjust the cooking time in the microwave.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SharonC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2957738/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-11T09:46:26.35Z",
                "reviewBody": "AWESOME recipe!!  I sauteed the onion and garlic in EVOO then set aside.  Put chicken in the pan and seared in a little EVOO and deglazed the pan with some sherry and set that aside.  Then added zucchini and mushrooms and sauteed for a few minutes on high heat added 1/4 cup h2o covered and simmered 2 min.  Uncovered and put all ingredients in pan and added two cans diced tomatoes and chicken broth.  Cooked down and served with parmesean cheese.  AMAZING!!!  Also cooked the squash in the oven.  Cut it in half, seeded it, placed on a cookie sheet face down.  Placed in half inch of water and baked at 375 for an hour.  Was done al dente and perfect!!  Also saved the seeds and roasted like pumpkin seeds, a little bonus with the meal mmmm!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mandy Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12005216/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-03T23:22:14.047Z",
                "reviewBody": "Great recipe. Cooked sqash in the oven instead and added a little fresh basil and crushed red pepper at the end and it was super. Very versatile also would be great with some grilled chx breast tossed in",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "big steve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8173584/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-01T23:55:09.127Z",
                "reviewBody": "This is a super tasty healthy and quick dinner. It would have gone even faster if my squash had not been stubborn (probably took close to 20 mins total to microwave). For the tomatoes I had one to dice and then I added about 1/2 cup of leftover pasta sauce to clean out the fridge. I also added a few mushrooms. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly Rekrut",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1510781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-10T19:35:28.593Z",
                "reviewBody": "This is delicious! I have always just made spaghetti squash with marinara (boring!) so this was a nice change for me. I didn't have bell peppers or feta (which I imagine would be yummy and I'll use it next time) so I used marinated artichoke (as suggested by another user) and fresh Parmesan. My daughter and I LOVED it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3331639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-17T17:21:03.79Z",
                "reviewBody": "This was amazing! My wife and I loved it so much we decided to grow spaghetti squash in our garden next year so we can cook this all the time. It was very easy to make and tastes/smells delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "willie8605",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6384215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-16T16:14:00.187Z",
                "reviewBody": "I roasted my squash in the oven and it came out nicely! I added some kale green bell peppers broccoli and tomatoes. I also used parmesan because I was totally out of feta cheese. This was great for dinner AND the leftovers reheated nicely (while my co-workers curiously asked me what I was eating that smelled so good - ha!) This was a great way to use the veggies in my weekly CSA basket! THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Justice Yost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nashvillenosher/"
                }
            }
        ]
    }
]