[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/706/world-cuisine/european/uk-and-ireland/irish/",
                    "name": "Irish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216071/true-bangers-and-mash-with-onion-gravy/",
        "name": "True Bangers and Mash with Onion Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F815033.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2019-04-02T06:54:12.000Z",
        "description": "Bangers and mash gets its name because sausages used to burst (or bang) while cooking, due to rusk (dried bread) being added to the meat. Mash, meanwhile, refers to the mashed potatoes.  This recipe was a staple at our home in Dublin at Halloween.  It is a very cheap, very traditional supper, and one that truly requires good sausage. Try to use a good quality sausage or perhaps even a bratwurst. Please note that this is a very thin gravy, as is traditional. It will still be very liquidy.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 links pork sausage",
            "2 pounds potatoes, peeled and cubed",
            "¼ cup butter",
            "2 tablespoons milk",
            "1 teaspoon dry mustard powder",
            "salt and ground black pepper to taste",
            "1 tablespoon butter",
            "2 large onions, chopped",
            "6 cups beef broth",
            "2 cups red wine"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 200 degrees F (95 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the sausage links in a skillet over medium-low heat until browned on all sides, about 5 minutes per side; transfer to an oven-safe dish and move to the preheated oven to keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place potatoes into a saucepan over medium heat, cover with water, and boil gently until potatoes are tender, 10 to 15 minutes. Drain and allow to steam dry for a minute or two. Mix in 1/4 cup of butter, milk, dry mustard, salt, and black pepper; mash until fluffy and smooth. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1 tablespoon butter in a skillet over medium-high heat; cook the onions until translucent and just starting to brown, about 8 minutes. Pour in the beef broth and red wine; boil the mixture down to about half its volume, about 10 minutes. Season with salt and black pepper. To serve, place a sausage onto a serving plate with about 1/2 cup of mashed potatoes. Pour the onion gravy over the sausage and potatoes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "wsf"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.64245810055866,
            "ratingCount": 179,
            "itemReviewed": "True Bangers and Mash with Onion Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "516.2 calories",
            "carbohydrateContent": "50.4 g",
            "cholesterolContent": "57.6 mg",
            "fatContent": "19.8 g",
            "fiberContent": "6.3 g",
            "proteinContent": "14.1 g",
            "saturatedFatContent": "10.8 g",
            "servingSize": null,
            "sodiumContent": "1414 mg",
            "sugarContent": "6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-22T22:31:28.443Z",
                "reviewBody": "Amazingly delicious! My family raved about this meal that is full of flavor from every angle. I used Johnsonville Brats and 3 lbs. red potatoes unpeeled. Although the gravy is thin it is very rich and soaks into the potatoes in a delightful way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Savory Susan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3209058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-14T22:07:53.907Z",
                "reviewBody": "This was my first time having Bangers & Mash. It wasn't bad, especially the gravy, but a little too time consuming as written for a simple meal. I would suggest getting the potatoes on the stove first, then brown the sausage, put it in the oven, sautee the onions and start reducing the gravy before mashing the potatoes. Also, it took me at least half an hour to boil the gravy down by half, probably because of the humidity here in Florida. I turned on the A/C to draw some of the moisture out of the air and it seemed to help speed things up. The potatoes seemed a little dry as is, so I tossed in another splash of milk. Adding a splash of beef broth to the potatoes might not be bad, either.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "METROWESTJP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1449997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-18T23:21:40.37Z",
                "reviewBody": "My husband wanted a traditional Irish meal for St Patrick's day, and said this was the best version of Bangers and Mash he has had! Great flavor, and the sauce was awesome..a little on the thin side so I added some cornstarch to it to help thicken it up just a bit. Will definately be serving this on more than just St Patrick's day",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2688599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-07T03:07:40.9Z",
                "reviewBody": "Giving this recipe five stars, even though I made a slight change to save time. I lived in England for a while, and this recipe is PERFECT!!! It's everything I remembered. My change in the timing was to cook the sausage first, then get the onions cooking in the sausage juices while I started the potatoes boiling. Also, to save time on cooking down the gravy, I added 6 cups worth of beef bouillon, but I halved the water and the wine. This made it cook down much faster so that it was ready when the sausages came out of the oven and the potatoes were done. AWESOME RECIPE!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Sterrett Bullock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4972226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-18T23:11:53.437Z",
                "reviewBody": "I've never had Bangers and Mash, so when I ran across this recipe then I knew I had to try it! The red wine sauce is absolutely delicious, but as stated it is a thin gravy. I like mine thick and there was no problem to thicken it up. I used a bratwurst and although it was still good, next time I will try a different sausage. Maybe something like Kielbasa, as I think it would compliment the onion gravy nicely. Of course the choice of sausage is down to preference. No complaints about the mash. I love mashed potatoes and I've never tried adding mustard powder. It gave it a nice little kick! I don't really understand the reviews that say this recipe is time consuming. The most time consuming part is the mash, which takes about 20 minutes to make. I just left the gravy on to simmer while the potatoes were boiling. In under 30 minutes, I had a meal on the table. It doesn't seem like much time to me! I served it with fried cabbage, which rounded it out nicely. This is not a fancy meal, but I'm very happy that I tried it. This is one of those heart warming comfort foods which I will definitely make again and again! Thanks for the great recipe wsf!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Goldana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2007528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-06T19:49:00.423Z",
                "reviewBody": "I'm afraid that the way I made this wasn't exactly traditional, but I had to use what I had and stick to my low-carb diet.  I used whipped cauliflower instead of potatoes and butter-flavored pan spray for the mash, but did add the mustard.  Also I used fresh chicken sausage instead of pork.  Even with the changes this came out great.  I can't wait to get skinny and make it the way it's written.  I just returned from England and didn't meet a sausage I didn't like.  Hence the return to the diet.  This was an excellent recipe, thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-05T00:24:31.847Z",
                "reviewBody": "My husband and I loved this dinner, I only wish I had steamed some cabbage to go with it. My very american and very picky daughters wouldn't eat it, but thats not the food, thats the kids. I also thickened the gravy, after the 10 minutes to cook it down I noticed it was as described and a bit too thin for my taste. I only added about 3T of flour to slightly thicken. Two cups of wine for the gravy, 4 cups of wine for the cook....Thats the way to do it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brenna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2545607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-15T00:32:21.503Z",
                "reviewBody": "Loved it! Soooo good and so easy to make. First time to ever eat an Irish Banger (bought mine at Trader Joe's). The broth was soooo flavorful. I baked french loaves to eat the sausages in & sauted cabbage to go along with this meal and cooked few slices of bacon til crispy to put atop the mash along with the onion gravy. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jlo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8549883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-01T19:03:49.27Z",
                "reviewBody": "So I've made this twice and this is what I have liked so far. I just used the gravy recipe and put it on mashed potatoes! Excellent! I made my own beef broth 3 boullion cubes in warm water. I also followed another reviewer and added a half cup of cold water mixed with corn starch (the more starch the thicker the gravy) I used about3 heaping tblsp. And for the wine I used one called \"red\" which left a very nice bold flavor. I let all that boil On high heat only stirring a COUPLE times. It took about 30 minutes for it to decease to half its volume. But EXCELLENT BROWN GRAVY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vennettes_mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8156229/"
                }
            }
        ]
    }
]