[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16233/meat-and-poultry/turkey/legs/",
                    "name": "Legs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216108/slow-cooker-turkey-legs/",
        "name": "Slow Cooker Turkey Legs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8062249.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2009-10-12T18:19:51.000Z",
        "description": "This makes a yummy mini-Thanksgiving, which my girls and husband love! I serve this with jellied cranberry sauce, quick stuffing, and gravy.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT7H0M",
        "totalTime": "P0DT7H10M",
        "recipeYield": "6 whole turkey legs",
        "recipeIngredient": [
            "6 turkey legs",
            "3 teaspoons poultry seasoning, divided",
            "salt and ground black pepper to taste",
            "6 12x16-inch squares of aluminum foil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Wash the turkey legs, and shake off excess moisture. Sprinkle each turkey leg with about 1/2 teaspoon of poultry seasoning, salt, and black pepper to taste. Wrap the leg tightly in aluminum foil. Repeat with remaining legs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the wrapped turkey legs into a slow cooker with no liquids or other ingredients. Set the cooker to Low, and cook until the meat is very tender, 7 to 8 hours.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Legs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "kmdennis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.37,
            "ratingCount": 100,
            "itemReviewed": "Slow Cooker Turkey Legs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "217.4 calories",
            "carbohydrateContent": "0.2 g",
            "cholesterolContent": "89.1 mg",
            "fatContent": "6.9 g",
            "fiberContent": null,
            "proteinContent": "36.3 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "101.9 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-05-24T22:41:33.09Z",
                "reviewBody": "DANGER!\nHard to give a rating, beause the turkey turns out great, but it MAY kill your crock pot! For that reason, I'm giving it 4 stars, with a few words of caution.\nAlthough I have made this delicious recipe 3 or 4 times, last night was a REAL problem! I mistakenly turned my cooker to high, instead of low. I heard some crackles, and passed it off to the turkey skin, but later that night when I put water in the crock to soak it, I ended up with water all over the counter!  Those sounds were being made by the crock as it cracked!  I called the manufacturer today, and they said that no matter what the recipe says, you should at least cover the bottom of the crock with fluid. I WILL make this recipe again in the future, but will add the fluid and souble check the temperature, in case that's what caused the problem.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1798839/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-05T14:31:50.313Z",
                "reviewBody": "I believe that Allrecipes has edited my original recipe.  The amount of seasoning is approximately 3 teaspoons for all 6 turkey legs--works out to approximately 1/2 teaspoon each leg.  Or, use as much or as little to your liking!  Sorry for the confusion--not sure why the editors changed this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kmdennis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3768301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-14T15:20:19.11Z",
                "reviewBody": "I made this yesterday. I used 1 pkg of legs & 1 pkg of thighs. I sprayed the foil with nonstick spray. Also I sprayed the turkey pieces a little so the seasonings would stick better to the meat. I tried 4 different seasonings out of my cabinet  put a different seasoning on each piece of turkey to see which one turns out the best. After removing the pieces from the slow cooker & removing the foil, the turkey fell right off the bone. The bottom of the slow cooker was full of juices from the turkey pieces. I do believe that the turkey was in the slow cooker TOO long. The skin on the turkey was almost completely gone. When the bones were removed from the turkey they looked like they were all cooked out & dry. The meat was juicy & tender. Next time I make this I'll take the turkey out when the internal temp is 170 degrees in the thickest part of a thigh. Yes, I would make this again. Tom, from Wisconsin",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6165743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-04T12:27:06.26Z",
                "reviewBody": "I like the idea and the simplicity but it is way too heavy on the poultry seasoning. Next time I will use about 1/2 to 3/4 teaspoon per leg. Definitely remove the skin before serving. I also plan to wrap in some cubed potatoes and carrots with each leg. 2/4/12 - Now that the recipe has been corrected this goes to 5 stars for someone who does know the difference between a tablespoon and a teaspoon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JVN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1475245/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-22T18:57:55.28Z",
                "reviewBody": "This recipe was pretty good. I rated it four stars because I love turkey and it is awesome that I can skip the oven and make it in my slow cooker. Minus one star because of the nature of cooking the turkey legs for that long. The bone starts to splinter off and if you take bites you get slivers of bone in your mouth. So, when plating, cut the meat off and serve without the bone. It's disappointed because one of my favorite things about turkey legs is picking up the leg and eating it like I'm a lord in a medieval castle...lol. But, what can you do? \n\nIn short, good, moist turkey that needs to be served off the bone. this is important if cooking for kids or company.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachael Dang",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8599094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-03T02:07:25.913Z",
                "reviewBody": "This was delicious. Instead of putting the foiled turkey legs in a dry cooker I placed a cup of water in the bottom and used a trivit to put the turkey legs on therefore ensuring the cooker had some liquid and would not be damaged. I also used all purpose seasoning which I sprinkled over the legs before wrapping in foil. I certainly will be cooking these up again. Thank you for posting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorraine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7201761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-09T04:04:36.337Z",
                "reviewBody": "What a great way to cook Thanksgiving style turkey on any night of the week. I cooked 3 legs, which ranged from sorta small to pretty darn big, for 6 hours. They were all tender and moist.  The skin was gross though, so you definitely want to remove it before serving these for dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JasLak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-29T02:14:36.887Z",
                "reviewBody": "This is the BEST crock pot turkey-in-foil recipe EVER! I used my own spices & herbs (or you could marinate overnight if you choose). After rinsing the turkey I took my spices & herbs and rubbed them all over each piece, wrapped each leg (or thighs & legs we prefer dark meatbut you can use breasts as well) into a piece of foil. Fold the foil into a \"pouch\" and toss them into the crock pot. Cook for 8 hours on low. When it's fully cooked your dinner is ready and it is super tasty and so tender it just fell off the bone! Word of caution - be careful when opening the pouches, they can get steamy. I'll use this recipe again & again! Great for when you just feel like some turkey and it isn't the holidays (or even for the holidays if you're not cooking a whole turkey). You can also use this for cooking chicken as well. I like to 'over cook' the amount I need, let it cool, & strip it from the bone, put the meat into freezer bags and when your ready for some turkey or chicken salad, or some yummy lunch meat just thaw it out and you've got a whole bunch of really delicious versatile meat! Much cheaper than buying it packaged from the grocery store and much healthier for you and your family too! I think the key here is to experiment with a variety of spices and herbs. You can make lemon or teriyaki chicken, or BBQ'd turkey or chicken by just dribbling a little BBQ sauce onto the meat into each \"pouch\". There are just endless ways to spice up this delicious fast and easy meal maker!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chillytoes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13039243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-15T20:11:12.263Z",
                "reviewBody": "This was good. I just eyeballed the seasonings and made sure the turkey legs were well coated. I sprinkled with poultry seasoning garlic salt pepper and some Tony Chacheres Creole Seasoning (which is really good to use in place of salt as it gives a lot of flavor). Wrapped in foil and put them in the crock pot for about 5 hours. They were falling off the bone. I liked having them wrapped in foil because it made for easy transfer and cleanup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lizzi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4088763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-03T18:55:59.147Z",
                "reviewBody": "For those of you who are confused by the measurements for the poultry seasoning; 3 tsp = 1 TB. If you divide the 3 TB by the 6 legs you will get 1.5 tsp per leg. Hope this helps with the confusion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "NY2AZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1741971/"
                }
            }
        ]
    }
]