[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1998/bread/quick-bread/biscuits/",
                    "name": "Biscuits",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216438/gregs-southern-biscuits/",
        "name": "Greg's Southern Biscuits",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F568652.jpg",
            "width": null,
            "height": null,
            "caption": "Greg's Southern Biscuits"
        },
        "datePublished": "2019-04-02T06:54:22.000Z",
        "description": "Light and fluffy and the closest thing I've found to my grandmother's biscuits. Delicious for jams, butter, honey, corn  syrup, or just great bread for any meal. My grandmother used to make them pretty much every day.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "8 biscuits",
        "recipeIngredient": [
            "½ teaspoon lard",
            "2 cups all-purpose flour",
            "¾ teaspoon salt",
            "¼ teaspoon baking soda",
            "2 teaspoons baking powder",
            "2 tablespoons butter, frozen",
            "2 tablespoons lard, frozen",
            "1 teaspoon bacon drippings",
            "1 cup buttermilk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet with 1/2 teaspoon of lard.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together the flour, salt, baking soda, and baking powder in a bowl. Grate the frozen butter and 2 tablespoons frozen lard into the flour mixture with a cheese grater; stir lightly 1 or 2 times to mix. With your fingers, make a well in the middle of the flour mixture, and pour the bacon drippings and buttermilk into the well. With just the tips of your fingers, stir lightly and quickly to just bring the dough together before the butter and lard melt. Dough will be sticky.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape dough out onto a floured surface, and gently pat the dough flat. Sprinkle the top of the dough with flour, and fold it in half; pat down, fold again, and repeat until you have folded the dough 4 or 5 times. With a rolling pin, roll the dough out to a square about 1 inch thick. Cut the biscuit dough into rounds with a 2 1/2-inch biscuit cutter or the floured edge of a drinking glass by pushing straight down (twisting the cutter will seal the edge and keep the biscuits from rising). Lay the biscuits onto the prepared baking sheet so the edges just touch.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until risen and lightly golden brown, 15 to 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Biscuits"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "GregWmson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6722222222222225,
            "ratingCount": 180,
            "itemReviewed": "Greg's Southern Biscuits",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "188.9 calories",
            "carbohydrateContent": "25.6 g",
            "cholesterolContent": "12.7 mg",
            "fatContent": "7.5 g",
            "fiberContent": "0.8 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "433.4 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-02T12:31:05.137Z",
                "reviewBody": "Disclaimer, This is my recipe. I  just wanted to pass on some tips.  First off.  Stick to the recipe, please don't alter it, then rate it, as its no longer mine. \n\nDo not over work the dough, flatten out gently, dust lightly with flour, (will be sticky) pat gently and then fold again, repeat, you should only do it 4-5 times max, any more and your dough will comes out flat, dense, and chewy.  \n\nIf they don't turn out like that, you more than likely overworked the dough, or need fresh baking powder/soda  \n\nThese rise about an inch on avg.\n\nRemember the key is, handle the dough as lightly and as little as possible.  \n\nA Tip:  To make buttermilk just add a 1 tbs of white vinegar to a cup of milk. Let sit for 5 minutes, and you now have buttermilk.  \n\nTo keep the lard/butter from clumping, grate directly over the flour moving it around as you grate and give a little stir if you see it clumping. \n\nBTW Grandma always sifted her flour, I did not,  \n\nI've eaten a lot of country food. This is the best biscuits I've ever had.  If yours don't turn out delicious, please try again, as something went wrong.  It's worth it.  Btw- These biscuits should be soft in the middle and have a very light crunch on the top. Grandma's words about biscuits, it largely comes down to feel and texture of the biscuit when it is kneaded perfectly with the right moisture to flour ratio and that comes only with a little practice. Enjoy! WARNING: this is NOT health food,   Please judge solely on taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GregWmson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4170238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-13T02:36:40.29Z",
                "reviewBody": "I have made these biscuits twice now - both times within ONE week! Originally, I am Southern-raised from NC, now living in CA, and I had been looking for some good old-fashioned Southern buttermilk biscuits to make for myself since they are basically nowhere to be found in Northern California. I stumbled across this recipe and couldn't wait to try it! I made a few substitutions - namely, instead of lard, I used 100% vegetable shortening. The first time, I made these exactly as the recipe stated. I was pleased overall with the consistency and the texture of them - just as the recipe described - but I felt it was missing something for my personal taste - namely, I thought the taste was a bit too... floury. I wanted more of a melt-in-your-mouth buttery flavor. The second time I made these, I used way more butter than shortening, in fact, I nearly doubled the amount of butter that I put into them (hey, I'm from the South - I enjoy my buttery buttermilk biscuits!) and they turned out phenomenally! In retrospect, I realized that I should have perhaps bought and used butter-flavored shortening instead of flavorless, but that's what recipes are for - trial and error. I highly recommend using mostly butter in them, however, because the flavor is so moist, decadent, and reminds you of home. I froze my butter and shortening beforehand and just used a cheese grater to grate the desired quantities into the recipe. I highly recommend doing that, as well - the biscuits come out so fluffy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MessyCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7182032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T18:31:18.167Z",
                "reviewBody": "Because I don't have lard, I used vegetable shortening (Crisco). I saw the submitter's suggestion to add two teaspoons of baking powder which is good because if I hadn't seen that, I don't think they'd have turned out as well. The bacon drippings was genius--it added just a hint of bacon flavor that really made these biscuits good! We all loved these and there are no leftovers. Next time, I might omit the lard and just use bacon drippings. That was a money idea. Thanks, Greg!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-20T19:16:28.72Z",
                "reviewBody": "I've been trying to make homemade southern buttermilk biscuits for years and they never turn out well, no matter what recipe I try.  These turned out perfect and my husband is devouring them and moaning with happiness as I write this!  Thank you, thank you for this wonderful recipe and the tips on making great biscuits.  This is life changing in our home!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Athena E",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4358807/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-02T12:56:15.417Z",
                "reviewBody": "Holy Cow! Best biscuits I've had in twenty years.  These really are southern style.  No, its not health food, or gluten free, or made with canola oil, but man if you love authentic southern style biscuits, these are it!!  I'm scratching my head at some of these reviews though, they rave about the flavor, then complain about the ingredients used.  Which is downright silly and a bit unfair to the submitter since it clearly list the ingredient, the fat content, the calorie count and everything else.   This is truly southern style, in the south we use lard, and lots of butter and salt. If you want healthy biscuits, I suggest people do a search for HEALTHY/GLUTEN Free Biscuits.  Grandma Mary would be proud of these.  One thing I noticed though, make sure that butter and lard are frozen hard, else its going to stick to the grater.  I'm going to go scoop up a bunch of  tbs of lard and keep it in my freezer now.  This is now a new Sunday Brunch tradition.  I wish I could give this 10 stars, they really are that good.  Thanks Greg!! I've been looking for this recipe for 20 years!!  After using this site for the last 6 months in a lurking state, I felt so compelled to rate these biscuits, I had to sign up to let people know, this is the biscuit recipe your looking for and they really are easy and fool proof if you follow the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SouthernDrawl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9232427/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-01T18:46:00.377Z",
                "reviewBody": "Just made these tonight, all I can say is, they turned out PERFECT. Thank you for the recipe, I changed NOTHING!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SilkSmoke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1683294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T23:36:22.47Z",
                "reviewBody": "Really good southern buttermilk biscuits.  They aren't quite my grandmothers (what I am searching for) but the closest thus far.  I'm certain with a few changes I will finally be able to replicate Maw's! Thanks Greg!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Houseof5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4185107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-07T18:33:06.883Z",
                "reviewBody": "I loved these biscuits.  Mine usually come out \"ok-ish\", nothing special. These, however, made me feel like i've finally found THE recipe! They are so light inside but with a ever so light cruntch on the top. Thanks for this great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sheryl Gardner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5008627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T18:45:14.047Z",
                "reviewBody": "Really, really delicious! I didn't have lard and ended up using vegetable shortening - I have a feeling they would have been even better with the lard, but they were great with the shortening, too. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claireschmieder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2708640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-07T18:10:37.053Z",
                "reviewBody": "these were ok for me im sorry grandmas angel biscuits just cant be beat now if i could just find the recipe for them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracey Parker Bustamante",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6526128/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Greg's Southern Biscuits",
            "description": "A true take on a southern style biscuit.",
            "uploadDate": "2018-01-15T17:55:39.055Z",
            "duration": "PT1M24.151S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6096daea-d9ba-4931-9b0d-e04be070a701%2Fb5e50958-40ea-473f-bbd2-ba4eaa12d63b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5711920139001"
        }
    }
]