[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/261/main-dish/ribs/",
                    "name": "Rib Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216524/cherry-balsamic-short-ribs/",
        "name": "Cherry Balsamic Short Ribs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F955766.jpg",
            "width": 2466,
            "height": 2470
        },
        "datePublished": "2019-04-02T06:54:25.000Z",
        "description": "This is one of my favorite comfort foods. They are sweet and tender and full of flavor. They go great with roasted garlic mashed potatoes!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 ribs and sauce",
        "recipeIngredient": [
            "3 pounds beef short ribs, trimmed",
            "salt and ground black pepper to taste",
            "4 tablespoons olive oil, divided",
            "1 onion, chopped",
            "2 stalks celery, chopped",
            "2 carrots, chopped",
            "1 bulb fennel, sliced",
            "1 cup Burgundy wine",
            "3 sprigs fresh rosemary",
            "8 sprigs fresh thyme",
            "3 bay leaves",
            "2 ½ tablespoons beef demi-glace",
            "4 cups chicken stock",
            "1 cup cherry cola",
            "⅓ cup balsamic vinegar",
            "2 cups pitted frozen tart cherries, thawed",
            "1 tablespoon butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle the short ribs with salt and pepper. Heat a heavy cast-iron pot or Dutch oven over medium heat until it just begins to give off wisps of smoke; drizzle in about 1 1/2 tablespoon of olive oil. Sear 3 ribs in the hot oil until golden brown on all sides. Heat pot until smoking hot again, drizzle in 1 1/2 tablespoon of olive oil, and sear the remaining ribs as before. Transfer ribs to a plate and set aside. Discard used oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place remaining 1 tablespoon of olive oil in the pot over medium heat, and stir in the onion, celery, carrots, and fennel. Sprinkle with a pinch of salt, and cook until the vegetables are soft and the onions are translucent, stirring frequently, about 8 minutes. Pour in the Burgundy wine; scrape and dissolve all the browned flavor bits from the bottom of the pot. Bring the mixture to a boil, and cook until the liquid is reduced by half, about 10 minutes. Stir in rosemary, thyme, bay leaves, and demi-glace; stir well. Mix in the chicken stock, cherry cola, and balsamic vinegar. Push the short ribs into the vegetable mixture so they are about halfway covered; spread cherries over the ribs. Pour any meat juices over the cherries, bring the short ribs to a boil over medium heat, and cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the covered pot into the preheated oven, and cook until the meat is tender and falling off the bones, 3 1/2 to 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the ribs to a serving platter. Skim fat from the cherry sauce, and strain all the cherries, vegetables, and juices through a fine-mesh sieve into a bowl. Discard the solids, and return the liquid back to the pot. Bring to a boil, and cook the sauce over medium heat until thickened, about 10 minutes, stirring frequently; whisk in butter. Serve sauce over the short ribs.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rib Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Amanda Hutton"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.659574468085107,
            "ratingCount": 47,
            "itemReviewed": "Cherry Balsamic Short Ribs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "539.7 calories",
            "carbohydrateContent": "25.5 g",
            "cholesterolContent": "97.8 mg",
            "fatContent": "30.1 g",
            "fiberContent": "3.7 g",
            "proteinContent": "34.6 g",
            "saturatedFatContent": "10.4 g",
            "servingSize": null,
            "sodiumContent": "734.3 mg",
            "sugarContent": "15.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-07-05T17:19:05.397Z",
                "reviewBody": "Let me start out by saying this:  We rarely eat beef at our house, maybe 6 times a year tops.  This recipe was so delicious, my husband ranked it as one if the best things I've ever made AND he was looking for more when we were finished!  I made it exactly as written, with the exception of discarding the veggies and cherries after taking the ribs out of the oven.  When you work hard at it, why throw away the delicious flavor from those ingredients?  Just pick out the bay leaves and herb stems, and serve with the ribs.  Divine!  Worthy of company, worthy of family dinner, and worthy of a 10 star review. Thanks so much for a delicious dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-11T19:21:47.17Z",
                "reviewBody": "This recipe took some time but it was WELL worth it.  I made it exactly how it was written and I'm so glad I did.  Great tasting, tender, the gravy was awesome on potatos.  LOVED it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chelsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2443034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-29T04:38:26.423Z",
                "reviewBody": "Excellent recipe. I substituted 1 (24) oz jar of Trader Joes dark Morello cherries in light syrup for frozen cherries and cherry soda with superb results.\n\nI cooked this a day ahead and skimmed the fat off the sauce before reheating. It would make an excellent dish during the holidays when you want to have as much as possible prepared in advance. Serve with yams, green beans, rosemary bread and a Pinot Noir wine. \n\nEnjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LaurelAnn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8239758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-06T00:16:21.89Z",
                "reviewBody": "Very good!! Will make again. I used 2 cans cherries then used juice from the can in addition to the wine in deglazing. I used my pancake griddle to brown everything--best way to do it everything is spread apart so it doesn't lose juice only nicely brown. I really browned the veg to give flavor to the stew used no fennel can't stand the stuff! I dbld the bay and used beef consomme instead of demiglace. Also used beef broth instead of chicken not sure why you would use chicken in this dish. 2.5-3h was more than enough the meat was way over done at 4h.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren Linton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2379359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-05T20:51:54.953Z",
                "reviewBody": "I found some discounted short ribs at my favorite supermarket and was looking for a recipe that didn't involve tomatoes. This was fabulous! I followed the advise of another reviewer and used a jar of Trader Joe's morello cherries with their juice instead of the cherry cola and frozen cherries. I also left out the rosemary (I can't stand it) and the fennel. Also beef demi-glace is very difficult to find and when one does find it it is very expensive. I just used a can of beef consume which I reduced and that seemed to work fine. I couldn't bring myself to discard the vegetable and cherry solids. Why spend the money on the cherries just to throw them away? So I served them on the side. This was an incredible dish and my husband and I finished every scrap. Thank you for the recipe foodlover83!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-03T01:35:24.067Z",
                "reviewBody": "This was delicious and the meat was melt in your mouth tender. I made my own demi-glace (much cheaper than buying the stuff) by using a can of beef consomme and a tbsp of butter. I boiled it until it was reduced to about 1/4 cup. Then I mixed 1/2 tsp corn starch with a tbsp of water and added it the reduced consomme and cooked until thickened. I also had to used a can of pitted tart cherries - as they were out of frozen at the store. I did not use rosemary or fennel because I don't like them. I used a Pinot Noir. No reason to spend a bunch of money on Burgundy wine but spend enough so you want to drink what is leftover:)After browning the first 1/2 of the ribs it wasn't necessary to add more oil to brown the other 1/2. I also used the fat that remained in the pan to saute the veges. I gave this recipe 4 stars because it only took 2.5 hours. They would have been overcooked had I left them for the 3.5-4 hours as suggested in the recipe. Also there was just way too much liquid imo. Next time I am going to reduce the chicken broth by 1/2 and see how that turns out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Life Tastes Good",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mmyers168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-24T08:27:54.293Z",
                "reviewBody": "I made these for my boyfriend's birthday and they were AMAZING. The house smelled insane while I was preparing them - I felt like a chef. That being said I couldn't really detect the cherry-based ingredients in the finished product. Just savory and delectable gourmet short ribs. I think next time I will decrease some of the chicken stock and add the juice from the cherries instead (recipe didn't say to add it and by the time I added the cherries there was already a scary amount of liquid in my French oven). I will DEFINITELY make these again next time for company. I served mine with caramelized shallot smashed potatoes and a green apple-gorgonzola-walnut salad. Thank you foodlover!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Button Love",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2085619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-29T17:08:08.533Z",
                "reviewBody": "This was so delicious! I made it exactly as the recipes says and was great. Really not difficult just some prep work involved. I saved the sauce and have put it on everything!! My husband doesn't even like cherries but LOVED this. Planning this for Christmas dinner now!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cryan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8042705/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-05T18:37:14.41Z",
                "reviewBody": "Excellent recipe! I followed the recipe except for omitting the fennel ( I'm scared of it) and the rosemary. It came out a rich dark mahogany color and the taste was out of this world good. I was driving him crazy with the smell of it cooking all afternoon he kept asking when's dinner! I served it with buttered egg noodles and hubby can't wait for the leftovers. A must try if you like short ribs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Missy Kitty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/missykitty/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-06T18:56:13.48Z",
                "reviewBody": "The ribs were fall off the bone tender and tasty but a lot of time and energy not to mention the cost.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda116",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145703/"
                }
            }
        ]
    }
]