[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13387/main-dish/pork/pork-chops/baked/",
                    "name": "Baked",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216871/pork-chop-and-rice-casserole/",
        "name": "Pork Chop and Rice Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F877056.jpg",
            "width": 4320,
            "height": 3240
        },
        "datePublished": "2019-04-02T06:54:40.000Z",
        "description": "This simple recipe was handed down to me from my grandmother.  She was a fabulous cook that could master elaborate dishes, but she also taught me how to make some easy and delicious meals. Slow baking makes this a 'fall of the bone' dish with even tougher cuts of pork!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT2H10M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "4 pork chops",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "1 (10.75 ounce) can  condensed cream of celery soup",
            "1 cup milk",
            "1 cup uncooked instant rice",
            "½ cup butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F (135 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a large skillet over medium heat, and brown the pork chops on both sides, 5 to 8 minutes per side. Place the chops into a 9x13-inch baking dish. In a large saucepan, whisk together the cream of chicken soup, cream of celery soup,and milk until smooth. Stir in the rice, and add the butter; bring the mixture to a boil over medium heat, and stir until the butter has melted. Pour the rice mixture over the chops; cover the dish with foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until tender, about 2 hours.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes",
            "Baked"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "cdrewcia"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.456692913385827,
            "ratingCount": 127,
            "itemReviewed": "Pork Chop and Rice Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "716 calories",
            "carbohydrateContent": "33.2 g",
            "cholesterolContent": "143.5 mg",
            "fatContent": "51.1 g",
            "fiberContent": "0.9 g",
            "proteinContent": "30.4 g",
            "saturatedFatContent": "22.8 g",
            "servingSize": null,
            "sodiumContent": "1312.6 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-08T17:29:58.323Z",
                "reviewBody": "Simple and good recipe.  As a personal preference I added sautéed onion and garlic to the sauce also will cut the butter just a bit next time.  Adding ¼ cup Sherry, as suggested, was nice.  I’m looking forward to trying some different soups next time, perhaps cheddar cheese and cream of potato.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gilligallo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3958985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-07T16:36:18.903Z",
                "reviewBody": "Oh my! I have made this so many times and it was from my gram also. I only recently did the rice on the side (low carber) Of course I love it best cooked with the rice! I also was told to add dry sherry into the soup to taste and it is great with or without it. Loved this for decades!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3953734/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-07T18:41:55.53Z",
                "reviewBody": "This recipe is great BUT they have come out w/ some really amazing creme soups, ie garlic and mushroom and this is really wonderful as a twist to this recipe. Creme of mushroom by its self is also wonderful. I usually add some seasonings to mine too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/andrea2/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-24T18:30:25.987Z",
                "reviewBody": "I'm givinig 4 stars because I feel it does need some changes.  Instant rice would never work for this dish.  Like other reviewers, I used regular long-grain rice and it was nearly mushy even then.  I'm sure it also needs a bit of spice as there is none in the recipe at all.  \n\nMy package of chops had six in it, so I used them all.  I dusted the chops with flour before browning, although I didn't need to...that was force of habit, I hadn't realized the recipe didn't call for it and I'm sure it wasn't necessary.  I put a bit of salt and pepper on the chops while browning and sprinkled the browned chops with garlic salt in the baking pan.  \n\nI lightened it up a LOT, used FAT FREE cream of chicken and celery soup, SKIM milk and NO butter.  I was a little worried about that, but it came out creamy and rich tasting.  I just mixed the soups and milk in a bowl with a wisk - no cooking - added about a teaspoon and a half of ground rosemary, and a small can of mushrooms including liquid.  Then I stired the rice in - maybe slightly over 1 cup.  I did cook at about 275 or 300 degrees for about 2 hours.  It was terrific and will definately be in the regular meal rotation from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alice Shockley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/87682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-20T00:44:29.5Z",
                "reviewBody": "I've been making this comfort food for years! Tonight, I discovered too late that I didn't have any instant rice. I improvised with a box of Uncle Ben's long grain and wild rice, using only half the spice packet. Adding sliced mushrooms and french-cut beans half way through the baking time made this dish really tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OneNonBlonde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5689993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T23:26:05.833Z",
                "reviewBody": "Made this for dinner tonight. The chops were fall apart tender! The dish tasted amazing! I made exactly as written. Will definitely be making again! Thanks for a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sharon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3766689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-27T00:50:18.313Z",
                "reviewBody": "YUMMY! Just the recipe I was looking for! My mom made pork chops like this when I was little and this recipe brought back great memories! If you made it just as the recipe states I am sure it would be superb!  I added pepper, garlic powder to the pork chops while they were browning just to give them a little extra flavor.  Also I wanted to make sure the rice wouldn't get mushy so used 1 cup regular long grain rice instead of instant and I added an extra half can of cream of chicken soup and another 1/3rd cup of milk so there would be plenty of liquid for the rice.  We loved the rice that went along with the pork chops! Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pinkzinnias",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4771901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-06T16:23:09.957Z",
                "reviewBody": "So GOOD!  As others I added Sherry (1/4 cup, reduced milk my a 1/4 too) and about 2 TBS crushed Rosemary to the soup mixture.  I used the Chicken and Celery soup....AMAZING!  Suggestion is to use regular (instead of instant) rice.  It was perfect when it came out and not mushy as some of the others have complained!  TRY IT...You won't regret it I promise!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Luvstyx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wendyraewalker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-16T23:06:28.023Z",
                "reviewBody": "I thought this was excellent!  Great way to cook pork chops so that they are tender & not dry.  The 3 of us in the house loved it!  I did season the pork chops with salt, pepper & garlic powder before I browned them.  And I also added about a tablespoon of crushed rosemary into the rice, milk, soup mixture.  It was really good.  The rice was a bit mushy, but it's instant rice, of course it was going to be mushy.  I wonder if I use converted rice, would it hold up better??  Still very very good recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1639808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-15T22:21:32.877Z",
                "reviewBody": "As written I think this recipe was a little bland and greasy. It is a good base and the pork chops were definitely tender but not a lot of flavor. This makes a TON of rice so I would try to add one or two more pork chops in to help even out the leftovers. I would also do as some other reviewers have suggested and add some onion to the pan after you brown up the pork chops. For a recipe with such sodium heavy condensed soups I'm sad to say that it needs salt to improve it. I would also cut the butter in half. Mine pooled up in areas and just seemed excessive. One other note; I didn't have instant rice so I used regular long grain. I checked the dish about half way through to make sure there was still enough liquid since regular rice absorbs more than instant. I had to add about a cup of water but in retrospect I would maybe add chicken stock instead and at the beginning if you are using regular rice to add more flavor. On a good note my husband and 3 year old liked this as written but they aren t too adventurous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Martin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1553296/"
                }
            }
        ]
    }
]