[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/672/meat-and-poultry/pork/sausage/",
                    "name": "Sausage",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216885/cindis-jambalaya-cajun-pot-pie/",
        "name": "Cindi's Jambalaya Cajun Pot Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6438429.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2019-04-02T06:54:41.000Z",
        "description": "This is a great recipe to warm up a winters day, just an awesome twist to an ordinary chicken pot pie. Just enough spice and heat with the flavor of Cajun jambalaya throughout. It will have them coming back for more and more.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT2H5M",
        "recipeYield": "1 pot pie",
        "recipeIngredient": [
            "¼ cup canola oil",
            "1 (16 ounce) package kielbasa sausage, cut into 1 inch pieces",
            "1 pound cooked chicken meat, shredded",
            "2 tablespoons Cajun seasoning, or to taste, divided",
            "2 tablespoons Cajun blackened seasoning, or to taste, divided",
            "1 onion, chopped",
            "3 stalks celery, chopped",
            "1 large green bell pepper, chopped",
            "¼ cup all-purpose flour",
            "2 quarts chicken broth, or as needed",
            "1 ½ cups uncooked white rice",
            "1 pound uncooked medium shrimp, peeled and deveined",
            "1 tablespoon ground black pepper, or to taste",
            "1 tablespoon cayenne pepper, or to taste",
            "2 (9 inch)  prepared pie crusts",
            "1 beaten egg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat canola oil in a large saucepan, and cook the kielbasa sausage and chicken meat over medium heat until the sausage has browned, about 10 minutes. Sprinkle the meat with 1 tablespoon of cajun seasoning and 1 tablespoon of blackened seasoning as it cooks. Remove the sausage and chicken from the pan, and set aside. Cook the onion, celery, and green bell pepper in the hot oil until the onion has turned translucent, about 5 minutes, sprinkling with 1 more tablespoon of Cajun seasoning and 1 tablespoon of blackened seasoning. Remove the vegetables with a slotted spoon, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make a roux with the oil left in the pan by sprinkling it with the flour. Whisk the flour and oil together, and cook over low heat, whisking constantly, until the mixture is a pale brown color. This could take up to 15 minutes; watch carefully so the roux doesn't burn. Slowly whisk in the chicken broth, about 1/2 cup at a time, to make a thin, smooth gravy. Bring the gravy to a simmer, mix in the cooked sausage, chicken, and vegetables, and cook until slightly thickened, about 20 minutes, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the rice into the gravy mixture, and simmer until the rice is almost tender, about 15 minutes; mix in the shrimp and cook until they are opaque and pink, 5 to 10 minutes. Season the filling with black pepper and cayenne pepper; remove the filling from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fit a pie crust into 1 9-inch pie dish; brush crust with beaten egg, and poke holes all over the crust with a fork. Bake in the preheated oven for 3 minutes. Fill the parbaked crust with the jambalaya filling, top with the second crust, and pinch and crimp the edges of the crust together with a fork. Brush the crust with more beaten egg, and cut several steam slits into the top of the crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the crust edges begin to brown, 10 to 15 minutes. Line the edges of the crust with foil, and bake until the whole crust is golden brown, about 5 more minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Sausage"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "aaron cindi"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.5,
            "ratingCount": 4,
            "itemReviewed": "Cindi's Jambalaya Cajun Pot Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "840 calories",
            "carbohydrateContent": "60.5 g",
            "cholesterolContent": "194.3 mg",
            "fatContent": "48.1 g",
            "fiberContent": "3.9 g",
            "proteinContent": "38.2 g",
            "saturatedFatContent": "14.8 g",
            "servingSize": null,
            "sodiumContent": "1572.2 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-10-18T20:26:32.13Z",
                "reviewBody": "I really enjoyed this but man is it filling once you add crust to the jamablaya! Also the bottom crust got a little soggy. Next time I will probably do away with the bottom crust and just go for the top. I also like to add tomatoes to my jambalaya so I iwl likely make that addition as well. Overall nice and creative use of leftovers for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2683147/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-03-07T10:40:35.703Z",
                "reviewBody": "Not sure how to accurately rate this recipe. Flavor wise this was great. Presentation wise not so much. For starters this is very expensive to make. Secondly this makes enough filling for 3 pies and that is before you even add the rice to the mix. On the rice note mine sunk to the bottom of the crust and basically became part of the crust. Tasted good but looked horrible. Neither the top or the bottom crust held together once you cut into it. This would have been better made into individual pot pies and not one big pie for sharing. Or should I say 3 pies for sharing? No way no how can you get all of this filling into one nine inch pie. It is impossible. With all of that being said the flavor is great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Soup Loving Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/souplovingnicole/"
                }
            }
        ]
    }
]