[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
                    "name": "Stuffed",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216931/sure-to-fool-em-vegan-stuffed-shells/",
        "name": "Sure to Fool 'Em Vegan Stuffed Shells",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F853445.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:54:44.000Z",
        "description": "Ok, this is my go-to recipe for those skeptics who say vegan can't be fun and flavorful! Oh yeah ... it fools them every time! Yup, even my East Coast/Italian friends! (You know who you are)! Perfect for a potluck, generous enough for a family dinner (maybe even leftovers)! Serve with salad and crusty bread! No one will know it's not ricotta! Get crazy and experiment with other veggies in the tofu mixture like mushrooms, zucchini, peppers, swiss chard, etc. for added flavor and vitamins.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "2 tablespoons crushed garlic",
            "2 (14.5 ounce) cans chopped tomatoes",
            "1 (15 ounce) can tomato sauce",
            "1 (10.5 ounce) container bruschetta",
            "1 pinch salt",
            "¼ cup red wine",
            "3 tablespoons turbinado sugar",
            "1 (16 ounce) package jumbo pasta shells",
            "1 (16 ounce) package extra firm tofu, drained",
            "½ onion, quartered",
            "½ (10 ounce) package frozen chopped spinach, thawed and drained",
            "3 tablespoons pesto",
            "½ (8 ounce) package Mozzarella-style vegan soy cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a skillet over medium heat. Stir in the garlic; cook and stir until the garlic begins to brown, about 5 minutes. Add the chopped tomatoes, tomato sauce, bruschetta, and salt. Cook and stir for 5 minutes, then stir in the red wine and sugar. Simmer for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 400 degrees F (200 degrees C). Spray a 9x13-inch baking pan with cooking spray, then spread layer of the prepared tomato sauce on the bottom of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tofu, onion, spinach, and pesto into a blender. Cover, and puree until smooth. Pour the tofu mixture into a resealable plastic bag. Snip the corner off the bottom of the bag, and pipe the mixture into the pasta shells. Arrange the pasta shells in the prepared baking pan. Pour the remaining tomato sauce over the shells, then cover the pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the pasta shells are tender, about 20 minutes. Remove the foil, and sprinkle the soy cheese on top. Return to the oven and continue baking until the the cheese has melted, about 10 minutes more.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Stuffed"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Connie Fabian Byrnes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.357142857142857,
            "ratingCount": 28,
            "itemReviewed": "Sure to Fool 'Em Vegan Stuffed Shells",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "586.1 calories",
            "carbohydrateContent": "79.5 g",
            "cholesterolContent": "2.5 mg",
            "fatContent": "19.2 g",
            "fiberContent": "6.1 g",
            "proteinContent": "23 g",
            "saturatedFatContent": "5.6 g",
            "servingSize": null,
            "sodiumContent": "1028.1 mg",
            "sugarContent": "14.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-23T17:15:45.36Z",
                "reviewBody": "This is an awesome recipe. For those of you who do not know, the shells are baked without boiling. My daughter has been vegan for 6 months and I am always on the hunt for good tasting and healthy foods. This is a winner but I did change some things, I did not add sugar and I used fresh spinach after processing the tofu with pesto (you can find pesto without cheese at Trader Joe's).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "charsmail39",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9063170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-16T02:49:18.52Z",
                "reviewBody": "Wow! I'm absolutely AMAZED at how DELICIOUS this was. I wish there was a way to give it more than 5 stars! We are new to the Vegan world so we are very selective with what we're eating. EVERYONE in this house - including my picky eater (!) ate this dish. Here's how I changed it for our family -- I doubled the garlic; used crushed tomatoes instead of chopped; omitted the bruschetta (not sure why it was suggested - didn't miss it); left out the spinach (I can't eat cooked spinach or any similar cooked leafy greens) but included it in the side salad; doubled the pesto and used \"Daiya\" brand mozzarella-style \"cheese\" (I refuse to use any other Vegan \"cheese\" as none compares). We are having a houseful of family over next weekend and have already decided this complete meal (shells salad garlic bread and homemade Vegan cupcakes) will be making a return with plenty of seconds I'm sure! A must to try. Oh and about the red sauce - so perfect that I plan to make it for any pasta dishes that call for red sauce! We lapped it up just with our bread as a snack it was so good! Thanks NJChick. You hit this one out of the ballpark. WINNER for everyone... not just Vegans =D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mesa Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4757764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-16T16:28:41.547Z",
                "reviewBody": "I made this for my vegan book club and was disappointed with the recipe. The sauce came out great! Did not stick to the recipe. Did not use sugar in the raw and used white granulated sugar instead. Used about half of the amount of sugar that the recipe called for. Cut back on the choppec tomatoes in the recipe and used more tomato sauce instead. I do not like the idea of a chunky tomato sauce with stuffed shells. So this may be a personal preference. The recipe falls apart with the stuffing. Too much onion and spinach. It just is not worth the time and effort to make. If I was to make this again I would cut back on the spinach not bother with the pesto. (had to make homemade pesto since everything in the supermarket had either parm ch or romano in it) Instead of the onion I would recommend using garlic powder instead. The directions to the recipe call for placing onion tofu spinach and pesto in a blender. Do not do this! You will end up with an unappealing green goo. I recommend blending the tofu with seasonings then adding the spinach to the tofu by hand. This recipe had 5 stars but no reviews. Usually I won't make something unless it has reviews. I decided to make it anyhow. It has potential but needs some tweeking. Overall it was a dissappointment making it for the first time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Sunflowers By The Season",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4063627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-25T02:48:32.557Z",
                "reviewBody": "Fantastic! My family loved this. We're vegans for health reasons not moral ones so I was okay just using a purchased pesto because I didn't figure in only a couple of tablespoons there was enough Parmesan to hurt us. I also used a jarred sauce for ease. This has gone onto our \"win\" list for sure!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wendy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9739793/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-01T05:43:09.243Z",
                "reviewBody": "I tried this recipe after reading the reviews and tweaks.I was skeptical about this recipe after I prepared the filling and tasted it, but my husband and I loved it after it was baked.   I prefer fresh/dried  ingredients to canned so I used fresh chopped tomatoes along with sun dried tomatoes  in the sauce. I also seasoned the sauce with garlic powder, onion salt and  italian seasoning.  I omitted the bruschetta and used agave nectar in place of sugar.  I also used cranberry pomegranate juice in place of red wine. For the filling,  I omitted the onion and added marinated artichokes.  I also used fresh baby spinach. I put the spinach and artichokes in the food processor and processed them until they would not process any more and set them aside. Then I put the tofu in the food processor and added seasoning salt, italian seasoning, garlic powder, salt free all purpose seasoning, and savory blend all purpose seasoning.\nI then folded in the tofu mixture with the spinach/artichoke mixture and also folded in the pesto.  (I think stirring it would have made it a goulish looking mess).  I used an icing spatula to insert the filling into the uncooked pasta shells and arranged then on the bed of sauce, covered them with sause and baked for 20 minutes. I then let it sit in the oven until I was ready to finish baking it for dinner.  When I was ready to finish baking it, I added a top layer of cranberry pomegranate juice on the top of the sauce and baked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Raindropp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4786864/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-24T00:40:42.847Z",
                "reviewBody": "This got raves at my house with just a couple of tweaks!  The previous review was helpful, and I altered the recipe by seasoning the tofu in the blender and then adding the spinach.  I also omitted the onion, and used about twice as much pesto to get a smooth consistency.  Next time, I may blow off the blender and just mush all the filling ingredients up in the plastic bag.  I subbed diced tomatoes w/garlic, basil & oil for the bruschetta, cut the sugar to 1 T (and used white granulated), and used crushed tomatoes instead of the chopped.  And I cut the garlic to about 1 T, as the tomatoes also had garlic.  I did NOT boil the shells at all, and baked it about 30 minutes until they were tender (I used a stoneware baker).  After 20 minutes they were not done when poked, but the added 10 minutes did the trick, so be sure to test!  I used regular Mozzarella, since my vegan kid was not home.  The meat eaters I served it to loved it, and I did not spill the beans about what they were eating!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "alamomom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5407593/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-22T17:23:14.067Z",
                "reviewBody": "This recipe is great as is! I did add a little garlic powder to the tofu and an extra scoop of pesto (just bc I love pesto). And it came out great. I served it to my boyfriend who gave it a 10.5 out of 10 and we both had seconds with half the tray left over. It was also our first time trying tofu and we could not tell the difference. Happy Cooking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sylvia_3740",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7891740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T22:19:48.37Z",
                "reviewBody": "I saw this recipe prepared on Allrecipes.tv and it looked really good - it is! The adults in the house loved it the kids not so much (maybe because they saw the part of the video about sneaking veggies into the stuffing mix... they were suspicious). I really like the pesto in the stuffing I used fresh kale instead of spinach and I added some salt. For the sauce I used only 2 T sugar. I skipped the cheese on top... it was quite awesome on it's own. Thanks NJChick!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Momi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/tacy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-26T00:21:05.09Z",
                "reviewBody": "These were easy to make and the whole family loved them even my picky eater who loves nothing I usually cook!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherri N David Clifton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2226890/"
                }
            }
        ]
    }
]