[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/216934/jims-cheddar-onion-soda-bread/",
        "name": "Jim's Cheddar Onion Soda Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F607521.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2019-04-02T06:54:45.000Z",
        "description": "I begged this recipe from my co-worker when he 'accidentally' mentioned he had a great soda bread recipe.  It was perfect timing, because St. Patrick's Day was only days away!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "2 loaves",
        "recipeIngredient": [
            "4 cups bread flour, plus more for dusting",
            "1 ½ teaspoons salt",
            "1 tablespoon baking powder",
            "6 tablespoons butter, softened",
            "1 ¼ cups buttermilk",
            "2 tablespoons confectioners' sugar",
            "¾ cup finely chopped onion",
            "¾ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, whisk together bread flour, salt, and baking powder until thoroughly combined. Beat in the butter, buttermilk, and confectioners' sugar to make a dough; gently mix in the onion and Cheddar cheese. Divide dough in half, and shape each half into a ball. Place the loaves onto the prepared baking sheet, and gently flatten to about 2 inches thick. Dust each loaf with flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake on a preheated oven until browned, about 30 minutes. Cool on racks for a few minutes; serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Keri"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.542253521126761,
            "ratingCount": 142,
            "itemReviewed": "Jim's Cheddar Onion Soda Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "264 calories",
            "carbohydrateContent": "36.9 g",
            "cholesterolContent": "23.7 mg",
            "fatContent": "9.1 g",
            "fiberContent": "1.3 g",
            "proteinContent": "8.2 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "487.5 mg",
            "sugarContent": "3.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-16T21:58:23.353Z",
                "reviewBody": "Fabulous Irish Soda Bread! I love Irish soda bread and generally only make it once a year. And I'll admit I'm used to the ones that are a bit more on the sweet side - made with raisins or currants best enjoyed with a cup of tea. This was a nice departure! I made it exactly as directed and since no \"type\" of onion was specified I chose the \"green\" onion in keeping with St. Patrick's Day. Plus it's mild and pairs well with Cheddar cheese. Like others I did use a bit more buttermilk but other than that this recipe is perfect. I scored it lightly before popping it into the oven and it baked up perfectly in the alotted time. Keri please thank your friend Jim for this wonderful recipe. It's a definite keeper and one I'll make more than once a year! UPDATE: Made this again (easily becoming a new favorite) and added in a bit of minced garlic and some chopped sun-dried tomatoes...definitely turns soup or salad into a meal! Try it with a little \"Herb Butter\" from this site too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-16T22:26:27.56Z",
                "reviewBody": "I'm happy to be this recipe's first reviewer! This is not your average soda bread - I'm sure no soda bread aficionado, but in my limited experience I've found it to be quite plain and, well, kind of boring - but not Jim's!  This is SO flavorful; and not (duh) just because of the add-ins.  Whether it's the buttemilk,  the touch of powdered sugar or maybe just the right amount of salt I don't know, but this bread really is \"alive\" with flavor.  In addition, I found the bread flour an unusual but great choice - I love the sturdy structure it gave the bread.   I was also a little concerned about the high oven temperature but here, too, it proved itself - it gave the bread a nice crust that I really loved.  When I mixed this up I found I needed to add more buttermilk than called for to make the dough come together, but that was no big deal. I did use the cheddar as directed, but for additional flavor and color I used chopped green onion rather than the regular ol' onion called for and I was very pleased both with how it looked and tasted. Since this was just for Hubs and me I scaled this down to 3 servings and made one, small loaf.  Don't know how the submitter \"scored\" the recipe from Jim, but many on AR will be glad she did. This is one soda bread that should not be limited to St. Patrick's Day baking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-22T21:34:39.37Z",
                "reviewBody": "Hubs said he'd rather have this than dessert. I used green onions and sharp cheddar. Baked exactly 30 minutes. Served with Herb Butter from this site per Jillian's suggestion. Thanks Keri for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Table for Two",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4699297/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-17T17:04:10.433Z",
                "reviewBody": "Made this for Recipe Group and we LOVED it! I was really excited to try this for a few reasons...first today we had our annual St. Patrick's Day dinner and though I always make traditional Irish soda bread I wanted to try a savory version too. Second It just sounded wonderful and third my hubby's name is Jim and I just knew he'd get a kick out of it lol. I halved the recipe to just make 1 loaf because I also made the traditional bread. I also needed to add some extra buttermilk opted to use green onions and did not have bread flour so I used AP flour. This was simple to make and smelled amazing while baking (I scored it with a knife before baking and when I took it out I brushed it w/ melted butter and sprinkled it w/ flour just becasue that's the way I always make my soda bread). I knew this was a true winner when my super picky dad ate like 3 pieces and commented on how good it was! This was a great bread that I will be making a lot! Thanks for sharing this winner Keri!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-17T17:04:09.42Z",
                "reviewBody": "I made this recipe as wriitten but for using all purpose flour. The aroma as it was baking was unreal but I admit I wasn't really expecting it to have quite the equal amount of flavor. I was wrong. Great flavor and a soft airy texture along with a nice crisp crust makes this recipe a keeper. Do expect to have to add more buttermilk as others did - it was neccessary for me to add more. Thanks Jim for generously giving up your terrific recipe for Keri to share here.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-24T00:40:37.15Z",
                "reviewBody": "Made this for the Recipe Group this week. This is the best soda bread I have ever tasted or made. The entire family enjoyed it this evening with our St. Paddy's meal. I didn't realize that I only had 3/4 cup of buttermilk so I mixed up another cup of 2% milk with lemon juice and ended up using all of it (1 3/4 cup total). I had vidalia and green onions and after reading the other reviews I was happy to see that many were using green onions and went with that option. Knowing that my granddaughter is more willing to eat smaller rolls or biscuits I decided to make half of the recipe into biscuits. These cooked in approx. 22 min. The larger half I followed the recipe and that cooked in approx 35 minutes. Mine weren't really browned at that point so I turned on the convection oven for just a couple of minutes and they browned up beautifully. The texture of this bread is wonderful. The flavors of the onion and cheese with a little twang from the buttermilk are delicious. I won't wait until next St. Patrick's day to make this bread again - I know it will be requested often. Thanks for sharing Keri!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T23:26:08.203Z",
                "reviewBody": "Made this for Recipe Group. I couldn't wait! Easy to put together smells wonderful. Taste is really good. I used green onions instead of regular and AP flour. This may have made them a little more dense I will try it again with bread flour. Neighbor came over and tasted one of the biscuits I made with the second ball of dough. She is in love and asked to take some home for dinner LOL! I told her they are really good warm with butter. Thanks Keri!! I love non-yeast bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-15T21:50:11.71Z",
                "reviewBody": "Very yummy bread! I made this exactly to the specifications of the recipe except halved and it was perfect--down to the timing of the baking! Everyone loved this bread. Thanks Keri and make sure you let Jim know that his bread was a total hit! I'll be making another loaf very soon. UPDATE: Today I made these as mini muffins. Half a recipe fit perfectly into a 24-muffin tin. Thing is we preferred it as a bread because the taste was much better even when adding a little more onion and cheese as suggested by the author. The crust was better but the taste was not the same. So the loaf for us!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-16T23:07:55.213Z",
                "reviewBody": "This bread is ridiculously good. Too good. So good that it will make you fat because you won't want to let anyone else have a slice. I'm sitting here with a very full belly after devouring 3/4 of the loaf. Like the last reviewer I used spring onions finely chopped and strong mature cheddar cheese. I'd be interested to know if the confectioners' sugar adds anything that normal sugar wouldn't.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lawrence",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6718551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-22T18:37:15.753Z",
                "reviewBody": "I followed the recipe to a T and didn't enjoy it at all. Looked like a cheddar bay biscuit on steroids. Flavor was very bland. Guess soda bread isn't my fav.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Texastwinkie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/360413/"
                }
            }
        ]
    }
]