[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/250/main-dish/pizza/",
                    "name": "Pizza Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23702/pizza-pinwheels/",
        "name": "Pizza Pinwheels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F732258.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2019-04-02T06:42:13.000Z",
        "description": "This recipe came from my Aunt when I was about 13 years old. Not only is it good for kids, but it's good for parties too!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H32M",
        "recipeYield": "16 pinwheels",
        "recipeIngredient": [
            "1 (8 ounce) can refrigerated crescent roll dough",
            "2 cups shredded mozzarella cheese",
            "24 slices pepperoni",
            "1 (14 ounce) can pizza sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a large baking sheet, pinch the 8 crescent roll dough triangles into 4 rectangles. Layer each rectangle with 6 slices of pepperoni and even amounts of mozzarella cheese. Roll tightly lengthwise and slice each into 4 or more pieces.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown, about 12 minutes. Serve with pizza sauce for dipping.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pizza Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CHRISTI_LANDINO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3698811096433285,
            "ratingCount": 757,
            "itemReviewed": "Pizza Pinwheels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "234.7 calories",
            "carbohydrateContent": "16.4 g",
            "cholesterolContent": "24.4 mg",
            "fatContent": "13.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "11 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "758.5 mg",
            "sugarContent": "3.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-07-14T23:25:40.59Z",
                "reviewBody": "These are awesome! After reading other reviews on messy prep, I finely chopped the pepperoni in the food processor, pulsed in the cheese and a little sauce then spread it over the dough. I used toothpicks soaked in water for 15 minutes (so they don't burn) to secure the logs, popped them in the freezer for 20 minutes then sliced with a very sharp knife. I bake them on their sides on sheets coated with a little cooking spray and ooze was minimal. A snap, and you can make an industrial sized amount in a very short amount of time. The toothpicks worked out great, and made a little handle for dipping. Also fantastic using thinly sliced ham and cheese with a honey mustard dipping sauce, or taco meat and cheddar! Perfect to do and freeze ahead to pop a handful into the toaster oven for late night munchies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonsie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-06T15:10:19.693Z",
                "reviewBody": "I made a few additions to this recipe and it was fantastic!  I diced up pepperoni in some, and added crumbled, cooked sausage to others.  After adding cheese and filling, i seaseoned with italian seasoning and grated romano cheese.  I rolled and added more grated cheese to the outside along with garlic and herb seasoning.  I refrigerated overnight, cut and baked the next day.  Served with homemade marinara...realy impressive!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carmela McCleary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T16:00:46.747Z",
                "reviewBody": "These were fabuous and not hard to make at all when you know how to do it. The first time I tried to work with crescent dough I cried because it turned out so horrible but just put the can in the freezer for 15-20 minutes before you work with it and work quickly and it will turn out fine. I also cut them up beforehand and chilled them for awhile as suggested. They turned out perfectly! I would definitely suggest the marinara or pizza sauce to dip in--it makes it that much better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PRATE002",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/117493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-05T19:40:14.89Z",
                "reviewBody": "This recipe was fantastic!  I made one minor change to the recipe.  Once I rolled and before I cut I sprayed a little butter on top of each and sprinkled with ground oregano.  Nothing heavy, just a touch and they came out PERFECT!  Melts in your mouth.  In fact, the first time I made them the smell alone lured everyone to the kitchen and they never even made it to the table!  \n\nI found that putting the cheese down then the pepperoni on top and leaving about a 1/2 inch without anything helped when rolling.  The pepperonis on top kept the cheese at bay and the extra space allowed everything to squish forward a bit without leaving excess gushing out the end of the roll.  \n\nAlso, the logs themselves freeze just fine, so you can make ahead, then pop out to thaw, slice and cook for a VERY quick and easy appetizer!  \n\nLove this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Trettel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/754765/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-30T18:01:39.57Z",
                "reviewBody": "This is a good make ahead recipe. Chilling the dough after adding the sauce and toppings for a while makes the dough easier to roll up. You can then freeze it and slice it frozen to maintain the shape just as you would a pinwheel cookie. The prepared dough can be frozen away as a log or slices for use at a later date. You don't even have to thaw the slices as they will heat up quickly. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/120781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-26T15:48:07.093Z",
                "reviewBody": "I love this recipe!! I use the garlic flavored cresent rolls and add some pizza seasoning. I also use turkey pepperoni and they still taste awesome. The key is - after you roll them freeze them for a bit (I freeze one roll while working on another) before slicing. This makes slicing them super quick and easy! I make a ton at a time slice and freeze them and then just pull them out whenever we have unexpected company. I slice them very thin (about 8 pieces per roll) and bake them on a pizza stone... easy and fantastic. I serve them with pizza sauce and ranch dressing and they always go fast!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2229214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-30T03:38:20.67Z",
                "reviewBody": "made these the other day, what a hit!! I added the pizza sauce inside the pinwheels, one recommendation though, glaze the pinwheels with an egg wash prior to baking.  It makes them golden and glossy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELIZABETH101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1389471/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T16:46:44.14Z",
                "reviewBody": "I used to make completely \"homemade\" appetizers. Now everybody asks me to bring these (much easier!). If the group is more adults than kids I will use half mozzarella and half pepper jack which can be too spicy for little kids. Tip: I chop the pepperoni up in the food processor and mix it with the cheese makes it easier to slice the rolls. Also DOUBLE it they go fast!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLIE1968",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/598743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T16:46:51.827Z",
                "reviewBody": "These were really delicious! I made them as an appetizer. I used the reduced fat Crescent Rolls and used half mozzarella and half pepperjack cheese. I'm vegetarian so I omitted the pepperoni and added diced onions and a sprinkle of Italian seasoning and garlic powder. I also prepared the rolls the day before I needed them and and froze the logs. When I was ready to bake them I cut each log in half and baked. Next time I will cut each log in half when I prepare them and pinch the open sides closed so that cheese doesn't run out when baking. I served them with marinara sauce and they were a big hit! When I make them again I will try to stuff more fillings in them because the rolls puff up when baked and the fillings remain in the bottom half. But nonetheless I will definitely be making them again. Thanks!:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BANSREEPARIKH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/400771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T21:25:43.36Z",
                "reviewBody": "These were pretty good. I didn't use pepperoni b/c the kids don't like. I also used refrigerated pizza dough in the tube. Freezing works great but cook a little longer to compensate",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "4GiddyGirls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3830826/"
                }
            }
        ]
    }
]