[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217132/beef-roast-in-red-wine-carni-arrosto-al-vino-rosso/",
        "name": "Beef Roast in Red Wine (Carni Arrosto al Vino Rosso)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9158202.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:54:53.000Z",
        "description": "A slow cooker recipe that turns the most economical roast of beef into a tender, succulent, delicious meal. The wine really enhances the flavor of the meat, and non-alcoholic wine can also be used to great success for those who prefer it. Coming home to the aroma of this slow-cooked beef will put you in mind of stepping into a nice Italian restaurant. Very comforting and inviting. Serve over rice or egg noodles.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 small onion, very thinly sliced",
            "3 ½ pounds boneless beef chuck roast",
            "1 teaspoon kosher salt",
            "1 teaspoon freshly ground black pepper",
            "4 large cloves garlic, very thinly sliced",
            "2 cups dry red wine",
            "2 (14.5 ounce) cans diced tomatoes, undrained",
            "1 cup beef broth",
            "1 tablespoon Worcestershire sauce",
            "1 tablespoon dried rosemary",
            "1 tablespoon dried oregano",
            "1 tablespoon dried basil",
            "2 teaspoons dried thyme",
            "1 teaspoon kosher salt",
            "1 teaspoon freshly ground black pepper",
            "3 tablespoons tomato paste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place half the sliced onions into the bottom of a slow cooker. Season the roast on all sides with 1 teaspoon of kosher salt and 1 teaspoon of black pepper, and lay the roast on top of the onions. Place the remaining onions and garlic on top of the roast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix the red wine, diced tomatoes, beef broth, Worcestershire sauce, rosemary, oregano, basil, thyme, 1 teaspoon kosher salt, and 1 teaspoon black pepper; pour the wine mixture over the roast. Cover the slow cooker, set the cooker to Low, and cook until tender, 8 to 10 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If desired, thicken the sauce at the end of cooking by whisking tomato paste with pan juices until thoroughly combined. Set the cooker on High heat, and cook an additional 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lou Kussard"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.147826086956521,
            "ratingCount": 115,
            "itemReviewed": "Beef Roast in Red Wine (Carni Arrosto al Vino Rosso)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "392.8 calories",
            "carbohydrateContent": "9.6 g",
            "cholesterolContent": "90.2 mg",
            "fatContent": "22.6 g",
            "fiberContent": "2.2 g",
            "proteinContent": "25 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "866.4 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-01-31T17:11:14.553Z",
                "reviewBody": "Absolutely delicious! However, I did \"tweak\" this a bit because just by looking at the ingredient list I could tell there was too much liquid and it was way too much seasoning which would be overkill.  First I used a 3 pound bottom round rump roast vs. a chuck roast (personal pref) and placed it on a bed of portabella mushrooms along with the onion after seasoning it with the kosher salt and black pepper. I cut the wine back to 1 & 1/2 cups (used Cabernet Savignon), 2 cans of diced tomatoes (drained), subbed 2 cubes of beef bouillion vs. beef broth, Worcestershire sauce, and added 1/4 cup of balsamic vinegar.  I cut the seasoning down to 1 & 1/2 tsp. each of rosemary, oregano, and basil and cut the thyme down to 1 tsp. I also cut the kosher salt back to 1/2 tsp.  I set the slow cooker on low for 8 hours and let it go.  The smell was Heavenly and just as the submitter states, the aroma is that of a nice Italian restaurant.  Once the 8 hours were up I added a whole 6 ounce can of tomato paste to thicken it up and let it go on high for an additional hour. This was fabulous served with garlic red mashed potatoes and Italian green beans. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-18T01:25:30.273Z",
                "reviewBody": "This was delicious!  I followed the recipe exactly and it turned out great.  \nNext time I will use half the wine, half the broth, and double the onions and tomatoes.  (There was just A LOT of extra sauce at the end.)  \nIt would also be delicious adding some mushrooms towards the end of cooking.  This is a great recipe if you love to cook roasts but want to try it with a twist!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2768124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-11T01:00:49.693Z",
                "reviewBody": "This was excellent but only after fairly significant alterations primarily in measurements. I drastically reduced the amount of herbs even tho I used fresh. Similarly I also reduced the broth wine and tomatoes to about one-fourth of what was called for! To get the tomato taste I knew would really enrich this I threw in a tablespoon of Pure Tomato Powder (this stuff is awesome good by the way it s from our (The) Spice House in Milwaukee and can be ordered online). I dredged the roast in flour before browning it in pure (not extra virgin) olive oil then laid it on a bed of baby bella mushrooms as well as the onions. Even after reducing the amount of liquids significantly this still was pretty juicy darn good but juicy. I was tempted to put the juices on the stove and reduce them till much thicker but ultimately decided against it figuring that it would become too salty. The meat as expected was fork tender and the juices were richly flavored delicious spooned over the beef as well as some buttered linguine. As for the excess of broth/tomato/wine juices it will be excellent used in the soup I plan to make tomorrow! Four stars rather than five only because of the overload of liquids called for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-28T00:44:21.297Z",
                "reviewBody": "Fabulous recipe!! The only modifications I made were: (1) seared the roast on all sides using a small amount of olive oil in a cast iron skillet before placing in crockpot; (2) used only 1 can of diced tomatoes; and (3) added sliced mushrooms during the last 30 minutes or so. The aroma was absolutely mouth-watering!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4529410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-21T16:02:55.22Z",
                "reviewBody": "It's nearly 100 degrees today here in Northern CA and I made this dish which is definitely more fall/winter fare but we had the hankering for beef roast. I thought the recipe was good although there are a few things to note. I seared the roast in olive oil before adding to the crock pot. There is WAY too much liquid called for here. I scaled the ingredients in half and had plenty of liquid for the roast to cook in. After the roast cooked for 8 hours on low I chose to strain the cooking liquid into a pan on the stove before adding the tomato paste. It will not thicken as stated in the recipe unless you add a thickener. I mixed up about 1-2 Tbsp. of cornstarch with a little water and mixed it in to get the desired consistency. It made a wonderful gravy for the very tender delicious roast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-05T19:09:14.68Z",
                "reviewBody": "I had a 2-pound chuck roast so I basically halved the recipe. I did take into consideration all the reviewers that mentioned that this had way too much liquid. So I used 1/2 cup red wine and 1/4 cup beef broth and one can of diced tomatoes undrained. I still ended up with a lot of liquid after the roast cooked down. I used fresh herbs which means I should have used three times as much to replace the dry. Well that seemed excessive so I used 2 t. each of fresh rosemary oregano basil and thyme. I turned the slow cooker on low at 11 pm and went to bed. I was up in time to check it after 8 hours and it was perfectly cooked. I did drain some of the liquid off and thickened the rest with some cornstarch mixed with water. I skipped the tomato paste. Reheated just before serving. Well this turned out to be a wonderfully seasoned fork tender and delicious pot roast!! Having the leftovers tonight on French rolls and adding provolone. Can t wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bellepepper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4452392/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-13T01:29:41.527Z",
                "reviewBody": "First let me say this was one of the best slowcooker pot roast dishes I've ever had... but I did head the advice of others and altered the liquid and spices as written would have been too much. I used just one cup wine and 2 bouillon cubes (skipped extra salt) instead of 2 plus 1/4 cup stock. I added just 1 1/2 - 2 tablespoons of Italian seasoning instead of all the others (it contains all of the herbs called for ). Those changes by themselves would have been wonderful however because there was still a good bit of liquid I decided to add 2 cups baby carrots and 2 Baker's cubed 2 hours before finishing. I put the meat and vegetables in a Corning dish to serve covered and kept warm. I put the juices in a sauce pan and added a cornstarch slury to thicken. I loved the tomato/potato/carrot mixture with a wonderful gravy. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mickdee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mickdee/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-28T03:12:45.987Z",
                "reviewBody": "This recipe turned out great! I'd have to agree with most reviewers here that it makes a lot of liquid! But I took the extra liquid and tossed in the freezer. It tastes like an amazing tomato soup. I thought I'd thaw one day and pair with it with a grilled cheese sandwich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "monsieurgrand02",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7142023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-31T23:39:03.897Z",
                "reviewBody": "very good I did thicken with Wondra to make it more like a gravy. I served over garlic mashed potatos",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JUDY2RIVER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-07T01:58:08.743Z",
                "reviewBody": "Sorry didn't care for this. Two adults rated it 3 stars and one adult a 2 star. I followed the recipe exactly. The roast lost it's meat flavor and all we could taste was spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "cando91",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1923932/"
                }
            }
        ]
    }
]