[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1426/soups-stews-and-chili/stews/gumbo/",
                    "name": "Gumbo Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217290/ashleys-african-peanut-soup/",
        "name": "Ashley's African Peanut Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4472009.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2019-04-02T06:54:58.000Z",
        "description": "I made my own version of this recipe after eating it at a restaurant. The mixture of ingredients seems a little peculiar, but trust me, they work wonderfully together.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H30M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "2 large skinless, boneless chicken breast halves",
            "1 onion, chopped",
            "2 red bell peppers, sliced",
            "4 cloves garlic, minced",
            "1 (28 ounce) can crushed tomatoes",
            "2 sweet potatoes, peeled and cut into bite-size pieces",
            "3 cups sliced carrots",
            "4 cups chicken broth, or more as needed",
            "½ teaspoon curry powder",
            "½ teaspoon ground cumin",
            "¼ teaspoon chili powder",
            "¼ teaspoon cayenne pepper",
            "¼ teaspoon crushed red pepper flakes",
            "¼ teaspoon ground cinnamon",
            "¼ teaspoon ground black pepper",
            "1 cup brown rice",
            "1 cup crunchy peanut butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a skillet over medium heat, and brown the chicken breasts on both sides, about 5 minutes per side. Place the chicken breasts into a slow cooker. Cook the onion, red bell peppers, and garlic in the hot skillet until the onions are translucent, about 5 minutes; transfer the cooked vegetables into the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the crushed tomatoes, sweet potatoes, carrots, chicken broth, curry powder, cumin, chili powder, cayenne pepper, red pepper flakes, cinnamon, and black pepper into the slow cooker. Set the cooker to High, and cook for 5 to 6 hours, or cook on Low for 10 hours. Stir in additional chicken broth throughout the cooking time if needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix in the brown rice 3 hours before serving, and mix in the peanut butter at least 1 hour before serving. Shred chicken meat, and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Gumbo Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ashley Olmstead"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4411764705882355,
            "ratingCount": 102,
            "itemReviewed": "Ashley's African Peanut Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "205.4 calories",
            "carbohydrateContent": "22.8 g",
            "cholesterolContent": "14.2 mg",
            "fatContent": "8.7 g",
            "fiberContent": "4 g",
            "proteinContent": "10.8 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "352.6 mg",
            "sugarContent": "4.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-04-30T01:05:05.42Z",
                "reviewBody": "This recipe is wonderful.  I made a few changes because it was my first time making soup like this and I just used what I had on hand.  I cooked rice separately and served it over rice.  I also made it first without chicken.  I later added it.  I omitted carrots and sweet potato only because I did not have any but they would have been great.  I also only had creamy peanut butter.  What makes this recipe stand out is the blend of seasoning.  They are the best!  The aroma was amazing.  2 friends ended up eating over because they were intoxicated by the smell of my kitchen while cooking this!  The flavor was wonderful and I am excited to make it again, closer to the original recipe.  I really feel the blend of spices make this recipe unique and stand out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4844404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-13T13:47:37.27Z",
                "reviewBody": "I loved this recipe. I order African Peanut Stew at one of my favorite restaurants about once a month. This recipe was just as good! I didn't add the rice to mine because I don't need the extra carbs and I also didn't add sweet potato because I forgot to buy them at the store. Oh I also skipped browning the chicken and vegetables because after 10 hours in the crock pot I knew everything would cook down and meld together. I loved the combination of spices. EDIT: I made this recipe again last night. I had some random veggies in the fridge I wanted to use up (celery broccoli zucchini) so I chopped them up and threw them in. Also I made with water instead of stock because I didn't have any. ALSO I found out at the last minute we were out of peanut butter so we added almond butter--I think it turned out just as good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIGHTBURNSBLUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1372655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-23T00:25:51.5Z",
                "reviewBody": "Wonderful. I used shredded chicken from a small farm-raised whole chicken, which is probably equivalent to two huge conventional breasts. I just threw the cooked chicken right into the crockpot,  no additional browning. I think just adding small bone-in pieces (browned) would be even better, so that the nutrients from the bones leach into the soup, and that's how I ate it in West Africa. I didn't add the cayenne or red pepper for my kids but it would have been great with them. I also used homemade chicken broth so it was not very salty, which we prefer, but most people would probably need to add salt if you don't use a salty broth. I also just served over rice instead of mixing rice in, as other reviewers suggested, and used creamy PB because I didn't have crunchy. I think the sweet potatoes are key - gives it sweetness to the tang and makes it very \"African\". I used to use the Groundnut Stew recipe from my tried and true \"More with Less\" cookbook, but I'm switching to this recipe. Thanks a lot - this is a wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLEANDRAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1158996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-27T00:00:25.013Z",
                "reviewBody": "My husband & I always add one can of pumpkin puree. Vegan/vegetarian variation: add 1 can canned pumpkin substitute vegetable broth for the chicken broth and leave out the chicken. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sunphlowers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2472953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-16T17:37:02.857Z",
                "reviewBody": "This is absolutely delicious! I used TVP chunks instead of chicken. The peanut butter really makes the soup. Make a big batch it will go fast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AmazonToAndes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3515464/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-08T18:53:56.93Z",
                "reviewBody": "I loved the flavor of this soup and I will definitely make it again however I am a bit perplexed with the ingredients and serving size. The recipe states 20 servings. For whom? Infants? I'd say 8 servings is more accurate! I made this based on the calorie count which means my serving was way more than 202 calories! The next issue is the fact that I left out one pepper 1 cup of carrots and the rice which would have used a substantial amount of liquid and this recipe still ended up as a very very thick stew even after adding 2 more cups of broth after the stated 3 cups! I'm so confused! I am an experienced cook and know what I'm doing.:) Anyone else have the same experience? Just curious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cristin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/899218/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-18T23:54:25.613Z",
                "reviewBody": "It was great the first couple of nights but not something I'd want to eat all week. (And for me and my husband that's usually what soup recipes mean for us.. the same thing all week.) After those first few days the peanutty taste just got too rich for us. But a good soup if you're having company or plan to freeze and reheat at a later date.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Patty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1583126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-08T02:49:55.417Z",
                "reviewBody": "When I was little m y mother made peanut soup for us and we all hated it so I've never tried it since. Therefore it was a nice suprise to find this one so good! Our whole family loved it and I definately want to make it again! Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sugar-n-spice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3833639/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-25T14:18:38.193Z",
                "reviewBody": "I have been making African peanut soup for years to the point that I don't even measure anything any more.When I made soup the first time I followed the recipe and added the rice but found I didn't like the texture...so subsequently I eliminated it. I saute 1-2 chopped onions and 2 chopped garlic cloves in a little olive oil. Clean and cut up 4-5 large carrots and also saute with the onions and garlic.Add 1 1/2 quart of homemade chicken stock.Bring to a boil and simmer until the carrots are soft after adding salt and pepper to taste. Cool.Put in food processor then return to pan. Add smooth peanut butter to taste and tabasco sauce to taste.Everyone loves it! You can also try adding other vegetables to saute and cook like sweet red peppers...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Anne Guiles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8367160/"
                }
            }
        ]
    }
]