[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1235/appetizers-and-snacks/meat-and-poultry/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217840/papas-rellenas-fried-stuffed-potatoes/",
        "name": "Papas Rellenas (Fried Stuffed Potatoes)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1008443.jpg",
            "width": 2553,
            "height": 2553
        },
        "datePublished": "2019-04-02T06:55:01.000Z",
        "description": "My mom used to make these when we were kids. Always loved them and each time you make them you can season to taste so its different every time!",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT4H15M",
        "recipeYield": "12 stuffed potatoes",
        "recipeIngredient": [
            "4 large potatoes, peeled and cubed",
            "½ teaspoon salt",
            "1 tablespoon vegetable oil",
            "½ cup chopped onion",
            "1 green bell pepper, chopped",
            "3 cloves garlic, minced",
            "1 pound ground beef",
            "1 teaspoon salt",
            "2 teaspoons ground cumin",
            "1 teaspoon ground black pepper",
            "4 teaspoons tomato paste",
            "1 tablespoon distilled white vinegar",
            "4 eggs",
            "2 cups dry bread crumbs",
            "1 cup all-purpose flour",
            "1 quart vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Mash in a bowl with 1/2 teaspoon salt until no lumps remain. Set aside to cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, heat the vegetable oil in a large skillet over medium heat. Cook and stir the onion, green pepper, and garlic in the hot skillet until the onion has softened and turned translucent, about 10 minutes. Increase heat to medium-high, and stir in the ground beef. Cook and stir until the beef is crumbly and no longer pink. Stir in 1 teaspoon salt, cumin, pepper, tomato paste, and vinegar until the tomato paste has dissolved. Scrape into a mixing bowl, and allow to cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with plastic wrap or waxed paper, and set aside. Beat the eggs in a mixing bowl, and set aside. Pour the bread crumbs and flour into separate, shallow dishes, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the potatoes and beef have cooled, form the potato balls: grab a handful of mashed potatoes, and split into two equal portions. Form each piece into a small bowl shape, and fill with the ground beef mixture. Place the two halves together, seal the edges, and smooth to make a round ball. Gently roll the ball in the flour to coat and shake off the excess flour. Dip into the beaten egg, then gently roll in bread crumbs. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded potato balls onto the prepared baking sheet while breading the rest. Refrigerate 2 to 4 hours, or freeze for later use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To cook, heat the oil for frying in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the potato balls in the hot oil in batches, using tongs to roll the balls around as they cook to ensure even browning, until crispy and golden brown, about 3 minutes per batch. Drain on a paper towel-lined plate before serving.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Meat and Poultry",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "alu1977"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.618181818181818,
            "ratingCount": 55,
            "itemReviewed": "Papas Rellenas (Fried Stuffed Potatoes)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "380.1 calories",
            "carbohydrateContent": "45.3 g",
            "cholesterolContent": "84.9 mg",
            "fatContent": "15.8 g",
            "fiberContent": "3.5 g",
            "proteinContent": "14.3 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "488.8 mg",
            "sugarContent": "3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-04-28T23:40:49.637Z",
                "reviewBody": "Every Cuban restaurant in my area has stuffed potato balls, and this one really tastes authentic.  There definitely was a preparation learning curve for me as far as stuffing the potatoes. When I finished, I had left over bread crumbs, beef filling, and too many eggs.  I used a mashed potato scoop, cut the potatoes in half, stuffed one side with the meat, added the other side and squeezed it into a ball.  My potato balls needed more meat stuffing, and next time, I will add filling to each half, and then press together to seal the potato balls.  Also, in the future, I will start with 2 eggs, and 1 cup of bread crumbs; you always can add more if necessary.  On the positive side, they tasted wonderful, and I definitely will make again.  I made these 3 days ago, froze them, defrosted today, deep fried this evening, and they turned out great.  One thing the recipe doesn't mention is hot sauce, and these potato balls always are served with hot sauce on the side, so be sure to put your favorite hot sauce on the table.  Thanks alu1977, these are the real deal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-09T19:39:57.61Z",
                "reviewBody": "My wife said these came out great better than the ones from Porto's in Glendale. I added extra salt to the potatoes and semi-froze the meat in mini muffin pans then put two meat blobs together and covered in potato. Then rolled in egg and bread crumbs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rochelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4247518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-02T23:36:36.383Z",
                "reviewBody": "Really good recipe, kids loved it :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tumelo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4988079/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-16T17:35:53.503Z",
                "reviewBody": "I followed the directions completely. Needed more salt in both the potato mixture as well as the meat. Also to get the crumbly soft meat thats in the ones I'm used to I will cook the meet like I do for coney sauce in water then add the onion pepper mixture. These were very labor intensive but well worth it. YEA Dont have to order them online or make a trip to Florida! Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4217581/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-02T17:37:07.463Z",
                "reviewBody": "We don't use breadcrumbs, just roll the cale in egg. We also aff black olive slices and a small lengthways slice if boiled egg, quite traditional in Peru. Not sure about deep frying either, shallow oil is fine.\n\nOur experiments show that the stickyness of the potatoes, i.e. the starch content is crucial. Old potatoes, that is ones that mash well are essential.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Reggiep",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14377001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-09T02:22:12.663Z",
                "reviewBody": "I made these twice. The problem I am having is they are splitting open. Any suggestions as to what I might be doing wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Camille Forgacs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11711450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-14T20:06:33.947Z",
                "reviewBody": "I loved this recipe! I tried it today and it came out delicious! I have to admit i did season my meat differently leaving out the cumin and tomato paste to make it more to our liking. But then end result was great! thank you for sharing your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peter Fitzpatrick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1802371/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-12-26T04:32:05.807Z",
                "reviewBody": "Really good! I made a few minor changes. After adding the cube size potatoes to the water, I started sauteing the veggies with 1 tb of butter and 1 of oil. I used very lean beef (90% lean) to avoid excessive liquid. In addition to the paste, I added 2 tbl of spaghetti sauce and I substituted 2 tbl of red wine for the vinegar. I also added a sprinkle of mestique and omitted the cumin because we're not big fans of the stuff. The recipe does not yield enough mashed potatoes and too much meat. The first time I made it I had extra meat left over. I now use 9 medium sized potatoes with the 1 pound of beef. The recipe yields about 10 balls, not 12. (For those of you that complained the beef was bland, just keep adding the spices until it tastes to your liking. It has to be very flavorful to compete with the blandness of the potatoes. Make sure potatoes are salty enough, too.) When the potatoes were mashed and cooled, I formed 1 THIN patty of mashed potato, put 2 BIG tb of beef in the center and covered it with another thin patty of potato. I then formed a ball, rolled it in the flour, egg (only use 2 eggs), and bread crumbs. Oil must be VERY hot prior to putting the balls in. These are great to make ahead of time. When your ready, fry them and pop them in the oven @ 375 for 5 minutes. My husband and son LOVED them. And my Cuban parents were floored! Best compliment and well worth the effort. ¡Gracias!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Aileen Lisette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24070061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-25T21:11:56.687Z",
                "reviewBody": "everyone liked them would make a sauce with them next time and add a little more salt. going to try different stuffing's with them next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna Drexler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3076703/"
                }
            }
        ]
    }
]