[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/693/meat-and-poultry/turkey/ground/",
                    "name": "Ground Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217898/kickin-turkey-burger-with-caramelized-onions-and-spicy-sweet-mayo/",
        "name": "Kickin' Turkey Burger with Caramelized Onions and Spicy Sweet Mayo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F660356.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2019-04-02T06:55:03.000Z",
        "description": "A spicy, flavorful, and moist turkey burger.  This is my husband's favorite.  It tastes delicious and I make it with extra lean ground turkey breast. The grated onion adds moisture as well as flavor to the turkey.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "1 cup light mayonnaise",
            "¼ cup coarse-grain mustard",
            "¼ cup honey",
            "1 tablespoon prepared horseradish",
            "hot pepper sauce (e.g. Tabasco™) to taste",
            "1 teaspoon ground cayenne pepper",
            "1 ¼ pounds ground turkey breast",
            "½ large onion, grated",
            "1 jalapeno pepper, seeded and minced",
            "2 tablespoons barbeque sauce",
            "2 tablespoons Worcestershire sauce",
            "¼ teaspoon liquid smoke flavoring",
            "1 tablespoon steak seasoning",
            "1 teaspoon dry mesquite flavored seasoning mix",
            "1 tablespoon olive oil",
            "½ large onion, sliced",
            "5 hamburger buns, split"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine mayonnaise, mustard, honey, horseradish, hot pepper sauce, and cayenne pepper in a bowl. Cover and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix ground turkey, grated onion, jalapeno, barbeque sauce, Worcestershire sauce, liquid smoke, steak seasoning, and mesquite seasoning in a large bowl. Form into 5 patties.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the patties in a medium skillet over medium heat, turning once, to an internal temperature of 180 degrees F (85 degrees C), about 6 minutes per side. Serve on buns topped with spicy sweet mayo and caramelized onions.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Ground Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Occasional Cooker"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.687022900763359,
            "ratingCount": 131,
            "itemReviewed": "Kickin' Turkey Burger with Caramelized Onions and Spicy Sweet Mayo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "459.3 calories",
            "carbohydrateContent": "58.7 g",
            "cholesterolContent": "81.8 mg",
            "fatContent": "9.3 g",
            "fiberContent": "2.1 g",
            "proteinContent": "33.9 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "1769.5 mg",
            "sugarContent": "27.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-07-13T00:14:08.137Z",
                "reviewBody": "Hi everyone. This is my recipe. I wanted to let you know that there will be extra mayo left over that can be used on other sandwiches or other items. About a 1/3 of it would be needed for the burgers. I use Hellman s low fat mayo that has a great flavor and only 15 calories per serving to cut down on the fat and calories. Also I used a Dijon course grain mustard and 99% extra lean ground turkey with Stubbs Original BBQ sauce (because it contains less sugar) but you could also use a mesquite flavored BBQ sauce if you don t have the dry seasoning or try one of the great substitutions other reviewers used. In addition I used a Vidalia onion and Montreal Steak Seasoning with McCormick s Mesquite Grill Seasoning. This is not a packet but in a jar like other spices. AR had changed that ingredient to a packet. If you have never tried a turkey burger this is the one to try! If you can t bring yourself to try turkey make it with ground beef. I made this the other night and switched it up with 93% lean ground beef which is as lean as regular ground turkey and used KC Masterpiece BBQ sauce. It was delicious also. I hope your family enjoys these burgers as much as mine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Occasional Cooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/occasionalcooker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-23T22:01:07.76Z",
                "reviewBody": "Wow these turkey burgers really are Kickin'! I love turkey burgers and this recipe was no exception. The carmelized onions and spicy sweet mayo really took this turkey burger over the top! I used vidalia onion and KC Masterpiece BBQ sauce. I also used Montreal Steak Seasoning and like others who didn't have dry mesquite seasoning on hand I mixed up my own with a bit of smoked paprika (love the stuff) chili powder and cumin. I did cut the back on the amount of spicy sweet mayo - I made half the recipe and even though it's more than enough to cover the burgers it's a great dipping sauce for sweet potato fries or just about anything else you can think of! We grilled these burgers vs. pan frying and served them on toasted rolls with fresh crisp lettuce along with the carmelized onions and spicy sweet mayo! Thanks Occasional Cooker for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-28T03:32:13.463Z",
                "reviewBody": "My hubby loved this, so it's a 5-star recipe in this corner!  Now let me tell you all the things I did--both wrong and different.  Wrong?  When I grated the onion, I grated it right over the turkey.  That's wrong.  I knew it as soon as I saw the juice gathering at the bottom of the bowl.  Melinda Lee, our talkshow host, told us all not to do that!  But did I listen?  Grate the onion into a separate bowl so the juice can settle and be siphoned off.  That's why my next mistake.  I still wanted to grill these patties.  And they fell through the grate.  So I finished them in a pan.  Different?  We wanted no bread, so we just had the onions and the wonderful sauce (to which I will add the other half of the cayenne for the leftovers--I was being cautious).  I served this with sliced deliciously ripe tomatoes and some Cajun Grilled Corn (from this site) so that we could drizzle some of that great sauce over all.  It was a wonderful dinner.  Thank you for our meal tonight!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-24T03:43:51.237Z",
                "reviewBody": "Prepared for participation in the Recipe Group this week. Wow! We were pleasantly surprised with this one! This is our first ever Turkey Burger and we were hesitant and really didn't think we would care for the texture. Boy were we wrong! This is absolutely delicious. Excellent flavor, great texture and juicy. We grilled these burgers instead of pan frying and I am so happy that we did. The grill flavor mixed with the steak seasoning, BBQ Sauce, Caramelized Onions and Sweet Mayo is perfection. \nJalapeno peppers just don't go over well with my family so I left that out. I also did not have the \nmesquite flavoring so I followed Saveur631 and used a pinch of chipotle and paprika. I used Montreal Steak Seasoning and Sweet Baby Rays BBQ Sauce. All of this adds such great bold flavor. I mixed everything up about 2 hours before dinner, shaped the burgers and put them in the fridge. The Spicy Sweet Mayo is awesome! I made half the recipe for the mayo (used only 1/4 tsp cayenne) and still have a little left over. I refuse to throw it away - I will definately find something...ANYthing to put this on. It is sooo good and perfect with the burger and carmelized onions. I used 1 & 1/2 very large vidalia onions to carmelize and it was the perfect amount for us. Using only 1/2 onion would not have done it. Hubby and kids can't stop talking about this one so I know it will be a frequent repeat here this summer. Thanks for sharing, Occasional Cooker!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-14T01:10:27.157Z",
                "reviewBody": "I used the recipe for the burgers and made stuffed red peppers instead. I cut the tops off red peppers hallowed out the insides and stuffed with them with the burger mixture. I baked the stuffed peppers at 350 degrees for about 45 minutes. Extra moisture that accumulates in the peppers can be used to baste the meat or can by poured out of the peppers at the end. Makes 4 large fully packed red peppers I couldn't find dry mesquite flavored seasoning mix so I skipped it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7187026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-11T00:32:25.067Z",
                "reviewBody": "I admit I didn't use turkey, I used a combo of beef and buffalo from Whole Foods. They were amazing!!!!!!!! So amazing, that we have eaten them 3 times in the last week. The spicy sweet mayo is so amazing. We made both sweet potato fries and oven fries with the burgers and both were great with the sauce. We love this recipe- thanks so much!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ONEHIPMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/685678/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T18:18:02.61Z",
                "reviewBody": "These were great!  I especially liked the spiced mayo although you can scale by half since it makes far more than you'll need.  We are wimps so I cut the cayenne pepper down to 1/2 tsp. and it was just right.  Hot but not crazy hot.  I also omitted the jalepeno pepper from the burger but used a spicy steak seasoning.   We had ours with muenster cheese.  I think they'd be great with mixed greens, avocado or any other toppings you like.  We also used the sauce as a dipping sauce for Grilled Chipotle Sweet Potatoes from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T12:01:41.207Z",
                "reviewBody": "I made this for the recipe group June 2011. Overall very good burgers. I would give this a 4 on the burgs and definitely a 5 on the sauce. Let's start with the burgers. I made exactly as written used Montreal for the steak seasoning Baby Rays Vidallia onion BBQ for the sauce. No mesquite seasoning so I used a couple of shakes of chipotle and smoked paprika. Formed four nice (small when grilled) burgers five would be tiny. I placed them in the fridge for a couple of hours prior to grilling to help them set up. On the carmelized onions I used the other onion half for TWO burgers if making 4 burgers needs at least an entire onion more if you like lots o' onion. The sauce makes it it's to die for. I halved the recipe and it would be plenty for 4 burgers. Just eyeballed the ingredients except the cayene just an 1/8 teaspoon. Very very good sauce. Overall tasty thanks for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Saveur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-19T10:30:21.09Z",
                "reviewBody": "This recipe is very good! My hubby and son never knew they were eating ground turkey!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl's Cooking Now!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4072782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-13T14:00:02.577Z",
                "reviewBody": "I love good food and there are not too many foods that I do not like. However I don't know what all the rage was about that sauce. I made it last night - followed the recipe exactly as written - and it just did not taste good. Sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt Mapp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4413003/"
                }
            }
        ]
    }
]