[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/653/main-dish/pasta/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217912/spences-pesto-chicken-pasta/",
        "name": "Spence's Pesto Chicken Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F642143.jpg",
            "width": 2250,
            "height": 2596
        },
        "datePublished": "2019-04-02T06:55:04.000Z",
        "description": "This is a great recipe that my boyfriend put together on a Sunday evening after a bike ride. You can't go wrong with all of the flavors in this dish!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ pound linguine pasta",
            "1 (8 ounce) skinless, boneless chicken breast, cut into small pieces",
            "salt and ground black pepper to taste",
            "3 tablespoons olive oil",
            "6 whole garlic cloves",
            "4 ounces fresh mushrooms, halved",
            "6 ounces roasted red peppers, drained and chopped",
            "1 (7.5 ounce) jar marinated artichoke hearts, drained and quartered",
            "3 ounces fresh spinach leaves",
            "¼ cup prepared basil pesto, or to taste",
            "1 tablespoon freshly grated Parmesan cheese, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the pasta is boiling, sprinkle the chicken with salt and black pepper. Heat the olive oil in a large skillet over medium heat, and cook the chicken pieces until lightly browned, about 10 minutes, stirring frequently. Stir in the garlic cloves, mushrooms, roasted red peppers, and artichoke hearts; reduce heat to a simmer, and cook until the mushrooms begin to give off their juices, 5 to 8 minutes. Stir in the spinach, and simmer just until the leaves are wilted, about 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the cooked linguine into a bowl, and toss with the basil pesto. Divide the pasta between 2 plates, and serve topped with the chicken mixture. Sprinkle Parmesan cheese over each plate to serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ChezCristy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.453900709219858,
            "ratingCount": 141,
            "itemReviewed": "Spence's Pesto Chicken Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "511.8 calories",
            "carbohydrateContent": "53.5 g",
            "cholesterolContent": "35.2 mg",
            "fatContent": "23.3 g",
            "fiberContent": "5.4 g",
            "proteinContent": "26.1 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "540.4 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-05-18T20:17:59.387Z",
                "reviewBody": "Spence's Pesto Chicken Pasta Haiku: \"This IS elegant. Flavorful, vibrant colors. A couple small tweaks.\" I was doubtful of putting that many \"special\" veggies all together, thinking their flavors would compete w/ one another, but it turned out to be a lovely dish. I didn't have quite as many mushrooms, and I had to sub hearts of palm for the artichoke hearts (close enough); I also added a handful of diced onion to the initial saute. Otherwise I was completely faithful to the recipe and was pleasantly surprised w/ the end result. When I make this again, I plan to increase the spinach, and stir a bit of the pasta water into the chick/vegg mixture for additional moisture b/c it was a bit dry. (Or instead of just tossing the linguine w/ the pesto, split the pesto into the chicken/vegg too.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock_lobster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rocklobster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-03T23:59:05.127Z",
                "reviewBody": "This was wonderful! I had to make changes because I didn't have all the ingredients. I used frozen spinach instead of fresh - still yummy - and I used broccoli and fresh red bell pepper. This will be one of our regulars. Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EmmaD01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2863891/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-19T17:04:26.34Z",
                "reviewBody": "Awesome! instead of peppers I did sundried tomatoes and I actually forgot the spinach but it was better because there was already a lot going on flavor wise! Oh, and instead of whole cloves of garlic I sliced them so as to disperse the garlic flavor! VERY VERY good! *****",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jamiesmith714",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5665823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T14:42:16.327Z",
                "reviewBody": "I am confused: at the top it says 4 servings (?only one chicken breast) and at the bottom it says divide pasta onto 2 plates. Which is correct?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Prue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6082803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-24T10:27:41.79Z",
                "reviewBody": "The reviews helped me to tweak this recipe to make it really zing. I used skinless boneless thighs instead of breasts so that the chicken had more flavor and moisture. When cooking I started out by browning the mushrooms to give them added flavor. Then I tossed them into a bowl with the chopped garlic peppers and artichokes and added them altogether with the chicken after it had browned for five minutes. Later I added 1/2 cup of dry white wine and half the pesto to the simmering vegetables. It turned out very well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KSALLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6608226/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-27T06:42:01.34Z",
                "reviewBody": "My husband and I loved this recipe!! I tweeked it a little because of the ingredients I had on hand. I didnt have any roasted peppers or artichoke hearts. I added finely diced red bell peppers diced tomatoes and mushrooms in with the same pan I had cooked the chicken and garlic in and fried it for a few minutes until fragrant. I wanted the excess water of the tomatoes out so I kept the stove on high until all the water evaporated and stirred occasionally. I added the spinach at the end and it turned out to be amazing! Also I took one cup of heavy cream and heated it on the stove until it was reduced to half and then mixed it with the pesto it was the perfect pesto cream sauce! I mixed the pesto cream sauce with the linguini and topped it off with the chicken mixture it looked and tasted absolutley amazing!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Daniak04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7948966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T16:56:32.853Z",
                "reviewBody": "I've been making something very similar to this for years - my recipe came from Food & Wine. To give it a little kick I add chopped sun-dried tomatoes and sun-dried tomato pesto instead of the basil pesto but both are good. This is one yummy dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LoneStarLady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4952159/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-25T16:09:43.413Z",
                "reviewBody": "I LOVED this recipe, which I served to my husband and dinner guests last night. My guests arrived one full hour early :( so I literally cooked while we visited. I doubled the recipe so that we'd have leftovers for hubbies lunch. Followed recipe, but cut back on artichokes a little (not hubbies favorite :) and minced three large cloves of garlic - less than called for. Next time I'll add more mushrooms, called for amount of artichokes and garlic, and add extra spinach - maybe 50% more. I used FOUR chicken breast halves. Sauteed them in HOT olive oil/butter mix until well browned. Then removed from pan while sauteeing mushrooms (and I added red onion). Then sliced chicken breasts and let everything simmer on lowest heat while I cooked pasta. Then added spinach and pesto. Chicken was slightly undercooked when I sliced; perfectly cooked and tender after simmering. Even my slightly picky, older guests loved this and asked for seconds. Definitely a keeper - Thank you ChezCristy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ycknits",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7122162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T23:53:26.827Z",
                "reviewBody": "This was good but could have been better. I used the exact ingredients but felt the cooking time for the chicken pieces was way too long. Came out dry. Next time I would shorten the chicken cooking time to 3-4 min. then toss in the balance of ingredients for a total of 10 min. It lacked some acidity or oomph. Next time I will broil some lemon halves and allow each diner to squeeze to their taste. Will make again but with adjustments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KellyG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2572778/"
                }
            }
        ]
    }
]