[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/657/soups-stews-and-chili/stews/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217952/west-african-peanut-stew/",
        "name": "West African Peanut Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7199619.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:55:06.000Z",
        "description": "A hearty stew that's super-easy to make and great for peanut butter lovers. Can be made vegetarian or with chicken. In a pinch, feel free to use vegetable or corn oil for peanut oil, powdered ginger for fresh, water for stock, etc. Kale works well in place of collard greens.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons peanut oil",
            "1 red onion, chopped",
            "2 cloves garlic, minced",
            "2 tablespoons chopped fresh ginger",
            "1 pound chicken, cut into chunks",
            "1 tablespoon crushed red pepper, or to taste",
            "salt and ground black pepper to taste",
            "5 cups chicken stock",
            "3 small sweet potatoes, cut into chunks",
            "1 (16 ounce) can chopped tomatoes, with liquid",
            "¼ pound collard greens, roughly chopped",
            "1 cup chunky peanut butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the peanut oil in a large pot over medium-high heat; cook and stir the onion, garlic, and ginger in the hot oil until softened, about 5 minutes. Add the chicken; cook and stir until completely browned. Season with the crushed red pepper, salt, and black pepper. Pour the chicken stock over the mixture. Stir the sweet potatoes into the liquid and bring the mixture to a boil; reduce heat to low, cover the pot partially with a lid, and cook at a simmer for 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the tomatoes, collard greens, and peanut butter into the soup. Partially cover the pot again and continue cooking, stirring occasionally, another 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "km1312"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.793991416309013,
            "ratingCount": 233,
            "itemReviewed": "West African Peanut Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "730.6 calories",
            "carbohydrateContent": "44.9 g",
            "cholesterolContent": "70.1 mg",
            "fatContent": "43.8 g",
            "fiberContent": "11.1 g",
            "proteinContent": "45.5 g",
            "saturatedFatContent": "7.7 g",
            "servingSize": null,
            "sodiumContent": "1470.3 mg",
            "sugarContent": "14.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-10-28T16:42:48.387Z",
                "reviewBody": "Excellent recipe! Easy to make, full of flavor, and open to variation based on preferences and what’s available in the pantry (this recipe is quite forgiving). Here are mine:\n\nUse a large crock pot. Additional ingredients: 1 chopped green pepper and 1T each of nutmeg, cumin, and smoked paprika. Save the collard greens as a garnish.\n\nMix the stock, tomatoes, peanut butter, and seasonings in the crock. If you’re preparing in the morning, set crock to low; otherwise, set to high.\n\nSauté the onion and green pepper; add the garlic about a minute before you are done sautéing. Add to the crock.\n\nAdd the chunked sweet potatoes. Don’t bother peeling, just give them a good scrub. The skins are full of nutrients and they’ll soften.\n\nAdd whole, uncooked chicken breasts (thawed or frozen). After a few hours, remove chicken and shred by pulling apart with two forks (I prefer the look and texture of shredded chicken in my stews). If the chicken is fully cooked, it will pull apart quite easily. Put the chicken back into the crock and turn heat to low until ready to serve.\n\nRight before serving, sauté the collard greens with a bit of butter and a generous pinch of salt. Use tongs to toss the greens. Sauté until slightly wilted and a pretty green.\n\nServe over quinoa, and garnish with wilted collard greens, shredded carrots, and coarsely chopped peanuts.\n\nLove, love, love this recipe!  Many thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Pietsch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7726017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-07T04:37:20.383Z",
                "reviewBody": "I made it vegetarian by replacing the chicken with garbanzo beans and chicken broth with vegetable -- upped the protein by serving it over quinoa.  Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janet White",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2769922/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-25T02:30:02.847Z",
                "reviewBody": "Let me be the first to say that this is absolutely delicious and different! I followed the directions exactly except for subbing regular potatoes for the sweet potatoes. Shared with some friends that couldn't believe how tasty it is. If not for the high fat/high carb/high cholesterol I'd make frequently. As is...it will have to be a rare treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily Tisdale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2463488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-19T14:54:47.003Z",
                "reviewBody": "I added the chicken used regular potatoes instead of sweet and fresh tomatoes instead of canned. It was really good. I thought it was a tad bit too spicy but dad and hubby both thought the spice level was perfect. Next time I will add the tomatoes and greens at same time I add potatoes didn't think they needed extra cooking as they came out very soft (maybe because I cut them in small bite size chunks).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mrs. kosmos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3825395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-27T06:42:18.337Z",
                "reviewBody": "One of our favorite restaurants occasionally serves this soup and we always look forward to it. I generally followed the recipe and used red garnet sweet potatoes as they are chock full of nutrients. We omitted the greens cut the red pepper flakes by half and used chunky natural peanut butter (no sugar added) so I tossed in a small fistful of brown sugar and a little cinnamon ground cloves and cumin for added aromatic spice. I actually liked that the potatoes cooked down and gave the soup a comforting thick texture perfect on a cold day. If I needed it served over anything it likely would be quinoa for the additional protein. I will be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chef's daughter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6236890/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-13T21:58:52.363Z",
                "reviewBody": "Love this dish! I've always called it African Groundnut Stew. I like it thick so cut way down on the chicken stock. Added tomato paste - did not add potatoes. Eat over rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Kline",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/902372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-23T22:15:30.617Z",
                "reviewBody": "This an amazing dish....I made some changes I used smoke Turkey wings instead of chicken and instead of sweet potatoes I used white potatoes.  I cooked this for my husband and kids and having him tell me as soon as he put the spoon in his mouth..... that it brought back all his childhood memories of his mom cooking that dish and the fact that my husband mother pass away when he was only 8yrs old and he really didn't remember her that much up until that very moment..... meant a lot to me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brandi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12442227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-03T22:18:32.493Z",
                "reviewBody": "My bestie was down for a much needed visit and having told me she just decided to go Vegan I thought it would be best to take her to this Vegan restaurant I love so much. Well on this particular day one of the chefs just had HIS best friend from Senegal over who made this dish for him so he was trying it out on the patrons. We were the first tasters!INSTANT LOVE! I felt it wasn't decent to ask a chef for a recipe to something so as usual I came here! So far so good! In the finishing stages of cooking it now. Did a taste test almost identical to the one I tasted from the vegan restaurant:D! Definitely a keeper! The only things I needed to change (And thus the reason for 4 and not 5 stars) was I did find that 5 cups of chicken stock is quite a bit especially when you then add the juice from the diced tomatoes. So you may want to use 3-4 cups of stock and none of the juice from the diced tomatoes. OH! And I ended up adding a cup of creamy Peanut butter in addition to the crunchy for more peanut buttery taste and not SO many nuts (Although I think that is more Brand specific than recipe specific). All in all I DEFINITELY think you should give this a try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lavendula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8234479/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-17T05:58:52.787Z",
                "reviewBody": "I made this for a co-worker who is from Benin in West Africa. He loved it and deemed it very authentic! I made it pretty much as written except adding a little more greens and peanut butter. This recipe is the real deal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Big Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2839396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-01-25T12:16:34.300Z",
                "reviewBody": "Made it twice. Didn't look like the picture at all. you have to cut back the liquid to about half of what it says. Otherwise it's too soupy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Hunter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22449256/"
                }
            }
        ]
    }
]