[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/215/salad/pasta-salad/",
                    "name": "Pasta Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16186/salad/pasta-salad/chicken-pasta-salad/",
                    "name": "Chicken Pasta Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218511/barbeque-chicken-pasta-salad/",
        "name": "Barbeque Chicken Pasta Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3769313.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2019-04-02T06:55:24.000Z",
        "description": "Zesty and sweet, this unique pasta salad melds the flavors of barbeque chicken, pasta, and freshly diced vegetables for a delicious summer meal.  Can also be made without the chicken or with less, for a side dish.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "3 skinless, boneless chicken breast halves",
            "1 cup barbeque sauce",
            "1 (16 ounce) package small whole-wheat pasta shells",
            "1 cup barbeque sauce",
            "1 cup mayonnaise",
            "1 teaspoon ground cumin",
            "1 cup jicama, peeled and diced",
            "2 red bell peppers, seeded and diced",
            "2 orange bell peppers, seeded and diced",
            "2 (15.25 ounce) cans whole kernel corn, drained",
            "¾ cup minced fresh cilantro",
            "2 (15 ounce) cans black beans, rinsed and drained",
            "2 jalapeno peppers, seeded and chopped (wear gloves)",
            "1 red onion, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken breasts into a saucepan over medium-low heat, and pour in 1 cup of barbeque sauce. Simmer the chicken until the meat is no longer pink inside, about 15 minutes. Allow to cool, and dice chicken meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the shell pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain well in a colander set in the sink. Rinse pasta with cold water until chilled, and drain again thoroughly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large salad bowl, whisk 1 cup of barbeque sauce with mayonnaise until thoroughly combined. Mix in the cumin, then stir in cooked chicken. Place cooked pasta, jicama, red and orange bell peppers, corn, cilantro, black beans, jalapeno peppers, and red onion into the salad bowl, and gently fold to combine with the dressing. Serve warm or chilled.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Pasta Salad",
            "Chicken Pasta Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "nenithel"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.423076923076923,
            "ratingCount": 52,
            "itemReviewed": "Barbeque Chicken Pasta Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "435.1 calories",
            "carbohydrateContent": "61.6 g",
            "cholesterolContent": "24.1 mg",
            "fatContent": "16.4 g",
            "fiberContent": "6.1 g",
            "proteinContent": "15 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "808.2 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-07-08T22:16:38.697Z",
                "reviewBody": "Was very tasty!   Cut back on the peppers a bit...\n\nApparently, some of you folks don't understand what a review is....like Cheryl2008 for instance, \"Left out the pasta, mayo, jicama, cumin.\"\n\nSo, Cheryl, you didn't make this pasta salad yet you review it? Why not post your own recipe?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Eric The Patriot",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15556348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-25T00:18:38.79Z",
                "reviewBody": "This was very good and receives lots of compliments but gets 4 stars as written. It's a 4.5 star with the following: The chicken step is a lot of work. If your local market sells fresh cooked chicken mix it with the cup of BBQ sauce and it saves a lot of time. Unless you really LOVE bell peppers 4 bell peppers is a lot. So if you just LIKE bell peppers reduce to 2 or 3 peppers and you'll have PLENTY. I substituted celery for the remaining amount of peppers and it adds a lot. I jullienned my jicama and it wilted by serving time. If serving cold there are a few things that don't hold that well: Jicama and the cilantro. I'd suggest saving out at least some of the cilantro (since it does add a lot of flavor during the chill) and all of the jicama until closer to serving time.If you add a bit of green onion it also helps to freshen the look of the salad. Finally my impression was that it was a little too sweet (might depend on your BBQ sauce) so I added some lime mixed with a bit of water olive oil salt and pepper to add a slight citrus dimension -- about 1/3 of a cup of this lime vinagrette. Next time I'll probably just whisk some lime just into the mayo before adding it into the salad. Makes a ton of food. UPDATE: I've started cutting back on the mayo and have increased evoo and lime. Just fresher tasting that way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nette/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-01T17:48:14.917Z",
                "reviewBody": "My husband and I both loved this dish! I used what I had onhand - red pepper frozen corn and cilantro. I skipped the black beans jicima and red onion only because I didn't have the ingredients. I was looking for a light summer dish - and this was perfect! I look forward to making it the next time we have friends over for dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Missy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7254573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-17T19:59:24.96Z",
                "reviewBody": "Had this last night. Yum! We did change the whole wheat pasta for regular shell pasta. The kids love it also. I thought they all would of turn there noses up on it. Thanks for the recipe nenithel",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7352652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-10T20:00:53.557Z",
                "reviewBody": "This is a very versatile salad to fit any family's taste. I've made this a several times and the family loves it with only a couple modifications due to our taste preference: only (1) orange and (1) red bell pepper no jalapeno peppers and didn't have cilantro... Have to agree with previous reviews to leave out the jicama until ready to serve. I've made it with out any peppers or jicama (just didn't have any) instead added can of green beans & kidney beans... Tip: you bake the chicken breast in a smoky seasoning of personal preference & the BBQ sauce... We have also combined ranch dressing with the BBQ sauce (we use that on several salads!) Yum!!! Thank you for a wonderful and versatile salad nenithel!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KrystynEd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3085491/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-18T00:57:59.917Z",
                "reviewBody": "For me this recipe was part of a \"Pantry Challenge\". I basically plugged a few ingredients in that I had on hand and this was one of the first recipes that popped up. I did scale this recipe back by half. I cannot find jicama anywhere in the area I live so I just omitted it. I also did not add the jalapeno pepper because I was feeding two kids. To make this a little......cheaper I did skip the step of cooking the chicken in the barbeque sauce only because I didn't want to overuse the little bit that I had in case I needed it for another recipe. I just cooked the chicken with some spices in my slow cooker for most of the day cooled it and then pieced it out for the salad. Very interesting take on pasta salad my two kids especially liked it. NO leftovers. I would make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-09T14:05:15.123Z",
                "reviewBody": "Only deviated by cutting some of the ingredients in half I only used one can of beans one cup of frozen corn one jalapeno (since it was all I had) one red and one orange pepper (again all I had!) cooked up 4 good sized chicken breasts and I didn t use jicama. And I also used one box of medium bow tie pasta as that was all I had. This was surprisingly fantastic! My husband and 4yr old devoured it. We had it warm the first night then cold leftovers for lunch the next few days (it makes a TON!). It tasted great both ways but I preferred it cold. This is a great summer recipe and would be perfect for potlucks since it makes SO much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jmbubble",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1593787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-21T01:05:12.927Z",
                "reviewBody": "This recipe was so delicious!! It's a combination of things I wouldn't have put together but it turned out great- people had third helpings when I made it for a picnic. I used whole wheat rotini instead of shell because I had it on hand and I prefer whole wheat and it was great. I also followed the advice of other commenters and only used 2 peppers and a few stalks of celery and that turned out great. I would caution other readers that this recipe makes A LOT of food!!! I filled two large serving bowls! I could have halved the recipe and been fine but it's so good I'm not sad to have leftovers. Highly recommend!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kschneids",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6241550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-07-14T07:43:26.283Z",
                "reviewBody": "No changes necessary it was great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ev",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12218269/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-08-14T17:52:59.21Z",
                "reviewBody": "We made some big changes but still wasn't the best. We made it warm so we boiled the vegetables before putting them in the pasta mix. We also added more vegetables (zucchinis and mushrooms) and doubled the amount of pasta. Even with all these other additions it was way too much BBQ sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ali Almohsen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20074016/"
                }
            }
        ]
    }
]