[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1035/bread/pizza-dough-and-crusts/",
                    "name": "Pizza Dough and Crust Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23809/crazy-crust-pizza-dough/",
        "name": "Crazy Crust Pizza Dough",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F71592.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:42:18.000Z",
        "description": "A quick and easy way to make your own pizza crust. Simply add the meat and vegetable toppings of your choice.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "1 pizza crust",
        "recipeIngredient": [
            "1 cup all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon dried oregano",
            "⅛ teaspoon black pepper",
            "2 eggs, lightly beaten",
            "⅔ cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a rimmed pizza pan or baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together flour, salt, oregano and black pepper. Mix in eggs and milk; stir well. Pour batter into prepared pan and tilt until evenly coated. Arrange toppings of choice on top of batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 20 to 25 minutes, until crust is set.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove crust from oven. Drizzle on pizza sauce and sprinkle on cheese. Bake until cheese is melted, about 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Pizza Dough and Crust Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8078817733990147,
            "ratingCount": 609,
            "itemReviewed": "Crazy Crust Pizza Dough",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "85.6 calories",
            "carbohydrateContent": "13.1 g",
            "cholesterolContent": "48.1 mg",
            "fatContent": "1.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "3.9 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "316.9 mg",
            "sugarContent": "1.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-15T21:58:51.89Z",
                "reviewBody": "My family thought tonight's homemade pizza was awesome...I will make again, although, I did make a few changes...I used 1 1/2 cups flour, 1 egg (not two) and added 1 1/2 tbsp olive oil, 1 1/2 tbsp baking powder, 1 1/2 tbsp cold water and 1 tbsp basil. The baking powder made the dough rise just a bit more than it would have otherwise and my advice - use the herbs you love to add some flavour. All in all, baked into a lovely crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mizwhite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1669495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-19T23:50:28.203Z",
                "reviewBody": "I thought this was a great yeast-less, homemade crust. I made a few substitutions and followed some of the recommendations and was really pleased with how it turned out. First, I used whole-wheat flour and added at least another 1/2-1 cup to the recipe so it was more firm and less moist. I omitted the second egg, added 1 tsp baking poweder, put in about 1-2 Tbsp. Italian seasoning, then pressed into a well-greased 11 x 13 baking sheet. I only needed to cook it for about 8 mins, then pulled it out and spread olive oil on top; then topped with tomato sauce, mozarella cheese, mushrooms, onions, fresh garlic and basil, tomatoes, green bell pepper, and olives. I then popped it in the oven again but used the broiler instead since my crust was already cooked enough and I was afraid I'd burn it. I might try cooking the crust for 5 or 6 mins next time, then add my toppings, then cook for about 8-10 mins at 400 next time to see how that goes. The crust was thin but sturdy...held all the toppings really well and had a great flavor. My hubby really liked it and both kids gobbled it up. A great, healthy alternative to traditional pizza crust. I'll definitely be making this again!\n\nFYI...definitely follow the recommendations of adding more flour, omit the second egg, and add baking powder. The original recipe does seem to be a little moist. Oh, and don't forget to spray your pan...otherwise you'll be scraping it out of the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBERMARIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1214531/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-24T02:48:10.28Z",
                "reviewBody": "I used one egg as others had suggested and also baked the crust for 10 minutes before adding toppings then an additional 10 minutes. I did not have oregano on hand so I used Italian seasoning and it was very tasty. I had no problem with the crust sticking to the pan...I sprayed it well with butter spray and also sprinkled the pan with cornmeal. This is the perfect no yeast crust!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim O.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2200101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-28T16:47:32.107Z",
                "reviewBody": "Stop giving recipes high ratings and great comments when you are going to be saying you made changes at the end....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Janice H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6712167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-16T21:11:03.857Z",
                "reviewBody": "I would have called it flat bread rather than pizza dough. It tasted terrific. I made the following additions: I added an extra 1/2 cup of flour I baked it for 10 min w/out any toppings I coated my baking stone with lots of Crisco Olive Oil spray (it didn't stick at all). I added crushed red pepper lots of garlic powder onion powder and pepper to the crust. After it cooled I topped it with a mixture of olive oil and 5 pressed cloves of garlic. Then came the colby/jack cheese thinly sliced tomato thinly sliced onion and thinly sliced mushrooms. I cut a chicken breast into bite sized pieces and sauteed it in olive oil and pressed garlic (2 cloves) until done. Then I used my Pampered Chef chopper to chop it into tiny little pieces and added that to the toppings. I then baked it at 400 for another 12 minutes. No sticking no bad or bland flavor no burning nothing wrong at all. This recipe is wonderful and I'll be making this again with other fun toppings. But I call it flat bread not pizza crust. Enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heidi R",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1681320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-30T16:05:14.017Z",
                "reviewBody": "Good pizza crust in a pinch when you don't have yeast. I will make it again but will only use 1 egg (it tasted a bit like an omelette with pizza toppings:)). Also we were only using cheese so I baked it by itself for 15 minutes in the preheated oven then turned it over and put on the toppings. Baking it longer would have probably burned the crust. It did stick but only in one place so I probably just didn't evenly spray the pan. The dough is very batter like before you cook it but bakes up nicely. Note; if you are making this don't expect it to be like a store bought or restaurant pizza crust. It's good in its own right but doesn't have the yeasty taste or feel of yeast raised crusts (obviously:)). My husband loved it and might even prefer it over the typical pizza crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MEHUNGRY98",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1147675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-29T22:20:43.343Z",
                "reviewBody": "I never made homemade pizza because I didn't like to deal with yeast so this is great. I've made it more than a dozen times now and get a request for it at least once a week. I make a triple batch (with 4 eggs) and use two large insulated cookie sheets. Cook for 12 minutes then flip over and spread with tomato paste. My 3-year-old handles all the other toppings. Then back in the oven until the cheese starts to brown. Thanks for this great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rebconr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2226682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-02T23:07:51.163Z",
                "reviewBody": "If you like thin crust and don't like to mess with yeast dough you've got to try this!!! I added some garlic powder and italian seasoning & did prebake it for about 10 minutes (it was amazing the way it formed \"sides\") I used an 11 X 15 cookie sheet. Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAJEC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-13T20:11:30.577Z",
                "reviewBody": "I made this by the recipe and it was fresh and made me wonder why I buy the 5.00 pizzas.  I look forward to trying different herbs and cheeses in the dough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VELEZ6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1354366/"
                }
            }
        ]
    }
]