[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
                    "name": "Raspberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218632/incredible-raspberry-cheesecake-cookies/",
        "name": "INCREDIBLE Raspberry Cheesecake Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F877017.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2019-04-02T06:55:30.000Z",
        "description": "I created a monster with these cookies. OMG!! I found these amazing cookies at a local gas station and had to have the recipe...I finally had some help and came up with this recipe for them. Take that Otis Spunkmeyer....I got ya ;-) The flavor just pops right off the cookie and into your mouth! These aren't as gooey as Otis Spunkmeyer cookies but they are INCREDIBLE!!!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "1 1/2 dozen",
        "recipeIngredient": [
            "1 (8 ounce) package cream cheese, softened",
            "1 egg",
            "1 (17.5 ounce) pouch sugar cookie mix",
            "⅔ cup raspberry baking chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, beat the cream cheese until soft and fluffy with an electric mixer, then beat in the egg until thoroughly combined. Mix in the cookie mix, then stir in the raspberry chips. Drop the dough about 2 inches apart onto the prepared baking sheets with a tablespoon or small scoop. Lightly pat the cookies to flatten.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the edges of the cookies are lightly golden, 9 to 12 minutes. Cool before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Raspberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Melissa Goff"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.447058823529412,
            "ratingCount": 170,
            "itemReviewed": "INCREDIBLE Raspberry Cheesecake Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "212.9 calories",
            "carbohydrateContent": "27.9 g",
            "cholesterolContent": "24 mg",
            "fatContent": "9.9 g",
            "fiberContent": null,
            "proteinContent": "2.9 g",
            "saturatedFatContent": "4.8 g",
            "servingSize": null,
            "sodiumContent": "104.7 mg",
            "sugarContent": "12.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-25T23:36:56.55Z",
                "reviewBody": "Amazing! I too could not find raspberry baking chips. In place I bought a small can of raspberry pie filler. I mixed the ingredients as directed (leaving out the raspberry chips/pie filler) and after mixing was complete I GENTLY folded the filler (about half the can) in with the dough. Roll into balls slightly flatten. They turned out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3721223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-20T00:43:24.527Z",
                "reviewBody": "This is my first review and well overdue considering I am a avid stalker of this site and of course a fan of mis7-ups, (one of my favorite cooks).  I was excited to try this recipe considering how easy it was along with the few ingredients, but her excitement about the cookie had me so courious that I could not wait for other reviews which is something I would typically never think of doing.  As for the recipe...I took my short shopping list to Walmart and of course could not find raspberry baking chips so I had to improvise the recipe slightly.  I added & beat in 2 teaspoons of raspberry extract to the egg/cream cheese mixture, then the cookie mix per the instructions..and just because I felt I needed to add something to replace the raspberry chips, I folded in some white chocolate chips.   I did not flatten down the cookie dough prior to baking and ended up with 30 cake-cookies.  My hubby absolutely LOVED these and took them to work to share, (and brag about my cooking LOL).  Mis7-Up thank you for an awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Micki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2051360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-10T20:54:34.643Z",
                "reviewBody": "Being the author of the recipe...Thank you AR for publishing. I have a blog on the this site, which should direct others where to find the raspberry tidbits. They are under 4 dollars a bag and the shipping is really inexpensive. My blog is attached to my name ;-) As for my recipe. My family loves these little humdingers! As much as chocolate is a great craving...we crave these more. Fluffy, lite and full of flavor. Will add this to note: If your cookies are lumpy....you've not incorperated the ingredients well enough. Reason could be for 2 things. 1. not mixed well with the cookie mix & 2. Cream cheese was not at room temp and soft when mixing together. This has been an addicting cookie from the start. The chips makes the cookie burst with flavor. I've taken note in my blog of another AR'er that has made her own raspberry chips to suit her and kuddos...hope others see notes to help make them from scratch...Hope y'all enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-22T17:55:27.993Z",
                "reviewBody": "Sinfully rich and absolutely delicious - these definitely are \"INCREDIBLE\" Raspberry Cheesecake Cookies!!! If you love raspberry cheesecake but don't want to take all the time and effort to make it well this little cookie is for you! You get all the flavor of the cheesecake with just four little ingredients all wrapped in sweet bite-sized little treat...what more could you ask for? Ever since I spotted this as one of mis7up's personal recipes I had to try this. So I ordered the raspberry baking chips (available on Amazon.com) and anxiously awaited their arrival. It's impossible to eat just one of these and I have to agree mis7up you've created a monster as these are highly addictive. These bake up beautifully and are hard to resist straight out of the oven. Break out the ice cold milk napkins and enjoy. I drizzled these with a bit of white chocolate and again took the title of \"Best Aunt Ever\"! Thanks for a truly wonderful and creative yet dangerously simple recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-20T13:26:35.47Z",
                "reviewBody": "Two days ago the raspberry tidbits came in the mail and I set about making the cookies right away. They disappeared very quickly. I made the recipe just as directed baking mine for 11 minutes which left them golden brown on the bottom. The photo looks just how mine did. Don't overbake them. Bet you can't eat just one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-23T16:04:45.043Z",
                "reviewBody": "These are excellent! I couldn't find the raspberry chunks either so I used 2/3 cup of fresh chopped raspberries and 1/4tsp of raspberry extract. Quick side note: watch these cookies! They don't look done, even when they are!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cold.bostongirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4923847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-30T22:33:54.683Z",
                "reviewBody": "I am sorry to say that I din't care for these cookies at all... I even went out of my way to find and order raspberry chips just to make these cookies because there were so many raving reviews about them. First of all I didn't enjoy the strong artificial flavors of these cookies. Second I didn't like the textures of them. Since I was determined to like these I made them 3 times to make sure I didn't mess up anything but I still didn't care for them. My 6-year-old did like them though. But my 4-year-old didn't like them at all either. So there it is my honest review/opinion. Hope it helps.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Citygirlincountry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/myboysmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-20T21:02:59.543Z",
                "reviewBody": "I'm giving it 5 stars because its awesome with white chocolate chips but WHERE does one find raspberry chips??? Please post! ! !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3850856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-14T04:44:27.393Z",
                "reviewBody": "I knew the second that mis7up posted these cookies and mentioned them on the \"buzz\" I had to make them. They are absolutely YUMMY! 4 ingredients 20 minutes and you have a perfect addictive \"INCREDIBLE Raspberry Cheesecake Cookie\"!! The Raspberry Tidbits (baking chips) are one of the best (new to me) products I have used in a long time. Thank you for finding them and posting it. They have so much flavor and take these cookies to a new level. We love the soft texture of these cookies and the Cream Cheese makes them taste straight from the bakery. You would never know that a packaged sugar cookie mix is used. I got 32 cookies out of this and between 5 of us there are only 18 left (I just made them earlier today!!:) I also ordered the Strawberry and Blueberry Tidbits and can not wait to try these with those flavors. This is an excellent recipe mis7up. Thank you so much for sharing!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            }
        ]
    }
]