[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1314/breakfast-and-brunch/eggs/omelets/",
                    "name": "Omelet Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218928/easy-egg-white-omelet/",
        "name": "Easy Egg White Omelet",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F889962.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T06:55:38.000Z",
        "description": "This is my go-to breakfast every morning. Fast, easy, foolproof, customizable, and packed with protein, all for fewer calories than your average fast-food breakfast sandwich.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "cooking spray",
            "2 tablespoons chopped onion",
            "2 tablespoons chopped green bell pepper",
            "2 tablespoons chopped mushrooms",
            "salt and ground black pepper to taste",
            "1 (32 ounce) container refrigerated pasteurized egg white substitute (such as Egg Beaters Whites®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Spray a 9x5-inch glass or microwave-safe loaf pan with cooking spray; sprinkle the onion, green bell pepper, and mushrooms into the pan, and toss lightly with a fork just to mix. Season with salt and black pepper, and pour in the egg whites.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook in a microwave oven on High setting for 3 minutes. Remove and stir the cooked egg white from the side of the pan into the rest of the ingredients; cook for 3 more minutes on High. If the omelet is still a little runny on top, slice it into chunks and turn them over in the loaf pan; microwave for 30 more seconds on High. Adjust salt and pepper, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs",
            "Omelet Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DONNA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.384615384615385,
            "ratingCount": 26,
            "itemReviewed": "Easy Egg White Omelet",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "127.7 calories",
            "carbohydrateContent": "0.8 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.2 g",
            "proteinContent": "24.9 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "370.9 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-09-14T17:32:54.083Z",
                "reviewBody": "this sounds so yummy and easy. i can't wait to try it! and whoever made that comment about \"wheres the protein\" and gave this 1 star is dumb. excuse me but eggs have a ton of protein genius. dont give things a poor rating that you haven't even made. eghh",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brookeking07",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4794629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-15T18:36:23.587Z",
                "reviewBody": "How lovely to be able to make an omelet in the microwave! I increased the vegetables a bit and sauted them in a pan-sprayed skillet before putting them in the glass loaf dish. I know I just made more work for myself but I like the browned flavor. Also the Egg Beaters are kind of expensive so I just separated a dozen eggs which I think made about the same volume. Now I just need to figure out what to do with the yolks. Anyway it seemed to work just fine. I also added a sprinkle of granulated garlic to the eggs along with a splash of hot sauce. I loved cooking the omelet this way. Thanks so much for the recipe DONNA!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-16T13:24:20.553Z",
                "reviewBody": "I've been doing Egg Beaters like this for a while and this definitely is \"Easy\" and so simple to make for a quick breakfast. Plus it's low in fat and good for you too! Since I was making this for just me I used only one cup of Egg Beaters and just eyeballed the rest of the ingredients. I also used a combination of red and green pepper along with a bit of tomato and garlic. Watch your microwave times as they do vary. Once this was done I topped it with a bit of light cheddar cheese and wrapped it in a warm tortilla for \"breakfast on the go\". This is a great base to add-in whatever you like and there's a number of flavors of Egg Beaters so get creative! Thanks DONNA!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-11T17:15:53.19Z",
                "reviewBody": "Pretty good as written but more veggies (vary them according to what you like) makes it better. And just for the record I've never gotten why folks buy and use egg beaters. All you have to do is use a real egg - just separate the yolk from the whites and use only the whites. This is basically all egg beaters are except they throw in guar gum and xanthan gum and flavoring - yuck! If you want a heartier omelet use two egg whites and one whole egg. Most people can handle one yolk and that's where the iron is if you're looking to add some iron to your diet. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8467227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-12T15:31:53.273Z",
                "reviewBody": "This was so easy yet delicious. I used a round glass baking dish so after I folded it it was in the shape of an omelette. I added onion bell peppers and spinach. I didn't need to feed four just myself so I used just enough liquid egg white to cover the bottom of the dish it took about 3 minutes to cook. This way of cooking an omellette will be in my permanent cookbook! Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Corie Browning",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5815484/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-17T16:36:18.15Z",
                "reviewBody": "Yum! I've been slacking on sticking to Egg Beaters (they are so expensive!) But Trader Joe's sells them for a reasonable price so I picked some up and was thrilled to find this recipe. I omitted the mushrooms salt green peppers and pepper and added roasted red peppers fresh minced garlic red pepper flakes green onion and sprinkled freshly grated provolone cheese on top.I love the convenience of using the microwave for this too! Thanks so much Donna!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MBKRH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lilkegs/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-17T05:23:57.343Z",
                "reviewBody": "Surprise! You CAN cook in a microwave! I was a little skeptical about that but this dish turned out very nice. Used a round glass baking dish and garnished with fresh tomatoes and green onions. This is a make-again recipe. Loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cynthia Ross",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cynthiaross/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-19T04:08:19.233Z",
                "reviewBody": "This is a great basic recipe and the only reason for my mediocre review is that it has SO much more potential. You can LOAD fhis with almost any variety of veggies for very few calories. A personal favorite of mine is onion a ton or so of mushrooms zucchini and spinach and I mix it up regularly so as not to get bored and use them liberally. Sometimes I add a piece or two of thin-cut crumbled bacon or a bit of finely diced lean ham for flavor ( 50 calories). A sprinkle of less than a tablespoon of a flavorful cheese (shredded Parmesan sharp cheddar feta or bleu for example) goes a long way in a simple dish. Also lots of herbs and spices mixed with the eggs all to suit your own preference add much to the flavor and healthfulness of the meal without adding fat or calories. I often use salt fresh ground black pepper fresh parsley granulated onion minced garlic a pinch of cayenne and a bit of turmeric. These also add a little more color to make the plate more visually appealing. Too and especially since I can get an 18-pack of eggs where I live for roughly 1.25 right now I just crack and separate the eggs whites myself; not that there is anything wrong with using a prepared product if you find it affordable and convenient. Lastly guests who might balk at \"just egg whites?!\" (lol) may respond better to a ratio of one whole egg to every two or three whites. Still a good healthy option and they will likely soon discover that they don't miss the familiar w",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tasha Sutton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4232693/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-30T06:35:07.64Z",
                "reviewBody": "my favorite omelet so far",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "buki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13399157/"
                }
            }
        ]
    }
]