[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218982/yummy-pork-noodle-casserole/",
        "name": "Yummy Pork Noodle Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F717317.jpg",
            "width": 2560,
            "height": 1920
        },
        "datePublished": "2019-04-02T06:55:40.000Z",
        "description": "This is my Mom's pork noodle casserole.  The added sour cream gives it a little twist on the usual version.  The added red pepper and corn give it color and flavor.  You can add and subtract any vegetables in this versatile recipe.  This is one of my favorite comfort food recipes.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 cups egg noodles",
            "cooking spray",
            "3 tablespoons butter",
            "¼ cup chopped onion",
            "¼ cup chopped celery",
            "¼ cup chopped carrots",
            "¼ cup chopped red bell pepper",
            "2 (10.75 ounce) cans  condensed cream of chicken soup",
            "½ cup sour cream, or more to taste",
            "2 cups shredded Cheddar cheese",
            "1 (8 ounce) can whole kernel corn, drained",
            "3 cups cubed cooked pork",
            "1 teaspoon salt",
            "¼ teaspoon ground black pepper",
            "½ cup dry bread crumbs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the noodles have cooked through, but are still firm to the bite, about 5 minutes. Drain well in a colander set in the sink.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking pan with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a skillet over medium heat. Stir in the onion, celery, carrots, and red bell pepper; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the noodles, cream of chicken soup, sour cream, Cheddar cheese, corn, and cooked pork, then season with salt and black pepper. Transfer mixture into the prepared baking dish. Sprinkle bread crumbs on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until bubbly, 30 to 35 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "cjscott"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.577586206896552,
            "ratingCount": 116,
            "itemReviewed": "Yummy Pork Noodle Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "579.6 calories",
            "carbohydrateContent": "32.9 g",
            "cholesterolContent": "142.2 mg",
            "fatContent": "32.9 g",
            "fiberContent": "2 g",
            "proteinContent": "38.2 g",
            "saturatedFatContent": "17.2 g",
            "servingSize": null,
            "sodiumContent": "1575.1 mg",
            "sugarContent": "3.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-10-13T02:03:31.397Z",
                "reviewBody": "I had some leftover pork roast and, honestly, I didn't have high expectations for this casserole.  But I was pleasantly surprised.  I followed the recipe to the letter, except I added a handful of frozen peas (for some color), sub'd a can of cream of mushroom soup for one of the two cans of cream of chicken soup (only had one on hand), and baked in serving-size  casseroles.  The one criticism I have is that it was very watery, so next time, I will use only one can of soup, otherwise, it was pretty tasty. Chicken or turkey should work equally well in this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-31T22:17:18.407Z",
                "reviewBody": "Very easy to put together and very tasty.  I used 1 can of cream of chicken soup and 1 can of cream of celery (because I didn't have any celery in the house).  The 13x9 pan was stuffed full.  Going to freeze the leftovers in individual size servings.  Will be making again, but as another reviewer said, I will add peas to it next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GOODELLI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/658017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-09T03:21:25.03Z",
                "reviewBody": "LISTEN HERE! I gave this five stars but I feel like I changed a lot.  I used the 3 cups egg noodles as suggested in another review.  I did not have celery but used carrots (finely chopped), onion, and fresh garlic, minced.  I had four pork chops, bone in, seasoned with salt, pepper, and onion powder and cooked them on low in a skillet.  When they were done, I removed them from the pan and added the butter, carrots, onions and garlic - scraping up the flavorful bits of pork on the bottom of the pan.  After sauteing those I added the half can of corn, a small can of mushrooms, and a half cup of thawed frozen peas to the same skillet.  I used the cream of asparagus per another review even though I had cream of chicken and I am glad I did.  THIS MADE THE RECIPE FOR US! Sour cream was added as recipe suggests but I halved the cheese and used sharp cheddar.  I didn't add any extra salt.  I like salt a lot but the creamed soup and other ingredients added plenty of salty flavor.  I also did not bake this in the oven, just heated everything in the skillet and served with garlic toast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Courtenay Howell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3300259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-23T23:28:53.29Z",
                "reviewBody": "I had leftover pork roast that I wanted to do something different with and found this recipe.  I was reading the reviews and thought that 2 cans of soup was a bit much, we are trying to watch our sodium intake.  I ended up modifying the recipe.  I doubled the onion, red pepper and celery and added mushrooms halfway through the saute of the vegetables.  I also added peas when I added the corn (used frozen corn and peas, thawed).  I used No Yolk egg noodles and package said to cook 10 to 12 minutes, I cooked them 9 minutes and used the whole bag.  I didn't add any salt and doubled the ground pepper.  I sprinkled parm cheese on the top before the bread crumbs.  I turned this into two 9x9 dishes and froze one for later since there is just two of us.  I really liked it, very comforting dish on a long day, plus I have one more to look forward to!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Hunter Shaw",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefamy1033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-19T13:25:22.36Z",
                "reviewBody": "We thought it as great! We didn't have any cream of chicken soup so we used cream of asparagus. What an outstanding flavor. This basic recipe would work with nearly any meats ( Pork Chicken Tuna ) as well as a variety of cream soups and vegetables. Use your imagination and you are sure to get a ht",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Flipper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3587811/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-08T04:42:57.557Z",
                "reviewBody": "This is such a great base recipe for many casseroles. I left out the pork (vegetarian) and a can of soup. Subbed plain greek yogurt and used about half a cup of alfredo I had left from making a dip. Also added about 1 tsp of garlic powder. Was out of celery and red pepper. Used frozen green beans instead. Definitely one of those base recipes that you can mix and match and use up stuff from the fridge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dreampdx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2982198/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-01T21:37:15.3Z",
                "reviewBody": "This recipe was easy to make. I did not add 2 cans of cream of chicken soup instead I added a 1/4 cup of milk to cut down on the sodium. I also added frozen peas and frozen corn instead of canned corn.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "amberkolberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7662910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-19T21:06:27.083Z",
                "reviewBody": "This was very good 'comfort' food, but a little on the too creamy and cheesy side, which for me is odd.  I will make again, but I'll increase the noodles to maybe 3 cups and double the veggies.  But definitely a good combination and good way to use up leftover pork.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "tammyl64",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1638592/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-08T17:12:22.257Z",
                "reviewBody": "I wasn't really sure how this was going to taste. Everyone like it said it was different then my normal casserole. I will surely make this again. Thank for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brenda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2040108/"
                }
            }
        ]
    }
]