[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/230/world-cuisine/latin-american/caribbean/",
                    "name": "Caribbean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220167/cuban-style-picadillo/",
        "name": "Cuban-Style Picadillo",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1312850.jpg",
            "width": 6552,
            "height": 6552
        },
        "datePublished": "2019-04-02T06:56:14.000Z",
        "description": "There are many variations of picadillo. This is a savory and traditional Cuban home-cooked meal with ingredients that are readily available in any supermarket. Do not omit wine, as it's really important to the flavor of this dish. Serve with garlic and onion white rice, black beans, and fried ripe plantains. Garnish with strips of ham and roasted red pepper.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 potatoes",
            "salt to taste",
            "2 tablespoons olive oil",
            "1 onion, minced",
            "1 green bell pepper, minced",
            "2 teaspoons crushed garlic",
            "1 ½ pounds lean ground beef",
            "2 cups dry red wine",
            "1 (15 ounce) can tomato sauce",
            "⅔ cup pimiento-stuffed green olives, drained and chopped",
            "½ cup capers, drained",
            "¼ cup golden raisins",
            "1 teaspoon ground cumin",
            "1 pinch dried oregano",
            "¼ teaspoon black pepper",
            "¼ teaspoon salt",
            "1 teaspoon olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the potatoes into a large pot with enough water to cover; season with salt. Bring the water to a boil; reduce heat to medium-low, place a cover on the pot, and cook the potatoes at a simmer until tender, about 20 minutes. Drain and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons olive oil in a large Dutch oven over medium heat; cook and stir the onion, green bell pepper, and garlic in the hot oil until the vegetables soften, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crumble the ground beef into the onion mixture, breaking the meat into smaller pieces as you mix; cook and stir until the beef is completely browned, 7 to 10 minutes. Drain as much fat from the mixture as possible.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the red wine, tomato sauce, olives, capers, golden raisins, cumin, oregano, black pepper, and 1/4 teaspoon salt into the ground beef mixture. Bring to a boil, reduce heat to medium-low, and cook at a simmer until the wine had reduced significantly, 25 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Peel the cooled potatoes and cut into chunks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 teaspoon olive oil in a skillet over medium heat. Cook the potatoes in the hot oil until browned, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently fold the cooked potatoes into the simmering ground beef mixture; cook together 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Caribbean"
        ],
        "recipeCuisine": [
            "Latin American",
            "Caribbean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "lutzflcat"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.615384615384615,
            "ratingCount": 39,
            "itemReviewed": "Cuban-Style Picadillo",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "471.3 calories",
            "carbohydrateContent": "29.6 g",
            "cholesterolContent": "78.9 mg",
            "fatContent": "22 g",
            "fiberContent": "4.5 g",
            "proteinContent": "26 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "1337.7 mg",
            "sugarContent": "10.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-06-13T22:53:19.66Z",
                "reviewBody": "Almost exactly the same way I cook Picadillo! Only I used white wine and did not have capers. Delicious. My entire family loves Picadillo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie Lacerna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3175254/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-04T12:45:39.77Z",
                "reviewBody": "I'm the submitter of this recipe, and one change I've made since submitting this recipe is that I slice the olives instead of chopping.  Makes for nicer presentation and you get more olive flavor from the slices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-27T11:02:00.683Z",
                "reviewBody": "I learned of this recipe and Cuban food by reading one of the submitter's blogs. I was very excited to try this recipe and I was not let down. Although I've had nothing like it before (not a huge Cuban influence where I live) and nothing to compare it to I can't imagine this \"Picadillo\" any other way. What a tasty dish! I thought the red wine would over power but it really only added to the flavours. The browned potatoes added something too. Next time I may get them a little crispier for some more texture. I followed the recipe exactly with the exception of omitting the raisins. I just can't bring myself to eat them. I imagine they would've added a sweetness that we obviously didn't miss. Thanks lutzflcat for sharing a cultural dish that we would have never known about. It's a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Volleyballmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3368022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-30T02:47:58.17Z",
                "reviewBody": "This is what we (two of us with some taste-testing from my visiting daughter) had for dinner half the recipe that is and we agreed that it is a keeper! I do think I would do things just a tad different next time. First I won't forget to buy the green pepper! I made no sub for that. Second I would add double the cumin (personal preference). Third I used regular-sized green olives and cut them in half but next time I'd either quarter them or slice them in neat little slices (I'd like more of a bite of them more often). Fourth I'd cut the potatoes a little smaller---about 3/8\" to 1/2\" cubes and maybe even add just a little tiny bit of butter to the olive oil to make them brown a little better. I loved it when I had a raisin in my fork--just that little bit of sweetness was great! We do have a few leftovers but we are going to wrap those in flour tortillas with a little cheese and salsa this weekend! I'll let you know how that turns out! Thanks for this new taste treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-09T03:02:30.843Z",
                "reviewBody": "I made this tonight with Congri (Cuban black beans and rice) and it was a winner! I'm half Puerto Rican but never cook the food I grew up eating it always seemed so time consuming to make. This is actually a pretty easy dish to make and reminds me of the filling my mother makes for empanadillas particularly the olives capers and raisins. Like another reviewer I took a shortcut i cubed the potatoes and microwaved them while browning the meat. I thought I had raisins but couldn't find them so I resorted to picking them out of a bag of trail mix! I didn't have the amount the recipe called for but that was ok because that's the one thing I don't care for in the empanadilla filling. My boyfriend was hesitant initially - he wasn't sure what to make of the picadillo but a few bites in and he was hooked. Instead of plain white rice I recommend making congri which is pretty easy and flavorful and can be made alongside this dish (especially if you use a recipe that calls for canned black beans - I used one that was not from allrecipes).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ronniecaliente",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6916165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-07T23:29:14.54Z",
                "reviewBody": "I halved the recipe to use 3/4 pound of ground beef. I nuked the potato to save dirtying a pan used white wine instead of red and doubled up on the olives (we like our olives). Never having eaten picadillo before I wasn't sure what to expect. After it simmered for a bit I ended up doubling the cumin and oregano and will probably double the potato next time as well. (I liked the idea of frying the potatoes before adding so they wouldn't get mushy) A tasty dish definitely different from our usual. Thanks lutzflcat I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy_in_TN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3072772/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-06T00:22:16.54Z",
                "reviewBody": "Made this tonight turns out just for myself. I used a meatloaf mix. That is what I had. Didn't have any golden raisins therefore omitted. I really liked it. I imagine the raisins would counter act the richness of the wine and meat. If I do make again I will have to plan better. Thanks for the post lutzcat",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "njmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/385747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-26T04:00:03.973Z",
                "reviewBody": "This \"Cuban-Style Picadillo\" was excellent! I loved the way the sweetness of the wine permeated even the capers and olives. This meal is a real treat! I can hardly wait to make it again! My only change next time will be to fry the cumin with the ground beef and onion mixture as I usually do (instead of adding the cumin in with the liquids as in this recipe) to take the \"raw edge\" off my freshly-ground spice. Thank you lutzflcat for sharing your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ladybug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15234165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-07T11:44:42.49Z",
                "reviewBody": "Really yummy...followed recipe closely but used white cooking wine and black raisins because I had it. Served with white rice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "msp1537",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3483986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-06T16:48:13.687Z",
                "reviewBody": "The capers are overpowering.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Andy Bryan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6095903/"
                }
            }
        ]
    }
]