[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/706/world-cuisine/european/uk-and-ireland/irish/",
                    "name": "Irish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220888/peanut-butter-potato-candy/",
        "name": "Peanut Butter Potato Candy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4476802.jpg",
            "width": 5152,
            "height": 3864
        },
        "datePublished": "2019-04-02T06:56:46.000Z",
        "description": "This candy is super easy to make and the ingredients are ones that most people usually have readily available in the house.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT2H20M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "¼ cup mashed potatoes",
            "2 tablespoons milk",
            "1 teaspoon vanilla extract",
            "1 pinch salt",
            "1 (16 ounce) package confectioners' sugar",
            "1 tablespoon confectioners' sugar for dusting, or as needed",
            "⅓ cup peanut butter, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine mashed potatoes, milk, vanilla extract, and salt in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir confectioners' sugar into potato mixture until a dough consistency is reached. Refrigerate dough until chilled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle confectioners' sugar on a cutting board or waxed paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough into a large rectangular shape on prepared surface.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread enough peanut butter on top layer of dough to cover.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll dough into a jelly roll shape; refrigerate roll for 1 hour. Slice dough into pinwheels to serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Brandi Rose"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.3968253968253967,
            "ratingCount": 63,
            "itemReviewed": "Peanut Butter Potato Candy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "116.7 calories",
            "carbohydrateContent": "24 g",
            "cholesterolContent": "0.1 mg",
            "fatContent": "2.2 g",
            "fiberContent": "0.3 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "20.7 mg",
            "sugarContent": "22.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-04-08T12:48:59.153Z",
                "reviewBody": "This candy is super delicious and sweet.  My mother use to make this for me when I was little, I made it for my children and then grandchildren.  It's always a big hit.  Do NOT alter this make as directed. Thanks for reminding me of my childhood Brandilynn.  Brings back so many memories. I would give this a 10 if available.  Keep this refrigerated after you make it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DJC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1169893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-04T15:17:05.3Z",
                "reviewBody": "Love this recipe! It's a traditional Irish recipe that my family made for years around the holidays. I use more than 1/3 a cup of peanut butter because I like a thick layer (and I like the peanut butter with the honey because the flavor is wonderful and it's easy to spread.) Make sure that you put this into the fridge until you are ready to serve.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CeceliaAnn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9313628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-19T15:02:36.61Z",
                "reviewBody": "A favorite recipe from my childhood! My mom made this for Christmas to put on the cookie tray and it was always one of my favorites because I love peanut butter so much. I did not measure the peanut butter for this recipe I just spread a generous layer on top of the potato/sugar layer. You definitely want to keep this in the fridge until you are ready to serve. I keep it in an air tight container with wax paper in between the layers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SoCalGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9312086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-28T23:56:36.117Z",
                "reviewBody": "I've made Potato Candy in the past, and since have lost that recipe. This recipe looked right, so I gave it a shot. Like many others here, my mixture was nothing but soup and completely unusable…then I evaluated the situation and realized why.\n\nHere's what's wrong with this recipe: The recipe calls for 1 (16 ounce/1 pound) package of Confectioners Sugar…THIS is nowhere near enough. If you shop at Wal-Mart, you'll notice that their bag is (32 ounce/2 pounds), this entire bag is what you should be using, not half of it, or your typical 1 pound \"box\".\n\n\nIn addition, a little adjustment to the directions- \n1. After mashing your potato with vanilla and milk, refrigerate it then, not after it's dough- the cold dough is too hard to work with.\n2. After your mashed potatoes have cooled off, mix in half of the sugar all at once. (it's ok if it's soupy at this point) Then, after that is mixed, dump in the rest of the sugar all at once, and mix. (this time it should make dough)\n3. Do Not refrigerate your dough before you try to roll it, your dough should be workable right out of the bowl. Chilling the dough will just make it harder to work with.\n\nHope this helps!\n\nNote: I have an alternate recipe for this in my collection, with the correct ingredient list and helpful tips within the instructions. Come on over and try it out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "GingerGypsy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/gingergypsy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-14T04:41:40.76Z",
                "reviewBody": "I must be stuck on stupid today. My daughter came home from school today and told me she needed a cultural dish for her class potluck TOMORROW. I panicked at first but my Dad suggested I make potato candy like my grandmother used to make when I was little. A little online research brought me to this recipe and the reviews that raved about how easy it was. Well here it is ten o'clock at night and I have watery sugary potato soup. I followed the directions to the letter and somehow ended up with nothing even close to being able to be served to my daughters class. Guess it is time to head to the grocery store and find something else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "szekeryandme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5729831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-04T16:31:08.523Z",
                "reviewBody": "I followed this recipe as another reviewer said exactly...well something was amiss. It was a blob of soft dough that even after 1 hour in refrig it was nearly impossible to roll out. I had to add at least 1 1/2 to 2 cups more sugar(and it should have been more) in order to roll it. Then the peanut butter was so hard to spread! I needed much more than 1/3 cup just to cover the dough. Then the act of rolling the dough it was more like pushing it into a form of a log. Shish! Not really worth the frustration even if it is an Irish tradition. And in the end it just too sweet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "melissainvb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9375142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-20T19:28:47.163Z",
                "reviewBody": "This is one of those recipes from my mother's childhood that was never written down. A few modifications - forget measurements! Start with only HALF of a small boiled potato (peeled and mashed) add a lid of vanilla and mix. Then add 3 large spoons of powdered sugar and mix up a little let set for a few minutes. When you come back the sugar and potato mix begins to melt! Keep adding and mixing in powdered sugar until you get a pie dough consistency. This takes a lot of powdered sugar and mixing - it's a great arm workout. Once pie dough consistency is met sprinkle powdered sugar on a clean dry surface rub on hands and then roll out the dough to about a 1/4\" thick. Then use CRUNCHY peanut butter spread over the surface. Roll up the dough cut into 3 sections. For each section roll it out until less than 1.5\" in diameter. Do so for each segment (or wrap and store in fridge for later) then cut into bite size slices. Store in fridge. The crunchy peanut butter adds texture and keeps the entire thing from being too runny or so sweet. Some people even add shredded coconut. I wonder what adding dark chocolate shavings would do...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10782431/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-11T18:44:46.443Z",
                "reviewBody": "I couldn't believe how easy this candy was! Make sure to add enough powdered sugar to get the potato portion to a dough that is easy to roll and not too sticky- I think I added a little more than 16oz. And use more than 1/3 a cup of peanut butter. I probably spread on a full cup (I LOVE peanut butter and wanted a thick layer but I would say 2/3 a cup would be the perfect amount). I actually rolled the outside with dark chocolate shavings before I sliced it and it turned out really good and made it look nice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Artemis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9408151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-20T17:46:51.34Z",
                "reviewBody": "Friendly tip: DON'T add milk. Not that it's impossible to make the dough with milk it is just so much easier to get the desired texture if milk is not added. Most recipes do not call for milk and milk is most likely the reason for the soupy mess many got. If milk is added more sugar will likely be needed. Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "YoungChefA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12672952/"
                }
            }
        ]
    }
]