[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222013/wet-burrito/",
        "name": "Wet Burrito",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1572420.jpg",
            "width": 3072,
            "height": 3072
        },
        "datePublished": "2019-04-02T06:57:13.000Z",
        "description": "This is a wet burrito with meat and beans in the traditional West Michigan style!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 burritos",
        "recipeIngredient": [
            "1 pound lean ground beef",
            "½ cup chopped onion",
            "2 cloves garlic, minced",
            "1 (14.5 ounce) can diced tomatoes with juice, divided",
            "1 tablespoon Worcestershire sauce",
            "1 ½ teaspoons chili powder",
            "1 teaspoon paprika",
            "1 teaspoon dried oregano",
            "¾ teaspoon ground cumin",
            "½ teaspoon ground black pepper",
            "2 cups refried beans",
            "¼ teaspoon ground cumin",
            "1 (18 ounce) jar beef gravy",
            "1 (10 ounce) can enchilada sauce",
            "4 large flour tortillas",
            "2 cups shredded Cheddar cheese, divided",
            "1 cup sour cream, divided",
            "¼ cup chopped onion, divided",
            "¼ cup chopped tomatoes, divided",
            "1 cup chopped lettuce, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a skillet over medium heat. Cook and stir ground beef, 1/2 cup chopped onion, and garlic in the hot skillet until beef is browned and crumbly, breaking it apart as it cooks, about 8 minutes; drain excess grease. Mix in half the can of diced tomatoes, Worcestershire sauce, chili powder, paprika, oregano, 3/4 teaspoon of cumin, and black pepper. Bring meat mixture to a boil over medium-high heat and cook for 5 minutes, stirring often.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat refried beans and 1/4 teaspoon cumin in a saucepan over medium-low heat. Keep beans warm. Mix remaining half of diced tomatoes, beef gravy, and enchilada sauce in a separate saucepan; bring to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place tortillas onto a microwave-safe plate and cover with a damp paper towel; microwave tortillas until they are soft and warm, about 30 seconds. Place a warmed tortilla onto a work surface and spoon 1/4 the beef mixture in a line down the center of the tortilla. Layer 1/4 the bean mixture on top of beef layer and spread 1/4 cup of Cheddar cheese over the bean layer. Fold right and left edges of the tortilla over the ends of the filling and roll up tortilla to make a burrito. Place burrito seam side down into a 9x13-inch baking dish. Repeat with remaining tortillas to make 4 burritos.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour gravy sauce over the burritos in the baking dish; top with remaining 1 cup Cheddar cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake burritos in the preheated oven until the cheese has melted, 15 to 20 minutes. To serve, place each burrito on a serving plate and spoon sauce from baking dish over the burritos. Top each burrito with 1/4 cup sour cream, 1 tablespoon chopped onion and chopped tomato, and 1/4 cup of chopped lettuce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Jordan VanderLaan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.557894736842106,
            "ratingCount": 95,
            "itemReviewed": "Wet Burrito",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1190.9 calories",
            "carbohydrateContent": "103.9 g",
            "cholesterolContent": "179.2 mg",
            "fatContent": "59.3 g",
            "fiberContent": "13.5 g",
            "proteinContent": "59.1 g",
            "saturatedFatContent": "29 g",
            "servingSize": null,
            "sodiumContent": "2550.9 mg",
            "sugarContent": "10.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-15T16:29:38.517Z",
                "reviewBody": "This is it! This is the recipe I have been looking for. I had wet burritos when I was growing up in West Michigan. Could not find it ever again when I moved from there. Please do not compare with regular burritos that are made in the south. These have their own identity and taste. I made these for my family and got total rave reviews all around the table. Thank you for posting this recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWSavvy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3080213/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-23T19:58:47.57Z",
                "reviewBody": "Took what I considered to be a chance on this recipe since I had some chopped meat and wanted to try a different recipe form the usual taco meat. Jar gravy?? I dont even use jar gravy @ Thanksgiving but I tried the recipe as is...and...loved it! Did NOT like the left overs couple days later but that wont stop me from making again. Thanks W. Michigan",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEANO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-19T19:17:52.97Z",
                "reviewBody": "Coming from GR Michigan I have been trying to duplicate this and could never get the sauce right! Thank you...we love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DELEVELD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/995675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-28T12:44:22.763Z",
                "reviewBody": "Wet burritos are a favorite here. I ran out of time so didn't bake them just filled rolled and then covered with sauce hot from the pan and veggies. Not quite the same but still quite good. I made homemade sauce and used fresh tomatoes rather than canned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "linda2d",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3733363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-19T02:46:52.747Z",
                "reviewBody": "I know I'm going against the pack here but we were really excited to try this recipe and were a bit dissapointed. We thought the sauce was a bit bland and are trying to figure out if it was the jar of gravy that really turned us off. It just wasn't for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Caitlin Perszyk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/caitperszyk/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-26T22:30:54.447Z",
                "reviewBody": "I, like Jordan, am from Grand Rapids and moved to Atlanta.   When I saw Jordan's last name, I knew I had to try this.  \n\nI made it exactly as designed, hoping to recreate the famous B*ltl*n* B*r wet burrito.  If you've had it you probably know that you can't find this anywhere else but in West Michigan. \n\nIt did not disappoint!  Yes, it's the gravy.  What a surprise.\n\nTo be sure, this recipe is not designed to be a Texas burrito, or a California burrito, and we got a kick out of some of the comments that tried to make this something that it wasn't designed for.  This is the West Michigan wet burrito.  It is heavy and delicious!  This is the best attempt I've run across to duplicate it.   Three of us down here in Atlanta, all native West Michigan, gave this 5 stars and two thumbs up.\n\nThat being said, we are going to experiment a little going forward.  We don't want to change the flavor, it's excellent and as designed!  We think there might be a little more beef and a little less bean.  This recipe turned out a little less dry than the real thing at B*ltl*n* and so I may try overcooking the beef and leaving the juice out of the diced tomatoes in the beef mixture.  Finally, we are going to try putting the lettuce, tomato, and onion in the burrito, putting all of the cheese outside, and then do a low broil instead of baking.   We will keep all of you West Michiganders posted.\n\nThanks Jordan!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "eamus Viridi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mojolake/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-17T04:41:39.643Z",
                "reviewBody": "This got raves from my husband. He even went as far as to say it is better than On The Border's food. While this was good it wasn't the same flavor as OTB. This was mild and more Midwesternized than TexMex. I don't know how this can only yield 4 burritos though as I got 8 and they were stuffed and I still had some filling left. I didn't have refried beans so I took a can of Ranch Style beans non-drained and smashed them up some and went from there. I mixed the bean/comino mix into the meat so all I had to do to build these was a scoop of beef/bean mix and some cheese then roll up and move on to the next one. I only used 2/3 a can of diced tomatoes and did add a pinch of kosher salt to the beef mix. I used medium spice canned enchilada sauce and a jar of brown gravy. I didn't have a lot of just Cheddar so I used a mexican cheese blend mix too. This was a nice mild dish and my husband raved. He is looking forward to taking the leftovers to work for lunch and sharing. We eat a lot of Mexican food and this passed our taste test. This was not my favorite but hubs loved it and had seconds so that makes it a keeper. My biggest complaint? It dirtied a lot of pots! Oh well the food is good and that is what matters most. Thanks I really enjoyed trying out this new recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "~TxCin~ILove2Ck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-13T17:54:10.753Z",
                "reviewBody": "The flavor was amazing but the steps to make and assemble were trying as I was also trying to calm my 3 month old baby. I will make again but when I have someone watching my little one. I put 2 unbaked burritos in the freezer for future meals.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Walterreit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2019342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-21T17:48:15.25Z",
                "reviewBody": "Was very skeptical never have I mixed beef gravy and enchilada sauce! Wow! This was delicious!! Thank you J.V. for sharing this recipe with everyone! I followed this recipe to a T...wouldn't make any changes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jnrandles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6585277/"
                }
            }
        ]
    }
]