[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/105/appetizers-and-snacks/dips-and-spreads/",
                    "name": "Dips and Spreads Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/436/appetizers-and-snacks/dips-and-spreads/salsa/",
                    "name": "Salsa Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17196/appetizers-and-snacks/dips-and-spreads/salsa/tomato-salsa/",
                    "name": "Tomato Salsa Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222041/ex-girlfriends-moms-salsa-fresca-pico-de-gallo/",
        "name": "Ex-Girlfriend's Mom's Salsa Fresca (Pico de Gallo)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2438890.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2019-04-02T06:57:14.000Z",
        "description": "My ex's mom had the best hand-chopped salsa fresca I have ever tasted back in college. Over the years, I have tweaked it to something my friends and family rave about. The trick for this salsa is marinating the onions and jalapenos in lime juice for about 5 minutes before adding the tomatoes and cilantro. There are two tricks to this recipe: 1. Hand-chop everything. It takes a while, but it is worth it.  2. The marinating is what makes this salsa special. Hope you enjoy.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup finely chopped red onion",
            "1 jalapeno pepper, seeded and finely chopped - or more to taste",
            "2 limes, juiced",
            "2 ½ cups Roma (plum) tomatoes, seeded and chopped",
            "½ cup chopped fresh cilantro",
            "1 teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix red onion, jalapeno pepper, and lime juice in a bowl. Allow to stand for 5 minutes. Mix in Roma tomatoes, cilantro, and salt; allow to stand 15 more minutes for flavors to blend.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Dips and Spreads Recipes",
            "Salsa Recipes",
            "Tomato Salsa Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "thebioteacher"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.740088105726873,
            "ratingCount": 227,
            "itemReviewed": "Ex-Girlfriend's Mom's Salsa Fresca (Pico de Gallo)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "29.4 calories",
            "carbohydrateContent": "6.9 g",
            "cholesterolContent": null,
            "fatContent": "0.2 g",
            "fiberContent": "1.6 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "394.5 mg",
            "sugarContent": "3.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-05T00:36:12.787Z",
                "reviewBody": "I made this earlier today but waited to really eat it until tonight so the flavors would meld together.  There will be none of this left after tonight!  I made it exactly as the recipe stated, using a red jalapeno (which I prefer) and kosher salt.  The measurements are right on the money.  This is great by the spoonful or as an accompaniment to something else.  For those who aren't used to using jalapenos, be sure to read how to handle them, and know that each jalapeno has its own level of heat even by the kind of variety.  So you may want to tread carefully.  Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-12T17:28:56.303Z",
                "reviewBody": "I bought one jalapeno pepper specifically for this salsa recipe. I took Marianne's suggestion and used a red jalapeno as the recipe did not specify which kind to use. I also added a couple cloves fresh garlic. I wanted a variety of textures in this salsa--I threw half of the onion, all the jalapeno, the lime juice, half of the tomatoes, the cilantro and salt in the blender and used the \"ice crushing\" feature to chop them into a finer consistancy. I then folded the pureed ingredients into the remaining onion and tomatoes. This was very good--the longer it sits, the better it tastes. We ate every single bit of it with our Black Bean Taco Salads.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-06T02:38:51.513Z",
                "reviewBody": "Almost perfect recipe. Just needed a couple cloves of crushed garlic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "My Hot Southern Mess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/myhotsouthernmess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-08T02:38:02.97Z",
                "reviewBody": "I made this to put on our pork tacos tonight but neither Hubs nor I could keep our mitts off it, surprising since I had asked him how he liked it and he shrugged his shoulders and said, “Not really,” but then kept right on eating it. And eating it.  And eating it.  Actions do speaker louder than words.  I cut the cilantro in half and that was plenty for our tastes.  I added some minced garlic but outside of that I left all else the same.  Delicious…and obviously addicting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-23T06:05:55.063Z",
                "reviewBody": "I read a bunch of pico de gallo recipes before coming to this one.I skipped everyone before this because they wern't authentic pico de gallo. This is the only pico de gallo recipe I put in my recipe box. I was looking for a authentic pico de gallo & here it is, Only authentic pico de gallo recipe on this website. Garlic does not belong in pico de gallo or garlic powder or seasoning & that isn't a personal preference I have NEVER seen it made that way & I've eaten lots of pico de gallo. Just so that anyone trying to add garlic or any of that other stuff knows. Also blending the pico de gallo, well that makes it salsa, not pico de gallo. This recipe is *perfect* as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gnvrlnn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11734822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-17T19:17:22.013Z",
                "reviewBody": "I have made my own salsa for years but never stopped to figure out the amounts just added this and that and if there was too much this I added that to make it the right blend. Your amounts were right on. I need the recipe because I have had people ask me for mine and couldn't give them anything more than the ingredients and tell them to figure it out. Now I have it thanks. I use sweet onion in mine. I also crush the cilantro and roll it in my palms then dice it fine before adding it. It helps distribute the flavor and make it less intense in a single bite. I also use about three medium sized green jalapenos mainly for aesthetics as the green is pleasing to the eye with the red of the tomato. I like the flavor of key lime when I can find good fresh ones though that often doesn't happen in Oregon. I use four to five. I don't marinate but am probably going to try that if I make it the same day as I will use it usually try to make the salsa a day before for the best flavor distribution though sometimes decided on the dinner plan the day of. Also have my special ingredient that I add last after checking the spiciness. Tiger Sauce! My all time favorite hot sauce. It just add a very special flavor. I am careful about how much I add depending on who is going to eat it. Kids and some adults prefer it on a milder side so I often split mine and then spice only part of it up for the more daring side of the crowd. I also do like to add some crushed garlic about a half teaspoon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Betty Dickson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9192782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-31T18:11:49.11Z",
                "reviewBody": "I went EXACTLY as the recipe stated, and I never use recipes, but I wanted to dare to be different, especially with all the rave reviews. \n\nMy salsa came out sooooooo SOUR!!! I have just spent the last 3 hours trying to fix it and ended up turning it into an actual salsa with canned tomatoes and sugar and cumin to try and tame the sourness. It is still uber sour, and I am really upset about it. I'm trying to understand if all the amazing reviewers love the sourness of that much lime juice? I don't get it. And the amount of red onion is crazy! 1/2 a cup would have been plenty and I will forever use a sweet yellow onion from now on, the red onion is way too overpowering. \nIf I am missing something from this recipe and I made a mistake, then please let me know, otherwise, this recipe is terrible in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "mhe220",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12299643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-19T01:24:59.273Z",
                "reviewBody": "Amazing pico de gallo. Only addition was two cloves of garlic finely minced added in with the onion jalepeno and lime juice. The marinating makes it amazing it allows the flavors to blend. Thanks so much for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Cornely",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9489728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-21T21:51:26.6Z",
                "reviewBody": "Very Good! My kids dont like it chopped or chunky so I blended to a salsa but the flavor is wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Reesa's Fab Kitchen online",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/reesaskitchen/"
                }
            }
        ]
    }
]