[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24035/kalua-pig-in-a-slow-cooker/",
        "name": "Kalua Pig in a Slow Cooker",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2267916.jpg",
            "width": 1413,
            "height": 1060
        },
        "datePublished": "2019-04-02T06:42:25.000Z",
        "description": "This is a simple way of making traditional Hawaiian kalua pig without having to dig a hole in your back yard.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT20H0M",
        "totalTime": "P0DT20H10M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (6 pound) pork butt roast",
            "1 ½ tablespoons Hawaiian sea salt",
            "1 tablespoon liquid smoke flavoring"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pierce pork all over with a carving fork. Rub salt then liquid smoke over meat.  Place roast in a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on Low for 16 to 20 hours, turning once during cooking time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove meat from slow cooker, and shred, adding drippings as needed to moisten.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KIKUKAT"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.706521739130435,
            "ratingCount": 1840,
            "itemReviewed": "Kalua Pig in a Slow Cooker",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "243.2 calories",
            "carbohydrateContent": null,
            "cholesterolContent": "82.4 mg",
            "fatContent": "14.7 g",
            "fiberContent": null,
            "proteinContent": "25.9 g",
            "saturatedFatContent": "4.8 g",
            "servingSize": null,
            "sodiumContent": "714.6 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-12T20:43:09.127Z",
                "reviewBody": "this is the best kalua pork i've ever had and i'm from hawaii.  i had no idea it was so simple to make.  i, too, found out that pork butt and pork shoulder is the same thing.  i used a boneless, 2lb cut and it made enough for my husband and me with lots of leftovers.  it is a little salty, but this is the way it's supposed to taste.  it tastes best served with white rice (shortgrain, like sushi rice, not long grain).  i also used black hawaiian sea salt, which i found at trader joe's.  trader joe's offers black and red.  but i noticed that the black sea salt also includes some charcoal ingredients, which helps it to taste more smoky and barbecued.  i also used reese's mesquite liquid smoke.  the black sea salt made the pork look really unappetizing on the outside, but once it's shredded, you can't really tell.  also, i turned it over more than once; several times, in fact, and after shredding, cooked it on low for about another hour to soak up the juices.  i added about two cups of shredded cabbage in the last hour or so, which is how it's served in hawaii.  my total cooking time was 5 hours on high and 1 hr on low.  great recipe and very impressive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "es",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2104407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T22:53:53.693Z",
                "reviewBody": "I was told by the grocery store meat dept lady that a pork butt roast IS the same thing as a pork shoulder roast.  (The, um-m, \"other\" would probably be called a rump roast!) :-)  So I used a near-6pound pork shoulder blade roast for this (with a bone in it).  Rubbed it with the Hawaiian red clay salt and liquid smoke and had it in the crockpot for 12 hours.  Started it on high for the first 3 hours, then low for the rest of the time.  It was moist, tender, & flavorful.  Although the liquid smoke flavor was fairly subtle, I reducing it to 1tsp would be better...just a personal preference.  When the roast was done, I drained the juices from it, took off any fat from the meat, and returned meat to the crockpot.  I then skimmed the fat from the juices, reserved 1.5c of it, and returned the rest to the meat.  I placed the 1.5c juices in a saucepan, got it simmering, and added a mixture of 2T flour/2T water to make a gravy.  (Could have stood to be a little thicker, but it was fine.)  Poured the gravy over the meat.  Served this with Suzy's Mashed Red Potatoes from this site, homemade applesauce, and peas.  Thank you for sharing your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T05:38:23.793Z",
                "reviewBody": "This is a great potluck recipe.  I put the juices in the crockpot into a container and into the freezer while I waited for the pork to cool enough to shred.  Then I take the hardened fat off the top and pour in the juices oil-free.  That may help make this dish less oily.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GWANMA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/151306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-15T22:36:32.77Z",
                "reviewBody": "Very good recipe!  Couldn't tell much of a difference in the traditional \"pig\" and this recipe.  Only thing I did differently was to slice open a banana (leave in the peel) and set it on top of the roast while it cooks to give it the taste of actually being wrapped in banana leaves prior to cooking it underground (make sure you remove the banana after the pig is fully cooked).  Sounds weird, but this gives the pig a very SLIGHT sweet taste which the islands are famous for.  After shredding the meat and removing the fat from the juice, I added 1 more tsp of liquid smoke and let the pig cook in it's juice for 1 hour more.  Perfect pig!!!  Served with the Hawaiian Cold Slaw from this site (which was a perfect complement to the meal) and Sweet Hawaiian bread rolls.  If you close your eyes and listen you'd swear you could hear the waves on the beach, smell the lightly scented breeze in the palms, and feel the sand between your toes.  This recipe is that good!!  Thanks so much to Kikuchan for submitting it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-21T19:50:02.967Z",
                "reviewBody": "Having relocated from Hawaii to the mainland 6 yrs. ago this is the same recipe we all use (even when in Hawaii because who can afford to roast a whole pig?). Pork Butt works the best (because that is what we are used to and it can be found for.99 lb. Other ingredients to add: 1 Hawaiian chile pepper and for a change of flavor: Garlic and Bay leaves. Since it is impossible to find Hawaiian chili peppers I use finely and SPARINGLY chopped habanero (about 4 small slices). It is pretty authentic. To those that say the roast is salty: is because the slow cooker intensifies the flavor so it is best to add less at the beginning and add more later if needed. Just a good rub around the pork with Hawaiian Salt will do it. Happy Grinds! Aloha!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMAGICITY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1168243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-12T07:53:59.937Z",
                "reviewBody": "THIS WAS INCREDIBLE!!! If I could give 10 stars I would!! Thanks to margarita4 I found the sea salt(Ming Tsai brand blue ginger at Target.) At first I was looking for something in a papper package like most salts are in and for something white. But it's in a tiny glass jar and the salt is a pinky salmon color(4-oz. 3.99) I had a 7 lb. bone in pork butt. It barely fit in my crock pot but I managed! I started it at midnight flipped it over at 8:30 in morning and let it cook until 4:30. Added 2 tsp. additional liquid smoke. It was done before that but I kept it going like recipe said and there was hardly any fat in this. Hard to believe only 3 ingredients could taste so good! My sister in law lived in Hawaii for 3 yrs. and said it was just like what they had there. I love pork and have had it many ways this ranks right up there with pig roasts it is my favorite so far. I had 8 guests and they were all ewing and awing over this. It was fabulous and will make this often. Thanks Kay for sharing this I'm so grateful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "awesome in tummy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-06T00:46:44.047Z",
                "reviewBody": "Really nice smoked flavor tender juicy and so easy. I found Hawaiian Sea Salt at Williams-Sonoma but check with specialty/gourmet food stores in your area if you don't have time to order online. Sometimes Hawaiian Sea Salt is called Red Clay Sea Salt and that might help you in your search. The sea salt that I found has an iron red appearance. Next time I will use 1 T. Hawaiian Sea Salt as I found it to be a bit too salty for my taste and that I am sure is because I rarely salt my foods. Thank you for a very tasty recipe that I will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAITH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/103423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-08T18:41:05.81Z",
                "reviewBody": "My pork was to die for delicious.  We had around 30 people over and all they talked about was how good the meat tasted.  I bought an 8.5 lb roast, so it wouldn't fit in my crock pot.  I set the oven on 200 and let it cook in there for 20 hours.  Then when I shredded it, I put the shredded meat in the crock pot, poured some of the juices on it and put the crock pot on warm.  Thanks for the delicious recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CANDICE LAUREN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/605332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-25T23:51:26.997Z",
                "reviewBody": "I read a lot of other reviews and was concerned with the saltiness others complained about. I went out and found the hawaiian clay sea salt and when i tasted it it was quite different from regular table salt and even coarse salt. I was extrememly impressed by this dish and having been to many luau's it is very close to what I've had there. I think the key to the dish turning out well is to buy the hawaiian salt--it's MUCH more mild and I think that's the key. I found the salt at whole foods market.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nevadamommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1874830/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T20:43:20.920Z",
                "reviewBody": "I had such great expectations after reading all these wonderful reviews.  First I had never used a Boston Butt Roast---Even though I trimmed and trimmed the cut of meat,this dish still was fattier than what I am used to after cooking. What saved the day was the Carolina Bar-b-que Sauce recipe that I found on this site. If it had not been for that sauce this would have been a big flop. And even then it was not as outstanding as these reviews would indicate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MANINTHEMOON850",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/846290/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Kalua Pig in a Slow Cooker",
            "description": "See how to make amazing Hawaiian-style pork.",
            "uploadDate": "2012-08-23T23:08:19.701Z",
            "duration": "PT3M4.267S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ffc168c34-c91d-4d1c-8d61-690f6d109049%2F1073ed46-8f88-4450-acb7-120a5306164b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1801376346001"
        }
    }
]