[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222255/great-grilled-smoky-vegetables-with-avocado-and-goat-cheese-crumbles/",
        "name": "Great Grilled Smoky Vegetables with Avocado and Goat Cheese Crumbles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F841202.jpg",
            "width": 1440,
            "height": 960
        },
        "datePublished": "2019-04-02T06:57:22.000Z",
        "description": "Smoky tender grilled vegetables just bursting with flavor, made pretty with the addition of creamy white goat cheese and luscious avocado! Add any other veggies you like. Asparagus and zucchini are good additions.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 portobello mushroom caps",
            "4 red bell peppers, cored and quartered",
            "1 red onion, thickly sliced",
            "½ cup olive oil",
            "2 limes, juiced",
            "2 tablespoons grill seasoning",
            "2 cloves garlic, minced",
            "1 pinch cayenne pepper, or to taste",
            "2 tablespoons balsamic vinegar",
            "1 avocado - peeled, pitted, and cubed",
            "½ cup crumbled goat cheese",
            "salt to taste",
            "freshly ground black pepper to taste",
            "2 tablespoons finely chopped fresh basil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place mushrooms, red bell peppers, and red onion in a 9x13-inch baking dish. Whisk olive oil, lime juice, grill seasoning, garlic, and cayenne pepper in a small bowl; pour over vegetables. Toss to coat and allow vegetables to marinate for at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat grill for medium heat and lightly oil the grate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove vegetables from the marinade, and shake off excess. Reserve remaining marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grill vegetables on preheated grill until tender, about 5 minutes. Transfer grilled vegetables to a large platter. Whisk remaining marinade with balsamic vinegar; pour over vegetables. Top with avocado and goat cheese, then season with salt and pepper. Sprinkle with basil to serve.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol Klassen "
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.9010989010989015,
            "ratingCount": 91,
            "itemReviewed": "Great Grilled Smoky Vegetables with Avocado and Goat Cheese Crumbles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "330.8 calories",
            "carbohydrateContent": "18.7 g",
            "cholesterolContent": "9.2 mg",
            "fatContent": "27 g",
            "fiberContent": "6.4 g",
            "proteinContent": "7.4 g",
            "saturatedFatContent": "5.7 g",
            "servingSize": null,
            "sodiumContent": "563.2 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-22T17:45:59.96Z",
                "reviewBody": "You MUST make these!!  They are awesome and will impress everyone.  My picky in-laws (but I don't like goat cheese..) loved them, my 13 year-old son (mom, when can we have those grilled vegetables again?...).  Very easy to substitute depending on what veggies you have on hand.  Have made this 5 times, here are my suggestions: slice the onion THICK or they will get lost.  add zucchini (quartered lengthwise) and/or asparagus, eggplant is good also.  MOST IMPORTANT:  PUT SOME BALSAMIC IN YOUR MARINADE, THEN ADD GOOD/HIGH QUALITY BALSAMIC TO SOME OF THE REMAINING MARINADE TO DRIZZLE ON THE GRILLED VEGGIES.  The avacado is optional but the goat cheese and FRESH basil are a must.  Addistional suggestion:  on the chance that you have leftover veggies, cut them up and add to sauteed onion and garlic, throw in a can of diced tomatoes and some grilled, sliced chicken sausage.  Simmer to desired consistancy and serve over pasta with additional cheese.  I now make extra veggies every time, just so we can have the pasta.  Did I mention I like this receipe :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pseudogourmet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2042556/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-11T23:09:54.097Z",
                "reviewBody": "Absolutely amazing! Like another said I'm dreaming of the next time I have this! I made the recipe exactly as above except I mistakenly added the balsamic vinegar while marinating instead of after grilling - but it was so good I don't think I'd try it the original way. We used the suggested ingredients plus zucchini (quartered lengthwise) yellow bell pepper and eggplant sliced into 1/2\" rounds all good. The red onion is a must it is a wonderful flavor complement to the other veggies. My suggestion make a lot especially if you're feeding more than 3 or 4 people - it'll be a hit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LesleyHMB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2922984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-25T13:01:12.58Z",
                "reviewBody": "I'd give this 10 stars if I could! This is BY FAR the best recipe for grilled veggies I have ever tried! Hubby agrees too! I followed the recipe exactly as written except that I used more cayenne (probably around 1/4 tsp - even that wasn't spicy). For the grill seasoning I used Montreal Steak Spice and used slightly less than called for. I'm already dreaming of the next time I can have this! I wouldn't change a thing! I love the sweetness of the peppers combined with the freshness from the basil and creamy goat cheese and avocado. This is the kind of recipe that will thoroughly impress guests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "France C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/francecevallos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-27T18:40:59.967Z",
                "reviewBody": "We grill veggies a lot but last night I wanted something different and a little more special--I was not disappointed with this recipe. I used 3 mushroom caps halved two red bell peppers quartered about 3/4 of a medium red onion 8 or so asparagus stalks and a large avocado. Just about perfect for 4 large helpings. I may have not used the full amount of goat's cheese but rather sprinkled it over the platter of vegetables until I was satisfied with the presentation. Also we grilled the veggies for about 15 minutes on the top shelf of the grill--they would have been underdone at 5 min.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mamakatie1346",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5691369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-18T16:03:14.973Z",
                "reviewBody": "I made this dish and frankly I believe it to be the best vegetable dish I have ever had....my wife thought so as well. I used 6 cloves of garlic...and more basil After grilling I put it in the oven on 300 for 5 minutes just to make sure it was hot. Paired it with a Grilled Flank Steak.....Bon Appetite....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tclark6262",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8510186/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-28T16:22:53.53Z",
                "reviewBody": "This is an incredible recipe! I used zucchini yellow squash green & red pepers red onion and asparagus. As some had suggested.. I used fresh basil and included the balsamic vinegar in the marinade. Sooo yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa k",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3167846/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-24T18:41:32.88Z",
                "reviewBody": "This was fabulous! Made it exactly as posted and wouldn't make it any other way. We had leftovers that we refrigerated and my husband put on a salad the next day. He said it tasted even better! The fourth time we made it (yes it's that good! I only found the recipe a month ago and we've had it 4 times already!) my step son had the leftovers in an omelet and he said it was delicious! Thank you for such an excellent recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tamara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5663579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-17T14:37:54.497Z",
                "reviewBody": "I usually only try recipes that have been rated but I was looking for a grilled veggie recipe that was a little different and this fit the bill. Despite burning a few of the veggies it turned out wonderfully and was even better for leftovers the next day. Here are my changes: I used a bag of sweet mixed (orange yellow and red) peppers instead of bell mostly because it was cheaper and I wanted more color. I only used 3 mushroom caps which I quartered. I used McCormick montreal steak seasoning for the grill seasoning because it was what I had on hand. I eyed the balsalmic vinegar and probably added a little extra bc I love balsalmic but probably added too much as it got a little too tart the longer it sat- so I'd say use as directed if not less. I also added asparagus as I needed to get rid of some and I skewered the vegetables for the grill. Everything else was the same. Will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lorieli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6975561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-20T02:06:02.053Z",
                "reviewBody": "These are soo good!!!!! Ive been looking for a great grilled veggie recipe and now I have found it! I left out the avacado and added zucchini. These will be made a lot at our house. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tnahinu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4092918/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-01T22:25:41.683Z",
                "reviewBody": "Just didn't care for it. I ended up blending it all added Italian sausage a can of tomatoes sun dried tomatoes and herbs. Put it on rigatoni.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Paul Hallmark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8188609/"
                }
            }
        ]
    }
]