[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/217/salad/potato-salad/",
                    "name": "Potato Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16151/salad/potato-salad/no-mayo/",
                    "name": "No Mayo",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/222279/picnic-potato-salad-with-no-mayonnaise/",
        "name": "Picnic Potato Salad with No Mayonnaise",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F839675.jpg",
            "width": 4288,
            "height": 3216
        },
        "datePublished": "2019-04-02T06:57:24.000Z",
        "description": "This is a great potato salad if you're looking for one without mayonnaise.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 pounds small new potatoes, quartered",
            "2 tablespoons balsamic vinegar",
            "¼ cup extra-virgin olive oil",
            "1 tablespoon Dijon mustard",
            "2 tablespoons chopped fresh basil",
            "½ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "½ cup chopped onion",
            "¾ cup crumbled blue cheese",
            "2 tablespoons chopped fresh chives"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place potatoes into a large pot and cover with lightly salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 15 minutes; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk vinegar, olive oil, mustard, basil, salt, and pepper together in a large bowl; add the potatoes and onion. Toss gently to coat. Let stand until cool, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold blue cheese and chives into potato salad until blended.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Potato Salad Recipes",
            "No Mayo"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "It's A New Day"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.628571428571429,
            "ratingCount": 105,
            "itemReviewed": "Picnic Potato Salad with No Mayonnaise",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "272 calories",
            "carbohydrateContent": "29.5 g",
            "cholesterolContent": "12.7 mg",
            "fatContent": "14.4 g",
            "fiberContent": "3.6 g",
            "proteinContent": "6.9 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "502.7 mg",
            "sugarContent": "2.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-05-17T03:39:02.44Z",
                "reviewBody": "I am so excited to be the first person to review this recipe! This potato salad is not a 'traditional' recipe, but I think that works in its favor. I loved the tangy flavor of the vinegar, and the little bit of spice the mustard gave the salad. And the blue cheese just put this over the top. I will definitely be making this again because it was so easy to make and tasted wonderful. Thanks for sharing the recipe, Maridele!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2022938/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-20T15:46:47.307Z",
                "reviewBody": "I chose this specifically for a company picnic my husband was attending.  I guess a couple of years ago the entire office ate something bad and all came down with food poisoning, so I was hoping to avoid a similar catastrophe - ha!  Anyway, this was super easy and extremely tasty.  I used blue cheese this time but I think feta would work, too.  I made it the night before and let it sit so by the next day, it was totally ready to go!  The basil added a fresh touch that I really liked, also.  Everyone loved it, and as of today, no one's called out sick :)  Calling it a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Justice Yost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nashvillenosher/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-17T16:34:13.383Z",
                "reviewBody": "AMAZING! I added candied walnuts and the flavors combined are out of this world!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissapeeker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9453816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-27T21:34:59.207Z",
                "reviewBody": "This is an extremely delicious recipe.  I really love the mayo type potato salads- but wanted a change-and had a party of people with sophisticated palates, Plus I had an abundance of  fresh basil and chives in my garden.  Here are some tips  for a perfect outcome.  You really have to watch the cooking time. If the potatoes over cook, they will break down to mush, like mashed potatoes, so depending on how large your cubes are, they need to come out as soon as its soft enough to eat.  They need to have plenty of firmness to withstand the mixing. My cubes were approx. an inch in diameter and they were done in 10 minutes.  After they cool down to the point where they aren't profusely steaming, you need to coat them with the wet dressing, this will help stop the sticky characteristics that potatoes get as they cool.  I would also wait to add the blue cheese until serving.  Cheese can start to get runny if mixed in.  There are similar recipes on this site that add celery and pickle, and I think that would ruin this elegant and tasty dish that has such great flavors and sophistication  without being too complicated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefNan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1594756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-18T13:38:42.043Z",
                "reviewBody": "We all liked this. I cooked the potatoes in the microwave stirring a couple of times rather than boiling (about 9 min in mine). I used dried chives because I didn't have fresh and used regular reds chopped to approximate quartered new potatoes but otherwise made no changes. Served at room temp as suggested and the only change I would make is to try lessening the oil a tad next time but that may not work. They weren't too oily I just tend to reduce the amount we use as much as possible. We rarely use mayo so it's nice to have another variation on one of our favorites. This is a very bold flavor though so I don't know that it is as versatile as some salads. I think it would be a nice compliment to a simple grilled steak.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "linda2d",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3733363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-03T23:43:41.753Z",
                "reviewBody": "This is really good potato salad, and I'm someone who usually likes mayo-based potato salads. I actually made this twice, but the first time I way overcooked my potatoes and they became almost like mashed potatoes and absorbed all the dressing, but the taste was still good. I made it again, properly, and I still liked it! The first time I didn't have any onions, so I added onion powder to dressing. This time I did have onion, so I used it but I think I would prefer it without pieces of onion. I don't know that this would be a good choice to make for a crowd; it's a lot of strong flavours that certainly wouldn't be for everyone. I found my first couple of bites of it very strong, but then it grew on me. I'll definitely make it again myself, I like all the strong flavours! Thanks Maridele for posting your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3513546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-03T20:03:21.683Z",
                "reviewBody": "just great stuff! i used russet taters. i did add hard-boiled eggs celery and bacon. delicious. but it was delicious prior to adding the cheese and bacon. it sat overnight we all loved it! thx maridale.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gderr the dysfunctional",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2856948/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-27T13:04:56.23Z",
                "reviewBody": "No question about whether or not this is a 5-star recipe!  Whether you use regular balsamic vinegar (especially a GOOD one--translates into expensive aged) or a white one, this recipe is PERFECT!  Oh, yum!  I made it earlier in the day and then took it out about an hour before serving so I could add in the blue cheese.  It was just plain delicious!  Thanks, Maridele!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-27T02:06:41.52Z",
                "reviewBody": "Our neighborhood potluck during the Memorial Day weekend was a perfect opportunity to make  potato salad. I truly dislike potato salads made with mayonnaise, so I decided to try this one. It was unbelievably delicious! I made a few changes. Rather than boil the potatoes, I quartered, oiled (olive oil) and roasted them in a preheated oven for 30 minutes at 400°. I removed them from the oven before they got mushy and let them cool down before proceeding. I substituted a little red wine vinegar for some of the balsamic since I have a VERY thick, syrupy balsamic that tends to be very sweet. I used Trader Joe's Aioli garlic mustard. I wanted a salad with a bit more crunch, so I increased the amounts of the red onion,  and I also added half of a large red bell pepper, chopped. I added 2 tablespoons of chopped parsley to the basil and chives…and I doubled the amount of basil in the recipe. Finally, I substituted Trader Joe's crumbled goat cheese for the blue cheese. Wonderful blend of sweetness from the balsamic,  heat from the black pepper & mustard, crunch from the red onion and bell pepper, and tang from the goat cheese. I'm going to make this for the Fourth of July!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bfried",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12809647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-28T17:43:29.273Z",
                "reviewBody": "I made this recipe as is. It very good and tasty but next time i'll be making it with white balsamic the potatoes were dark brown color it did not look very appetizing. So for that I will give it 3stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "zedna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11940465/"
                }
            }
        ]
    }
]