[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24075/chicken-and-spinach-alfredo-lasagna/",
        "name": "Chicken and Spinach Alfredo Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1512862.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "2019-04-02T06:42:27.000Z",
        "description": "A different, yet wonderful twist on normal lasagna!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (8 ounce) package lasagna noodles",
            "3 cups heavy cream",
            "2 (10.75 ounce) cans  condensed cream of mushroom soup",
            "1 cup grated Parmesan cheese",
            "¼ cup butter",
            "1 tablespoon olive oil",
            "½ large onion, diced",
            "4 cloves garlic, sliced",
            "5 mushrooms, diced",
            "1 roasted chicken, shredded",
            "salt and ground black pepper to taste",
            "1 cup ricotta cheese",
            "1 bunch fresh spinach, rinsed",
            "3 cups shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Cook lasagna noodles for 8 to 10 minutes, or until al dente. Drain, and rinse with cold water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over low heat, mix together heavy cream, cream of mushroom soup, Parmesan cheese, and butter. Simmer, stirring frequently, until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the olive oil in a skillet over medium heat. Cook and stir the onion in olive oil until tender, then add garlic and mushrooms. Mix in the chicken, and cook until heated through. Season with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly coat the bottom of a 9x13 inch baking dish with enough of the cream sauce mixture to coat. Layer with 1/3 of the lasagna noodles, 1/2 cup ricotta, 1/2 of the spinach, 1/2 the chicken mixture, and 1 cup mozzarella. Top with 1/3 the cream sauce mixture, and repeat the layers. Place the remaining noodles on top, and spread with remaining sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 1 hour in the preheated oven, or until brown and bubbly. Top with the remaining mozzarella, and continue baking until cheese is melted and lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sue"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.638636363636364,
            "ratingCount": 440,
            "itemReviewed": "Chicken and Spinach Alfredo Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "591.3 calories",
            "carbohydrateContent": "22 g",
            "cholesterolContent": "159.5 mg",
            "fatContent": "43.7 g",
            "fiberContent": "1.5 g",
            "proteinContent": "28.7 g",
            "saturatedFatContent": "23 g",
            "servingSize": null,
            "sodiumContent": "846.8 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-24T18:44:05.297Z",
                "reviewBody": "I wish that I could give this just one more star for the sheer indifference it has to calories or fat content.  Oh. My. Goodness.  This was good.  I was in a pinch for bringing a dish to a party and happened to have most of the ingredients for this so I pulled it together, and it's my new favorite recipe.  I did substitute the cream for 2 cups half & half and one cup nonfat evaporated milk (ROFL, that makes it healthier, right?) and I used frozen spinich instead of fresh and I'm sure fresh would make it even better.  I also used diced portobello mushrooms and plain ol' chicken breasts.  Everyone ate this all gone and were fighting for the recipe.  Thanks a ton (and you know where that ton came from ;))\n\n*Edited to add~  I made this again and used fat free half and half and 98% fat free creame of mushroom soup, skim mozzarella and lowfat ricotta, and it tastes just as good as the original.  I also omitted the mushrooms and used sundried tomotoes....yummy!  Still a favorite recipe for special occassions around here.  I've also found it's good to take it out after it's done and let it sit, covered, for a good thirty minutes to thicken up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sorashell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-29T01:47:18.437Z",
                "reviewBody": "This is an excellent recipe.  To overcome the issue with the volume of spinach (I used 1 - 6oz. bag of fresh baby spinach leaves which worked out to be the perfect amount without overwhelming the dish... or kids ~ nice green speckles here and there), I added the spinach to the skillet of sauteed veggies at the last moment before turning off the heat  to slightly wilt the spinach.  This way all of the prepared ingredients fit perfectly into the 9\" x 13\" dish without the oozing that I've read about in other reviews. I also used a whole medium sized onion and the whole 5oz. package of sliced mushrooms from the produce dept.  This worked out perfectly for flavor, not to mention nothing wasted.  The mushroom slices (as  opposed to chopped) made it a lot easier for my little mushroom hater to pick them out.  Allow the dish to rest at least 15 minutes after removing it from the oven to allow it to settle for easier cutting and serving.  The sauce would be great as a base for other pasta dishes too.  I will definitely use this recipe again and again.  Thanks for posting it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OJAGAJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/400932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T20:46:50.977Z",
                "reviewBody": "Although this lasagna is pretty good, I was expecting better after all of the work I put into it. The blandness that others commented on may be because there isn't much salt called for in the recipe. I may try it again with alfredo sauce packets instead because this sauce still tastes like canned cream of mushroom soup to me, even though I followed the directions exactly. The final product was a little runny because, when you put the spinach in fresh and then bake it, it exudes a lot of water into the ricotta layer underneath. In order for this lasagna to be worth the effort, it needs a few changes. But it has potential.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "THEEVOYS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/463357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-03T19:08:36.183Z",
                "reviewBody": "Very good recipe.  I, like others, took the quick way out and used a roasted chicken from walmart and a few jars of my favorite alfredo sauces.  I put the fresh spinach and the mushrooms in the food processor so my kids wouldn't really notice it.  I then put all of that in a pan, along with the chicken, diced tomatoes, chopped onions, and some frozen peas and sauted it with garlic powder, onion powder, adobe, and oregano.  I then added that chicen mixture to the sauce.  THE WHOLE PAN IS GONE!  My kids were fighting over who was going to take leftovers to school.  I had some leftover sauce so I am going to boil some fettucine and make a cassarole with the noodles, sauce, ricotta, and mozzarella.  Can't wait to eat it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lady t",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2710986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-26T11:42:42.34Z",
                "reviewBody": "VERY GOOD! Everyone loved it ages 5 - 70. I used milk instead of heavy cream and it was still very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1533554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-10T13:51:48.53Z",
                "reviewBody": "VERY good This rich and cheesey dish is fantastic. I will use this simple alfrado sauce alone in the future (drop 1 can of cream of mush. and add 1 can of cream of chicken).The kids and wife could'nt stop raving thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "heetmiser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1647193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T21:29:18.17Z",
                "reviewBody": "This is going to be a much repeated recipe. It is absolutely amazing!!! It is a bit time consuming so I suggest having company over to enjoy what you spent so much time on. That way you know your time was worth it because everybody with rave about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "meljoy1980",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/190470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T20:45:57.473Z",
                "reviewBody": "Wow. A friend and I combined this with the \"spinach and artichoke lasagna\" recipe to tone down the richness. It was so delicious we couldn't wait to eat leftovers! Combined with some tomato sauce it is less heavy. It is a special occasion dinner for certain!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLH516",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T21:32:26.36Z",
                "reviewBody": "This recipe is time comsuming, but worth it!!!  I put it together the night before, then put it in the oven when my guests arrived.  It came out great, there were seconds served all the way around!!!  Dinner was a big hit!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRAT GIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/617663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T21:33:24.343Z",
                "reviewBody": "I just finished making this and will eat it tomorrow. It looks like it will taste wonderful. One thing to note is the directions and usage of the ricotta. At one point it calls to use half then the rest then the remaining? Doesn't add up and I read the thing over and over but didn't catch that error until it called for the non-existant \"remaining\" ricotta. Oh well it still looks very good and the way it smells it HAS to be great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/172271/"
                }
            }
        ]
    }
]