[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/721/world-cuisine/european/french/",
                    "name": "French",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/223233/french-macaroons/",
        "name": "French Macaroons",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F900211.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:57:57.000Z",
        "description": "Fantabulous colored, bite-sized macaroons. Divide batter into thirds and color one-third pink and flavor with raspberry flavoring; color one-third yellow and flavor with lemon flavoring; color one-third pale blue and flavor with vanilla. Fill and make sandwich cookies with filling of choice, like peach jam or strawberry preserves.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "4 dozen cookies",
        "recipeIngredient": [
            "3 egg whites",
            "6 tablespoons superfine (castor) sugar",
            "1 cup finely ground almonds",
            "1 ½ teaspoons finely ground almonds",
            "1 ⅓ cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 320 degrees F (160 degrees C). Line baking sheets with parchment paper or a silicon mat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk egg whites in a clean metal mixing bowl until thick, about 5 minutes; whisk the superfine sugar into the egg whites until thick, glossy, and the mixture holds stiff peaks, 5 to 8 more minutes. Place a sieve over the bowl containing egg whites and sieve both amounts of almond meal and confectioners' sugar into the egg white mixture. Gently fold the almond meal and confectioners' sugar into the egg whites, retaining as much air as possible.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate the meringue into separate bowls to flavor and color, if desired. Spoon the meringue into a piping bag fitted with a 3/8-inch tip. Pipe 1-inch disks of meringue onto the prepared baking sheets, leaving about 2 inches between cookies.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let the cookies stand at room temperature for about 15 minutes to form a thin skin. Pick up the baking sheets and let drop from several inches above the work surface to adhere cookies to the baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until tops are dry, about 15 minutes; let cool completely on the baking sheets before peeling off the parchment paper.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "French"
        ],
        "recipeCuisine": [
            "European",
            "French"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "crazymary98"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4526315789473685,
            "ratingCount": 95,
            "itemReviewed": "French Macaroons",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "61 calories",
            "carbohydrateContent": "11.4 g",
            "cholesterolContent": null,
            "fatContent": "0.9 g",
            "fiberContent": null,
            "proteinContent": "2.3 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "7.4 mg",
            "sugarContent": "9.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-07-22T14:23:21.523Z",
                "reviewBody": "They turned out easier to make than I expected! The hardest part was to make them perfectly circular! I got around that using the cupcake baking sheet. Just make sure to use the paper cups and remove them when still a bit warm, CAREFULLY!! And voila! You have perfectly round shaped macaroons without any effort! :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "isochrome",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4469689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-24T14:24:25.51Z",
                "reviewBody": "I have made macarons twice before and was fairly successful. With this recipe, however, my macarons stuck to the parchment paper and that has never happened to me before. I liked that the macarons aren't as sweet as the ones I've made before and seem lighter. That's why I would like to try this recipe again and see if maybe I should have baked a little longer... I'm not sure what the cause of my problem was but these cookies are difficult to master so I will troubleshoot until I get them right. I have previously used buttercream as a filling and it is great (strawberry or lemon/lime) but I went with dark chocolate ganache this time and it is decadent! Update: Made again and decided to bake at 350 degrees for 6 minutes, then switch cookie sheets (I moved the one that was on the upper rack to the bottom rack and viceversa) and bake for 6 more minutes. They didn't stick to the parchment paper this time. I added a few drops of creme de menthe oil to half of the batter and colored it green. Again, I used chocolate ganache to stuff them with. Very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-19T07:48:45.823Z",
                "reviewBody": "No, I didn't make these but I did read the previous review and she had problems getting the macaroons off the paper.  I pipe almond macaroons onto parchment paper and to remove them, I turn the paper over and wet the bottom with just enough water to soak through and loosen the macaroons.  A second or two will do it and you can peel them off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "superstitches",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4103012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-19T05:33:58.65Z",
                "reviewBody": "I'm 11 almost 12 and I made these by myself. At first I was worried they wouldn't turn out well because I'm not that great when it comes baking and French macaroons at professional level. I gave it a try today after reading reviews and tips. They turned out really well! This is so simple compared to other recipes I checked out. I dyed them blue using very little food coloring knowing the color fades a little. We bought keylime icing and had that in the middle. They had the perfect consistency. Even my picky younger sister ate them and ended up loving them. This recipe is a success!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "3rin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7232980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-15T11:10:01.21Z",
                "reviewBody": "The heat is very important and it is the thin line between a good macaron and a disaster. By the way this is not a \"macaroon\" (no coconut cookie) but it is a \"macaron\". \nTrust a seller who sells rusty forks as stainless steel but never trust your oven temperature :) Buy a oven thermometer and check what you set the oven and how hot it is actually and adjust your oven until you get steady correct temperature from the thermometer. You'd be surprised that your lovely friend (oven) is lying 95% of times and your new best friend w,ll be that small \"in oven thermometer\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Despy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10752679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-15T16:53:38.953Z",
                "reviewBody": "I have been nervous about trying french macaroons, but this came out perfectly!  The second time I made them I made a few changes to make things a little easier.  First, I put my almond flour in the food processor and pulsed it a few times.  I had a really hard time getting the AF through my sieve the first time around.  Seemed to make it easier.  Second, use a silpat if you are able instead of parchment.  It makes a huge difference with them sticking.  I had no problems.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEREMYANDSHELLY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/523386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-15T18:08:10.793Z",
                "reviewBody": "Amazing.  I have searched the web top to bottom to find the simplest and most fool-proof recipe for these.  I started with this one, and couldn't be more thrilled that I did.  I followed recipe exactly as recommended.  I used parchment paper, as they stuck to my silpat. A couple comments: I made two batches: Batch #1, I didn't beat the egg whites and castor sugar as long and baked exactly as recommended.  They turned out vibrant in color, and not overcooked, a bit chewy and got rave reviews.  Batch #2, I beat the egg white and castor sugar a bit longer (it was a bit more stiff) and then baked on convection.  These were very crisp, not as vibrant in color, but still maintained a great flavor.  The texture was extremely different.  These also got good reviews, but cracked more and weren't as pretty as my first batch.  They also weren't as easy to fill with the buttercream b/c they were more delicate.  They did, however, fall right off the parchment paper with no issues! I made yellow lemon with a raspberry buttercream, green mint with a dark chocolate buttercream and purple almond/vanilla with rasp on some and chocolate on others.  Went off beautifully for dinner party.  MMMMMMMMmmmm…:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cublove",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3275322/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-10T18:16:25.13Z",
                "reviewBody": "Temperature is too high. Drop to 300 F. for about 15 minutes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kanefire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4132906/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-13T19:25:27.91Z",
                "reviewBody": "this was by far the best macaroon recipe i have ever tried!!!! the other recipes i have tried always crack! but not with this recipe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catherine9620",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7091559/"
                }
            }
        ]
    }
]