[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1548/side-dish/potatoes/scalloped-potatoes/",
                    "name": "Scalloped Potato Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/227994/mormon-scalloped-potatoes/",
        "name": "Mormon Scalloped Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F966337.jpg",
            "width": 2409,
            "height": 2441
        },
        "datePublished": "2019-04-02T06:58:08.000Z",
        "description": "A classic Utah dish, done often in Dutch oven style, that will not last through a party. It's just that good.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 9x13-inch dish",
        "recipeIngredient": [
            "8 Idaho or russet potatoes, peeled",
            "2 (10.5 ounce) cans cream of chicken soup",
            "2 cups sour cream",
            "½ cup butter, melted",
            "1 cup chopped green onion",
            "2 ½ cups shredded Cheddar cheese",
            "1 cup crushed corn flakes, or more if needed",
            "¼ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place potatoes into a large saucepan, cover with water, and bring to a boil. Reduce heat to medium-low and simmer potatoes until tender but not mushy, about 15 minutes. Drain and let cool. Cut potatoes into 1-inch thick slices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk cream of chicken soup, sour cream, 1/2 cup melted butter, and green onions in a bowl until thoroughly combined. Whisk cheese into the sauce. Mix corn flake crumbs with 1/4 cup melted butter in a separate bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread a thin layer of the sour cream sauce into the bottom of a 9x13-inch glass baking pan. Spread a layer of potato slices over sauce, followed by a thick layer of sauce. Continue layers, ending with sauce. Sprinkle corn flakes mixture over the top of the casserole.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until casserole is bubbling and the corn flakes topping is crisp, about 45 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato",
            "Scalloped Potato Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kitchen Witch"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.752577319587629,
            "ratingCount": 97,
            "itemReviewed": "Mormon Scalloped Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "483.8 calories",
            "carbohydrateContent": "42.3 g",
            "cholesterolContent": "76.1 mg",
            "fatContent": "30.4 g",
            "fiberContent": "2.7 g",
            "proteinContent": "12.7 g",
            "saturatedFatContent": "18.1 g",
            "servingSize": null,
            "sodiumContent": "601.4 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-17T01:05:39.37Z",
                "reviewBody": "Really good!  I think that I'll cut the potatoes a bit thinner next time.  At 1 inch thick, they seemed a bit undercooked.  Still tasted great though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danielle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9782587/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-08T00:59:02.323Z",
                "reviewBody": "Very good! The taste was perfect, original and filling. I did follow the advice of the other reviewer and sliced the potatoes much thinner than the one inch thickness that the recipe called for. Turned out to be cooked all the way through and delicious. The only other thing I did different was to have added a little bit more cheese, considering I had some extra (about a cup extra), but it turned out to be nice and cheesy, gooey and delicious. I made this dish to compliment a ham that I had made and it served extremely well. Very good dish! Would definitely make again and in the future.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefTek",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cheftek/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-13T03:02:19.893Z",
                "reviewBody": "I altered the recipe so that I could make these a day ahead. First I peeled the potatoes (10 of them),then I put them through the food processor and sliced them into 1/8 inch thick slices. Then I sautéed them in butter (ended up using 3 pans so as not to overcrowd the potatoes each pan had a quarter cup of butter) and I sprinkled them with a little kosher salt. Sauteed them for about 10 minutes until just tender,then I drained the butter out of each pan into a large bowl. To this I added the cream of chicken and the sour cream. Then I folded in 1 bunch of sliced chives and 2 cups shredded cheddar and 1 cup shredded emmenthaler. Then I layered three layers of potatoes,starting with the sauce on the bottom and ending with the sauce on top. I stuck it in the fridge till the next day. Next day melted the 1/4 cup butter and put 3 cups corn flakes in a gallon ziplock bag and crushed them with a marble rolling pin. Poured the melted butter in the bag once the butter cooled a little and mixed it up in the bag. Poured the mixture onto the potatoes. Baked at 350 for 45 min. Half of the time it was covered in foil and the other half of the time it was uncovered. I wish I had put some white pepper in this but I forgot. This was super good but should have cooked even longer since a few of the potatoes were a little underdone. It made a lot of dirty dishes for one side dish but it was very decadent and special and it helped to make it a day ahead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Criscelda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6571940/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-10T03:22:27.097Z",
                "reviewBody": "This is a fantastic recipe!  It's a true classic Mormon Utah dish!  My whole family loved this recipe...even my 17-month old couldn't get enough of it!  I've been looking everywhere for a dish like this that doesn't use fake or frozen potatoes...I wanted real potatoes and this is perfect!  I added some salt and pepper to make it taste even better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Winters Van Otten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8544133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-24T21:15:55.15Z",
                "reviewBody": "I've made this several times and have found the addition of a layer of sauteed onions takes this to a different, delicious level. I usually put the onions on the bottom, just after the first layer of potatoes. Also, I have tried this with every sort of cheese and if you use Parmesan, it has a bit more of a sophisticated flavor. To make it vegetarian friendly, I use cream of mushroom soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3827477/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-17T19:29:02.587Z",
                "reviewBody": "I have made these potatoes twice now and they are a HIT!  The only thing that I did differently was substituted Panko breadcrumbs for corn flakes (didn't have any), and the second time I adjusted the ingredients to make a smaller pan (there are only 2 of us here).  I would suggest, as some of the others have, cutting the potatoes as thin as you can to make sure that get cooked all the way through...overall 5 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ken Baughns",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8335946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-17T06:56:18.06Z",
                "reviewBody": "Made it exactly as written except I didn't parboil the potatoes. Instead, I used a mandolin to slice them thin and cooked the dish for 1 hr (covered for the first half). Super yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy Wingfield Hartling",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2929083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-26T17:06:36.983Z",
                "reviewBody": "Fabulous! I thin sliced the potatoes first then parboiled or around 10 minutes until the potatoes were beginning to soften but could still be handled for layering. Use green chili dip instead of sour cream! Takes about an hour to cook. YUMMM!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cook4fun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9406672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-02T06:34:00.627Z",
                "reviewBody": "This turned out so well that my family (with many food restrictions) immediately added it to the \"make it again\" list! I sliced the potatoes on a mandolin slicer, about 1/4 inch thick. I didn't precook the potatoes, just cooked it for a bit longer and it was magnificent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2575357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-22T01:25:45.673Z",
                "reviewBody": "Russet potatoes come in such a wide range of sizes saying 8 potatoes will get you no uniformity in the recipe. I halved the recipe and used 4 medium sized potatoes. I only had enough potatoes to make one layer in the 9x9\" pan. Third why are we cutting in such large pieces? Cutting them so large makes for awkward serving. I ended up having to mash the potato and sauce together on my plate in order to eat it all together. Fourth the amount of butter in the sauce is too much. There is a huge grease slick in the pan. I did use unsalted butter and therefore my potatoes needed salt and pepper. It was very bland and greasy before. I had to add some dried minced onion because I didn't have enough green onions. I also used Panko bread crumbs instead of corn flakes. I was happy to try the recipe and give it a \"face\" but I won't be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "It's A New Day",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/844886/"
                }
            }
        ]
    }
]