[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228238/goat-stew/",
        "name": "Goat Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6944310.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:58:18.000Z",
        "description": "This is based on a Filipino stew recipe called caldereta. It is usually served with rice. I suggest marinating the meat for at least 6 hours. The serving size for this recipe is 2 to 4 depending on how much bone the meat has. Serve over rice. Masarap!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound bone-in goat meat, cut into large chunks",
            "¼ cup vinegar",
            "¼ cup soy sauce",
            "4 cloves garlic, crushed",
            "1 tablespoon vegetable oil",
            "1 onion, chopped",
            "1 red bell pepper, cut into 1-inch squares",
            "1 cup tomato sauce",
            "2 cups beef stock",
            "1 potato, peeled and cut into large chunks",
            "2 carrots, peeled and cut into large chunks",
            "½ cup green peas",
            "½ teaspoon salt",
            "¼ teaspoon pepper",
            "1 pinch cayenne pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix goat meat with vinegar, soy sauce, and garlic in a large bowl; cover and refrigerate from 1 to 8 hours. For best flavor, marinate at least 6 hours. Remove meat from marinade and pat dry with paper towels; reserve marinade and garlic cloves.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a large pot over medium-high heat and brown the goat meat, working in batches if necessary, 10 to 15 minutes. Set goat meat aside. Cook and stir onion, red bell pepper, and garlic cloves from the marinade over medium heat until onion is translucent, about 5 minutes; pour in tomato sauce and bring mixture to a simmer. Allow to cook down slightly, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return goat meat to the sauce and pour in reserved marinade and beef stock. Bring to a boil, reduce heat to low, and simmer covered until goat meat is partially tender, 30 to 40 minutes. Stir in potato, carrots, and peas; season with salt, black pepper, and cayenne pepper. Simmer until goat meat is very tender and potato and carrots are cooked through, 20 to 30 more minutes. Adjust seasonings before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Olivia Tuggle"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.531914893617022,
            "ratingCount": 47,
            "itemReviewed": "Goat Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "271.8 calories",
            "carbohydrateContent": "27 g",
            "cholesterolContent": "53.1 mg",
            "fatContent": "6.5 g",
            "fiberContent": "5.4 g",
            "proteinContent": "26.2 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "1670.3 mg",
            "sugarContent": "9.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-07-29T13:26:29.103Z",
                "reviewBody": "Wow!  This was the first time I'd tried an unrated recipe, I made it exactly as stated (marinating for 6 hours), and it was so simple and delicious!  It was very easy to prepare with ingredients you're likely to have on hand, except for maybe the goat.  We had purchased two pounds of frozen goat stew meat and made a curry with the first pound.  We found that first meal quite chewy and tough to eat because we hadn't realized that we should have stewed the goat for some time to soften it.  With this recipe the marinating combined with the stewing made the goat meat easy to eat.  The broth was lovely and rich, and rather than rice we used bread for sopping up the broth, but next time (and there *will* be a next time) I think we will use rice.\n\nThough it was very, very tasty and I do recommend it, it did seem to be missing a little something.  The flavour seemed a tiny bit unfinished, if that makes sense.  I was thinking maybe some other herb or spice was needed to round it out, but I couldn't put my finger on it.  I may have to experiment... :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karla Wilson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4849233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-14T14:02:32.1Z",
                "reviewBody": "WOW !!! Thank you very much Olivia Tuggle !!!\nOn a scale of 1-100, this is a 100. WARNING: You may find yourself starting to like leftovers, eating it 3 times a day, licking your fingers and plate, and eating 1/3 of it at the counter b/s you can't stop to get more comfy.  TRIPLE+ the recipe and definitely use lots of water for sauce and lots of rice for soaking it.  I used some extra finely crushed red pepper and finely chopped tomatoes (and a bit of paprika) b/s I didn't have cayenne pepper and tomato sauce.  The final taste is really a combo of hot, salty, sweet and sour - WOW !!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ivantpdc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13622568/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-15T02:37:38.473Z",
                "reviewBody": "This recipe was amazing. We have never cooked goat before and were worried about the taste (this was an Ibex goat that we cooked so it's game meat.) We marinated for 24 hours and the meat was so tender that we didn't have to cook the recipe as long as the recipe suggested. Great taste. We will definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cobolicious",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10558390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-25T00:37:23.003Z",
                "reviewBody": "My husband and I enjoyed this dish. I did not use any additional salt based on a couple of the reviewer's warnings and I doubled the vegetables. Other than that I followed the recipe. This is the first time I cooked goat so it was a risk. However we eat lamb regularly. If you like lamb I think you'll like goat. Definitely a keeper for us and now I want to try more goat meat recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy Lyons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9353193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-29T14:25:50.13Z",
                "reviewBody": "Recipe was great and am sure beef could have been substituted but goat needs to be boiled 2 hours first to soften then do original recipe using boiled water as base for stew.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "00fearless",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11559164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-15T01:37:14.64Z",
                "reviewBody": "This was so good!  I live in India and was making for the family here, so I did minor tweaks.  But the basic idea of this is perfect and you can vary it as you want.  \nHere's my changes: I tripled the recipe, so added three goat feet to give the soup broth richness as I used the meat cooking liquid only (no broth here and I didn't have time to make one). After marinating and browning I pressure cooked the meat with thinly sliced onions and water.  I made the tomato base as written, then added the meat with cooking broth and marinade.  I needed to add more water.  My family likes spicy so I did up the spices (I don't measure but used a lot of chili powder and some various masalas).  Since the meat was mostly done I just added the potatoes to cook and tasted as they cooked, adjusting the spices.  Served over rice.  This is definitely going to be made regularly for us!  YUM",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Hoffecker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/962264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-02-22T19:30:50.247Z",
                "reviewBody": "After the first time making this it quickly became my husbands favorite dish. He requests it all the time and no one else in the family complains. I took the advice of a reviewer and boiled the meat for two hours before marinating and used the boiled water in place of the beef stock. I marinated the meat for six hours and used sweet peppers instead of bell pepper. It was absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan Newton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17029463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-05T07:54:58.53Z",
                "reviewBody": "I made some changes based on what I had in the kitchen. I used the whole 2 lb bag of goat cubes because I already had them thawed. I left the marinade measurements the same except I doubled the garlic and used white wine vinegar. I marinated for 12 hrs. I dumped the whole thing in the slow cooker with the rest of the ingredients except for the peas. I tossed those in when it was done. I added Hungarian paprika a bay leaf and a chunk of ginger. The bay leaf and ginger not to be eaten. The stew is absolutely delicious. The meat was tender and flavorful. I will definitely be making this again. Next time I will probably flour the meat to thicken up the gravy as the slow cooker creates a lot of juice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Mims",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3182130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-06T01:56:52.843Z",
                "reviewBody": "I think this recipe has potential. This is my first time cooking goat and it came out on the tougher side. I think it needs to be simmered way longer. I used apple cider vinegar and replaced some of the soy sauce with low-sodium soy sauce. I also used diced tomatoes instead of tomato sauce because it's what I had on hand and added a splash of ketchup. Taste-wise it was very good - not too sour salty or sweet - a perfect balance. Just need to get the goat less tough...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sunnymonkey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3582320/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-29T21:34:08.557Z",
                "reviewBody": "Way too salty way too tomatoey and we even used less than the recommended amounts of soy sauce and tomato sauce! Definitely will not make again and if I could rate this lower I would for sure. I have NO idea how this is rated so highly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Niccole Vasatka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3380116/"
                }
            }
        ]
    }
]