[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/151/breakfast-and-brunch/pancakes/",
                    "name": "Pancake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15005/breakfast-and-brunch/pancakes/baked-pancakes/",
                    "name": "Baked Pancake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24146/german-baby/",
        "name": "German Baby",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9188215.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:42:29.000Z",
        "description": "Quick, easy and delicious. Serve with lemon wedges, warm maple syrup and jam.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "1 to 2 servings",
        "recipeIngredient": [
            "3 eggs",
            "¾ cup milk",
            "¾ cup all-purpose flour",
            "¼ cup butter",
            "2 tablespoons confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Place butter in a 10 inch cast iron skillet and heat the skillet in  oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat eggs at high speed with an electric mixer. Slowly add the milk and flour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into hot skillet. Return skillet to oven and bake for 20 minutes. It will rise like a souffle, then fall when taken out of oven. Lightly dust with powdered sugar and serve.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Pancake Recipes",
            "Baked Pancake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Shirley Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.639344262295082,
            "ratingCount": 244,
            "itemReviewed": "German Baby",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "555.9 calories",
            "carbohydrateContent": "48 g",
            "cholesterolContent": "347.3 mg",
            "fatContent": "32.7 g",
            "fiberContent": "1.3 g",
            "proteinContent": "17.5 g",
            "saturatedFatContent": "18.1 g",
            "servingSize": null,
            "sodiumContent": "307 mg",
            "sugarContent": "12.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-20T16:24:06.797Z",
                "reviewBody": "Okay, first time I made this I followed other suggestions--I warmed the milk and eggs and added 1/2 tsp of vanilla and 2 tbsp powdered sugar.  I preheated oven to 425 and put the butter in the pan.  This first one only took 13 minutes to cook and even then it was slightly burning and seemed uneven...but it was still good.  So then I made another one, and this time I didn't warm the milk and eggs, I only added the vanilla and not the powdered sugar.  Also, most IMPORTANTLY, I reduced my oven to 400 and warmed the skillet without the butter.  Once the batter was done, I added the butter, kept the pan in the oven for a minute or so, then took the pan out and added the batter.  It baked for about 18-19 minutes and it was perfectly puffed and golden brown.  It was PERFECT this second time around!!  I submitted a photo for reference...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nicksprincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2432041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T02:15:13.717Z",
                "reviewBody": "I became addicted to these after having them at the local Pancake House, and was very excited to find a recipe. After a few false starts, I figured out the trick... for these to turn out correctly, YOU MUST USE WARM EGGS AND MILK! I submerge the eggs in hot water from the tap for about five minutes (refilling several times) and microwave the milk for 50 seconds. Doing these two simple things dramatically changes the end result. I make one or two of these on the weekend to have for lunch during the week... they heat up surprisingly well in the microwave. With fresh squeezed lemon juice and powdered sugar there's nothing better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SemantiTheft",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1764787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-09T16:53:51.25Z",
                "reviewBody": "Yum! I've always heard this called a \"Dutch baby\" - my sister first introduced me to this at a breakfast restaurant near her home in Vegas. I was so excited to try this recipe!\n\nThank you so much to SemantiTheft who advised warming your eggs and milk - I did, and it puffed like crazy! I don't have a microwave right now, so I just put a few inches of hot water in the sink and put the eggs and the big measuring cup of milk in there while the oven was preheating. Worked like a charm!I also add a capful of baker's vanilla - clear instead of brown; won't darken the color of the batter - into the milk. Adds a tiny hint of sweetness which I like.\n\nThis was so easy, and so much fun to watch while it's in the oven - and really fun to eat, too! I don't have a cast iron skillet, so I just used my regular (oven proof) pan the same size, and it worked just fine! I used margarine instead of butter, and the edges seem to be a little salty, so I think I'll try unsalted butter next time, but completely delicious even so! I debate reducing the butter every time, but I think those little pools in the middle are part of the magic! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-22T14:57:25.337Z",
                "reviewBody": "As is I would give this recipe 4.5 stars. With the few changes that I made it was 5 stars. I added about a teaspoon of vanilla a few dashes of cinnamon and just a pinch of sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jigginjessica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2112453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-28T20:11:41.297Z",
                "reviewBody": "This was great! While it was cooking I warmed up some strawberries bananas & pineapple in a non-stick skillet with a 1 tbl. butter & 1/4 cup brown sugar. Topped the servings of the \"pancake\" with that and then added some light whipped cream sprinkled with cinnamon. The only suggestion I would have would be to use unsalted butter. The salted butter gave it more of a savory taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wannabe Gardener",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1393034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-21T23:05:00.273Z",
                "reviewBody": "Fantastically easy! Chewy goodness! It definitely helped to have a cast iron skillet, and I just tossed in the butter,  heated it up in the oven for, I dunno, 20 minutes or so, and whisked up the batter and dumped it in. 20 more minutes and it looked even BETTER than the picture. Sorry, I can't take a picture of it now. I ate it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jon Kerr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2385814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-11T18:06:51.95Z",
                "reviewBody": "Yummy! Better than the restaurant that serves this by my house. I had a craving for a German Apple (it's a German Baby with apples) but I didn't want to have to go out. I substitued for what I had in my kitchen: Smart Balance for butter soy milk for regular milk and a square 8.5\" pan. I think the soy milk made it fluff up more. It was all fluff actually (no custardy center). The only thing I would change is to use a non-stick pan. I did the traditional lemon maple powdered-sugar topping. It was delicious. I submitted some photos. Next time I may add some granny-smith apples sliced thinly to the bottom of the pan to get the German Apple taste. I just didn't want to experiment too much the first time around.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZEROGIRL42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1409037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-05T01:12:25.513Z",
                "reviewBody": "This is great! A memory from my childhood of a restaurant breakfast treat where they called it a \"Dutch Baby\". My cast iron skillet is only 9\" rather than 10\" so I ended up having to add about 7 more minutes to the baking time to compensate for the batter being less spread out in the smaller pan. I would have found the eggy-ness VERY unappealing if I'd taken it out at 20 minutes! The edges didn't burn, so it worked out fine. After cooking, I filled the pancake with cooked pork link sausages and sauteed apples with lemon wedges, maple syrup and powdered sugar on the side. It made a quick and different easy dinner. I think the batter could have used a speck of salt to it, but that is my only complaint.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-30T00:59:23.59Z",
                "reviewBody": "This was very yummy! I added some sugar and a dash of vanilla and cinnamon to the batter. There was a diner that used to serve this dish in my hometown. Every time we went I would order this. I was so excited to find a recipe for it. It tastes just like I remember! I ate the whole thing myself and then had to make another one for my boyfriend!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LorieLou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1288249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T20:33:42.05Z",
                "reviewBody": "I've never had a german baby before but we thought it tasted like thick scrambled eggs. Probably won't be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RALWATTAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1281438/"
                }
            }
        ]
    }
]