[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/109/appetizers-and-snacks/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1118/appetizers-and-snacks/vegetable/mushrooms/",
                    "name": "Mushrooms",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14906/appetizers-and-snacks/vegetable/mushrooms/stuffed-mushrooms/",
                    "name": "Stuffed Mushroom Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24174/garys-stuffed-mushrooms/",
        "name": "Gary's Stuffed Mushrooms",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1037150.jpg",
            "width": 2992,
            "height": 2992
        },
        "datePublished": "2019-04-02T06:42:30.000Z",
        "description": "Chicken flavored dry stuffing mix is the secret ingredient in these stuffed mushrooms created by my cousin Gary.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H42M",
        "recipeYield": "12 mushrooms",
        "recipeIngredient": [
            "12 large fresh mushrooms, stems removed",
            "1 (6 ounce) package chicken flavored dry stuffing mix",
            "1 (8 ounce) package cream cheese, softened",
            "½ pound imitation crabmeat, flaked",
            "2 cups butter",
            "2 cloves garlic, peeled and minced",
            "salt and pepper to taste",
            "garlic powder to taste",
            "crushed red pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Arrange mushroom caps on a medium baking sheet, bottoms up. Chop and reserve mushroom stems.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare chicken flavored dry stuffing mix according to package directions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium heat, melt butter. Mix in garlic and cook until tender, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together reserved mushroom stems, prepared dry stuffing mix, cream cheese and imitation crabmeat. Liberally stuff mushrooms with the mixture. Drizzle with the butter and garlic. Season with salt, pepper, garlic powder and crushed red pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake uncovered in the preheated oven 10 to 12 minutes, or until stuffing is lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Vegetable",
            "Mushrooms",
            "Stuffed Mushroom Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TINACOX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.601652892561983,
            "ratingCount": 605,
            "itemReviewed": "Gary's Stuffed Mushrooms",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "413.1 calories",
            "carbohydrateContent": "14.4 g",
            "cholesterolContent": "105.7 mg",
            "fatContent": "37.9 g",
            "fiberContent": "1 g",
            "proteinContent": "5.9 g",
            "saturatedFatContent": "23.7 g",
            "servingSize": null,
            "sodiumContent": "693.5 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-07-30T18:44:28.703Z",
                "reviewBody": "I loved these mushrooms.  I did make a couple of changes (I can't seem to stop myself).  I sauted the chopped mushroom stems with some finely chopped onion and minced garlic before adding them to the prepared stuffing mix.  I also used 2 cans of real crab meat instead of the imitation, cuz I had some in the cupboard that I had picked up at the 99 cent store.  I also put a healthy pinch of grated Parmesano Reggiano on top of each stuffed mushroom before baking.  Had to bake these for about 25 minutes, though. They smelled wonderful while they were baking, and I took them to my card club and the ladies snarked them all up.\n\nOne thing:  Even though I used a 24 oz box of mushrooms, and piled them high with stuffing, I had quite a bit of the stuffing left over.  The next day, I bought another 24 oz box of mushrooms and made these again for just my husband and me for dinner.  If Gary only uses 12 mushrooms, and uses up all the stuffing, the mushrooms must be ENORMOUS.  Great recipe, though!  Will make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-20T17:29:45.497Z",
                "reviewBody": "stuffed mushrooms are a holiday staple, but i make mine a little different...chop and saute the reserved stems and about 1/2 cup chopped onion... also, i use ham instead of crab.  (you can either us the canned ham, or chop up some deli ham).  -I've never tried them with cream cheese, but think it would be a nice compliment to the ham. -\r\nalso, for extra moist mushrooms (and to save a little fat), omit the butter and drizzle a little chicken broth over the  stuffed creations just before baking. \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda Spring Wilmoth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/731505/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T01:27:48.913Z",
                "reviewBody": "I just love recipes that I can throw together using ingredients I already have available; that much better when the food tastes so good that everyone wants the recipe.  This is one of those recipes.  I eliminated the crabmeat since I had none on hand and J_TATUM and LOTHRID both said this did not hamper the success of the recipe.  I used one and a half sticks of butter during step five, and a half stick during the preparation of the boxed stuffing, bringing the total butter usage to 1 cup.  This was in response to the postings which said too watery or too much butter.  It worked fabulously.  Served these at a dinner party with much success.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUST-MARRIED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-05T17:12:09.84Z",
                "reviewBody": "These are FANTASTIC! I did take the advice of other reviewers and reduced the butter.  I used one stick of butter to saute the garlic, then I added the cream cheese to the melted butter/garlic until it was melted and smooth.  I added this entire mixture to Stovetop chicken flavored stuffing and added two cans of Geisha snow crab meat.  It does make alot of stuffing but it freezes well so you can save some for another batch of stuffed mushrooms.  These taste unbelievalbe.  Whether I make 25 or 75 of these for a party...every last one is eaten.  Thanks for a fantastic recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBACUB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-25T19:15:17.53Z",
                "reviewBody": "I made these for an appetizer, and everyone loved them.  I didn't see the point of all the butter, but after checking on them in the oven half way, I understood that it is for cooking the mushroom.  I have made them since, and added stock to the pan instead of butter, it worked just as well. Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDYGIRL1977",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1454133/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-17T02:26:19.013Z",
                "reviewBody": "I made these to have as appetizers before our Christmas dinner and they were absolutely delicious with some changes.......I doubled the amount of mushrooms but really I could have tripled and still come out okay. I omitted the crabmeat used mushroom and onion flavored Stove Top and light cream cheese. And the butter-there's no reason to use that amount! I just used the few tablespoons it took to make the stuffing and that was it. When I finished stuffing the mushrooms I sprinkled them with a little Parmesan cheese paprika and dried parsley flakes. Right before baking I also sprinkled on a dry white wine and poured just enough wine in the pan to cover the bottom of it. Perfection! Everyone loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "plumeria1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1472204/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-02T15:37:54.84Z",
                "reviewBody": "I used pork sausage instead of Crab and used small mushrooms instead of large. We had to get more mushrooms because of the amount of extra stuffing. I use 4 - 8 oz packages of small mushrooms. It was wonderful. Also you don't need as much butter. I only used about 1/2 cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisadeew",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1572319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T20:09:15.37Z",
                "reviewBody": "Yum yum yum... wow I thought I'd never find mushrooms this good. We had a restaurant here in St Louis that closed and I've been searching for their mushrooms and this recipe is close to it. I read most of the reviews and changed things a bit myself I made this with pork sausage (no crab) and half the butter. It was great and dont tell anyone but I ate 6 myself (needless to say I was full) I made 16 mushrooms and had plenty of stuffing left for Sunday dinner I stuffed chicken breasts with the stuffing like another reviewer said. I still have to find something to do with the rest but I'd eat that filling on crackers really. Thanks Gary great mushroom recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NICOLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-05T19:07:51.77Z",
                "reviewBody": "this is a good recipe but holy cannolis does it have an insane amount of calories!!! ONE mushroom is almost the equivalent of a Mcdonalds Big Mac!! ONE MUSHROOM! I tried to cut it down since only my husband and I were eating these i made 8 msrms. I used only 4tbsps butter 4 oz crm chse 1C stuffing mix chopped garlic and small onoin. along with spices it came down to about 148 calories per serving! still quite a bit but at least i can eat 3 versus eating only 1!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSIEQ203",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1425257/"
                }
            }
        ]
    }
]