[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1457/side-dish/potatoes/mashed-potatoes/",
                    "name": "Mashed Potato Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228849/garlic-mashed-potatoes-in-the-slow-cooker/",
        "name": "Garlic Mashed Potatoes In The Slow Cooker",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F882989.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "2019-04-02T06:58:37.000Z",
        "description": "Simple and delicious! If you cook for a large family or want to reduce last-minute chaos in the kitchen, you will LOVVVVE this recipe! It has been taste-tested by adults, teenagers, children and toddlers. Everyone in my family loves it...and you will too! Can easily be made ahead; just cool, cover, and store in refrigerator overnight.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H20M",
        "totalTime": "P0DT3H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "5 pounds red potatoes, peeled and cut into chunks",
            "1 (8 ounce) package cream cheese",
            "1 (8 ounce) container sour cream",
            "1 ½ cups chicken broth",
            "2 teaspoons garlic powder",
            "salt to taste",
            "½ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer potatoes to a large bowl and mash with cream cheese and sour cream until thoroughly combined; slowly mash in chicken broth, followed by garlic powder and salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat potatoes with an electric mixer on high speed until whipped, about 2 minutes. Transfer potatoes to a slow cooker. Set slow cooker to Low and cook for 3 hours. Stir melted butter into potatoes just before serving.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato",
            "Mashed Potato Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Alley"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.673913043478261,
            "ratingCount": 46,
            "itemReviewed": "Garlic Mashed Potatoes In The Slow Cooker",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "464 calories",
            "carbohydrateContent": "47.8 g",
            "cholesterolContent": "74.7 mg",
            "fatContent": "27.7 g",
            "fiberContent": "4.9 g",
            "proteinContent": "8.8 g",
            "saturatedFatContent": "17.2 g",
            "servingSize": null,
            "sodiumContent": "396.2 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-11-30T04:41:04.197Z",
                "reviewBody": "Very good recipe. I made it for Thanksgiving and it went over well with my company. However, I didn't need to throw the potatoes in a slow cooker as my cooking plans changed and a holding pot wasn't necessary. Now, I have a question. Why do people have to leave such cranky reviews about a good recipe that they might not have even tried?? The poor reviews really knocked the rating down unnecessarily, and I'm really sick of reading snide, \"know-it'all\" reviews wherever I go on the internet. This recipe was intended for those who had too much cooking to do and needed a way to make it ahead without having to reheat the dish. Who cares if I have to wash something extra? If a recipe doesn't appeal to you, please just move on to something that does without ruining it for those who might want to try it. This was a wonderful idea and a good recipe. Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crispybiskit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10869389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-02T14:07:19.513Z",
                "reviewBody": "I used reduced fat cream cheese and reduced fat sour cream. I did also add a good amount of fresh snipped chives. I served these with salisbury steak--the family ate almost the whole thing in one sitting. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-10T00:14:50.093Z",
                "reviewBody": "I like making a big batch of mashed potatoes like this because I freeze some of them in qt sized freezer bags. Thaw out a bag, put in a sauce pot over a very low flame and stir a few times and you would think they were just made. I also add a couple of bay leaves and black pepper to the salted water when boiling them. I scrub mine well and leave the skins on before cutting and boiling then mash with a hand masher because I like chunky skin on mashed potatoes. Also I swap out the chicken broth and use half and half. I know, rich but what the heck, very comforting and we don't eat them every day. Whenever there is a family get together I always get asked to bring \"your\" mashed potatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "slo_cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2767931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-20T21:31:36.33Z",
                "reviewBody": "I made these for our Thanksgiving in September gathering and well, let's just say.....what is not to like? You obviously don't make these if you are counting calories - you do make them if you are looking for a great make ahead, full of flavor, delicious side dish to any special meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-01T02:41:50.223Z",
                "reviewBody": "Perfect for Thanksgiving. I used yellow potatoes instead of red and I should not have. Next time I will use the red or a firmer potato. They came out a little runny because they just weren't firm enough.Overall the dish was really good and a huge stress reliever because I didn't have to boil/mash the potatoes and try to get the turkey out all at the same time. I will make them again for next Thanksgiving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOSSIER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1224560/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-07T13:12:13.073Z",
                "reviewBody": "I have been making a version of these potatoes for years. I use french onion soup dip instead of sour cream and do not add chicken broth or so much butter (just a few pats on top of potatoes when they get baked). I also have never tried them in the crock pot. I just make them ahead and put them in the oven with the rest of the side dishes. I have also made them frequently without the cream cheese and just added some milk to make them creamier and somewhat healthier. If you have the room in your oven I don't know why you'd dirty another dish to put them in the crockpot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ccon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ccon1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-26T16:29:07.273Z",
                "reviewBody": "This the perfect way to have the mashed potatoes done ahead of time for Thanksgiving!!! LOVE the creamy rich flavor. Will definitely make this again. Thank you",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gtyyup",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4623596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-28T19:18:41.067Z",
                "reviewBody": "Made mashed potatoes for the first time ever using this recipe for our thanksgiving dinner. Had to make them the day before and then take them to my mom's so the slow cooker worked out perfectly. Some other comments made me worry about getting too watery so I only used half the chicken broth figuring I can add more the next day if needed but it wasn't needed. I only cooked for about 2 hrs the day they were made then day of high for an hour and low for an hour adding the melted butter after turning to low. Good news was they turned out great bad news is now its my job every thanksgiving from here on out. Thanks for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lulu43",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12412551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-27T10:52:04.483Z",
                "reviewBody": "I followed the recipe pretty much exactly as written and used the towel under the lid trick but after putting these into the crock pot they turned to thick soup. Delicious soup but still soup. No one complained and in fact they all complimented me on how delicious they were. The only deviations I made from the recipe was to mash the potatoes with a manual potato masher instead of whipping with an electric mixer so they were more chunky than whipped. Plus I prepared the potatoes the night before Christmas and refrigerated them overnight. Maybe that is where the excess moisture came from. This is a total winner taste-wise as a mashed potato recipe so I'll continue to work with it. The benefit of last minute prep prevention is worth further experimentation with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SouthernJane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4997719/"
                }
            }
        ]
    }
]