[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14730/soups-stews-and-chili/stews/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229089/northern-italian-beef-stew/",
        "name": "Northern Italian Beef Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1066605.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2019-04-02T06:58:46.000Z",
        "description": "This hearty beef and vegetable stew that can be made in the slow-cooker is a family favorite.  It is also the backbone for an excellent beef soup, if you actually find yourself with leftovers.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT4H20M",
        "totalTime": "P0DT4H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "2 pounds lean top round, trimmed and cut into 1-inch cubes",
            "2 large sweet onions, diced",
            "2 cups large chunks of celery",
            "4 large carrots, peeled and cut into large rounds",
            "1 pound crimini mushrooms, sliced",
            "2 tablespoons minced garlic",
            "2 cups dry red wine",
            "4 large tomatoes, chopped",
            "1 ½ pounds red potatoes (such as Red Bliss), cut into 1-inch chunks",
            "1 tablespoon dried basil",
            "1 teaspoon dried thyme",
            "1 teaspoon dried marjoram",
            "½ teaspoon dried sage",
            "1 quart beef stock",
            "2 cups tomato sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large skillet over medium-high heat. Cook beef in batches in hot oil until browned completely, about 5 minutes per batch. Remove browned beef cubes to a plate lined with paper towels, keeping skillet over heat and retaining the beef drippings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook and stir onion, celery, and carrots in the retained beef drippings until just softened, 2 to 3 minutes. Stir mushrooms and garlic into the onion mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour red wine into the pan; bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Continue cooking the mixture until the wine evaporates, 7 to 10 minutes. Stir tomatoes into the mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return beef to skillet with potatoes, basil, thyme, marjoram, and sage. Pour beef stock and tomato sauce over the mixture. Bring the liquid to a simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce heat to low and simmer until the beef is very tender and the sauce is thick, 4 to 6 hours.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Karen Barris Calabro"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.463829787234043,
            "ratingCount": 235,
            "itemReviewed": "Northern Italian Beef Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "475.7 calories",
            "carbohydrateContent": "34.4 g",
            "cholesterolContent": "102 mg",
            "fatContent": "10.2 g",
            "fiberContent": "7.2 g",
            "proteinContent": "49.9 g",
            "saturatedFatContent": "2.7 g",
            "servingSize": null,
            "sodiumContent": "500.5 mg",
            "sugarContent": "11.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-09-21T11:06:16.957Z",
                "reviewBody": "I used two and a half pounds of stew meat because honestly, I can't afford top round. I also used sliced baby bella mushrooms instead of crimini. I did not have time to make this in a dutch oven. I browned the meat in the oil, then added it to my crockpot with the celery and the carrots. I then sauteed the onions and garlic in the drippings with a little butter until the onions turned translucent, then I deglazed the pan with the wine. I poured all of it into the crockpot, then added the tomatoes, potatoes, spices, beef stock and tomato sauce. I let this cook all day until my family got home. I made homemade yeast rolls to go with. This was one of the best stews I've ever made. It's got a beef burgundy feel to it, it's rich and decadent tasting. I had a big bowl when I got home from work and it was like eating a big hug. EXCELLENT recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-12T03:22:01.75Z",
                "reviewBody": "Big and hearty, with a beefy tomato taste.  Rich and robust, satisfying, stick to your ribs good.  Other than coating the meat in flour first, I made no changes to the recipe.   I had my doubts that 4-6 hours simmering was necessary and even thought it might work against this dish, but I chose to follow the directions.  After two hours I was ready to call it quits but let it go another hour – and shouldn’t have.  By this time, three hours, the meat had broken down and started to fall apart into small pieces.  I would have much preferred a stew with good-sized chunks of meat.   Four stars rather than five for directions that essentially took this backward as it overcooked.  After two hours it seemed to have reached a turning point and lost quality beyond that.   An hour and a half to two hours would have resulted in tender meat that still held its shape.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-16T12:54:54.64Z",
                "reviewBody": "Delicious!  I didn't have fresh tomatoes, so I used canned diced.  Also, I didn't have all the herbs recommended, so I used dried Rosemary, Thyme and Basil.  Used Chiati for the red wine and it went beautifully with the finished product.  Best beef stew I have ever made!  Such an easy recipe too!  My husband loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340146/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-26T21:19:30.31Z",
                "reviewBody": "The taste, which is what we're all after in the first place, conveys a rich delicious broth with tender sweet vegetables and beef, making this stew a winner any day, although I reserve these meals preferably for Sunday lunch or dinner ... and cooked in a slow cooker (crock-pot)                   \nBeing a retired butcher, catch chuck or shoulder roast on sale ... buy a three or four pound roast ( boneless or bone in ) take it home and cut it up in 1/2\" pieces ( trimming the fat off at this time if your so inclined .... leaving some fat on improves the richness of the final product when cooked ) and saving at LEAST a dollar a pound over buying pre-packaged \"stew meat\", while controlling the preferred bite size and fat content. /Use the amount of stew meat that you think it will take and freezing the rest in portion controlled freezer bags. (I dusted the meat with seasoned ( S&P ) flour before browning it in a skillet) During or after browning the meat, toss in  and sauté the onion, celery, carrot, mushrooms and garlic (garlic last ... DO NOT BURN the garlic !) Next, deglaze skillet with some wine and add all to crock pot.\nI used a \"Lambrusco\" wine ... added 3 tbl. of \"Kitchen Bouquet\", and 1 tbl. of \"Lee & Perrens Worchester Sauce\". ( always! )  \n\n(optional ... toss in a hand full or two of frozen corn ( or a small can of \"Niblets\" white corn, drained ) .... same with peas (small preferred)... both, personal preference to add. \n\nThis is a recipe not to be missed !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4066174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-20T23:26:55.383Z",
                "reviewBody": "I really liked this!! I did as Sarah suggested and used stew meat! Finished up in the crock! 4.5 hours on low! Will def make again! Only other change was in my spices..... Used an Italian blend in lieu of the above and added 2 bay leaves while in the crock!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2511000/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-22T22:06:55.62Z",
                "reviewBody": "Made this up as posted - wonderful beef stew.  It's a bit of work to get the prep done but the results are well worth the effort.  I may have cut the beef and potatoes a bit smaller than 1 inch and with the 4 hour cooking time they were more than done, but still intact.  I will keep closer to the 1 inch recommendation next time.\n\nOne tip I saw somewhere that was helpful was to freeze the round steak for 15-30 minutes (not frozen hard) to make cutting it easier and it worked great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PawpawToGo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12387200/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-01T15:08:58.933Z",
                "reviewBody": "I tried this recipe for the first time a few weeks ago. We were pleasantly surprised at how flavorful it was; we loved it so much that I am making it again today. This will be our favorite go to throughout the winter season. We did add a few other vegetables that we had around the house; this recipe easily lends itself to being tweaked to each persons liking. Having a recipe that uses such affordable cuts of meat make it even more appealing to a single income family like us; you could throw in some rice or a pasta and stretch it even that much further. Thank you so much chef Karen for this wonderful meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "angvald",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9961927/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-22T01:40:25.86Z",
                "reviewBody": "I used a little over 2 pounds of stew meat and I cut back the mushrooms to 1/2 pound. Other than these changes I used the ingredients suggested by the recipe author. My stew meat was tender after 3 hours on the stove top. I can't imagine that a better cut of meat would hold together for 6 hours in the pot and the vegetables would be nearly dissolved if cooked that long. This makes a generous amount of stew and I had to use a 6 quart dutch oven since I do not have a skillet large enough to accommodate this. The stew as written nearly filled my pot. The stew liquid is well-flavored though thin (I prefer a thicker sauce consistency for stew) and not too strongly flavored with tomato. I only have one other tiny criticism. Herb leaves turn dark and unattractive in tomato based sauces. I think it would be more appetizing to tie them up in cheesecloth and remove before serving. I can well imagine this as a soup if everything is cut into bite-sized pieces. If you wish to make soup I would recommend adding the carrots mushrooms and potatoes later in the process so the smaller pieces will not cook too long. Overall I give the recipe four stars both for the flavor and for the directions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bibi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bibi/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-05T11:52:21.45Z",
                "reviewBody": "To be fair as written it is a four star recipe due to a bit of blandness to the flavor. But the second time I made it I added only basil and oregano as my spices but upped the garlic to four cloves and added a quarter cup of Worcestershire sauce. Now it is five stars! Yum!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8467227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-13T02:37:49.59Z",
                "reviewBody": "I don't think I would make this again serves at least 12 and on the expensive side to make. It really needs salt and pepper. Filled my crockpot to the top. Took at least 6 hours to cook. Add salt an pepper to taste and a little Worcestershire to taste also",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Gay Clark",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3432724/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Northern Italian Beef Stew",
            "description": "Wow yourself with this hearty beef stew.",
            "uploadDate": "2017-12-18T22:29:24.435Z",
            "duration": "PT2M26.98S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fe591ea85-87fa-45f6-835a-97ed7550489c%2F6eea535b-4256-4f88-bba7-4dc96929bef8%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5686674058001"
        }
    }
]