[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17743/main-dish/rice/",
                    "name": "Rice",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14363/main-dish/rice/fried-rice/",
                    "name": "Fried Rice Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229293/korean-saewoo-bokkeumbap-shrimp-fried-rice/",
        "name": "Korean Saewoo Bokkeumbap (Shrimp Fried Rice)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F972475.jpg",
            "width": 2359,
            "height": 2359
        },
        "datePublished": "2019-04-02T06:58:55.000Z",
        "description": "Ever since we lost our good friend Mr.Cuckoo (the name brand of our rice cooker) a few months ago, we never have any leftover rice (which is ideal for fried rice) because our new one makes exactly four servings. And since my futile attempts at fixing Mr.Cuckoo had reached its end, the missus had to make new rice and let it cool for a few hours. Enjoy this fried rice with kimchi and other Korean side dishes.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "1 carrot, diced",
            "½ green bell pepper, diced",
            "2 cups shrimp, peeled and deveined",
            "½ onion, diced",
            "½ (15.25 ounce) can whole kernel corn, drained",
            "2 cloves garlic, thinly sliced",
            "1 tablespoon olive oil",
            "2 eggs, beaten",
            "4 cups cooked rice, cooled - or more to taste",
            "2 tablespoons oyster sauce, or more to taste",
            "2 tablespoons soy sauce",
            "1 tablespoon butter",
            "½ teaspoon salt",
            "1 teaspoon butter, or as needed",
            "4 eggs, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons olive oil in a large skillet over medium heat and cook and stir carrot and green bell pepper until slightly softened, about 5 minutes; stir shrimp, onion, corn, and garlic into carrot mixture. Cook and stir until shrimp turn pink and are no longer translucent, 5 more minutes. Pour off any liquid. Turn heat to low and let mixture simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon olive oil in a separate skillet over medium heat; pour 2 beaten eggs into hot oil and scramble the eggs until firm and no longer runny, 2 to 3 minutes. Mix scrambled eggs lightly into shrimp and vegetables.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir rice, oyster sauce, soy sauce, 1 tablespoon butter, and salt into shrimp mixture, tossing until rice is thoroughly combined with shrimp and vegetables and coated with sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 teaspoon butter in a small nonstick skillet over medium heat until butter stops foaming; break 1 of the 4 remaining eggs into the hot butter. Cover skillet and let egg cook until the bottom is slightly browned, the yolk is runny, and the top of the white is slightly firm, about 3 minutes. Set egg aside. Repeat with remaining 3 eggs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Serve shrimp fried rice topped with fried eggs. For a nice presentation, fill a bowl with 1/4 of the fried rice, press lightly to compact, and turn fried rice out onto a serving plate in a dome shape; top with a fried egg. Repeat with remaining rice and eggs.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Rice",
            "Fried Rice Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mykoreaneats"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7894736842105265,
            "ratingCount": 38,
            "itemReviewed": "Korean Saewoo Bokkeumbap (Shrimp Fried Rice)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "552.8 calories",
            "carbohydrateContent": "61.2 g",
            "cholesterolContent": "375.2 mg",
            "fatContent": "22.8 g",
            "fiberContent": "2.9 g",
            "proteinContent": "26.4 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "1209.4 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-11-08T22:46:44.207Z",
                "reviewBody": "The recipe itself was decent but I've read some of these reviews(as a half Korean) and can't help feeling this surge of disappointment. It just seems people don't respect the individuality of Asian cultures and their cuisines and try to view all things Asian in this fusion heavy sort of way. Its not all the same, folks. Chinese fried rice is notably different from Japanese fried rice which is still different from Koream and Thai and so on. Every Asian nation has its own unique take on dishes such as fried rice and it ain't all the same thing. Take heed that changing green peppers to peas isn't just a simple matter of preference, you're going from a Korean dish to a Chinese one. If you like to eat this way, thats great. But at least acknowledge that what you're doing isn't strictly Korean anymore and the fried rices of eaxh country are all that much different. Same goes for the inclusion of egg drop soup on the side- its perfectly fine but at leasr habe a bit of acknowledgement that its Chinese. You're pairing a Chinese soup with a Korean dish. Peace.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nico95",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10852995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-02T02:27:56.42Z",
                "reviewBody": "Hubs is lucky I like him.  He’s on a business trip today, getting home late tonite, and won’t have had a chance to eat all day.  He told me he’s been looking forward to this dinner (I made this along with Egg Drop Soup (Better than Restaurant Quality!) all day.  This was so “D” good it’s only the guilt factor and the fact that I like him that’s preventing me from scarfing up his portion too.  As is my preference, I used peas and carrots rather than green bell pepper, corn and carrots, and in the interest of being carb-responsible, less rice than called for in proportion to the shrimp and vegetables.  I loved the addition of the oyster sauce as well as the soy sauce, which gave this fried rice a little more complexity in flavor than most.  As for the egg, as I always do when I make fried rice, I cooked it as a crepe, rolled it up like a cigar, then sliced it into ribbons, chiffonade style – much prettier.  (I learned this from a wonderful Chinese cook many, many years ago) I did not top this with the optional fried egg – this was just perfect without it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-10T21:00:21.317Z",
                "reviewBody": "This was delicious. Fried rice and eggs are a common breakfast on Maui and this is a good one. I made one small change. I used peanut oil with a drop or two of sesame oil because I like those oils for their flavor in stirfrys.(instead of olive oil) Thanks so much for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-08T16:24:41.747Z",
                "reviewBody": "Now here is my go-to shrimp fried rice! I made two batches the first one per the instructions. It was just marvelous and rates five stars on its own. On the second batch I used 24 ounces of frozen pre-cooked shrimp and added them in step #3. I used 2 cups of veggies diced carrot frozen corn and frozen peas. I did prepare the scrambled eggs thin and crepe-like and then made a chifonade of them - The presentation was just like at a restaurant! Oh and for a little added zing I also added about 1/2 teaspoon of Sriracha sauce in step #3. All in all I had a great time with this recipe and everyone thought I was a genius! Thanks oliviajasonkim!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WileyP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1775667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-09T01:12:37.537Z",
                "reviewBody": "Next time I will take a photo - this was possibly the best fried rice I have ever made. I usually make Chinese style which is good but these flavors and the fried eggs put this over the top! Everyone (including my 7yo DD) cleaned their plate. Ten stars as is. I did change the method from the recipe but not any ingredients. I dislike pan washing (who doesn't?) so I used a large cast iron pan and just scooted everything to the outside to scramble the eggs in the same pan. They cook in less than a minute and you just stir up together. I also used precooked shrimp so I added the onion and garlic after the first five minutes then added the thawed shrimp and corn for another two. The combination is ideal and I recommend against changing it especially the fried eggs. Kudos mykoreaneats!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRAEZDAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/669128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-14T18:13:43.993Z",
                "reviewBody": "This is absolutely delicious!!! I added cabbage but other than that I cook it by the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cngarrett25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11381040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-04T08:01:37.283Z",
                "reviewBody": "The flavor was good the eggs on top were unexpectedly good as well. I felt like the ratio of sauce to rice was a little too light for me. I might increase the sauce next time to saturate my rice a little more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mamamel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8486425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-30T12:24:40.457Z",
                "reviewBody": "5 stars from the entire family! I'm hit or miss when it comes to rice and this came out perfect. I did omit the corn because we don't care for it in our fried rice. Also omitted the shrimp because it was being served with Honey Walnut shrimp. I did add anchovy paste and was asked to add pineapples the next time. I didn't have day old rice so I made it in the morning allowed it to cool for 1hr on wax paper after separating with a fork and then put it in the frig for 6 hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Isthat Onsale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13200307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-06-14T06:51:35.907Z",
                "reviewBody": "It was ok but I wouldn’t make it again. The vegetables weren’t the typical fried rice type and it was too much soy sauce flavor. I will keep looking for more fried rice recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "nellycct",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9258169/"
                }
            }
        ]
    }
]