[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15455/main-dish/meatballs/",
                    "name": "Meatball Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229484/spanish-style-albondigas-in-a-sunny-mediterranean-sauce/",
        "name": "Spanish Style Albondigas in a Sunny Mediterranean Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F961619.jpg",
            "width": 1280,
            "height": 1280
        },
        "datePublished": "2019-04-02T06:59:02.000Z",
        "description": "The sunshine just shines on and on. A delight to the taste buds.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "⅔ pound ground beef",
            "⅓ pound ground pork",
            "2 tablespoons minced green onion",
            "2 tablespoons minced fresh oregano",
            "1 tablespoon minced fresh flat-leaf parsley",
            "1 clove garlic, minced",
            "2 dashes Worcestershire sauce, or to taste",
            "salt and ground black pepper to taste",
            "3 ½ ounces fresh white bread crumbs",
            "2 tablespoons extra-virgin olive oil",
            "3 ½ ounces pancetta, chopped",
            "3 tablespoons minced onion",
            "1 clove garlic, minced",
            "2 tablespoons minced carrot",
            "2 tablespoons minced celery",
            "2 tablespoons minced red bell pepper",
            "1 ½ teaspoons dried basil",
            "1 ½ teaspoons dried oregano",
            "¼ teaspoon ground coriander",
            "2 grinds ground black pepper",
            "1 cup white wine",
            "2 tablespoons tomato puree",
            "1 (28 ounce) can Italian plum tomatoes, chopped",
            "2 tablespoons extra-virgin olive oil, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix ground beef, ground pork, green onion, oregano, parsley, garlic, Worcestershire sauce, salt, and black pepper together in a bowl. Slowly add and mix breadcrumbs into meat mixture to desired consistency. Form mixture into balls, roll them in remaining bread crumbs to coat, and arrange onto a shallow tray. Cover meatballs with plastic wrap and refrigerate at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons olive oil in a large pot over medium heat. Cook and stir pancetta in the hot oil until browned, about 4 minutes. Add onion and garlic to the pancetta; continue to cook and stir until fragrant, about 1 minute. Stir carrot, celery, and red bell pepper into the pancetta mixture; cook until the carrot softens slightly, about 3 minutes. Sprinkle basil, oregano, coriander, and black pepper over pancetta mixture; stir to season evenly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour wine over the pancetta mixture. Increase heat to medium-high and cook until the liquid reduces by about half.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Quickly stir tomato puree into pancetta mixture; add chopped tomatoes. Cook and stir the mixture until the tomatoes begin to break down into a sauce, about 5 minutes. Reduce heat to low and simmer until the sauce thickens, 60 to 90 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons oil in a large skillet over low heat. Cook and stir meatballs in batches in hot oil until evenly browned and cooked through, 5 to 7 minutes; drain on a plate lined with paper towel.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently drop meatballs into the simmering sauce; cook together until meatballs are heated through, about 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Meatball Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5,
            "ratingCount": 10,
            "itemReviewed": "Spanish Style Albondigas in a Sunny Mediterranean Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "615.1 calories",
            "carbohydrateContent": "26.4 g",
            "cholesterolContent": "86.9 mg",
            "fatContent": "40.1 g",
            "fiberContent": "3.8 g",
            "proteinContent": "26.4 g",
            "saturatedFatContent": "11.3 g",
            "servingSize": null,
            "sodiumContent": "760.1 mg",
            "sugarContent": "7.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-01-07T15:28:20.643Z",
                "reviewBody": "I've had Spanish meatballs before and really liked them so I was anxious to try these. I considered a prior reviewer's comment that they were a bit salty so I decided to leave out the added salt entirely.  Rather than frying the meatballs in batches, I simply baked them at 400 degrees for 20 minutes. Finally, I just dropped the meatballs into the sauce and simmered everything together for 45 minutes.  This was excellent.  I would suggest cutting the amount of pancetta in half, however, because it was still a little salty; the only thing that marred an otherwise tasty treat. We served this with Awesome Rice Pilaf and Swiss Chard Sauteed with Lime, both recipes from this site as well. The combination of the three made for a memorable meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Spunky Buddy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6878166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-14T22:27:46.27Z",
                "reviewBody": "This is an excellent recipe!  Tried it yesterday and followed it completely ... except ... I had no white wine so I used red wine.   The only reason I did not give it a 5 star was it was too salty ... it's a keeper and next time I will cut the salt down a bit.  Having said that ... would it have been different with white wine?   Thanx Don for the recipe ...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Summerpls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/summerpls/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-19T23:47:44.143Z",
                "reviewBody": "I made this when it was still a personal recipe; Here is my review:.....Reviewed on Jun. 9 2012by misty This tasted wonderful and was enjoyed by all. Leftovers were equally as good! I followed recipe as stated; except using fresh garden tomatoes. I think the idea of chilling the meatballs was great seemed hold them together better; I would have never thought to do that. Thanks for sharing Don. Another winner in my book!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "misty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8483516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-30T00:52:22.05Z",
                "reviewBody": "Based on other's comments I checked the sodium content of the pancetta at the store before purchasing and there was 6 times more sodium per serving compared to low-sodium bacon (which still has plenty salt)! Sorry but I substituted bacon for pancetta. That substitution didn't really figure into my rating. The dish was good; though I think I put high expectations on the dish with the exotic name and all the ingredients. I have made other red sauces before and this sauce didn t really seem all that different. The meatballs were denser that what I m used to and I really didn t taste the fresh oregano or Worcestershire. The wine in the sauce certainly made it sharp. I encourage people to try this recipe but for me it was too much fuss and the overall flavor seemed more Italian to me than Spanish or Mediterranean.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Scott M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2754713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-26T02:03:24.363Z",
                "reviewBody": "I served the sauce on frozen meatballs and that wasn't the best idea. But the sauce wasn't very flavorful and too chunky to coat the meatballs. Instead of simmering stovetop I put in the crock put for several hours. Disappointing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "HTurn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13223533/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-03-09T12:51:45.257Z",
                "reviewBody": "This is a cool new European twist on the Mexican albondigas soup I love and I'm familiar with and I had to try it. Mexican albondigas soup has rice in the meatballs potatoes cilantro and mint instead of parsley no Worcestershire no celery and nothing is \"minced\" it's all very chunky.... at least in my experience. And a healthy dose of heat. When I saw this recipe randomly it seemed so weird I had to try it. I followed the recipe mostly added more garlic used bacon because pancettas hard to come by. It was very interesting. It's definitely nothing like the Mexican version but it's very good. This should get its own name it's very distinct. If I make it again I might try some olives in the soup and I think the aromatic herbs like thyme and mint are missing. I would also still add more garlic like I did this time. Thanks for sharing:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katy Wilkerson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21233532/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-10-26T06:01:04.527Z",
                "reviewBody": "My boyfriend is from Ecuador and loves homemade Spanish food. He really liked this recipe. The only suggestion I can add is that if you use dried oregano cut the amount at least in half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ssanta618",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8999971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-26T19:53:34.68Z",
                "reviewBody": "I just made this recipe and was good to do something new. Really good tasting tomato sauce only a few things I changed. Added some smoked paprika for a bit of colour to the meatballs and another flavour. The other thing I normally do but forgot as followed the rest of the recipe to a tee is add the olive oil when you mix the meat mixture initially not in the pan. This way the meatballs stay really moist. Done in the pan they can dry out much more easily. Would do again for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "souther",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14396409/"
                }
            }
        ]
    }
]