[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/446/main-dish/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1469/main-dish/beef/pot-roast/",
                    "name": "Pot Roast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229957/slow-cooker-au-jus-pot-roast/",
        "name": "Slow Cooker Au Jus Pot Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6864107.jpg",
            "width": 3468,
            "height": 3468
        },
        "datePublished": "2019-04-02T06:59:19.000Z",
        "description": "I've never found a recipe I really liked for a savory, au jus-style pot roast without mushy veggies and a weird sweetness. So after some experimenting, this is the way I make it every time now. The tomato sauce disappears and will not make a tomato-flavored gravy. Quick and easy. The roast size and cut can vary, and it will still turn out great. Good for those who don't like onions, although they can be added if you like. I love to make homemade mashed potatoes and dill carrot slices for sides. Cook roast on top of sliced onion rings if desired.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT8H20M",
        "totalTime": "P0DT8H35M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (4 pound) boneless beef chuck roast",
            "1 tablespoon Worcestershire sauce, or to taste",
            "1 tablespoon Montreal-style steak seasoning",
            "2 tablespoons olive oil",
            "1 cube beef bouillon",
            "1 cup hot strong black coffee",
            "1 (8 ounce) can tomato sauce",
            "1 teaspoon dried oregano, or to taste",
            "2 teaspoons Worcestershire sauce, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rub chuck roast with 1 tablespoon Worcestershire sauce and sprinkle on all sides with steak seasoning.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large skillet over medium-high heat. Sear the roast in the hot oil until browned, about 5 minutes per side. Transfer roast to a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve beef bouillon cube in the coffee and pour the mixture over the roast. Pour tomato sauce over meat and season with oregano; drizzle meat with 2 teaspoons Worcestershire sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set cooker to Low and cook until meat is tender, 8 to 10 hours.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Beef",
            "Pot Roast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "crancherry"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.708333333333333,
            "ratingCount": 120,
            "itemReviewed": "Slow Cooker Au Jus Pot Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "385.6 calories",
            "carbohydrateContent": "2.8 g",
            "cholesterolContent": "103.4 mg",
            "fatContent": "29 g",
            "fiberContent": "0.5 g",
            "proteinContent": "26.9 g",
            "saturatedFatContent": "10.7 g",
            "servingSize": null,
            "sodiumContent": "697.8 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-11-20T03:58:32.94Z",
                "reviewBody": "Given the broad and varied array of ingredients I expected something different, unusual.  Would I taste the coffee?  Would it be tomato-y? Would it instead have its own unique flavor?  I probably don’t need to mention that the aroma of this roast filled the kitchen all day, and it was wonderful.  As I was eating this, I completely forgot that I was on the look-out for something unusual, noticing instead that what I was eating was a good old tender pot roast (I used a rump roast which I dredged in flour before browning) with a rich, beefy “jus.”  No one ingredient stood out and in my mind that’s a good thing. So there was nothing particularly different or unusual about this, but I was not disappointed. It was just plain hearty and good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-07T19:19:57.4Z",
                "reviewBody": "Interesting twist if you are out of other \"staples\" for making crockpot roast. I also like the fact you can control the amount of sodium (unlike the recipes that use dry seasoning packets such as onion soup mix,etc).  It's pretty hard to mess up a slow cooker roast, and this recipe resulted in a tasty, tender dinner. I always add onions at the beginning, and add carrots and potatos midway through cook time.\n\nI would like to give the one star reviewer zero stars for mis-using this forum as a grammar/spelling review.  If you haven't tried the recipe, you have no bizznus writing reviews...of anything!  The last time I checked, most grade schools are looking for volunteers, so perhaps that is a better use of your skills and talent :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Severson1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3824213/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-13T05:27:27.813Z",
                "reviewBody": "I made this for company.  I doubled the amount of coffee, a mistake, but was OK because we like lots of gravy.  I thickened the sauce with cornstarch.  I love Montreal Steak seasoning and it's a staple in my house.  I will be making this many times over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Wrzesinski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857337/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-14T01:24:10.987Z",
                "reviewBody": "This is really very, very good.  I followed the recipe exactly, only I did slice an onion and minced a clove of garlic and put them in the crock pot under the roast.  Other than that I followed the recipe as written.  Well, I should say I didn't measure the spices or the Worcestershire sauce...I just eyeballed what looked good to me.  Next time I may thicken the gravy, but this time I just ladled a big ol' spoonful over my portion...so moist, so tender and so tasty!  5 stars and a tip of my hat to you, crancherry :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Puck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1310315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-12T01:09:46.017Z",
                "reviewBody": "I haven't tried this yet, but I will soon...looks delicious!\nRE: the one star vote. I read the directions and yes, there is a \"typo\". Not too many of those on this website. I think most of the cooks that enjoy All Recipes will be able to make this dish without a problem.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Koye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2505709/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-24T01:21:38.727Z",
                "reviewBody": "I will try anything and needed a new pot roast idea. This sounded good. Followed the recipe to the letter. It was just ok. I had made some nice Czech style dumplings to go with the au jus. A waste of the dumplings. The roast looked and smelled great while searing... But my family was unimpressed as was I. Something was missing in the flavor and I am at a loss as to what.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Lmoucha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10777806/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-30T01:36:21.72Z",
                "reviewBody": "Do not let the odd combination of ingredients scare you away from this recipe. I made this for the family tonight, and followed it exactly (although I did add 1/2 an onion and 3 whole cloves of garlic to the slow cooker below the roast).  It was delicious!  Nobody could guess the secret ingredient (coffee), and there was no trace of tomato either. After the slow cooking process you are left with a rich, beefy jus, and tender fall apart roast.   I also boiled some of the jus along with cornstarch to thicken, and served it on the meat an homemade mashed potatoes. I'm even saving the leftover gravy to liven up some chicken tomorrow.   I'll be making this again for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steffyp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2733596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-22T06:58:28.83Z",
                "reviewBody": "Fantastic! The only thing I did differently was that I used some frozen pulverized tomatoes that I have from my garden (I am trying to use them up and didn't have a can of tomato sauce.) It worked out fine, but I would use the tomato sauce if I had it available next time. The meat was sooooo delicious, I kid you not. I will go to this recipe the next time I am making a pot roast...which will be soon, I'm sure, because everyone loved this one! Note: I did not need to cook it for 8 hours, because it was done way earlier than that.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thegrape",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1515405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-01T00:56:30.46Z",
                "reviewBody": "Quick, easy, delish!  I prefer the Roast Beef and Gravy from this site, but hubs DEVOURED and RAVED about this, so it gets a 5.  We served on toast hot beef style to soak up the nice sauce.  No, you dont taste the coffee and it's not too tomatoey either.  Made this exactly as written, although I usually don't brown meat that I'm putting in a crockpot.  I just think it's a wasted step and adds cleanup.  I recommend this recipe especially if you are a newbie to cooking or using a crockpot.  This will turn out fine without much fuss.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8580335/"
                }
            }
        ]
    }
]