[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/847/desserts/cookies/fruit-cookies/",
                    "name": "Fruit Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13356/desserts/cookies/fruit-cookies/date/",
                    "name": "Date",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230870/coconut-date-bars/",
        "name": "Coconut Date Bars",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5560798.jpg",
            "width": 3055,
            "height": 2669
        },
        "datePublished": "2019-04-02T06:59:57.000Z",
        "description": "The on-the-go, travel-light snack bar. Derived from a famous raw food bar and the ultimate in 'foodie!' This is a great snack for the active lifestyle and impressive to hand out to others.  As an outdoor professional I take these in the back country and they need not be refrigerated and give great energy. Cut into bars and enjoy or wrap individually for on the go.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT0H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "⅓ cup slivered almonds",
            "½ cup flaked coconut",
            "10 pitted dates, or to taste",
            "¼ cup cashews, or to taste",
            "1 teaspoon coconut oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Blend almonds and coconut in a food processor; add dates and pulse until combined. Add cashews and coconut oil; pulse until mixture is thick and sticks together. Transfer to a sheet of waxed paper; form into a square, folding sides of waxed paper over the top. Refrigerate until solid, at least 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Fruit Cookie Recipes",
            "Date"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lacy Wilson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.647058823529412,
            "ratingCount": 68,
            "itemReviewed": "Coconut Date Bars",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "249 calories",
            "carbohydrateContent": "22.9 g",
            "cholesterolContent": null,
            "fatContent": "17.3 g",
            "fiberContent": "4.7 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "8.8 g",
            "servingSize": null,
            "sodiumContent": "60.5 mg",
            "sugarContent": "14.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-02-16T02:20:08.1Z",
                "reviewBody": "These were very easy to make and they taste delicious. They are also very versatile so you won't get tired of the same flavor over and over again. They remind me of Larabars. I will use their flavors as ideas to make my own versions at home. I used raw whole almonds and pecans instead of cashews. I did add the coconut oil because it's good for you, but it doesn't need it hold together. The oil from the nuts is more than enough. Also, the dates make it sticky. The key here is to let the food processor go on(times will vary depending on the power of your processor) until the ingredients come together and form a ball. If you don't process the ingredients long enough, your mix might not stick together. Next time, I will skip the coconut oil because it made it a bit too greasy for me. Also, I might add unsweetened dried cherries or other fruits. Update: DO NOT add the oil. Even without the oil, the bars are oily/sticky enough. I made them again but folded in some dark chocolate mini chips and some chopped pecans to give it texture. Wow! Excellent. I'll add in some chopped almonds and some chopped dried cranberries or cherries next. Another idea would be dried apples and cinnamon...with or without raisins... Macadamias and white chocolate (though white chocolate isn't healthy, just add a bit)... Dried pineapples and mangoes... The possibilities are endless!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-25T02:50:52.707Z",
                "reviewBody": "I made 4 double patches today different combos of extras they are all great! You do need to pulse and/or run the food processor at least 2 or more minutes to get to the ball state. I used a combo of Medjool and Deglet Noor dates since the medjools are more expensive but as another reviewer pointed out are more moist and sticky. I combined the coconut (half unsweetened) whole almonds and dates in the processor then mixed in the extras by hand literally. I too left out the oil although did coat my hands with it to press the dough. I made Almond with Choc Chip with sliced almonds and mini chips Cashew Cranberry and Chia and Pecan Cherry. Having the chunks of the fruit and nuts mixes up the texture a bit. To form bars I lined a loaf tin with plastic wrap and then pressed in the dough turned it out and then cut into pieces without refrigerating first. Put into plastic bags to make a quick grab and go snack. A double batch made 10 squares about 1/2 to 3/4 in thick. Will be making these for a long time to come!! Perfect gluten free snack! With more time I'd like to try some additional flavorings like spices or peels.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dryheat3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8410640/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-02T18:08:31.81Z",
                "reviewBody": "Very tasty. Without a photo by lacy the recipe submitter and limited guidance ( pulse until mixture is thick and sticks together ) it s hard to know how fine or coarse a texture she intended these bars to have. In preparing this review a photo by lacy was found in her member photo gallery which gives a good representation as to size if recipe is followed. Making the recipe exactly as written and after processing the ingredients the uncut square was no larger than half the size of the square shown in a 2/21/13 photo by LatinaCook. Given this 4 servings recipe the unprocessed nuts and coconut equal about 1 cup for 4 servings and after processing about 1/8 cup of processed mixture 2-1/2 dates per serving. For those with a Vitamix blender the combined ingredients do not form enough mixture to work with as it sticks to the side of the blender barely above the blade and the tamper tool can t reach it. Next time making these I ll at least double the recipe as that would probably provide a sufficient amount of mixture to process with a Vitamix or to justify the time involved in cleaning the food processor. I ll also eliminate the coconut oil as the nuts and oil deliver a lot of fat for a relatively small sized bar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ConkyJoe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6974221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-11T00:25:46.867Z",
                "reviewBody": "I made these twice and they are very crumbly.  They don't look as pictured.  I tried microwaving the dates, and adding more dates to soften the bars.  They taste delicious, but I'm using it as a topping instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "gilR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3231893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-08T18:12:57.36Z",
                "reviewBody": "I make a similar recipe using choc. chips instead of coconut to give it a little sweetness - the end result tastes just like cookie dough! Delicious and healthy snack when you re on the run.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Indra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7664373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-23T20:01:26.137Z",
                "reviewBody": "We made two batches. The first batch we made with half dates half figs. We did this because we felt our dates were 'dry'. This batch was very moist and we liked the flavor but we felt like we might have processed them too much as there was very little texture. The second batch was so much better. We used only the dates and added dried cranberries and eliminated the oil like someone suggested - and we eliminated the cashews. We waited and added the cranberries and almonds last- and barely processed them- this made the bar more pleasing to the eye ( seeing the chunks of nuts and berries). The second batch was perfect and we are currently planning our next variations choosing different dried fruits and nut combinations. LOVE this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beverly Pauley Ondera",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2852519/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-22T21:43:40.487Z",
                "reviewBody": "These are GREAT! So addictive and a great substitute for expensive energy bars. I didn't add the coconut oil but I did throw a few chocolate chips in and they turned out wonderfully! I used a small food processor (it holds like two cups) and pulsed and ground the heck out of it until it was starting to stick together and ball up in the processor. Be patient it took at least 60 two-second spins. Maybe the people having trouble with the recipe are using different dates? I used boxed unpitted medjool dates which are pretty sticky. I also spread the mixture between two pieces of parchment paper and really pressed it together. I'm off to make a second batch with some different nuts! Thanks for the keeper Lacy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SQUIDGIRLIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1078905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-21T00:11:05.673Z",
                "reviewBody": "I added dried cranberries flax and chia walnuts and sunflower kernels. Kind of threw together what I had. My husband needed them for a school survival trip. His classmates raved!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6385266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-29T23:02:26.577Z",
                "reviewBody": "My dates were dry so I heated them up with a bit of water in a pot on the stove before blending them in. Nutritious and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Acissejya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15032839/"
                }
            }
        ]
    }
]