[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1785/soups-stews-and-chili/stews/irish-stew/",
                    "name": "Irish Stew Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231968/ultimate-guinness-beef-stew/",
        "name": "Ultimate Guinness&reg; Beef Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1964736.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2019-04-02T07:00:40.000Z",
        "description": "This is an Irish beef stew made with Guinness&reg;. This stew is very hearty and begs for a good sopping bread.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H25M",
        "totalTime": "P0DT3H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "3 bay leaves",
            "¼ cup all-purpose flour, or as needed",
            "2 pounds <a href=\"https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/\" aria-label=\"beef stew\">beef stew</a> meat, cut into 1 1/2-inch cubes",
            "2 yellow onions, quartered",
            "2 cloves garlic, minced",
            "1 teaspoon dried thyme",
            "1 teaspoon dried rosemary leaves",
            "2 tablespoons all-purpose flour",
            "1 (15 ounce) can Irish stout beer (such as Guinness®)",
            "1 cup beef stock",
            "2 large potatoes, cut into 1 1/2- inch cubes",
            "½ pound carrots, peeled and thickly sliced",
            "2 tablespoons chopped parsley",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 275 degrees F (135 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil and bay leaves in a 6-quart oven-proof pot over high heat. Place 1/4 cup flour in a shallow bowl, press beef cubes into flour, and sear beef in the hot oil until the meat has a browned crust, about 3 minutes per side. Cook and stir onions with beef until onions are translucent, 5 more minutes. Reduce heat to low.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine garlic, thyme, and rosemary leaves with 2 tablespoons flour in a small bowl; stir flour mixture into beef and onions until thoroughly combined. Pour beer and beef stock into mixture, stir to combine, and bring to a simmer. Cook, stirring often, until thickened, about 5 minutes. Mix potatoes, carrots, and parsley into beef and sauce; cover pot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Braise stew in the preheated oven until potatoes are cooked through and beef is tender, about 3 hours; stir occasionally. Season with salt and black pepper.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Irish Stew Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "dad2twins"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.314285714285714,
            "ratingCount": 35,
            "itemReviewed": "Ultimate Guinness&reg; Beef Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "415.2 calories",
            "carbohydrateContent": "39.4 g",
            "cholesterolContent": "79.8 mg",
            "fatContent": "13.7 g",
            "fiberContent": "5.6 g",
            "proteinContent": "33 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "113.7 mg",
            "sugarContent": "6.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-02-08T12:59:46.097Z",
                "reviewBody": "Wow loved this recipe.  The house smelled great while this was cooking.  Only change I made was add some mushrooms because we loved them.  Also before I had heated the oil and bay leaves I had prepped the meat, onions and mushrooms ahead of time this to prevent the burning of the bay leave as per one reviewer had mentioned.  Then as they were frying prepped the tatters and carrots.  Will be making again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nadine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5049040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-19T01:57:29.82Z",
                "reviewBody": "Recipe Group Selection: 17 January 2015 This review is based on only my DH opinion. I made this with venison rather than beef that was my only change. He loved this dish! He loved the texture the venison the veggies and the broth and he does NOT like Guinness beer! He said the combination of the ingredients worked really well together. I purchased 1 can of Guinness for this recipe. I freaked out when I poured the Guinness in the pan. There was something in the can that moved. I got a flashlight to see what it was. It was a milky white ball. I told my hubby I thought it was an eyeball. He assured me it wasn't but he took the can apart to be sure. LOL Never having purchased a can of Guinness I wasn't aware that there is a ball of nitrous. It helps create the foamy frothiness when you pour out the beer. All that being said hubby loved his dinner and told me to \"feel free to make this one again!\" Thanks dad2twins for sharing your recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-03T14:08:23.81Z",
                "reviewBody": "made for recipe group 1/21/15: First of all the flavor was really good and it was easy to prepare so I would make it again. However the bay leaf burned in the pan before I could add the beef. I removed it and added another when moving to the oven. My only change was to use leftover medium rare beef with a little extra broth to compensate for juices that fresh might have contributed. I halved the recipe so used a 3qt pot and after 2 hours the carrots were perfect the potatoes were just done and the onions all but disappeared. It came out of the oven with no liquid. There was a light coating on the chunks but I could have easily ate this from a plate with a fork. Since the description says to have some sopping bread handy this was not the texture I expected. It tasted great but I then I added another 1.5 cups broth to get to what's in my photo. I would make it again but with more liquid from the start(both beer and broth so as not to change the flavor ratio).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "linda2d",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3733363/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-22T11:07:55.063Z",
                "reviewBody": "Recipe Group: here's how I really feel! Guinness=Magic. This is the epitome of beef stew which is incidentally torture to make because your house will smell divine and you can't eat the source for three hours. This recipe cannot be improved in any way. Thank you thank you thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ONIOND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1013798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-19T19:54:48.17Z",
                "reviewBody": "Made for Recipe Group. A good basic beef stew with bonus-Beer! Gives it a good flavor. I like that it preps on stovetop then goes into the oven. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sassyoldlady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3571626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-20T02:33:39.157Z",
                "reviewBody": "Recipe Group. Pros...no tomato products or canned or packaged soups. Easily cooked in the oven with no chance of burning in my overly hot slow cooker. Meat and veg perfectly done in 3 hrs. Cons....very bitter &/or sour taste. No beef flavor. I added a TBS sugar about 2.5 hrs which improved it considerably. The only tweak I made was to omit the potatoes. I served this over green beans. 4 stars from DH 2 from me so 3 over all. Guess I'm just not a Guinness fan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Connie-O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/566099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-19T14:56:54.737Z",
                "reviewBody": "Recipe group 1/17/2015: I love the flavor the beer imparts to this. The veggies and herbs this calls for are just right. I will make again. Not sure what I will do with 3 more bottles of Guinness I I bet I think of something!:-D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lilcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3549535/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-15T01:59:22.283Z",
                "reviewBody": "3-10-2016 What interested me to try this recipe was because in all the decades I ve made beef stew I ve never made it with beer. The rest of the ingredients are nearly identical to how I typically make stew so aside from making some minor modifications the difference was pretty much just the beer. First I prepared it all on the stove only because that s my comfort zone. (Simmer beef for about 1-1/2 hours before adding the vegetables this needs no more but no less cooking time. Simmer another half hour or so once you add the vegetables. Thicken as necessary at the end with a flour slurry) In addition to the potatoes and carrots I added cabbage chunky slices of celery and sliced mushrooms - because I always do - because it tastes good. The stew was very good. But it surprisingly tasted no different with the new ingredient beer. Now of course I don t expect the stew to taste like beer. What I am saying however is that since neither I nor Hubs detected any difference between this stew made with beer and the stew I typically make without it I say keep it in the ingredients list but drink it while you re making the stew.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-09T21:18:48.9Z",
                "reviewBody": "Overall this was pretty yummy. I had to make a few small changes... I added a little more garlic than the recipe called for because we are garlic lovers in this house. Also I did add the bay leaves to the oil even though I was suspicious. Unfortunately as I feared they burnt to a crisp in no time at all. So I added some into the dish before it went into the oven so that the bay flavor could really get into there. And finally I didn't add the fresh parsley until I pulled it out of the oven because if you add it too early all the freshness and brightness will cook right out of it. The sauce was pretty yummy even though I think there was a touch too much flour in it... didn't stop me from sopping it up with my bread! Might make again with a few tweaks next time. Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christie Biggers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/807903/"
                }
            }
        ]
    }
]