[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/152/breakfast-and-brunch/potatoes/",
                    "name": "Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24532/sausage-casserole/",
        "name": "Sausage Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4501563.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2019-04-02T06:42:41.000Z",
        "description": "Mouth watering, bowl scraping good! This recipe also makes a great dinner entree!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound sage flavored breakfast sausage",
            "3 cups shredded potatoes, drained and pressed",
            "¼ cup butter, melted",
            "12 ounces mild Cheddar cheese, shredded",
            "½ cup onion, shredded",
            "1 (16 ounce) container small curd cottage cheese",
            "6 jumbo eggs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13 inch square baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the prepared baking dish, stir together the shredded potatoes and butter. Line the bottom and sides of the baking dish with the mixture. In a bowl, mix the sausage, Cheddar cheese, onion, cottage cheese, and eggs. Pour over the potato mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 1 hour in the preheated oven, or until a toothpick inserted into center of the casserole comes out clean. Let cool for 5 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "WILLIAM ROSSBACH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.694996028594122,
            "ratingCount": 1259,
            "itemReviewed": "Sausage Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "355.5 calories",
            "carbohydrateContent": "7.9 g",
            "cholesterolContent": "188.1 mg",
            "fatContent": "26.3 g",
            "fiberContent": "0.5 g",
            "proteinContent": "21.6 g",
            "saturatedFatContent": "13.3 g",
            "servingSize": null,
            "sodiumContent": "754.7 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-11T15:38:34.657Z",
                "reviewBody": "I've made this twice already and it is delicious. The first time I made it, I did the following: I followed the advice of a few other reviewers and used 8 eggs instead of 6, and cooked the onion with the sausage. I also tossed in some diced green peppers and onions with the potatoes that I shredded, and I baked the crust separately. The second time I made it, I used frozen hash browns instead of shredding my own potatoes. I just tossed the frozen hash browns with diced peppers, onions, and melted butter, and baked at 375 for about 30 minutes. The frozen hash browns hold up much better than using grated potato hash browns, probably because frozen hash browns are thicker. The fresh grated hash browns were by no means bad, but the frozen hash browns had better taste and texture. Also, the second time I used ricotta cheese, and I gotta say, I liked the cottage cheese better. Again, the ricotta was not bad, but the casserole made with ricotta came out kind of spongy, if you will. The casserole made with the cottage cheese was more moist and, in my opinion, more flavorful. The cheese flavor of the ricotta was more subtle than the cottage cheese, and again, the ricotta gave the casserole a spongy (almost dry) texture.\nI also agree with the reviewer who used 4 cups of hash browns instead of 3. HOMEMADE SAUSAGE: 1LB GROUND BEEF, 2t GROUND GINGER, 2t GROUND SAGE, 3/4t SALT, 1/2t BLACK PEPPER, PINCH CAYENNE PEPPER.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DivineHealth7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1478626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-11T20:03:10.8Z",
                "reviewBody": "I still have yet to figure out why people change the recipe and then give it a bad review. Follow this recipe and it tastes great. I've tried a couple of the breakfast/sausage casseroles on here and this is by far the best one. I made it for Easter and everyone loved it. I think everyone had at least 2 (some had 3) pieces.  I will be making this again VERY soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Micah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2163064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-25T17:08:57.513Z",
                "reviewBody": "This was perfect for Christmas breakfast.  I pre-cooked the potatoe shell in the oven the night before at 350 degrees and refrigerated it until the next morning.  I also mixed all ingredients the night before so that all I had to do was pour into crust and bake.  Very simple.  Hubby enjoyed this casserole better than the bread ones.  I did add some red and yellow peppers for color.  Everyone enjoyed this.  Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GYMNASTMOM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1307469/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-10T17:30:15.937Z",
                "reviewBody": "YUM!!!  I needed to use up some things from the freezer, and this was SO good.  I made the following changes:\n\n-Used frozen shredded O'brien potatoes (with chopped onions and bell peppers)\n-Browned the butter in the 9x13 (just put it in the pan, stuck in the oven to melt, and waited till it was brown) and then threw potatoes in, stirred and pressed in the bottom\n-Baked potato layer for 30 min., then added egg layer and baked another 30\n-used leftover sliced corned beef instead of sausage\n-added chopped mushroom to egg mixture\n\nMy dd tasted it and said \"YUM!  You're making this EVERY Sunday!!!\"  She's pretty reserved, so this was huge.\n\nI plan to make this for Christmas morning.  I will probably use regular breakfast sausage, and add green onions and black pepper.  I think I would also let the potato layer cook a little longer before adding the eggs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HIS_KID",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/his_kid/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-30T19:21:46.89Z",
                "reviewBody": "The onion was crunchy and undercooked which distracted from the overall quality of this. Next time I'll saute the onion with the sausage to ensure it is cooked and limp prior to baking. I followed other reviewers suggestions: used refrigerated shredded potatoes (\"Simply Potatoes\" brand) used sharp cheddar substituted ricotta for the cottage cheese added a 4 oz. can of chopped green chiles used 8 eggs instead of 6 and baked it at 350 deg. It was delicious and flavorful. Each of my guests went back for seconds. One guest kept adding black pepper to his portions so next time I'll probably add some to the mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-05T18:02:25.153Z",
                "reviewBody": "Very tasty recipe. I didn't give it four stars because I think it could use some minor modifications. I would use slightly more potatoes (about four cups). I'd also suggest using cream cheese instead of cottage cheese for more flavor and saute the onions along with the sausage. But even without the changes it was a very tasty and easy to make recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LaurieJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2153490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-05T19:24:49.073Z",
                "reviewBody": "I really liked this dish. Didn't change a thing except I used sharp cheddar. Took others advice and baked the hashbrown layer by itself first. Next time I will be sure to bake on bottom rack of oven for better browning of hashbrowns. A keeper thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Woodstock42",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2052820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-07T14:51:26.327Z",
                "reviewBody": "This is fantastic and perfect for breakfast or brunch! My Sunday school class devours it it is a huge hit with the men. I did modify a few things: Add 1 4oz. can of diced green chiles & a small jar of diced pimientos for color. Use frozen hash browns-defrost & press moisture out. I also lightened it a bit by using light butter & 4 whole jumbo eggs & 4 jumbo egg whites. This is a definite keeper!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-18T22:47:43.623Z",
                "reviewBody": "I made this for my MOPS (mothers of preschoolers) meeting this week & there was none left. I did make some changes. They are as follows: I used regular breakfast sausage a 16 ounce package of O'Brien potatoes (with onions & peppers) I omitted the onion used an 8 ounce bag of sharp cheddar (2 cups) & used ricotta instead of cottage cheese. It turned out perfect. I even made it the night before & baked it the next morning. This would be great to make Christmas Eve for Christmas morning brunch. Great recipe. Thanks Bill!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/386866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-18T15:54:48.920Z",
                "reviewBody": "I keep coming back to this recipe, and every time I rate it, I lower it a star.  I think that this is a decent recipe, but it is very, very bland and really lacking any WOW.  If you are serving to small children or to the elderly it might be passable.  It is fine for getting rid of some leftovers, but as the recipe currently is, I would not serve this to guests as is.  It requires many changes and by the time the changes are made, it is a new recipe, not at all the same as the recipe here.   When I made this recipe the first time, following the recipe exactly, I felt it was bland, it lacked any flavor and definitely needed major modifications.  I added the onion and some green pepper to the sausage and cooked them together.  I ended up adding a can of well- drained diced tomatoes to the sausage as well.  I only had large eggs, not jumbo, so I used nine large eggs.  I added a bit of onion powder and a clove of crushed garlic to the egg mixture, as well as a bit of black pepper.  I felt it needed a bit of extra flavor.  I also used sharp cheddar cheese ... shredded myself, never from the package.   I used half of the cottage cheese the recipe stated, combining the other half with sour cream.  I used store bought shredded potatoes, but added some salt and pepper to the potatoes as well.  I assembled the entire casserole the night before and baked in the morning.  It takes longer to bake than the recipe calls for.  In my convection oven it took about 1 hour and 20 minutes.  Even ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "aivilo elleon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2165473/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Sausage Casserole",
            "description": "See how to make a top-rated breakfast casserole.",
            "uploadDate": "2012-07-10T16:41:22.369Z",
            "duration": "PT3M10.774000000000001S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff81abc2e-9174-4831-9e6b-f0943a347f0f%2F4d6067d9-f808-4408-b9e1-0e3a59022eaa%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1728958697001"
        }
    }
]