[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/674/main-dish/pork/pork-chops/",
                    "name": "Pork Chop Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24558/pork-chops-to-live-for/",
        "name": "Pork Chops to Live For",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F669344.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:42:42.000Z",
        "description": "My mom used to make this all the time and it has always been one of my favorites. The best part is you can mix it up in a few minutes in the morning and forget about it for the rest of the day. You may add an additional can of soup if you want more gravy.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H15M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons shortening",
            "4 pork chops",
            "1 egg, beaten",
            "½ cup all-purpose flour",
            "1 large onion, sliced",
            "2 (10.75 ounce) cans  condensed cream of mushroom soup",
            "2 cups milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt shortening in a large skillet over medium-high heat. Dip pork chops in beaten egg, then dredge in flour.  Cook in hot skillet, turning once to brown both sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pork chops into a slow cooker, and arrange sliced onions over meat. Pour  soup and milk over the meat and onions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on High for 4 to 5 hours, or on Low for 8 to 10 hours.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pork Chop Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jennifer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.268987341772152,
            "ratingCount": 632,
            "itemReviewed": "Pork Chops to Live For",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "493.8 calories",
            "carbohydrateContent": "31.6 g",
            "cholesterolContent": "121.2 mg",
            "fatContent": "24.7 g",
            "fiberContent": "0.9 g",
            "proteinContent": "35.1 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "1181.7 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-10T15:53:46.937Z",
                "reviewBody": "I changed some things too. I have a 7 qt. slow cooker, and I wanted to make 5 pork chops. I didn't use any eggs or milk. I simply mixed flour, garlic powder, salt and peper together and just floured the porkchops with that mixture, no eggs. Then I browned them in the shortening. While they were browning, I dumped 2 cans of cream of mushroom soup, 1 can of cream of chicken, 1 can of beef broth,  1 envelope of onion soup mix, and two 4 oz. cans of mushrooms in the slow cooker, and mixed it all up. After the porkchops were done browning (about 4 min. on each side), I added them to the slow cooker and covered them with the soup mixture, and let them cook for 5 hours on high. They were so tender and the taste was out of this world, the aroma filled the house. There were no extra spices needed. I served them with mashed potatos and corn. My kids loved them! I will definately make this again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIANE73162",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/628416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-27T18:18:23.82Z",
                "reviewBody": "Good as is. I can't get over the way you all just change the recipe completely and then rate it!!!! Why don't you just post your own recipe? I love the recipes on this site but that is one thing that bothers me! I call it \"recipe bashing!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Roseann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2516855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-11T00:40:48.367Z",
                "reviewBody": "We LOVE this dish, I have made it many times. Before I started I read over all the reviews and this is what I can up with after all the suggestions. \r\nOmit the egg and flour process, just lightly brown pork chops in pan (I use pork tenderlion, sliced thin) Then slice 1 onion, 1red bell pepper and 1 pkg mushrooms, chop 4 cloves garlic and saute all of it in pan with little olive oil. Season with salt, pepper, season all, and little sage. Use 1 can cream mushroom and 1 can cream chicken, with the 2 cups milk. Serve over rice. Turns out perfect and my family loves the gravy over the rice. In fact I am making this tonight!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAUREN908",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/498256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-08T19:14:47.43Z",
                "reviewBody": "My husband and I love this recipe! I have made this quite a few times and always make it the way one of the other reviewers suggested:\n\"I didn't use any eggs or milk. I simply mixed flour, garlic powder, salt and peper together and just floured the porkchops with that mixture, no eggs. Then I browned them in the shortening. While they were browning, I dumped 2 cans of cream of mushroom soup, 1 can of cream of chicken, 1 can of beef broth, 1 envelope of onion soup mix, and two 4 oz. cans of mushrooms in the slow cooker, and mixed it all up. After the porkchops were done browning (about 4 min. on each side), I added them to the slow cooker and covered them with the soup mixture, and let them cook for 5 hours on high.\"\nI also made mine with potatoes. Just scrub, cube, and toss them into your crockpot along with everything else. The potatoes turn out perfect every time!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Miller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2168963/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-18T15:18:31.563Z",
                "reviewBody": "Making it right now.  Sounds delicious.  Maybe all the other folks that add all kinds of different ingredients should just submit their own recipe.  I tend to try others as written.  If I want to change the recipe I would have the courtesy of just offering my own, not completely changing the individuals recipe and telling everyone it was awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VetChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4753296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-16T23:05:54.17Z",
                "reviewBody": "OK: Here's my take on this recipe. Salt & pepper the chops before dredging them in flour. No egg necessary. After browning put in slow cooker. To drippings in pan saute 12 oz. sliced fresh mushrooms. Then add 1 can of cream of mushroom soup 1-1/2 cans of milk then 1 packet of onion soup mix. Mix ingredients and bring to boil then add to slow cooker. I used six thick boneless chops and had more than enough gravy. Fork tender no need for a knife.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gail",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/804166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-16T05:15:52.763Z",
                "reviewBody": "This tasted really good!  The only thing I added was a packet of onion soup mix, but I would change a couple of things based on texture and visual appearance.  I found that the egg and flour coating gave the chops kind of a slimy \"skin\" - next time I'll just season the chops and brown them without the dredging step.  Also, instead of slicing I would chop the onion.....the slices in the gravy looked a little too worm like for me :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LIVE4FOOD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1368068/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-16T02:05:35.293Z",
                "reviewBody": "This was pretty good and very easy. I made some changes to make it a healthier meal: I used thick boneless pork chops skipped the whole dredging/frying part I used the 98% fat free soup 2 cans of evaporated skim milk and added other seasonings. The meat was so tender! I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetaddiction",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/343032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-15T01:21:24.937Z",
                "reviewBody": "With the appropriate \"tweeking\" this is definitely a \"5\". I shop \"on sale\" and found sirloin and rib chops bone in for.89 a lb. I used 11 of them (I have 6 stepdaughters 2 sets of twins!) Cut off excess fat sprinkled with seasoned salt and pepper dredged in 1/2 flour & 1/2 italian bread crumbs. Browned on MedHi in butter flavored shortening. Layered in lg. crock pot with slivers of onion in between. (1/2 lg white onion) 3 cans cream of mushroom soup 2 c. milk 1 c. cooking sherry packet of pork gravy 8 oz. canned mushroom in pan with dripping until blended. Poured over chops cooked on low 5 hours removed chops and took off bone. Return meat to pot for another hour on high. Served over rice. EXCELLENT! Loved the previous reviews.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Mother Earth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1795111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-30T00:36:25.583Z",
                "reviewBody": "These were good but too heavy - I think next time I will use less soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SharonNJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2183711/"
                }
            }
        ]
    }
]