[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/109/appetizers-and-snacks/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1241/appetizers-and-snacks/vegetable/jalapeno-poppers/",
                    "name": "Jalapeno Popper Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232429/ryans-reverse-popper-dip/",
        "name": "Ryan's Reverse Popper Dip",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1009909.jpg",
            "width": 3343,
            "height": 3338
        },
        "datePublished": "2019-04-02T07:00:56.000Z",
        "description": "Before my son left for boot camp, I wanted to give him a going away party complete with all of his favorite foods. There wasn't enough time to stuff and wrap jalapenos for poppers so I took his favorite recipe and turned it into a warm spicy dip that disappeared faster than any poppers I've ever made! Serve warm with your favorite chips.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "8 slices bacon",
            "1 teaspoon canola oil",
            "1 teaspoon minced sweet onion",
            "1 ½ teaspoons minced garlic",
            "3 tablespoons dry bread crumbs",
            "2 (8 ounce) packages Neufchatel cheese, at room temperature",
            "2 cups shredded reduced-fat sharp Cheddar cheese",
            "10 jalapeno peppers, seeded and chopped",
            "½ teaspoon ground cumin",
            "1 teaspoon dried oregano"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; place a baking rack atop the aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lay bacon strips in a single layer on the baking rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until crisp, 25 to 35 minutes. Drain the bacon slices on a paper towel-lined plate. Increase oven temperature to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat canola oil in a skillet over medium heat; cook and stir onion in the hot oil until slightly softened, about 2 minutes. Add garlic; cook until fragrant, 1 to 2 minutes. Remove from heat and cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Coarsely chop 4 slices bacon; mix with bread crumbs in a bowl. Coarsely chop the remaining 4 slices bacon to mix with dip.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix Neufchatel cheese, Cheddar cheese, onion-garlic mixture, chopped bacon, jalapeno peppers, cumin, and oregano in the bowl of a stand mixer fitted with paddle. Spoon mixture using a rubber spatula into an 8-inch pie pan. Sprinkle bread crumb-bacon mixture over dip.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until dip is bubbling and topping is lightly browned, 12 to 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Vegetable",
            "Jalapeno Popper Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cat Hill"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.590909090909091,
            "ratingCount": 66,
            "itemReviewed": "Ryan's Reverse Popper Dip",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "177.4 calories",
            "carbohydrateContent": "3.7 g",
            "cholesterolContent": "39 mg",
            "fatContent": "13.2 g",
            "fiberContent": "0.5 g",
            "proteinContent": "11 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "417.3 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-06-23T18:51:23.823Z",
                "reviewBody": "Yum! My kids made this as the appetizer for our Mother's Day dinner. We enjoy poppers made on the grill so the boys chose to grill the peppers for a few minutes to give them that cooked and roasted flavor. Once cooled they removed the skins and seeds and chopped 'em up. We followed the recipe exactly other than that step. Everyone's first remark was \"Wow\" followed by \"This is great (delicious awesome fantastic ) and some other comments that were garbled by mouths being full.:) One of the other boys commented that he was glad we planted Jalapenos in the garden because we're gonna need 'em to make more of this dip. Our peppers were very hot - possibly more so because of the grilling- but it was perfect for our taste. Just wonderful. Thanks Cat for sharing your recipe! Update It was requested I make this for an afternoon by the pool. I had a container (8 oz) of sour cream that needed using up so I added it to the ingredients. The result was a creamier dip and easier to scoop without breaking the chips. I plan on making part of the ingredients as it was enjoyed so much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-27T22:32:10.39Z",
                "reviewBody": "I made two small changes--I used a good amount of homemade roasted sweet onion and one four ounce can of diced mild green chilies instead of the fresh diced jalapeno peppers. (My apologies to the recipe submitter I honestly don't think she would mind). My family INHALED this dip. In fifteen minutes. Seriously. They ate the whole serving bowl full. Everyone adored it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-17T18:50:18.207Z",
                "reviewBody": "All I have to say is YUM! I made this for #1 Son's Birthday (keeping in the theme of favorite dishes of Sons) and it was completely wiped out in a very short time. I put in only 5 Jalapenos because the ones I purchased were big. However next time I will put in 7 or 8 and work my way up to 10. It was so tasty and not hot at all. Just good! The bacon and onions and garlic only add to this super delicious dip. I already know I'll be making this again and again. Thank you Cathill for creating such a wonderful and EASY dish that will be on the DECKER menu from now on for our family gatherings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Candice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/candice100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-10T18:14:43.45Z",
                "reviewBody": "I'm the submitter of this recipe and AR fixed the first oops with the directions but I have noticed some having difficulty with the cook & prep time the original recipe has differing times from what AR posted in the submitted recipe. Not creamy enough or all you taste is bacon & cream cheese know what you mean. This is best hot for sure. And I had no idea cream cheese and jalapenos varied so widely in flavor texture or heat so that could certainly affect the outcome of this recipe for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cat Hill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cathill/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-02T18:24:40.97Z",
                "reviewBody": "I think I'm the only person I know who has never had jalapeño poppers. They never appealed to me as I was intimidated by putting a hot pepper in my mouth. (weird I know). This dip is a fantastic alternative to that. I used eight jalapenos as my were a medium size. It was just the right amount of spiciness. I was going to increase the bacon because my family loves bacon. I didn't and I'm glad I stuck to the recipe because it was just the right amount. This will be great for football season. Thanks Cat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa j",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1789946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-20T02:02:43.017Z",
                "reviewBody": "Recipe Group Selection: 27 April 2013 I am late in making the group selection but soooo glad I finally got it made. Cat-Hill your recipe is absolutely wonderful and so much easier to make than stuffed poppers. I made a half batch to take in to school. Five of us wasted no time polishing off the dip and all four of them wanted the recipe. I let the mini-chopper take care of jalapeños for me. It did a great job and I didn t have to worry about the oils from the peppers. I baked for 30 minutes in the toaster oven and then reheated it in the microwave when we enjoyed it with our lunch. I added fresh diced tomatoes on top before serving with tortilla chips. Thanks for sharing a winner Cat-Hill.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-27T02:24:37.17Z",
                "reviewBody": "This is so flavorful! It is rich and creamy and slightly spicy. Absolutely decadent but actually rather figure friendly. Thanks Cat this was worth waiting for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-18T17:41:01.69Z",
                "reviewBody": "Cat this is wonderful! DH said this is his new football dip! Really glad the jalepenos are doing well in the garden. This will be made often thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lucky Noodles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/luckynoodles/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-16T19:25:42.047Z",
                "reviewBody": "I made this for a BBQ last night and people simply couldn't get enough of it. I followed the recipe exactly (although using full fat cheddar cheese) - and it was perfect - but will make it without the bread crumbs next time because I have a number of gluten-free friends (and don't think I'll sacrifice any flavor by doing so). I brought tortilla chips to dip but one party-goer even slathered it on his hot dog as a topping. He said it was delicious that way. Just a couple cooking notes: It took me a bit longer to bake it (maybe closer to 30 minutes) and using my stand mixer was a life-saver. It's really really thick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jessnmrb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11397571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-17T21:44:57.55Z",
                "reviewBody": "'Really surprised I didn't love this. Really surprised. I prefer just cream cheese not cheddar poppers so may be a link there.:/ 'Wasn't spicy more cheesy cheesy cheesy.:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BOOKMARKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bookmarker/"
                }
            }
        ]
    }
]