[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/657/soups-stews-and-chili/stews/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232554/slow-cooker-chicken-tinga/",
        "name": "Slow Cooker Chicken Tinga",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1410158.jpg",
            "width": 1597,
            "height": 1198
        },
        "datePublished": "2019-04-02T07:00:59.000Z",
        "description": "A spicy chicken and chile dish. A good friend of mine from Guadalajara who works hard to make this on the stove inspired me to make my own version in the slow cooker. Serve on tostada shells and garnish with chopped cilantro and onions.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H45M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "18 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "1 onion, chopped",
            "1 (15 ounce) can tomato sauce",
            "1 (7 ounce) can chipotle chile peppers in adobo sauce, chopped and seeded",
            "2 fresh jalapeno peppers, seeded and chopped",
            "2 cloves garlic, minced",
            "1 teaspoon ground oregano",
            "1 teaspoon ground cumin",
            "1 teaspoon chili powder",
            "¼ teaspoon red pepper flakes",
            "¾ (1 pound) chorizo sausage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix chicken, onion, tomato sauce, chipotle chile peppers in adobo sauce, jalapeno peppers, garlic, oregano, cumin, chili powder, and red pepper flakes in a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low until chicken is no longer pink in the center, 2 to 3 hours. Remove chicken from slow cooker and shred using 2 forks; return to the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat. Cook and stir chorizo sausage in the hot skillet until browned and crumbly, 5 to 10 minutes; drain and discard grease. Stir chorizo into chicken mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low for 45 minutes to 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "angelosmommy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.645669291338582,
            "ratingCount": 127,
            "itemReviewed": "Slow Cooker Chicken Tinga",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "130.7 calories",
            "carbohydrateContent": "3.9 g",
            "cholesterolContent": "30.2 mg",
            "fatContent": "8.1 g",
            "fiberContent": "1 g",
            "proteinContent": "10.2 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "418.4 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-08-07T22:03:29.997Z",
                "reviewBody": "This was awesome!  My husband, who has been spoiled by California authentic mexican food, said it was restaurant worthy!  I omitted the red pepper flakes and left in the adobe seeds and sauce and it was plenty spicy!  In serving, I used flat corn tostada shells and layered the following: lettuce, chicken mixture, monterrey jack cheese, avacado slices, chopped tomato, cilantro cream (Which cut the spice - used allrecipes \"Amy's cilantro cream sauce\"), & few leaves of cilantro for garnish!!! This is now a favorite in our house! Great recipe, thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gracebew_u",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8454693/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-08T16:29:53.56Z",
                "reviewBody": "Great recipe! I was worried that the full can of chiles in adobo would be too spicy (and I love spicy food, but recall having once ruined a recipe from using too many of them) so I only used half, but I definitely should have used the whole can--with all of the tomato sauce, it actually came out pretty mild. 2-3 hours on low was just the right amount of time to cook the chicken. I skipped the chorizo and just made this until step 2 and returned the shredded chicken to the slow cooker for about another 40 minutes. This was fantastic as tacos on soft corn tortillas with chopped onion and fresh cilantro! Made great lunch leftovers for the next day, too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly Kate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2988843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-10T23:11:32.907Z",
                "reviewBody": "chicken plus all the pepper and tomato made this a must try for me.  so easy to do.   Cooked mine for 4 hours on high and then added the chorizo.  I also added a can of corn and also green chiles.  I used both pork and beef chorizo.  ake sure to drain well after browning it.  I layered paper towels on an oven pan and let all the grease soak into the paper.  moved it around with a spatula.  it came out fantastic!  Don't forget some avocado too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hockeyfan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4677579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-24T00:18:09.047Z",
                "reviewBody": "Loved this recipe! I omitted the jalapeño and red pepper flakes. I only used 3 chipotle peppers in adobo sauce (seeded) and 3 boneless, skinless chicken breast only because my husband and son don't like things as spicy as I do. I also added 1/4 cup chicken broth. I served it with a tostada with homemade refried beans smeared over it and chopped green leaf lettuce and tomatoes for garnish. I also included a side of avocado slices. My husband put shredded Mexican cheese on his as well. He loved it so much he ate 3!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "spicymom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5960255/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-04T14:57:41.95Z",
                "reviewBody": "This was a nice change for our standard Taco Tuesday dinner night. Topped with lettuce, chopped cherry tomatoes, shredded cheese, cilantro, guacamole, and plain Greek yogurt (instead of sour cream). Were it not for the toppings, this might have been a little too spicy for us (& we love hot & spicy) but the toppings helped cool the heat plus the cherry tomatoes added a touch of sweetness that paired well with the spicy heat.\n My only complaints are: 1) chorizo is VERY greasy, even when well-drained, but that's just how chorizo is so it wouldn't be fair to take away a star just for that. Next time, I'll halve the amount of chorizo, just for my personal health preferences. 2) I'm not a fan of having to use a skillet pan when prepping a slow cooker meal, esp. when the recipe adds this extra step midway through the cooking time. The beauty of crockpot cooking is being able to just throw everything in and have it ready by dinnertime, so to make this easier, I put everything in the crockpot except the chorizo and onion (& used frozen chicken breasts directly from the freezer) and let it cook during the day. Right before dinner, while crisping up the tostada shells in the oven, I cooked the chorizo and onions in my skillet and stirred it into the chicken mixture right before serving. I also cheated by using dried minced onions since I didn't feel like chopping up an onion. Faster and easier to make this way & every bit as tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2093540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-07T05:37:37.87Z",
                "reviewBody": "Amazingly delish! Very authentic tasting and the perfect spiciness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yumyum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11353302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-16T04:08:03.647Z",
                "reviewBody": "DELICIOUS! I did make a slight alteration since I was afraid of the heat - I omitted the red pepper flakes and only used 1 jalapeño - and the heat is definitely manageable. Next time I will use 2 jalapeños and I think it will be perfect for my taste buds. This recipe is pretty average until you add the chorizo and then BAZINGA! flavor overload. I served it between stacked tostadas layered with \"mexican mix\" shredded cheese chopped tomato sliced avocado and lite sour cream. An amazingly delicious dinner. Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pandoraly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/pandoraly/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-19T23:39:21.953Z",
                "reviewBody": "Wow! this is delicious!!! Finally found a chicken taco filling my family all agree on. The only change I made was not using jalapenos red pepper flakes & I only used a half can of chipotle peppers as others suggested. (we're wimps when it comes to spicy) It had just enough spice for us! I liked this before I even added chorizo it had a good flavor the chorizo (which was the spicy one) made it taste even better",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barbara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1894794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-15T11:48:08.22Z",
                "reviewBody": "FABULOUS! Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3354578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-03T02:06:32.85Z",
                "reviewBody": "Watching the Mexican Grand Prix this weekend and wanted a different Mexican dish than what we're used to. This seems to fit the bill. Agree with some of the other reviewers: this is spicy hot -- although part of it may have been my problem as I did not seed the chipotle peppers. Did not shred the chicken and return it to the sauce nor did I use the chorizo at all. Served it over brown rice and took recommendations and added sour cream and a simple guacamole. While that certainly tempered the heat considerably needed to put the dish in the microwave to reheat. (All the cold ingredients made the dish cooler than lukewarm.) That having been said DH absolutely loved it; suggested next time we use it in enchiladas. To that end will double the tomato sauce and cut down just slightly on the chipotle peppers pour the sauce over the assembled enchiladas and top that with cheese before baking. Will still serve with sour cream and guacamole cuz it's going to be needed. All and all however not a bad dish. Thanks angelosmommy for an interesting recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mrscrazyed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4031339/"
                }
            }
        ]
    }
]