[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/251/main-dish/sandwiches/",
                    "name": "Sandwich Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1031/main-dish/sandwiches/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/234396/slow-cooker-philly-steak-sandwich-meat/",
        "name": "Slow Cooker Philly Steak Sandwich Meat",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1045362.jpg",
            "width": 3072,
            "height": 3059
        },
        "datePublished": "2019-04-02T07:01:42.000Z",
        "description": "This makes a fantastic meat for Philly steak sandwiches. You can even use lower grade roasts and have this turn out. It also makes its own au jus if you like to dip as I do. To serve, sautee a sliced onion and sliced green pepper in a skillet. Put meat on a sub bun and top with onion and green pepper and Swiss or provolone cheese on top of that.   Leave open-faced and broil until the cheese just starts to brown. The top of the bun will brown fast so don't broil that until the cheese has completely melted and just starts to show color.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H8M",
        "totalTime": "P0DT8H23M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ large onion, sliced",
            "3 cloves garlic, chopped",
            "1 pound beef sirloin, cut into 2-inch strips, or more to taste",
            "½ teaspoon ground cumin",
            "½ teaspoon ground black pepper",
            "½ teaspoon chili powder",
            "½ teaspoon onion powder",
            "½ teaspoon garlic powder",
            "¼ teaspoon paprika",
            "¼ teaspoon dried thyme",
            "¼ teaspoon dried marjoram",
            "¼ teaspoon dried basil",
            "2 tablespoons bourbon whiskey (such as Jim Beam®)",
            "1 teaspoon soy sauce",
            "1 teaspoon prepared mustard",
            "1 teaspoon Worcestershire sauce",
            "½ teaspoon hot sauce (such as Frank's Red Hot ®)",
            "1 (12 fluid ounce) can or bottle beer (such as Budweiser®)",
            "2 cubes beef bouillon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Spread onion and garlic into the bottom of a slow cooker; layer beef over onion and garlic. Sprinkle cumin, black pepper, chili powder, onion powder, garlic powder, paprika, thyme, marjoram, and basil over beef; top with bourbon, soy sauce, mustard, Worcestershire sauce, and hot sauce. Pour beer over beef mixture and add beef bouillon cubes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low, stirring every hour or so, for 8 hours (or High for 4 hours).\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Sandwich Recipes",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "duboo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.27027027027027,
            "ratingCount": 111,
            "itemReviewed": "Slow Cooker Philly Steak Sandwich Meat",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "250.9 calories",
            "carbohydrateContent": "7.6 g",
            "cholesterolContent": "60.4 mg",
            "fatContent": "10.6 g",
            "fiberContent": "0.8 g",
            "proteinContent": "20.1 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "601.8 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-09-19T23:17:44.927Z",
                "reviewBody": "It is a pleasure to be the first person to try and rate this recipe.  I used a 3 lb. sirloin tip roast that was about 3.5 inches thick so I sliced it across the grain in about 1 Cm thick slices.  I used all the spices except omitted the cumin, a personal preference. I didn't have beef bouillon cubes, but did have my own homemade beef broth, so used a cup of that with the beer (Yuengling ®) and whiskey, just enough to cover my meat. My slow cooker is a very old cooker and low for seven hours was perfect for tender moist meat with excellent flavor, you wouldn't even know beer was used.  My husband used the au jus for dipping his sandwich in, sort of a french dip Philly steak.  Easy to quick cook up the onions and peppers for some really great tasting sandwiches.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-02T15:45:31.677Z",
                "reviewBody": "Tasty tasty and easy! :-) My sirloin was about 3lbs and I quadrupled most of the rest of the ingredients. I omitted the soy sauce and added a lot more hot sauce, and I don't use the bouillon cubes, but I replaced with beef base. This made the house smell GREAT as it cooked, and it tasted wonderful. Used Muenster cheese. Oh, and I did just add the new sliced peppers to the meat in the last hour of cooking and that worked well. They were softened but not disappearing. The only thing I will caution is that if you leave this go too long, the pretty slices will end up self shredding..doesn't change the taste, just not as pretty or as \"philly steak\" looking. :-) Thanks, Scooby!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1885019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-04T19:32:20.387Z",
                "reviewBody": "I joined Allrecipes.com just to rate this awesome recipe!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13307036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-20T04:19:24.607Z",
                "reviewBody": "I finally made this today and the results were way above my expectations. I have made other slow cooker beef sandwiches that came out tasting like nothing more than a shredded Sunday beef roast piled on a bun. Always disappointing. This recipe however had exactly what I was looking for in a slow-cooked beef filling for a beef sub sandwich. Delicious flavor and melt-in-your-mouth texture. I sliced the sirloin 1/4 inch thick so it would keep shape (didn't want it shredded) and seasoned it with a little of the spice mixture and seared it first. I added the rest of the spice mixture to the slow cooker along with the seared beef strips and the remaining ingredients. I used Crown Royal thank goodness to compensate for the cheap domesticated light beer that I had to use and Muenster cheese under the broiler like another reviewer because I like how it melts nice and creamy and the sauteed peppers and onions. All spices and measurements I followed exactly. I'm going to make this again this weekend to impress my guests who are coming in from out of town:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jayelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7559747/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-15T13:21:29.91Z",
                "reviewBody": "This is my recipe and I appreciate everyone who has tried this and given it their honest opinion.   One review mentioned that there wasn't much flavor and I actually had that happen once, and I've made this dozens of times.   I don't know what happened.   If the meat sucked out the flavor or what.   However, I was able to turn it into the great meal it should be by adding another bouillon cube.   Alternatively you could also just add in salt until the flavor wakes up.   I'm not a big believer in salting things to death, but sometimes it's a necessity.   Thank you for trying one of our family favorites.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "duboo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/duboo/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-07T12:57:00.593Z",
                "reviewBody": "Fantabulous explosion of flavours! I used the beer I had on hand Budweiser and I didn't have Kentucky whisky only Tennessee (J.D) so that's what I used. I had a moment and completely forgot to add the bouillon cubes and didn't miss it a bit. I was a little worried about pre-cutting the meat and I usually sear it off before I put it in the slow cooker but I've made a recipe from this home cook before so I had faith and followed directions. I was right to do so because this was awesome! Thank you Duboo. I enjoyed Sunday football while my sups was cooking away. My boys really loved it too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Volleyballmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3368022/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-08T00:42:44.2Z",
                "reviewBody": "This was amazing! I couldn't stop eating it! I made only minor changes. I used a 3 1/2 pound chuck roast so I tripled the recipe. I only used 1/4 teaspoon of thyme just because I don't care for it much. I used only 1/2 a teaspoon of hot sauce but I could have gotten away with using it all. I also started out with one can of beer. I added a second about halfway through. We ate it on some bakery buns with Muenster cheesee onions peppers and mushrooms. Soooo good. Will be making again. Thanks Duboo.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "superfox12082",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5614840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-04T14:00:23.263Z",
                "reviewBody": "I loved the way the meat turns out tender & moist from these ingredients. I don't usually like pot-roast-type meat, as it always feels \"dry\", even with juice & gravy. This meat is so tender & juicy - I guess from the chemistry of the beer/whiskey/spices? (I felt like a mad scientist mixing the many seasonings!) It is SO good! I think I ate 1/3 of it during the day - I had to make sure I didn't overcook it, right? The juice is so good I want to drink it...I used 2# boneless beef short ribs sliced 1/2\" thick, doubled the seasonings & cooked 8 hours on low. Fabulous! I will use this recipe over & over and have been thinking of adapting it for a pork loin I've got on hand...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "scootersandi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9419394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-03T20:05:51.413Z",
                "reviewBody": "I think I messed this recipe up by using a sirloin steak instead of a roast. The meat was tough and I could taste the Worcestershire sauce which I can NOT taste in a philly sandwich. I will try it one more time before I give up on it:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisacg1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10323564/"
                }
            }
        ]
    }
]