[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24786/slow-cooker-chicken-parisienne/",
        "name": "Slow Cooker Chicken Parisienne",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F476727.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:42:48.000Z",
        "description": "Chicken breasts slow cooked with a creamy white wine and mushroom mixture. This quick and easy recipe calls for just five main ingredients, yet is tasty enough to serve for company! My husband normally doesn't like chicken, yet asks for seconds whenever I prepare this. I spoon the sauce over the chicken and serve with rice or noodles.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H10M",
        "recipeYield": "4 to 6 servings",
        "recipeIngredient": [
            "6 skinless, boneless chicken breast halves",
            "salt and pepper to taste",
            "paprika to taste",
            "½ cup dry white wine",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (4.5 ounce) can sliced mushrooms, drained",
            "1 cup sour cream",
            "¼ cup all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle chicken breasts lightly with salt, pepper, and paprika to taste. Place in slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a mixing bowl, combine the wine, condensed soup, and mushrooms. In another bowl, mix together sour cream and flour. Stir sour cream mixture into the mushrooms and wine. Pour over chicken in slow cooker. Sprinkle with additional paprika, if desired.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on Low for 6 to 8 hours.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JUDITH"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.039393939393939,
            "ratingCount": 330,
            "itemReviewed": "Slow Cooker Chicken Parisienne",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "296.3 calories",
            "carbohydrateContent": "10.6 g",
            "cholesterolContent": "85.3 mg",
            "fatContent": "12.6 g",
            "fiberContent": "0.6 g",
            "proteinContent": "30.2 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "515.3 mg",
            "sugarContent": "1.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-11T22:27:43.247Z",
                "reviewBody": "This reminded me of a recipe I sometimes prepare on special occasions.  I added garlic, 1/4 cup minced onion, 1/4 grated parmesan cheese, some crushed rosemary and doubled the mushrooms.  One hour before serving I also added a 14oz can of quarted artichoke hearts.  Served over rice, it was delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "robswife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2312563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T15:00:37.623Z",
                "reviewBody": "Pretty good! I took note that other reviewers complained of it having too strong a wine flavor or being too tangy and with that in mind I took the lid off the crockpot for the last half hour and turned it on high. I think this allowed more of the alcohol to evaporate and the resulting dish was milder than previous tastings during cooking. (It also thickened the sauce nicely.) The chicken was very tender perfect! I'd add more mushrooms next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "bizarrogirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/154907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-27T16:54:14.763Z",
                "reviewBody": "WOW!  This turned out fantastic!  My husband is not a  huge chicken fan, but all I heard during dinner was Mmmmmmm, this is great!  I used frozen chicken breasts, substituted whole fresh mushrooms for the canned, and used white zinfandel wine (all we had in the house).  Definitely season the chicken with salt, pepper and paprika, still needed a little salt, but then we like things very well seasoned.  I served it over angel hair pasta, with garlic green beans.  Try this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GALA62",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/570055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-18T17:07:33.25Z",
                "reviewBody": "Don't usually like canned soup based recipes but this was quite good. I did brown the chicken and fresh mushrooms first then deglazed the pan with the wine/chicken broth (I used broth). Added some onion salt and season salt & pepper. Used the paprika on top at serving to add color. Also used the mushroom soup w/ roasted garlic. Served with rice & glazed carrots. Whole family enjoyed it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THELAWRENCES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-04T21:25:57.983Z",
                "reviewBody": "Thank you Judith for this wonderful simple easy and oh so tasty recipe. My hubby just loved it and my picky eaters loved it as well. We served it over buttered/parsley noodles and it was a winner! The only thing I did different was my chicken breasts were frozen(I forgot to take them out and thaw them) I placed them in the crock frozen and they cooked up just wonderful with no extra time needed to the cooking time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Schauer Sottosanti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97624/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T08:12:32.99Z",
                "reviewBody": "My family raved about this chicken! I substituted chicken broth for the wine as we do not drink. I served it over egg noodles. The chicken was tender enough to cut with a fork. My kids had seconds and thirds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDAJOHNS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/318674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-21T03:21:27.983Z",
                "reviewBody": "Easy basic recipe but one that needs some tweaking to achieve a fuller flavor. Have made it several times and will continue to use the following method; browned the chicken in olive oil using a mixture of flour garlic seasoning salt paprika and onion powder to provide a richness to the sauce. I believe this enhances the flavor that so many reviews find lacking. Used the Golden Mushroom soup mix with golden sherry in place of the wine (as that's all I had on hand) and poured over the layer of chicken and thinly sliced portabella mushrooms. Reduced the cooking time to accommodate browning the chicken. Served over noodles for an easy low stress dinner. Perfect for the working mom! Thanks Judith for the submission! UPDATE: Just 2 of us for dinner vs the whole \"herd\" so I had plenty of leftovers. Had a \"hmmmm\" moment and thought this might be good as chicken and dumplings. So the next night I added chicken stock to the remaining gravy made herb dumplings found on this site brought the gravy and chicken to a slow rolling boil and added the dumplings to cook. I can't even begin to tell you what a great use of leftovers this was. Absolutely outstanding!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-29T14:41:12.17Z",
                "reviewBody": "I made this for dinner one night when my two in-laws were visiting. We all absolutely loved it. I did a few things differently such as I used Campbells Cream of Mushroom With Roasted Garlic soup; added one cup of chicken broth to crock pot; I used 7 chicken thighs (skin removed) and browned them in some olive oil and garlic before placing them in the crock pot and when I placed the chicken in the crock pot I put thin slices of onion atop each of them. I also added about 1/4 cup of cooking sherry. I cooked it on \"low\" for 7 hours but for the last half hour or so I removed the cover and turned setting to \"high\". I served the chicken and gravy over noodles. The chicken was falling off the bone! A truly excellent dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUCKAROONI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/660068/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-07T01:52:44.75Z",
                "reviewBody": "To make this an all in one dinner I layered the chicken (which I chunked into bite sized pieces) in the bottom of my crockpot with half of a sliced onion 4 ounces of chopped FRESH mushrooms then covered it with the cream of mushroom soup and the white wine. Right before dinner I stirred in 1 1/2 cups cooked broccoli 2 cups cooked elbow macaroni the sour cream and a good amount of fresh ground pepper. I didn't need the flour as the starch from the pasta thickened it up nicely. I'll make this again but I would add spices the second time around as it was a little bland. I would also double the mushrooms.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T16:18:34.623Z",
                "reviewBody": "We were a little disappointed in this recipe. It was very quick to prepare aside from the normal time in the cooker and the chicken had the perfect consistency but it had a funny taste. We enjoy dishes with wine in them and creamy sauces however this dish had a very sour taste to it. It wasn't a taste of the wine and our sour cream wasn't bad but the combination in the slow cooker made an almost unbearably sour taste. Our daughter wouldn't even eat it complaining of the acrid taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "COURTNEYSUNSHINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34302/"
                }
            }
        ]
    }
]