[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/662/meat-and-poultry/chicken/whole-chicken/",
                    "name": "Whole Chicken Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24790/chicken-savoy/",
        "name": "Chicken Savoy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F387545.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2019-04-02T06:42:48.000Z",
        "description": "A whole chicken cut into pieces and baked with a simple mixture of olive oil, chicken stock, garlic, spices and cheese - topped with balsamic vinegar just before serving. The best Chicken Savoy on the planet is served at the Belmont Tavern in Bloomfield, where it was invented by Stretch himself. Go there, order Savoy for two, and order Zita with pot cheese. They make a wonderful combination. The place is not fancy, but the food is outstanding. This is a recipe to eat with your fingers and get juices on your hands. Yum!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (2 to 3 pound) whole chicken, cut into pieces",
            "⅛ cup extra virgin olive oil",
            "1 cup chicken stock",
            "1 clove garlic, crushed",
            "1 teaspoon dried oregano",
            "salt and pepper to taste",
            "¼ cup grated Romano cheese",
            "3 tablespoons balsamic vinegar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken pieces in a 9x13 inch baking dish. Pour oil and stock over chicken and sprinkle with garlic. Season with oregano, salt and pepper and top with cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for about 45 to 60 minutes, or until chicken is cooked through and no longer pink inside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour vinegar over chicken and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Whole Chicken Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Joe"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.394160583941606,
            "ratingCount": 411,
            "itemReviewed": "Chicken Savoy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "477.2 calories",
            "carbohydrateContent": "2.9 g",
            "cholesterolContent": "178.6 mg",
            "fatContent": "30.4 g",
            "fiberContent": "0.2 g",
            "proteinContent": "45.4 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "389.7 mg",
            "sugarContent": "1.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-22T20:55:25.8Z",
                "reviewBody": "I've had the chicken at the Belmont Tavern, and flipped when I saw this recipe - YUM!\n\nHowever, a few tweaks - more garlic! :-) I didn't have time to marinate, so I lined the chicken up in a pan, poured some chicken broth in to cover the bottom, then lightly drizzled the chicken (I used legs) with olive oil.  I then put some crushed garlic on each piece, then sprinkled oregano (lightly), and grated Romano (generously) over all - I then drizzled the chicken (lightly) with Balsamic vinegar - Halfway through the cooking time, I turned the chicken, and repeated the application of garlic, oregano, romano, and balsamic vinegar, adding more chicken broth to cover the pan.  When the chicken was done cooking, it had a lovely dark brown sauce that I poured over the top of the chicken prior to serving.  Just like the Belmont!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris T.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2054110/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-28T17:21:48.443Z",
                "reviewBody": "This recipe is not bad, however, Balsamic Vinigar is not used....it is made with Red Wine Vinigar that has carmalized while cooking.  I know this because my friend is the head chef at Stretch's!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "NYCityChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2439985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T01:05:21.88Z",
                "reviewBody": "Adding more chicken recipes to my repetoire doesn't happen too often, as how many do you need?Well, Chicken Savoy is the exception to the rule.  My tweakings---I marinated the chicken all day in the oil,oregano, broth, 4 cloves crushed garlic, and 1/4 tsp. crushed pepper flakes.  Under each piece of marinating chicken, I tucked a few peeled cloves of garlic. I \"cheesed\" the chicken from the beginning, and really enjoyed the crispy golden coating.  Next time will experiment with the balsamic vinegar.  Did you know that you can boil this vinegar down to a syrupy glaze.  It becomes very sweet and thick.  Going to do that next time.\r\nThank you for sharing Joe, we really loved this dish.\r\nCheers,\r\nJeff\r\nP.S.\r\n3rd. time preparing this dish, and all of the above still goes---but, now I only use chicken thighs.  For each serving, I place 2 thighs on top of great mashed potatoes, and place a few whole garlic cloves in between the chicken pieces. I spoon some of the pan juices (not a lot though) around the edges of the mashed potato \"bed\". Lastly I drizzle the reduced \"syrupy\" balsamic vinegar on top.  WOW is all I can say.  Ummmmazing.  Thanks again, Joe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chefjeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-08T18:26:14.06Z",
                "reviewBody": "i just want to say....i WORKED at the belmont tavern back in the late 80's.....i actually prepared this this AT the belmont tavern. i see 2 things with this recipe that we NEVER did at the belmont: 1) we didnt use any chicken stock back then (not sure if they have changed it up since then but i doubt it) 2) RED WINE vinagar....not balsamic. A few additional tips: we would throw a whole teaspoon of the minced garlic/olive oil over EACH piece of chicken...as for the rest of the ingrediants...use them liberally (be careful with the salt obviously), this is supposed to be an intensely flavored dish. Make sure to use a metal roasting pan....it makes the caramalization a lot easier to attain than if you're using glass. lastly....be sure to add LOTS of red wine vinegar as soon as he chicken is taken out of the oven and then make sure to pour it all over the chicken after it has been plated.  i have made the authentic savoy at my house over the years......great dish.....unfortunately it never came out as good as it did at the belmont....im assuming the oven at the restaurant made the difference.   ps....this dish works best with a smaller sized chicken, IMO.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eddie Smithjones",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2706760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-16T17:37:28.86Z",
                "reviewBody": "Recently there has been a lot of talk about this chicken recipe. I had it saved to my box and was anxious to try it. Last night was the night. With such simple ingredients, how could the reviews be so different from one another? This is what I did.  I used chicken breasts rather than the whole chicken because that's what I had on hand. In a dish, I drizzled the olive oil all over the chicken and made a rub of 3 minced garlic cloves, the oregano, salt and pepper. Rubbed that all over the chicken and carefully poured the stock over all. I let it sit for about 30 minutes to absorb the flavors. Then, in a heated cast iron skillet, I browned the herb crusted side for a few minutes til it had a nice brown. Turned it right side up, and poured the broth mixture over the top of the chicken. Coated the breasts with shaved parm/romano combo and baked it in the pan in a preheated 500 degree oven for about 20 minutes. Removed the breasts, added red wine vinegar instead of the balsamic, deglazed in the oven for 3 minutes and poured the finishing sauce on top of all. It was cooked perfectly and very moist and juicy. I served it with asparagus & angel hair pasta tossed with EVOO and garlic. 10 stars for taste, and 4 because I did not adhere to the actual directions. Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Avon- status quo PRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3326566/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T20:05:42.937Z",
                "reviewBody": "Considering the few comments about this recipe being bland I made some minor adjustments when I tried it. First I used a very rich chicken stock - home made simmered and reduced until it was golden brown. Second I sprinked on a little basil along with the oragano. And finally I used several whole garlic cloves instead of the crushed garlic. I served a garlic clove with each piece of chicken so my family could mash the garlic and spread a much or as little as they liked over their chicken. I lowered the temp and baked it just a little longer to allow the flavors to meld just a bit more. We LOVED this recipe!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMANSAVAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/621825/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-14T04:35:56.53Z",
                "reviewBody": "I LOVED IT.  ON MY DAY OFF I CUT UP THE CHICKEN AND PUT IT IN A ZIPLOCK WITH THE BROTH, GARLIC, OLIVE OIL AND OREGANO.  WHEN I GOT HOME FROM WORK I JUST POURED IT INTO THE PAN SPRINKELED ON THE CHEESE. NO MESS.  I THINK THAT IT ALSO MADE IT MORE TENDER TO MARINADE THIS WAY.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANIAM6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/449231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-30T18:16:27.59Z",
                "reviewBody": "This is one of my favorite chicken dishes.  I've made it many times and everyone loves it.  I alter the recipe just a bit.  I marinate 8 boneless skinless breasts in about 1/3 cup balsamic vinegar, 1 Tbs olive oil, 8 cloves crushed garlic, oregano, salt and pepper.  I slice some mushrooms and saute them a little bit of balsamic vinegar and garlic.  I the cover the chicken breasts with the sauteed mushrooms and cheese, and then bake at 350 for about 40 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yellowjacket",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-29T22:53:27.16Z",
                "reviewBody": "For those of you that haven't had the chance years ago to eat \"Savoy made by Stretch\" you really don't know what this dish is supposed to taste like. Stretch is \"God of Savoy,\" and this recipe is close with a few exceptions. Years ago I was a regular and had to have Savoy at least twice a week. If I could have afforded it I would have been there for lunch and dinner every night. Then the worst thing happened- I was transfered to Nashville- Medegone Central where guys named Bubba made what they thought was pizza. I was in hell and had no choice but to try to make Savoy myself. I have now since moved back to NJ and perfected a home version which is a lot closer to Stretches than 40 or so other restaurants in North Jersey that currently have Savoy on their menu.  You will need metal pans cause glass will shatter when adding the cold balsamic vinegar at this high temp. Stretch must have had his oven up 700+ but you won't be able to do that. Start out around 375 for a half hour, then 400, then 450, and last 8 or so minutes 500+. Your goal is well done chicken, like a barbecue look.  Cooking time varies.. you want almost all of the stock to be cooked off before you take out and add balsamic vinegar which should be searing when applied. If not you had the heat too low. The Belmont is still the best but I think this is a very close second.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michale Adamoli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4828802/"
                }
            }
        ]
    }
]