[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/234750/spinach-and-beef-lasagna/",
        "name": "Spinach and Beef Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7549132.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T07:01:52.000Z",
        "description": "Spinach and meat with three types of cheese and herbs, layered with red sauce and noodles.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT1H50M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 tablespoon extra virgin olive oil",
            "½ onion, chopped",
            "½ pound lean ground beef",
            "2 cloves garlic, minced",
            "½ teaspoon dried oregano",
            "½ teaspoon dried basil",
            "1 (45 ounce) jar spaghetti sauce",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained",
            "2 cups fat-free ricotta cheese",
            "1 (8 ounce) package shredded part-skim mozzarella cheese",
            "½ cup dried parsley",
            "¼ cup grated Parmesan cheese",
            "1 teaspoon salt",
            "⅛ teaspoon black pepper",
            "10 lasagna noodles, or more as needed",
            "½ cup shredded part-skim mozzarella cheese, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large pot over medium heat. Cook and stir ground beef in the hot pot with garlic, oregano, and basil until beef is completely browned, 5 to 10 minutes. Stir spaghetti sauce and spinach into ground beef mixture; simmer until heated through, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir ricotta cheese, 8 ounces mozzarella cheese, parsley, Parmesan cheese, salt, and black pepper together in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread a small amount of sauce in the bottom of a 9x13-inch pan. Arrange lasagna noodles in a single layer over the sauce. Spread another layer of sauce over the top and arrange another layer of lasagna noodles over sauce. Spread 1/2 the remaining sauce and 1/2 the cheese mixture over the top. Repeat layers, finishing with sauce. Cover pan with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 55 minutes, remove aluminum foil, sprinkle lasagna with 1/2 cup mozzarella cheese, and bake until noodles are cooked through and sauce is bubbling, about 15 minutes. Cool for 10 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ArmeC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.75,
            "ratingCount": 8,
            "itemReviewed": "Spinach and Beef Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "322.1 calories",
            "carbohydrateContent": "35.3 g",
            "cholesterolContent": "37.6 mg",
            "fatContent": "11.1 g",
            "fiberContent": "4.5 g",
            "proteinContent": "18.9 g",
            "saturatedFatContent": "4.6 g",
            "servingSize": null,
            "sodiumContent": "875.5 mg",
            "sugarContent": "12.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-11-05T01:34:59.37Z",
                "reviewBody": "The flavour on this dish is fantastic and flavour wise it should be 5 stars  but there are some problems with the recipe itself.  It calls for ½ lb. of ground beef I increased it to 1 lb. and still felt that it was skimpy.   The recipe calls for ½ cup dry parsley this is way to much I used 1 tbsp. think next time will double this.   I have never seen a 45 oz. jar of spaghetti sauce so I used a 28 oz. jar of spaghetti sauce and a 28 oz. jar to tomato sauce the extra worked great as I used 15 oz. of fresh spinach instead of frozen.  Now for the instructions.  There is no indication on what to do with the onions for I fried them up along with mushroom the beef and spices.  Now for the layers as written there is no way that you can use ½ the amount of meat sauce in the layers and still have some for the top.  The way it should read is as the following:  small amount of sauce on the bottom of the pan, noodles, 1/3 of meat sauce, ½ of the cheese mixture, noodles, 1/3 of meat sauce, remaining cheese mixture, noodles and remaining of the meat mixture.   Bake as pre the recipe instructions.  I will be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Nadine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5049040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-03T01:48:28.2Z",
                "reviewBody": "Not quite sure how to rate this recipe but the lasagna turned out quite well. I agree with other reviewer: instructions were not clear enough. I just followed the general outline of the recipe so I used all the ingredients that were called for but in terms of quantity I kind of just eyeballed everything and added in the amount as I though appropriate. I also accidentally bought cottage cheese instead of ricotta cheese. It was too late by the time I realized that and so I went ahead and used it. It turned out very well and it got my daughter's approval so hence the 4 star rating. In my opinion a much better recipe than the slow cooker lasagna.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "peterpam112",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10594196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-02T00:28:30.04Z",
                "reviewBody": "Followed the previous recommendations of doubling beef & using 2 tbsp of parsley. For our pasta sauce however we chose Garden marinara & mushroom marinara. It made it difficult to layer the lasagna & also ended up being a bit sweet. So next time we'll use a spicy marinara instead. We prepped the night before and made the next day thinking it would take a lot of time. But it was surprisingly a lot faster than our first attempt at a different lasagna. Great recipe! We will be making it again!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Wendy T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mswendalyn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-13T04:34:25.19Z",
                "reviewBody": "Well here's the thing. The finished results were fabulous just had to modify a bit to get it there. My changes were to use fresh spinach (2 10oz. pkg) which I added to the almost cooked onion and garlic with spices. I cooked the meat with the salt and pepper but did not add it to the marinara. I did it all in layers. Cheese mix spinach mix meat and then the sauce. I'm sure you get the gist. In all there were 4 layers of noodles the bottom one on top of the marinara the 4 filling layers I mentioned earlier. (You should actually divide the filling ingredients in half.) noodles fillings noodles and the top layer as originally written. The timing was pretty good. Just increased the unfoiled portion of timing to 25 minutes instead of 15. Awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "cillah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9417652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-04-14T07:25:47.84Z",
                "reviewBody": "I just made this and put it in the oven. I'm a tad upset that I didn't read the reviews first. My lasagna has no onions in it:-(. I also used a pound of ground beef as I thought a half pound was not enough. I will revise my review after I taste it. But next time I will add my onions while browning the beef which I will also increase. I had a pound and a half but figured there was a good reason for only using a half pound. As my family are meat lovers I will follow my instincts next time I prepare depending on the taste. However it was quite tasty... even without the onions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mac1doodle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10045901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-06-07T04:38:51.28Z",
                "reviewBody": "I made this with a few substitutions. I used fresh spinach fresh cilantro instead of dried parsley dividing it between the meat sauce and the ricotta filling and fresh homemade spinach lasagna noodles. I used a whole onion 3 cups of ricotta and a pound of extra lean ground beef as my husband likes a meaty cheesy sauce. Because of using the fresh pasta it took less time than the recipe indicates to cook and was done in 55 minutes. It was nice and cheesy. Will be making again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Martin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21999708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-08-28T01:46:56.127Z",
                "reviewBody": "This is an awesome lasagna if you follow the review from Nadine (the flavour is excellent but the original instructions don't make sense) however I tried both fresh and frozen spinach and I prefer the frozen better as long as it's drained very well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cattikit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13577578/"
                }
            }
        ]
    }
]