[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/113/appetizers-and-snacks/pastries/",
                    "name": "Pastries",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24871/beef-samosas/",
        "name": "Beef Samosas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F609167.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2019-04-02T06:42:51.000Z",
        "description": "Beef and potatoes are the main ingredients folded inside these wonderful deep fried samosas. Chicken livers may be substituted for beef, if you choose. My friend from Bangladesh gave me this savory, spicy recipe. You just can't buy better in the shops.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "18 samosas",
        "recipeIngredient": [
            "2 large potatoes, peeled",
            "1 cup frozen peas, thawed",
            "2 tablespoons vegetable oil",
            "½ teaspoon cumin seeds",
            "1 bay leaf, crushed",
            "2 large onions, finely chopped",
            "1 pound ground beef",
            "4 cloves garlic, crushed",
            "1 tablespoon minced fresh ginger root",
            "½ teaspoon ground black pepper",
            "1 ½ teaspoons salt",
            "1 teaspoon ground cumin",
            "1 teaspoon ground coriander",
            "1 teaspoon ground turmeric",
            "1 teaspoon chili powder",
            "½ teaspoon ground cinnamon",
            "½ teaspoon ground cardamom",
            "2 tablespoons chopped fresh cilantro",
            "2 tablespoons chopped green chile peppers",
            "1 quart oil for deep frying",
            "1 (16 ounce) package phyllo dough"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a medium saucepan of lightly salted water to a boil.  Stir in potatoes and peas. Cook until potatoes are tender but still firm, about 15 minutes. Drain, mash together and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium high heat, heat the oil. Brown cumin seeds and bay leaf. Mix in onions and ground beef. Cook until beef is evenly brown and onions are soft, about 5 minutes. Mix in garlic, fresh ginger root. Season with black pepper, salt, cumin, coriander, turmeric, chili powder, cinnamon and cardamom. Stir in the mashed potato mixture. Remove from heat and chill in the refrigerator for 1 hour, or until cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large, heavy saucepan over high heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix cilantro and green chile peppers into the potato and beef mixture. Place approximately 1 tablespoon of the mixture onto each phyllo sheet. Fold sheets into triangles, pressing edges together with moistened fingers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In small batches, fry until golden brown, about 3 minutes. Drain on paper towels and serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Pastries"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sassyangelkiwi Donna-Maree Aus"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.491666666666666,
            "ratingCount": 240,
            "itemReviewed": "Beef Samosas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "258 calories",
            "carbohydrateContent": "23.8 g",
            "cholesterolContent": "21.4 mg",
            "fatContent": "14.8 g",
            "fiberContent": "2.3 g",
            "proteinContent": "7.6 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "346 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:29:13.077Z",
                "reviewBody": "Loved the filling, but thought the phyllo dough was unauthentic.  So I got this recipe from an Indian friend...\r\n2 cups of plain flour\r\n¼ tsp salt\r\n4 tbsp of oil/ghee\r\n4 tbsp of water\r\n \r\nMethod for base\r\n1. Mix all the ingredients for the base together with your fingers until it forms a dough.\r\n   Add tiny bit more water if needed.\r\n2. Knead the dough for about 10 minutes or until it is smooth. \r\n3. Put it in a plastic bag and set aside for 30 minutes or longer, in the refrigerator if possible.\r\n\r\nThen I think you take a walnut-sized portion of dough, and then roll it out to about 4 inches across.  Put a couple of TB of filling in, fold dough over to make a semicircle, press seams together, roll edges over, and fry 'til golden.  Sorry for the long post, but hope it helps. =)\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AUNTWEBBIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/757670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-29T19:46:59.23Z",
                "reviewBody": "These are great, but I have two suggestions and a tip.\r\n\r\n1) Use a green chile paste instead of fresh chiles.  You can find it at Indian/Pakistani markets.  Also known as green chile chutney.\r\n2) Use samosa wrappers instead of filo dough if filo is too crumbly.  These are easier to work with and do not flake so easily when cooked.  Also found at Indian/Pakistani markets.\r\n\r\nTip) I used southern style hashbrowns instead of whole potatoes.  They are already boiled and cut up, so the boiling time is much less.  Basically you are just heating up the potatoes and the peas.  Then mash together like recommended.  (Southern Style is the one that is cubed, not shreaded.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYANA_SNOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/808295/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-13T01:01:36Z",
                "reviewBody": "Excellent & yummy recipe, easy to make too!  I lived in India during part of my childhood and Indian food is my fave ... and this recipe meets full approval and tastes so authentic!  However, like almost all cooks in this website, I modified a few things.  I diced the potatoes into little pieces and boiled them with the peas - I did not mash them. I used more cumin seeds (love the flavour of cooked cumin seeds in Indian dishes), and added 2 - 3 tablespoons of lemon juice at the end of the cooking of the filling (after the potatoes and peas were added in) - this gives it a bit of tangy flavour (a lot of vegeterian samosa recipes call for lemon juice).  I did not use phyllo dough but ready-made thin flaky pie dough - it has a very nice puff when fried and it's a very tasty combination with the filling.  Egg-roll wrappers are not for samosas and do not do samosas justice for the taste, so pls don't use them !  If ever, it's better to make your own dough, though this can be more time consuming. \nBravo and thanks again for this great recipe !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gemma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2140736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T14:59:03.27Z",
                "reviewBody": "I love this recipe. The ground beef is what makes the samosa so delicious. Don’t let the long list of ingredients daunt you from making this; the meat mixture is pretty easy to make once you get everything together (helps if you measure out all the spices at least a day in advance). I like to put the beef in warmed tortillas and top it with a small sprinkling of grated cheese. Yum. As for the samosa, when I first made this, I baked the samosa in the oven at 400 degrees until the dough was golden (suggested by other reviewers). I also spread the dough with melted butter before popping the samosa into the oven. And I used spring roll wrappers. Since I try not to eat too many carbohydrates, I usually omit the potatoes when making the meat mixture. It tastes just as good, in my opinion.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "moonlight sonata",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/612816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T09:20:31.717Z",
                "reviewBody": "I made these with ground chicken, a handful of raisins and without the cilantro and green chiles. They were absolutely wonderful! For a more healthy version, bake the pastries in the oven on 400 degrees until brown and crisp. I brushed the outsides with melted butter so that they would crisp nicely. I suspect that ground turkey would be just a nice to use as well. My friends and I had fun making then and eating them :) If you are out of garlic, a tablespoon of garlic powder works well too. Also, put in a teaspoon of garam masala for wonderful flavor and a nice aroma. The phyllo dough doesn't make them like genuine samosa, though. I suggest using wonton or eggroll wrappers to mimick the doughy and thick goodness of authentic samosas. My friends and I doubled the recipe and ate them as a meal until we were stuffed. They are quite good :) Also, if you have already browned meat, just cook the onions seperately and mix them all together. I think these would be awesome with left over turkey too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAWNCANDACE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590498/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-01T14:22:21.03Z",
                "reviewBody": "Looking for something a lil' different for your next gathering...you have found it!! I LOVED THIS RECIPE, although I made a few minor adjustments.  Phyllo dough is a bit difficult to work with, so I bought the pre-made phyllo shells, they look like miniature puff pastry cups.  I filled each with the Samosa mixture, and instead of frying, I put them on a cookie sheet and baked them just until the tops got browned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAMDANCE88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:29:15.513Z",
                "reviewBody": "Now I won't have to go to an Indian restaurant just to eat one of my favorite appetizers.  These turned out really tasty.  I added some crushed, dried chile peppers in the filling for some more spice.  For the dough I used the recipe AuntWebbie posted (thanks!).  It was the perfect consistency and I was able to make the wrappers with no hassles.  The samosas taste better for me when the dough is thin, and there is a lot of filling.  Great recipe!\r\n\r\nPS - Only one thing I had problems with.  From the recipe, it sounds like you're supposed to smash the peas with the potatoes, but I didn't smash the peas.  I think it tastes better this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHINYAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-11T05:36:32.92Z",
                "reviewBody": "I used vegetarian ground beef and wonton wrappers (which were just the right size). They came out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WYSEWYG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/134576/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T18:17:34.92Z",
                "reviewBody": "We loved this! I didn't have any phyllo nor any other wrappers and I didn't feel like going to the store to buy some but I had some tortillas in the fridge. It was great! I topped it with Cheddar and Mozzarella cheese and grilled it in the oven for 5 minutes to melt the cheese. After we each had one we made 2 more but topped each with some medium salsa. The combination of samosa filling with the salsa topping just made it a perfect meal. It was given a Yes please make this again so I will:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAWLIGA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/561439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:29:12.937Z",
                "reviewBody": "I tried making this maybe it just wasn't our tastes but we didn't like it it needs something else but I dont know what.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "KITKATRAMPAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/863777/"
                }
            }
        ]
    }
]