[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/250/main-dish/pizza/",
                    "name": "Pizza Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1036/main-dish/pizza/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24878/bbq-chicken-pizza/",
        "name": "BBQ Chicken Pizza",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F58411.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:42:51.000Z",
        "description": "A topping of spicy barbeque sauce, diced chicken, cilantro, peppers, and onion all covered with cheese, and baked to bubbly goodness! This is similar to a recipe I had at a popular pizza place in California. My family LOVES it!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "1 - 12 inch pizza",
        "recipeIngredient": [
            "1 (12 inch) pre-baked pizza crust",
            "1 cup spicy barbeque sauce",
            "2 skinless boneless chicken breast halves, cooked and cubed",
            "½ cup chopped fresh cilantro",
            "1 cup sliced pepperoncini peppers",
            "1 cup chopped red onion",
            "2 cups shredded Colby-Monterey Jack cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place pizza crust on a medium baking sheet. Spread the crust with barbeque sauce. Top with chicken, cilantro, pepperoncini peppers, onion, and cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 15 minutes, or until cheese is melted and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pizza Recipes",
            "Chicken"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KIMIRAE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.516355140186916,
            "ratingCount": 428,
            "itemReviewed": "BBQ Chicken Pizza",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "385 calories",
            "carbohydrateContent": "37.8 g",
            "cholesterolContent": "58.3 mg",
            "fatContent": "16.1 g",
            "fiberContent": "1.7 g",
            "proteinContent": "22.7 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "1666 mg",
            "sugarContent": "8.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-15T07:10:22.31Z",
                "reviewBody": "This is a great weeknight recipe that we make at least twice a month!  Sometimes we use the Pillsbury pizza crust dough and other times, we make our own.  But either way, it is delicious. NOTE: The best way I've found to pre-cook the chicken is to place each breast in the center of a square piece of aluminum foil and sprinkle on both sides with salt (and pepper, if desired).  Fold up the sides of the foil to form a sealed packet.  Place the packets on a baking sheet and bake at 350 degrees for 1 hour.  The chicken will come out moist and delicious.  Simply cube the chicken and it is ready to add to your recipes  (chicken salad, chicken ala king, etc).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aeposey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6074/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-25T11:43:46.513Z",
                "reviewBody": "Many of the reviews seemed to take issue with the ingredient amounts so I used my cook's intuition and eye-balled everything.  I omitted the pepperocinis (better served on the side like Papa Johns), approx. doubled the chicken, kept the rest of the measurements approx. the same, and made TWO medium pizza crusts with the ingredients instead of just one.  The key to keeping the chicken moist and flavorful is mixing a few TBSP of BBQ sauce into the cubed chicken before topping the pizza.  Otherwise, the edges tend to dry out while cooking.  Also, slice the onions super thin so they will cook more quickly.  If you have the time, I would definitely recommend making Jay's signature pizza crust over using a store-bought kind -- it turned out crispy on the outside and chewy on the inside.  Homemade crust is surprisingly easy to make, tastes fresher, and saves a lot of money. This pizza tastes great (very close to CPK) but I gave 4 stars because of the modifications.  This recipe will probably taste great with some pineapples too (similar to Davd & Buster's BBQ hawaiian pizza that seems to have disappeared off the menu).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T23:13:47.983Z",
                "reviewBody": "Good Recipe. My boyfriend and I always eat the chicken barbeque pizza at California Pizza Kitchen and this is very close. I don't know about the peppers though. I love them but not on my pizza I don't think that would taste right. I also used 3 chicken breasts instead of 2. And whoever suggested making pizza dough out of bisquick is wrong. Bisquick doesn't make pizza dough. Thanks for turning a perfectly good pizza into chicken and barbeque sauce on a biscuit. I did it to try and save money like they did and it was not very good. First of all 1 1/2 cups of bisquick only made about enough \"dough\" to cover half on my pan. Next time I'll try using a real recipe for pizza dough. Other than that the pizza was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATIECOWAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/441693/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T19:18:36.983Z",
                "reviewBody": "You're right when you say it tastes like the CPK pizza! Yummy! I ommitted the pepperoncini peppers and substituted it with green bell pepper. I also used a mix of mozzarella and monterey jack cheese. Make sure you slice the onion and pepper thinly (it tastes best that way). I just had regular bbq sauce so I added a dash of hot sauce and boy it gave it a kick. Good stuff will be making again. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-01T21:16:42.78Z",
                "reviewBody": "This was really a quick and easy recipie and my husband loved it. To make it a bit cheaper we made a Bisquick pizza crust (1 1/2 cups Bisquick and 3/4 cup very hot water. Mix into dough then spread on pizza stone/pan). Just put the topping on the uncooked crust and bake it for 15 mintues.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bethany",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/602686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T19:19:42.45Z",
                "reviewBody": "I've been wanting to make this for a long time. I mixed my BBQ sauce right with the shredded meat of 3 breasts before then spread it over the crust.....sprinkled it with a diced fresh jalapeno (didn't have pepponcini)and covered with mozzarella and cheddar (didn't have cilantro or red onion). IT WAS GREAT!!! I can't wait to try it again WITH the red onion. The hot pepper gave it just a bit of heat. Went great with the chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMP70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/575740/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-31T19:44:55.06Z",
                "reviewBody": "I made this exactly like the recipe says (except the peppers because I didn't have any) the first time and found the bbq sauce quite overpowering. since then i add a few tablespoons of my favorite bbq sauce to prego spaghetti sauce and spread that mixture over a boboli crust (i'm lazy!!!) and top with all of the toppings except the peppers (they are too expensive). when served with salad and a nice red wine it makes for a very fun meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALAS76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-31T19:44:21.653Z",
                "reviewBody": "Used Bobolis in the small size to make individual pizzas. I cannot say enough good things about this recipe. I do think some of the measurements were off on the recipe and just eyeballed the amounts that I wanted on each one. Definitely use the pepperconi and red onion it helps round out all the flavor of the pizza otherwise you have come BBQ chicken on a crust. Also used regular BBQ sauce but dashed on some Tabasco. Used a combination of mozzerella and mild chedder cheese. It looked so good even before I put it in the oven. Plan on making this again tomorrow night for friends. This recipe is terrific and I wouldn't say that if it truly weren't. Easy preparation also. I eat CPK BBQ pizza all the time and this is pretty much on it if not better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-28T15:34:54.237Z",
                "reviewBody": "I really like this recipe a lot and you can cater to your own taste. I used Stubb's spicy BBQ sauce. I marinated my chicken with a little mesquite sauce and seasoned with some salt pepper onion powder garlic salt and red pepper flakes. I also put a couple tablespoons of the BBQ sauce in with the chicken while it was cooking on the skillet. I cut my chicken into cubes before cooking so it didn't take as long to cook on the skillet. I sauteed some white onion and green bellpepper with a little diced garlic (instead of using peppers and red onion). I also only used about 3/4 cup of sauce to spread on the crust. I sprinkled a little mozzarella cheese on top after I layered everyting else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nurse Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1887921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-16T19:52:32.347Z",
                "reviewBody": "Worst homemade pizza I've ever had. I agree on the ingredients to go in it as I've made something similar. The amount of ingredients stated for this made it taste like a pile of hot garbage. I've made BBQ chicken pizza before and it is much easier to gauge how much you put in it by eye. Good ingredients. Awful amounts. Also I recommend buying dough from a pizza shop. I make (great) homemade pizza frequently and this is by far the worst one I've had. Gauge the ingredients by eye.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "jz040488",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5463983/"
                }
            }
        ]
    }
]