[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17246/main-dish/stuffed-main-dishes/",
                    "name": "Stuffed",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16539/main-dish/stuffed-main-dishes/stuffed-cabbage/",
                    "name": "Stuffed Cabbage",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236131/spicy-unstuffed-cabbage/",
        "name": "Spicy Unstuffed Cabbage",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1323183.jpg",
            "width": 3080,
            "height": 2714
        },
        "datePublished": "2019-04-02T07:02:34.000Z",
        "description": "This is a huge hit at potluck suppers. You can adjust the spiciness to your own palate. I also think it just gets better the next day!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 pound spicy bulk pork sausage",
            "1 pound lean ground beef",
            "1 (28 ounce) can diced tomatoes",
            "1 onion, chopped",
            "1 (6 ounce) can tomato paste",
            "2 tablespoons distilled white vinegar",
            "2 teaspoons chili powder",
            "½ teaspoon salt",
            "¼ teaspoon red pepper flakes, or more to taste",
            "10 cups shredded cabbage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat. Cook and stir sausage and beef in the hot skillet until browned and crumbly, 7 to 10 minutes; drain and discard grease.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir diced tomatoes, onion, tomato paste, vinegar, chili powder, salt, and red pepper flakes into the sausage mixture; add cabbage and fold into the mixture. Reduce heat to medium-low and cook, stirring occasionally, until the cabbage is tender, 20 to 25 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Stuffed",
            "Stuffed Cabbage"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Valerie Kasper"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.433333333333334,
            "ratingCount": 120,
            "itemReviewed": "Spicy Unstuffed Cabbage",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "314 calories",
            "carbohydrateContent": "17.4 g",
            "cholesterolContent": "67.7 mg",
            "fatContent": "17.3 g",
            "fiberContent": "5.2 g",
            "proteinContent": "22.2 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "889.7 mg",
            "sugarContent": "9.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-08-07T15:11:41.38Z",
                "reviewBody": "Spicy Unstuffed Cabbage Haiku: \"Halved the recipe, used all ground beef, no sausage. This sure makes alot!\" So the submitter of the recipe is right; even in half, this makes a ton! As it resembled a cabbage roll's guts, I made rice alongside it for serving, but found that the leftovers the next day that had been mixed up w/ the rice, were far superior. Wasn't too thrilled w/ the heavy vinegar taste, and felt that it could've benefited from the addition of minced garlic, so when I make this again (which I will as we really did like it alot), I would serve it mixed w/, instead of on top of, rice, reduce the vinegar, and add garlic, and probably make a full batch, as I imagine extras would freeze nicely for a reheated casserole later on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock_lobster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rocklobster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-03T14:14:33.877Z",
                "reviewBody": "**EDIT**  When I posted this recipe I didn't realize that I had left out to transfer the cooked and drained meat to a Dutch oven or a large soup pot.  You can even use a crockpot if you desire.\nThe amount of spice you add is all up to your personal taste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Kasper",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valeriekasper/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-02T02:49:18.483Z",
                "reviewBody": "This was delicious. Even the kids liked it. I sliced the cabbage so it was long and thin and told them it was sort of like spaghetti.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4209987/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-10-26T09:53:46.563Z",
                "reviewBody": "I'm rating the recipe 5 stars not because it's the best recipe in the world but because it's one of the best recipes for 'unstuffed cabbage' that I've found. I did add a bit of brown sugar and added rice to the dish (increased the liquid to do so). I also added some oregano. As other reviewers mentioned this definitely made a LOT. But I wanted (individual) meals to put into the freezer so this was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-10T20:48:02.28Z",
                "reviewBody": "Freakin delicious!  And I don't usually rate things on here, but I am too grateful for this recipe to pass it up.  We skipped the sausage and went with the 1 lb beef alone.  We used fresh tomato in place of canned 1:1, but otherwise kept true to the recipe and it was GREAT.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristy Leon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3309275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-11T20:13:44.22Z",
                "reviewBody": "Loved this.  I used crushed tomatoes and omitted the tomato paste, added 2 carrots, 2 celery stalks and 1/4 cup of Thai sweet chili sauce.  Great low carb meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peggy Morra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12650987/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-10T20:50:24.937Z",
                "reviewBody": "Loved this recipe.  Selected this recipe primarily because my son is on a low carb diet.  He raved about the wonderful flavors and textures.  Made it as written using half venison and half spicy breakfast sausage with two large bags of store bought shredded coleslaw.  Be sure to use your largest deepest fry pan because it makes a lot and takes some time to melt the cabbage down into the sauce.  The result is well worth the effort though.  A definite low carb keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tlinker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9169543/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-02T10:37:03.003Z",
                "reviewBody": "I think its a great starting point, but in the end I had to make some changes to enhance the flavor. I did not have diced tomatoes or distilled vinegar, so I substituted with tomato sauce and apple cider vinegar. I also added 1 red pepper and did not use ground beef because I didn't think the recipe needed that much meat. The edit by the author to cook the dish in a dutch oven or in a pot on the stove is very important. \n\nMy grocery store did not have a great variety of pork, but in retrospect if you have access to chorizo it might add to the flavor. I also supplemented the flavor by adding two bay leaves, about 3 teaspoons of ground sweet basil, and a small handful of cheddar cheese before serving. It does make a lot, but I am anticipating the left overs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ValleyLily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7851189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-05T09:27:09.73Z",
                "reviewBody": "Thank you for sharing this! I loved this dish! This is going to be a favorite I'll make a couple times a month and it's very hearty! I made quite a few changes because of the ingredients I had on hand and to increase the variety of veggies which included the addition of 1 small leek a large stalk of celery about 1.5 cups sliced carrots and about 1 cup diced apple added in the last 2.minutes of cooking. Also to aide digestion I added a couple tablespoons of fresh. finely minced ginger root. I sauted the mirepoix with the leek and ginger root about 10 minutes over med-low flame with a tablespoon of olive oil and a few spoonfuls of water in the last few minutes as needed. I only had a 14.5 oz can of diced tomatoes so I added a 1/2 cup of water. Also had to substitute white wine vinegar for plain. To make it a bit lighter I only used 1/2 pound cooked sausage and about 4 oz. cooked ground beef. This was more than satisfying and reduced cost and calories. To beef up the protein and fiber I served it with steamed quinoa and the flavor of the grain was the perfect compliment to the smoky chili spices. Finally I forgot about the tomato paste until after the dish was done and so I added that at the end and only heated it through; this worked really well because it kept the bright high notes of the tomato from mellowing through cooking which was surprisingly perfect. Shared some with friends who aren't big vegetable lovers and they asked for seconds and skipped",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cckel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17312645/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-09-25T09:52:02.917Z",
                "reviewBody": "I cut this recipe in half because it was just for two. Still we had a lot of leftovers! I used regular pork sausage not spicy and apple cider vinegar chopped garlic and diced up fresh tomatoes instead of canned with no tomato paste. I also added slices of smoked white Chedder cheese that I needed to use up. By adding cheese it tasted like my mother's stuffed cabbage rolls ( at least somewhat). My husband said it was okay but not great. I may or may not make it again at least I am trying new ways to cook cabbage and I had to try this version.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kikikim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/crazycatlady63/"
                }
            }
        ]
    }
]