[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17156/desserts/chocolate/dark-chocolate/",
                    "name": "Dark Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236212/homemade-melt-in-your-mouth-dark-chocolate-paleo/",
        "name": "Homemade Melt-In-Your-Mouth Dark Chocolate (Paleo)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F08%2F03%2F1112044.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-02T07:02:36.000Z",
        "description": "Homemade chocolate that melts in your mouth. Made without artificial ingredients or waxes, this wholesome treat is ideal for the health conscious individual who enjoys an indulgent treat. Sweetness can be tweaked to taste, and add-in ingredients and combinations are endless. Enjoy!",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT1H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ cup coconut oil",
            "½ cup cocoa powder",
            "3 tablespoons honey",
            "½ teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Gently melt coconut oil in a saucepan over medium-low heat. Stir cocoa powder, honey, and vanilla extract into melted oil until well blended. Pour mixture into a candy mold or pliable tray. Refrigerate until chilled, about 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "Dark Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Linda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.541666666666667,
            "ratingCount": 216,
            "itemReviewed": "Homemade Melt-In-Your-Mouth Dark Chocolate (Paleo)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "157 calories",
            "carbohydrateContent": "9.4 g",
            "cholesterolContent": null,
            "fatContent": "14.7 g",
            "fiberContent": "1.8 g",
            "proteinContent": "1.1 g",
            "saturatedFatContent": "12.9 g",
            "servingSize": null,
            "sodiumContent": "1.5 mg",
            "sugarContent": "6.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-03-30T22:41:30.81Z",
                "reviewBody": "I was looking for another recipe when I stumbled across this one. Seeing that I had all the ingredients, I decided to try a batch. Wow, are these good!!! I can't believe how simple they are. To prevent the honey from sinking to the bottom of the chocolate, here is what you do. Mix the oil and cocoa powder. Stick this mixture in the fridge until it starts to thicken. Now you can stir in the honey and it won't 'sink' because the coconut oil is no longer liquified. I added a little less than 1/4 tsp of cayenne pepper, and a couple pinches of chipotle powder. I didn't have candy molds or a pliable tray, so I lined a small plastic container with foil. Once hardened, I was able to lift everything out of the container and cut into 8 pieces. Heavenly!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "France C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/francecevallos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-07T20:54:03.753Z",
                "reviewBody": "This chocolate is delicious, but I did have to switch up how I made it. I kept the ingredients exactly the same, but I tried this recipe three times, and the third time was the keeper! I know other reviewers said they also had the problem of the honey sinking to the bottom. When I tried the recipe, I tried the trick that others had given, to cool the mixture a little in the fridge before adding the honey, so that they consistency of the cocoa/oil mixture and the honey was similar. However, the first time, the honey sank to the bottom. The second time, I tried another suggestion, and heated the honey first, to give it the same consistency as the coconut oil. That batch was better, but it still had some honey on the bottom.  The third time, I did not melt the coconut oil, but kept it as a soft solid. I mixed in the cocoa, and the honey and vanilla, which made a thick paste-like consistency. Then I heated that on the stove-top, just enough so that the cocoa powder dissolved and it was smooth. Then I poured it into a foil lined dish and put it in the fridge. Perfect! The texture is amazing...so smooth. It is  great if you like dark chocolate. I added a little cinnamon to mine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "momtotwo Monument",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16316026/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-04-08T01:50:31.417Z",
                "reviewBody": "This was surprisingly good!  I used a whisk to mix the cocoa, honey and vanilla into the melted coconut oil,  then poured it into a foil-lined loaf pan (this size pan created the perfect thickness) and sprinkled in some toasted pecans.  Chilled for about 1 1/2 hours, popped the foil out and cut the chocolate into pieces.  Very creamy and definitely melt-in-your-mouth!  Will make this again and again!  Great recipe for a healthy treat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kendy Misoni",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3437116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-09T20:19:41.027Z",
                "reviewBody": "I tried this not knowing what to expect. I loved it! In addition to the honey, I added 1 1/2 tablespoons of Agave nectar, I like it a little bit sweeter. Finally I added 1/2 tsp of sea salt and 1/3 C chopped almonds. Fabulous! I only made mine 1/4\" thick and I didn't have a problem with the honey sinking to the bottom, as i read in another review. Thank you for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin Valley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4917961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-10T17:36:11.223Z",
                "reviewBody": "Delicious just as written! But I have also played around with the recipe and I found that adding a tiny bit of sea salt makes this great recipe even a bit better. (Salt really brings out the sweetness in candies and chocolates!). I also have made this with almond extract and even coffee extract and I've added nuts and coconut. It is a great recipe that easily allows you to add your own special touches, or just make as written for a simple, delicious treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8467227/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-04T18:38:40.01Z",
                "reviewBody": "We love this, although the last time we made them, I used raw cacao butter instead of coconut oil as I had only liquid coconut oil and didn't know if it would set properly.  And oh my!  This batch was KILLER!  Full chocolate flavor, and it rivals my all-time fave, Scharffen-Berger.  I always add vanilla, and I use only 2 TBS honey since we like bittersweet chocolate.  Be sure to use cocoa you really like in this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wisweetp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sogirl_2/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-26T02:27:47.103Z",
                "reviewBody": "This \"Homemade Melt-In-Your-Mouth Dark Chocolate (Paleo)\" is out-of-this-world delicious! Oh my goodness! I used flavorless \"refined\" organic coconut oil (not \"virgin\" coconut oil) since I don't like the characteristic fruity taste of coconut oil in most recipes. My coconut oil was liquid at room temperature, so I wasn't going to bother to heat it. I found that the honey kept separating from the coconut oil when I tried to mix them at room temperature. Then I remembered something I learned in chemistry class: liquids are more soluble at higher temperatures. I heated the honey and oil together and they still didn't mix together very well (although better). Then I remembered something I learned in English class: read the instructions! Everything mixed together well when I followed the instructions. I put my organic dutch-processed cocoa powder through a sieve to make sure that it was free of all lumps. I also made my chocolates in a paper-lined mini-muffin tin (yield: 12). Important Tip: I found it much easier to remove my chocolates from the mini-muffin tin when they were freshly set after 1 hour of refrigeration (easy removal) rather than after they were well hardened (pry out with a knife). Thank you Linda (LMT) for sharing your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ladybug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15234165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-28T17:44:49.853Z",
                "reviewBody": "I tried this recipe and not sure if it was just first time bad luck but all the coconut oil stayed on top of the mold and the honey sunk to the bottom. So what I was left with was a chocolate that only tasted good on the bottom. I may try again though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4176897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-29T20:00:03.853Z",
                "reviewBody": "Made this twice now and it is really very good. The first batch I made with some ground cayenne and the second time I made separate 1/2 batches with fresh mint leaves (I let the leaves rest with the melted mixture for a bit) and coconut flakes sprinkled in at the end right before pouring into the moulds each was delicious. I didn't have any issues with the honey/oil separation. I actually melted them all together over super low heat then let the mixture cool a bit before pouring into silicone moulds. I used wildflower honey (very thick and very flavourful) in the first batch and it overrode the flavour a bit much. In one half I used acacia (very light flavour and very liquid) and the second half I used orange blossom honey (almost solid and only a hint of flowers) and let it melt. The honey was less evident in both of these. All three solidified very well. Definitely keep in the fridge. These melt-in-your-mouth but also in your warm fingers! Just a good reason to eat them quickly! Will update a picture ASAP.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Buckwheat Queen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/melaniegiovenzana/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Homemade Melt In Your Mouth Dark Chocolate (Paleo)",
            "description": "This rich, paleo-friendly homemade dark chocolate melts in the mouth.",
            "uploadDate": "2014-06-16T21:02:13.628Z",
            "duration": "PT1M25.085S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7d170bee-cc31-4baa-a43b-46f7824664c6%2F8f050c68-7344-46c7-96b2-15da22f1f1f8%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3625621709001"
        }
    }
]