[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/225/side-dish/vegetables/",
                    "name": "Vegetables",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/924/side-dish/vegetables/eggplant/",
                    "name": "Eggplant",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/236311/baked-eggplant/",
        "name": "Baked Eggplant",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9296727.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T07:02:39.000Z",
        "description": "Great baked vegetable side dish with slices of eggplant and tomato seasoned with oregano and Parmesan cheese.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "cooking spray",
            "1 eggplant, sliced into 1/2-inch-thick rounds",
            "3 tomatoes, sliced",
            "1 tablespoon extra virgin olive oil",
            "1 teaspoon oregano",
            "⅓ cup grated Parmesan cheese",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Prepare a baking dish with non-stick play.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange eggplant and tomato slices into the bottom of the prepared baking dish. Drizzle olive oil over the vegetables; season with oregano, salt, and pepper. Sprinkle Parmesan cheese over the entire mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until the cheese is beginning to brown, about 30 minutes. Switch oven broiler to high; continue baking until completely browned, about 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Vegetables",
            "Eggplant"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JEZZI16"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.664536741214057,
            "ratingCount": 313,
            "itemReviewed": "Baked Eggplant",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "53.9 calories",
            "carbohydrateContent": "3.2 g",
            "cholesterolContent": "3.9 mg",
            "fatContent": "3.7 g",
            "fiberContent": "1 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "71.7 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-09-17T00:36:06.763Z",
                "reviewBody": "I am so happy to find a recipe for eggplant that doesn't involve bread crumbs or flour! This is delicious as written, simple flavors blending well. I made it the first time without making any variations. The second time I made a few modifications and it made it even more flavorful. I used heirloom tomatoes (de-seeded) and peeled eggplant both times. The second time, in addition to the recipe as written, I sprinkled garlic salt and Italian Seasoning blend over the tomatoes and eggplant. I then sprinkled 1/2 cup shredded Parmesan (not the kind from a can) and 1/2 cup crumbled feta cheese on top. Baked 25 minutes, which was enough. This is a perfect recipe to add veggies into a family meal (always a challenge) and use fresh summer produce. Thank you for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lappinparker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7452434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-08-02T06:09:53.897Z",
                "reviewBody": "I suggest peeling the eggplant 1st.. the rind is not a fun thing to eat. Also sear the eggplant on both sides so it doesn't become soggy when the tomato goes on during the baking process, i also recommend putting some parmesan between the tomato and the eggplant to absorb the tomato juices..DO NOT OVERBAKE.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alan Nicholas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4293557/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-05T02:33:49.18Z",
                "reviewBody": "This was a good jumping off point. I added minced garlic and some dry basil.  I also layered the eggplant and tomatoes with mozzarella.  The baking time was too short so I dropped the temperature to 375F and increased the baking time to 50 minutes.  This was simple but very tasty.  Thanks, Jezz!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BigShotsMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bigshotsmom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-31T03:26:34.417Z",
                "reviewBody": "After reading some of the reviews I ended keeping the Parmesan cheese & Italian seasoning, then I peeled the eggplant, used canned diced tomatoes (I was all out of fresh as I had just made a very refreshing tomato salad),and added diced kalamata olives & garlic to the whole mix. I also lowered the temp to 375, and after baking for 40 minutes sprinkled shredded mozzarella on the eggplant slices and broiled for the remaining 10 minutes. \nThis was absolutely delicious! I love eggplant but am not a fan of frying or breadcrumbs so I was thrilled to come across this recipe. What a super way to have a meatless meal. I bought some good semolina bread so the next day my husband made himself a hero with the leftover eggplant. I will definitely be adding this to my cooking repertoire...thanks Jezz and thanks to all the other posters for adding some great ideas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "moominmamma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1472921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-27T19:22:33.03Z",
                "reviewBody": "Absolutely loved finding a non-breaded recipe and was surprised how delicious! This will be my go-to for summer bumper crop eggplant. Thank you so much for sharing--love, love, love this!\n\nPreparation Must and would eliminate several of the soggy and bitterness reviews I read. As with all eggplant recipes, the key is to sweat the eggplant first. Do this by skinning, slicing, and heavily salting (I use canning salt) and let set for at least 30 minutes -- all the excessive water and bitterness will bubble out. Then rinse thoroughly  and squeeze out all the excessive water with clean tea towel or paper towels.  Then proceed with the recipe.\n\nTip: bake on stoneware and eliminate the cooking spray. I baked 35 minutes at 400, no broiling required for nice brown crunchy Parmesan. Resist the urge to put mozzarella on as some reviews suggested as it's the browned Parmesan that is so very very good. I also put Parmesan between  the eggplant and tomato--yes, I love Parmesan!\n\nSeasoning Variations: use Italian seasonings (mixture of oregano, basil, thyme), garlic powder, minced up jalapeno between the eggplant and tomato.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "milo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/milo/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-09T06:00:07.06Z",
                "reviewBody": "I loved it!  After reading the reviews, I followed these suggestions:  I peeled and sliced the eggplant and placed it in a colander and sprinkled it with salt to sweat for 30 minutes.  Then I rinsed it with cold water and patted it dry with paper towels.  \nI used a cookie cookie sheet sprayed with PAM.  \nI made them WW friendly - 1 smart point for 2 slices.\nI topped the eggplant/tomato slices with fresh, chopped garlic; oregano, basil, salt and pepper, crushed red pepper flakes, and 1 tbsp. Pecorino Romano cheese and 1 tbsp. olive oil.  I baked at 400 for 30 minutes.  It was delicious!  I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JRocandJordysMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9562482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-16T19:39:00.523Z",
                "reviewBody": "Thank you for the posting.  This recipe was easy to prepare and very healthy (no breadcrumbs needed).  I used a can of diced tomatoes with garlic and oregano.  Plate of spaghetti and garlic twist on the side with cherry cheesecake for dessert.  Excellent.  [I know cherry cheesecake isn't healthy-but it was a boxed mix]",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IDYDELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1137943/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-09T07:44:21.79Z",
                "reviewBody": "SO good! After reading a few other reviewers suggestions, I made some minor modifications.  First, I brushed my eggplant rounds with EVO and lightly salted them and roasted them at 425 for 10 minutes.  Then I added chopped fresh tomatoes, fresh shredded basil and oregano, a little cracked black pepper and then the shredded (not the grated stuff you put on your spaghetti) parm.  Baked at 375 for about 20 min then broiled for 3 minutes.  AMAZING!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Loves to Bake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14999805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-02T18:47:13.027Z",
                "reviewBody": "Great recipe - substituted feta because it was all I had... it was delicious. Will definitely make this again - so healthy and flavorful. Followed other suggestions to bake longer at 375... also added lots of garlic and fresh basil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren Herberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3965842/"
                }
            }
        ]
    }
]