[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/237054/jalapeno-popper-quesadillas/",
        "name": "Jalapeno Popper Quesadillas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1127835.jpg",
            "width": 1803,
            "height": 1803
        },
        "datePublished": "2019-04-02T07:03:00.000Z",
        "description": "This is a great alternative to deep-fried jalapeno poppers that's much easier to make and healthier too. Slice into small wedges to use as an appetizer, or enjoy as light meatless Monday dinner.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "6 jalapeno peppers - stemmed, seeded, and halved lengthwise",
            "1 tablespoon butter, softened",
            "2 (10 inch) flour tortillas",
            "2 tablespoons cream cheese, softened",
            "½ cup shredded Mexican cheese blend",
            "3 tortilla chips, crushed, or more to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange jalapeno peppers, cut-side down, on the prepared baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Broil jalapeno peppers in the preheated oven until skins are bubbling and blackened, 10 to 15 minutes. Immediately place peppers in a resealable plastic bag; seal. Allow peppers to steam in bag to help loosen skins, about 20 minutes. Carefully open bag, pull skins off peppers, and chop peppers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread half the butter onto 1 side of each tortilla. Spread half the cream cheese onto the other side of each tortilla. Sprinkle half the jalapeno peppers, half the Mexican cheese blend, and half the tortilla chips over the cream cheese-side of each tortilla. Fold each tortilla in half over the fillings with butter-side on the outside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a skillet over medium-low heat; cook 1 quesadilla in the hot skillet until golden brown, 2 to 3 minutes per side. Repeat with second quesadilla.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "laurieish"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.302083333333333,
            "ratingCount": 96,
            "itemReviewed": "Jalapeno Popper Quesadillas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "472.8 calories",
            "carbohydrateContent": "41.4 g",
            "cholesterolContent": "63.5 mg",
            "fatContent": "27.8 g",
            "fiberContent": "3.4 g",
            "proteinContent": "15.2 g",
            "saturatedFatContent": "15.8 g",
            "servingSize": null,
            "sodiumContent": "797.5 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-03-22T12:30:46.247Z",
                "reviewBody": "Have been making quesadillas with these fillings for quite awhile but I LOVE your idea of buttering the grill sides of the tortillas and adding crushed tortilla chips! Am giving this recipe a four star but only because it's much more complicated than need be. You can simply place all the internal ingredients on one entire tortilla, top with the other tortilla (butter side up) then when time to turn just slide on to the plate you already planned to slice the quesadillas on, turn the skillet upside down over the plate and flip the plate and pan over to slide it back in the skillet and continue cooking the other side. Oh, and using sliced jalapenos from a jar saves the step of broiling the fresh jalapenos should you like to choose ;-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Deeli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3816489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-09T16:09:47.613Z",
                "reviewBody": "I love the Concept of this recipe! But as written it just didnt work for me.I made these again today for my husband at lunch time and he LOVED them with some alterations!! First off I Doubled EVERYTHING!I made one for myself An even added some leftover thinly sliced chicken breast Absolutely TO DIE FOR!! With my changes a definite 5 STAR recipe!!! I didnt even have a chance to take a picture he ate them that fast..lol",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "missrochester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6418859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-13T01:45:53.84Z",
                "reviewBody": "This was delicious.  I used two whole tortillas stacked on top of each other and cooked it on a baking sheet at 425 for about 7 minutes per side and it was perfectly browned and melty.  Added salsa and sliced avocado on top - the whole roasted jalapenos are quite spicy with the membranes and seeds left in, but so worth the extra effort of roasting and peeling.  Had leftover wedge the next morning with a fried egg on top and more salsa.  I almost think I prefer the breakfast version!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lesa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13420029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-07-31T23:46:35.32Z",
                "reviewBody": "My husband is now officially OBSESSED with these. He asks for them at least once a week. And they are so fast!  The usual changes I make are that I use jarred pre sliced jalapenos, because it's faster and I don't have to bake any that way. And instead of using the crushed regular tortilla chips, I'll use Doritos, when and if I have them on hand. Otherwise I'll just skip that (optional) step. As a filling I've also added chicken and mushrooms, and they were delicious that way as well! Oh I've also added sliced yellow, red and orange mini bell peppers that I previously sauteed in a frying pan :) The options are endless!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Viv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2845675/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-09-09T18:41:00.1Z",
                "reviewBody": "Add some chopped bacon and they are perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Teralyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13846515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-05T13:21:53.59Z",
                "reviewBody": "These were just okay for me although I love the idea. I doubled all of the other ingredients but used three tortillas. Even then I felt that the cream cheese was barely enough to cover. I might try again with some modifications. I think I expected ooey-gooey and you just don't get that with one tablespoon cream cheese and one-fourth cup shredded cheese on one ten-inch tortilla.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Thisni Caza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1060346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-02T05:12:09.503Z",
                "reviewBody": "I absolutely loved these and so did my husband, we have found that as you age you lose some of your taste buds and spicier foods are often a welcome treat.  These aren't too spicy that they burn the roof of your mouth, just right!  After making the first small recipe to sample and after reading the reviews, next time I make them I will broil a big batch of jalapeno peppers, skin them and dry freeze till needed  for appitisers especially for outdoor dinner parties.  I loved the idea that someone offered about using these for breakfast with an egg or two, all the more reason to freeze dry a big batch of jalapeño peppers and just grab a handful as needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth Duckworth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5232089/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-27T20:04:50.98Z",
                "reviewBody": "I didn't make any changes and the recipe was wonderful. However I bought some jalapeno peppers from the fresh market near our home and they were the hottest jalapenos I have ever eaten. I love them because when removing the membranes and seeds they are always great on flavor and kick. But these were so hot the quesadillas were too hot to eat and burned your mouth lips and throat for 20 minutes after. Now I'm not a sissy when it comes to hot stuff. We use Siracha on almost everything. But these were hotter than habaneros or any other chili I have ever used. I will try the recipe again and I know the heat of the peppers has nothing to do with the recipe; I just wanted to share our hot pepper experience. Thank you for the recipe. Debbie",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7989173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-22T05:40:36.597Z",
                "reviewBody": "Made these as an appetizer tonight for a clam bake. Made the recipe for 10. Cooked them on my le creuset grill pan. Learned a few things: I started with whole wheat tortilla and a non stick pan but it didn't work well. Switched to flour tortilla and the grill pan and it worked brilliantly. Because of the size of my grill pan Deeli's suggestion of using two stacked tortillas instead of one folded one did not work quite as well. I split the jalapenos and scraped out the seeds and membrane with my fingertip. I had a little eczema or something between a couple of my fingers on both hands. And then they started burning.... burning.... burning..... I tried a few tricks and they worked - in this order: washed hands with oil-dissolving dish detergent - that didn't work too well then I did a thick paste of water and baking soda which I left on to let dry - may be a bit better. Then I rubbed a tablespoon of olive oil between my fingers for about 3 minutes - this really seemed to do the trick. I know it was stupid - next time I'm heeding the warning and wearing gloves. This is a great recipe easily tailored to individual tastes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Helen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2055039/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Jalapeno Popper Quesadillas",
            "description": "Your favorite snack with a spicy kick!",
            "uploadDate": "2017-01-09T04:08:54.602Z",
            "duration": "PT54.638S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fada22f49-6b18-4db9-b4c3-f96c5db98701%2F40c7f317-6a3c-4755-b77d-b9df375ae48f%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5275087344001"
        }
    }
]