[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16543/main-dish/pork/pulled-pork/",
                    "name": "Pulled Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25147/sarges-ez-pulled-pork-bbq/",
        "name": "Sarge's EZ Pulled Pork BBQ",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F778533.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2019-04-02T06:43:00.000Z",
        "description": "Too busy to cook? A slow cooker and a can of beef broth gets you started on this recipe. 'Low and slow' cooking gives you a roast that shreds with a fork. As an added bonus you get great stock for beef gravy as a by-product! Serve with your favorite BBQ sauce and plenty of coleslaw.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT8H0M",
        "totalTime": "P0DT8H10M",
        "recipeYield": "8 to 10 servings",
        "recipeIngredient": [
            "1 (5 pound) pork butt roast",
            "salt and pepper to taste",
            "1 (14 ounce) can beef broth",
            "¼ cup brewed coffee"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut roast in half. Rub each half with salt and pepper, and place in the slow cooker. Pour broth and coffee over the meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the slow cooker to Low, and cover. Cook  for 6 to 8 hours, or until the roast is fork tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Carefully remove the roast to a cutting board. Pull the meat off the bone with a fork. You may also chop it with a cleaver afterwards, if you like it really finely cut.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pulled Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sgt.Rock"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7204767063921995,
            "ratingCount": 923,
            "itemReviewed": "Sarge's EZ Pulled Pork BBQ",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "269.7 calories",
            "carbohydrateContent": null,
            "cholesterolContent": "85.3 mg",
            "fatContent": "18.8 g",
            "fiberContent": null,
            "proteinContent": "23.4 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "196 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-29T06:28:23.733Z",
                "reviewBody": "Excellent, but this recipe can be made even easier.  (For other reviewers who are browning the meat - there's really no need. Since it's shredded, browning the meat doesn't add much to the flavor or color.)  I just put the pork in, even without salting it sometimes, then pour about 2/3 to a full bottle of BBQ sauce on top and cook on low for 6-8 hrs. or high for 4-5 hrs.  Adding the beef broth just makes it soupy and the pork gives off a lot of juice while cooking anyway. BBQ sauce alone can tenderize the pork perfectly.  And I tried with and without coffee and it made no difference in flavor or tenderness - so don't bother.  When pork is done, I shred the pork, add the remaining BBQ sauce or how ever much you want and let it sit in the crock pot on high for another 30-1hr to heat through.  I like Stubbs Original BBQ sauce (a little spicy) or Stubbs Mesquite BBQ sauce (thick & sweet) or mix 1/2 and 1/2 of each. Eat with warm Kaiser buns and you're in heaven.  So easy to make but taste like a lot of work.  Awesome dish!  Finish off with a slice of Coconut Sour Cream Cake (from this website) and you're transported to Southern Heaven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-02T23:31:53.243Z",
                "reviewBody": "This pork turned out soo tender and moist!  I used a 9 pound bone-in pork shoulder and trimmed it down to fit into my crock pot.  I added a can of beef broth (left out the coffee b/c the roast will give off a lot of natural juices) and some salt and pepper and put the lid on it and let it do its thing in the pot for 8 hours.  The next morning my apartment smelled awesome and I shredded it and had the pulled pork all ready for Sunday dinner!  Come sunday, I put the meat back in the crock pot with a bottle of Baby's Ray's and let my guests dish out their own sandwiches.  My advice to someone who wants to do Pulled pork, use the shoulder or butt portion roast.  I wouldn't waste a cut like tenderloin on some thing like this.  The long, slow cooking toughens a cut like tenderloin, whereas a cut like the shoulder has lots of connective tissue and fat thatt softens as its cooked.  Save the tenderloin for shorter cooking times.  This is a really easy recipe to follow and turns out really well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NCRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1426180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T00:29:07.59Z",
                "reviewBody": "I made this tonight and my husband just about died - he loved this so much! He says it is the best pulled pork sandwich he has ever had!  He also said this was the best thing I ever cooked (and I am a fairly good cook). I agree - it is really good! We usually drive 40 minutes to a restaurant in Maine so he can get a pulled pork sandwich. We are going to save money and a lot on gas now! I made a smaller roast because my crock pot is small, so I cut the recipe in half. (Our 2.5 lb. roast made about 5 good-sized sandwiches.) I used Hunt's BBQ \"Hickory\" sauce and it was perfect (not too sweet and slightly smokey). I added a small amount to the shredded pork and then we added extra on our sandwiches as needed. I served the shredded pork on toasted kaiser rolls. Really good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Punkintoze",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-13T04:04:53.86Z",
                "reviewBody": "Outstanding, Sarge!!!  I was leary because I've never made pulled pork before, but this was soooooo easy to complete and the flavor was just incredible with my homemade BBQ sauce.  I made a small tweak by adding 1 teaspoon of liquid smoke to the broth.  Started it at midnight in a slow cooker on Low and went to bed.\n\nI wasn't sure what to do with all that broth the next morning, but reading the various reviews I went ahead and removed the shoulder from my cooker (about 11am) then poured the broth out into a large gravy separator.  Pulled the pork apart on a tray with forks (being careful not to overdo it and make it too fine) then returned it to the cooker.  Added 1 ladle of the broth back in ... along with 3 cups of my BBQ sauce.  Cooked it one more hour then served on kaiser rolls with side dishes.  Oh Wow!!!  None of us could believe how great this turned out.  Everyone was commenting on it and nobody could stop with just one sandwich.  \n\nI can't see eating the pork without a BBQ sauce or gravy as some reviewers commented, but with the right sauce - this is a definite HOME RUN !!!   Thanks, Sarge.  I'm making this again when family comes to town in two weeks.  They'll love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jstoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2371011/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-04T23:59:32.733Z",
                "reviewBody": "Great..but! I've combined this and another recipe I've read somewhere and have experimented with an effort to get the most taste with the least work. I've used the following about ten times and guarantee you it's impossible to miss. Pepper then brown the pork (shoulder or butt the cheap cuts) stick it in the slow cooker pour 1/2-3/4 bottle of your favorite bbq sauce on it wait 8-10 hours debone and remove any leftover chunks of fat shred the meat put it back in the cooker on high mix well with the balance of the bbq sauce wait 1/2 to 1 hour serve on buns (with good beer).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/486785/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-15T12:40:10.733Z",
                "reviewBody": "Oh wow! Absolutely scrumptious! I read most of the reviews and took some of those suggestions when making this. I added three minced cloves of garlic and some onion flakes. I sprinkled the roast with salt & pepper and then seared it before putting it in the slow cooker. It cooked all day and smelled delicious when we got home. After six hours it really did fall apart easily. I took about a third of the meat and placed it in a pot on the stove. I added the season broth and BBQ sauce. Sweet! The plain meat itself appeared dry at first but then we put the \"au ju\" as my hubby called the seasoned broth on the shredded pork and placed it back in the slow cooker. Delicious! My hubby was very impressed and had two of each sandwich...plain and BBQ. That was his birthday dinner and he loved it! Thank you! It's a sure bet I'll be making this again in the future!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOMMYSQUARED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1088294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-05T15:28:28.293Z",
                "reviewBody": "I have tried a lot of pulled pork recipes with a ton of ingredients and steps. But not one of them compares to this. It is fantastic. And it is so easy! I never use any other recipe. I add 3 cloves of cracked garlic to the liquids.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Stephan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/996744/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-03T16:00:10.877Z",
                "reviewBody": "WOW! I can't believe I actually made something this good! Based on other reviews I also added liquid smoke and a jar of BBQ sauce and upped the coffee to 1 cup. I also added Worchestire sauce a packet of Lipton Onion Soup Mix and 2 sm cans of tomato paste for thickness and a touch of sweetness. My husband LOVED it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1058166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T18:03:59.803Z",
                "reviewBody": "Great recipe. I cooked it on high for just half the time (around 4 hours). I served it with warm BBQ sauce and kaiser rolls baked beans cole slaw and sweet tea! I perfect southern meal for Father's Day for my husband. I have learned that it is best to quickly brown (on all sides) on the stove any roast you will do in the crock pot before putting it in the pot. It gives it a little color and more flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FREDRICA2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/672383/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-19T21:40:33.16Z",
                "reviewBody": "I was so excited to try this after all the great reviews. It was definitely tender but the flavor was very bland. I even added some pork bbq spice. If I decide to make it again I will need to step up the flavor profile 10 fold. If you are a big bbq fan - you will probably be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "lovetocook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2199739/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Sarge's EZ Pulled Pork BBQ",
            "description": "This pulled pork is so easy to make in your slow cooker.",
            "uploadDate": "2012-09-21T18:15:44.676Z",
            "duration": "PT2M25.145S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F71a434c1-d43f-4d69-a027-5fcfd4f8e693%2F9df6a68b-524a-4bd9-9a02-50f444714944%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1854023333001"
        }
    }
]