[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/237992/roasted-greek-chicken/",
        "name": "Roasted Greek Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2649248.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "2019-04-02T07:03:20.000Z",
        "description": "Juicy, flavorful chicken meat with a crispy skin. Tastes wonderful and is super simple to make.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 chicken leg quarters, with bone and skin",
            "¼ cup olive oil",
            "4 lemons, halved",
            "4 teaspoons dried oregano",
            "4 teaspoons dried basil",
            "4 teaspoons garlic powder",
            "4 teaspoons salt",
            "4 teaspoons ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place chicken legs in a deep, large baking dish. Massage 1 tablespoon olive oil onto each chicken leg. Squeeze lemon juice over the chicken. Arrange lemons around the chicken.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix oregano, basil, garlic powder, salt, and pepper together in a bowl; sprinkle evenly over each chicken leg, flipping the chicken to season both sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook chicken in the preheated oven until no longer pink at the bone and the juices run clear, about 1 hour 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "GatorJess"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.607407407407408,
            "ratingCount": 135,
            "itemReviewed": "Roasted Greek Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "516.4 calories",
            "carbohydrateContent": "16.8 g",
            "cholesterolContent": "139.8 mg",
            "fatContent": "34.6 g",
            "fiberContent": "7.1 g",
            "proteinContent": "41.9 g",
            "saturatedFatContent": "7.6 g",
            "servingSize": null,
            "sodiumContent": "2463.6 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-06-07T17:25:19.693Z",
                "reviewBody": "I have been making this for years.  This is a family favorite.  I also add potatoes cut into wedges with the chicken to cook.  Make a nice salad to complete the meal.  You can't go wrong with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dorieruiz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4785240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-17T21:06:35.503Z",
                "reviewBody": "Juicy and Flavorful are the first 2 words I can use to describe this dish! You may think from looking at the ingredients like I did that 1 lemon per chicken is too much, but please do yourself a favor and just try the recipe all the way through you just can't be disappointed. Only thing is i used sea salt because chicken can be bland and a little of cayenne pepper for some added spiciness! And every 30 minutes I opened the oven and based the chicken with the juices that was at the bottom of my glass dish to keep the chicken moist and flavorful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs. Peterson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4636324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-10T00:08:32.49Z",
                "reviewBody": "Very nice and simple recipe. The skin was crispy and the lemon complimented the seasoning well. The recipe doesn't say, but I baked skin side up, uncovered.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "td",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13729579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-23T03:43:05.35Z",
                "reviewBody": "I have never left a rating for any recipe before but after making this recipe every week for a couple months I felt I should share my experience. You see, I have six children ages 6-16 and after all my years of cooking for them, this is literally the only recipe that EVERY one of them love and ask for often. I usually have to make two different chicken recipes simultaneously to please both camps of tastes but this one is perfect and quick! don't change anything in the recipe other than using refrigerated lemon juice instead of fresh lemons, oh, and quadrupling the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alisa Rossini",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1638960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-17T02:58:01.387Z",
                "reviewBody": "I have made a similar dish for years but thought I'd try this one. I used a total of 15 drumsticks and approximately 10 thighs (I have a big eating family and we LOVE leftovers)! I just rubbed a little olive oil over each piece of chicken then seasoned with kosher salt and some black pepper. Mixed approx.. 1/3 cup each of basil and oregano a bit of garlic powder since I added approx.. 10 cloves of fresh garlic over chicken before baking. Added just a bit of salt and pepper to the spice mix and a bit of adobe over chicken pieces. Cut approx.. 5 lemons in quarters squeezed over chicken in my roasting pan which was coated with a pad of melted butter and threw the remainder of the lemons in the pan. Placed roasting pan in oven at 350 degrees for approx.. 1 hr. And then added about 8 potatoes cut in wedges which were dredged in remainder of spice mix and lemon. Since I had so much chicken and potatoes I baked for approximately 1 more hour basting occasionally and re-positioning chicken/potatoes so everything got browned and crispy. Served with steamed brussel sprouts and my entire family from 10-55 years LOVED IT! Most of them had 3 helpings! Thanks so much for the recipe it was FABULOUS! Next time I will add some Portobello mushrooms. Bon Appétit",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annie'sKitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4588844/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-07-22T12:26:54.71Z",
                "reviewBody": "I made this with only chicken legs and omitted the olive oil (the cooking time was only about 45 minutes).  It made the most delicious sauce that I spooned over pilaf. My young boys ate 4 pieces each.  Delicious, SO easy and healthy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Civiello",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3173719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-08T18:54:01.45Z",
                "reviewBody": "Made this last night and I loved it. The chicken came out so moist and I loved the taste of the skin with all the spices. (It wasn't spicy just a nice blend with nice flavor.) I didn't have real lemons (my husband don't like lemon) so I wasn't able to bake it with the lemons but I did put lemon juice on it before I put the spices on. Next time I think I will add a tad bit more garlic and maybe try onion as well. To me this craves to be made and served with mash potatoes and veggie of your choice. (Unfortunately my husband wasn't feeling well and he couldn't taste anything but he did comment on how moist they were.) It was a huge hit with me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "susanslomski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3248394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-05T02:58:29.867Z",
                "reviewBody": "I loved this recipe! Very simple and easy. I only had 6 legs so I only used 2 lemons, 3 teaspoons of everything that called for 4 teaspoons except the salt because I only had garlic salt instead of garlic powder, so I only add 1 teaspoon of kosher salt and about 1/2 teaspoon cajun pepper....I baked them for about an hour in a half uncovered flipping them and basting every 20 minutes! They were very juicy and fall off the bone amazing! Will definitely do this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chisholm's",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13865322/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-24T18:11:29.05Z",
                "reviewBody": "This flavor combination is worth 10 stars!  Use the seasoning and lemon to taste and this will be one of your favorite ways to cook chicken.  For 12 chicken legs, I lightly coat with olive oil and use half the amount of seasoning and lemon called for, which makes it perfect for us.  When I have no lemons, bottled lemon juice works well. I tried it with potatoes, but much prefer to cook the potatoes and chicken separately in shallow baking pans and baste the potatoes with some of the drippings each time I baste the chicken. One time I  had to leave these in the oven for an extra hour after they had reached temp, so I turned the oven to 180 and let them sit and they were so good, I do it this way whenever I have the time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vjc333",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1788901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-01-14T03:04:05.460Z",
                "reviewBody": "Great chicken recipe! I have made this for years and was taught by my Italian grandmother. No olives no mint no fennel no thyme? Greek and Italian foods have similar flavor palettes. To differentiate I would add green olives capers rosemary fennel fresh garlic. Perfect recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "genibean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5605780/"
                }
            }
        ]
    }
]