[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/712/world-cuisine/european/eastern-european/",
                    "name": "Eastern European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/716/world-cuisine/european/eastern-european/russian/",
                    "name": "Russian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25202/beef-stroganoff-iii/",
        "name": "Beef Stroganoff III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F795486.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2019-04-02T06:43:03.000Z",
        "description": "I have been making this recipe for over 20 years. This can be served over either rice or noodles. A little work but worth the effort.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "6 to 8 servings",
        "recipeIngredient": [
            "2 pounds beef chuck roast",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper",
            "4 ounces butter",
            "4 green onions, sliced (white parts only)",
            "4 tablespoons all-purpose flour",
            "1 (10.5 ounce) can condensed beef broth",
            "1 teaspoon prepared mustard",
            "1 (6 ounce) can sliced mushrooms, drained",
            "⅓ cup sour cream",
            "⅓ cup white wine",
            "salt to taste",
            "ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove any fat and gristle from the roast and cut into strips 1/2 inch thick by 2 inches long. Season with 1/2 teaspoon of both salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, melt the butter and brown the beef strips quickly, then push the beef strips off to one side. Add the onions and cook slowly for 3 to 5 minutes, then push to the side with the beef strips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the flour into the juices on the empty side of the pan. Pour in beef broth and bring to a boil, stirring constantly. Lower the heat and stir in mustard. Cover and simmer for 1 hour or until the meat is tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Five minutes before serving, stir in the mushrooms, sour cream, and white wine. Heat briefly then salt and pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Eastern European",
            "Russian"
        ],
        "recipeCuisine": [
            "European",
            "Eastern European",
            "Russian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Donna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.59979702300406,
            "ratingCount": 2956,
            "itemReviewed": "Beef Stroganoff III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "303.5 calories",
            "carbohydrateContent": "5.7 g",
            "cholesterolContent": "82.8 mg",
            "fatContent": "23 g",
            "fiberContent": "0.9 g",
            "proteinContent": "16.6 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "619.5 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-01-06T03:54:40.91Z",
                "reviewBody": "I made this stroganoff several times and it has now become a staple fancy dish! My boyfriend (now husband 7/2006) claims this is his all time favorite dish that I make. Over time I made a few modifications to this recipe:\n(1) Marinate the meat in red or white wine for 1-2 hrs in the fridge prior to cooking. This adds a really nice flavor to the beef and tenderizes the meat, and you can skip the addition of the wine at the end as this can thin out the sauce.\n(2)  Use 1 medium yellow onion (sliced or chopped) and use the green onions for garnish instead.\n(3)  Garlic is a must (be liberal unless you are on a date)!\n(4)  Corn starch works just as well as flour or you can also use 2 tbsp of each. I found it easier to dissolve them in a few tbsp of beef broth before adding it to the skillet otherwise it's really difficult to dissolve flour/corn starch in the sauce.\n(5)  Add 1 tbsp Worcestershire sauce along with the prepared mustard.\n(6)  Add two cans (4 oz each) of sliced mushrooms and simmer with the beef instead of at the end of cook time. Fresh sliced mushrooms (8 oz) work well also.\n(7)  Add 1/3 cup cream cheese and 1/3 cup sour cream that the end--trust me this is key!!\nTIP: found it VERY difficult to push aside the browned meat and then cook the onions and add the flour to the skillet the first few times I made this. Instead, I now remove the browned meat to a plate, cook the onion by itself, and then return the meat back to the pan and add broth with dissolved flour/starch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BeezlyS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/beezlys/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-12T16:15:07.39Z",
                "reviewBody": "This was the best beef stroganoff I've ever had!  I did marinate the beef in red wine.  I also used yellow onions instead of the green onions. I did also add 1 TBSP. minced garlic. I added 2 TBSP of cornstarch to the beef broth before adding it to the pan and cut the flour to 2 TBSP.  I found it easier to take the meat and onions out while thickening the sauce and then adding them back to the pan.  I let this simmer for about an hour and a half and the meat was really tender.  I think you could put it in a crock pot too and that would be delicious.  At the end I added 1/3 c. cream cheese and 1/3 c. sour cream and omitted the white wine since I marinated in red. The cream cheese was a great addition which I saw from another reviewer. It was absolutely delicious!!!  My 17 month old daughter loved it.  This will be a staple in our home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Henley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/674916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-01T15:05:54.623Z",
                "reviewBody": "\"I'm speechless.  I'm actionless.  All i can do is sit here and revel in how good this is!\"  Direct quote from husband.  We did follow the suggestions of other reviewers:  omitted butter (used non-stick frying pan) for healthier meal; used sirloin instead of beef chuck; added 1 Tbs. Worchestershire sauce;  added two garlic cloves; used 1 diced yellow onion instead of green onions; and used fresh mushrooms.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "YEKEPA79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1367658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-10T22:06:50.67Z",
                "reviewBody": "Perfect without any changes as far as I am concerned. I don't rate recipes a 5 if they need changing to be right.\n\nAs for the food snob that thinks if a home cook can make it it only deserves 3 stars....get a life! Some of us have other things to do other than wreck a simple recipe by fooling around all day trying to be a \"chef\". Simple is often better.\n\nThis is delicious and doesn't taste like a \"simple\" recipe. Don't be put off by the snobs!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mega Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1587260/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-06T20:01:14.737Z",
                "reviewBody": "This is fantastic!!! I’ve used this recipe for Stroganoff several times with only minor changes … used fresh (sautéed) mushrooms and eliminated the white wine (because it thinned the sauce too much) and my family has always enjoyed it.  But, after reading some of the reviews, I decided to try marinating the beef (sirloin) in red wine for a couple of hours and added a chopped clove of garlic (at the same time the green onions were added).  These two changes along with using the fresh mushrooms have made this an absolute family favorite. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURENH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1049094/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-14T22:16:43.427Z",
                "reviewBody": "This is some of the best beef stroganoff ever!  I used sirloin instead of chuck roast and let that marinate in red wine, garlic, and Worcestershire for two hours before cooking.  I cooked that then plated it.  I used a combination of green onions and vidalia, fresh mushrooms instead of canned, 1 Tbsp. of Worcestershire, white wine and minced garlic.  After I added the meat back in I reserved a bit of the broth to mix with 2 Tbsp. of corn starch.  I added that to thicken then added the sour cream and a bit of cream cheese. This was fabulous served over egg noodles - YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-04T02:40:22.26Z",
                "reviewBody": "Mercy!  This one offers up a most incredible flavor, a unique combination of down-home and exotic.  The recipe as written is no doubt wonderful, but I improvised a bit based on experience, instinct and what I had available.  I followed suggestion of marinating the beef in red wine.  Then, because the wine permeated the dish all through, because of the beef marinade, I didn't add the white wine in at the end.  I also added 1/3 cup of cream cheese as recommended by other reviewers.  That part was fine, but I'm not so sure the extra calories are worth it.  I didn't detect a significant difference in the flavor pre cream cheese to post cream cheese.  I used real mushrooms, not canned.  That is highly recommended. I sauteed the mushrooms with the green onions and removed them from the skillet to the same bowl where I rested the beef.  Too, I used light sour cream. Hey, there is enough richness in the recipe, using light sour cream will not make one iota of difference.  I served the recipe on packaged noodles.  I'll try rice next time.  Even my picky wife, who shuns flavors that depart from basic meat and potatoes--especially dishes involving wine--said she \"loved it.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-03T04:38:24.92Z",
                "reviewBody": "Absolutely Wonderful! As suggested by previous cooks, I marinated the beef in a white wine for a few hours and then didn't add any wine at the end (used a little extra broth instead). I used a whole yellow onion instead of the green. It seemed like a lot of onion and I was nervous at first, but after an hour of simmering, they practically diappeared. Just before the hour of simmering, I added 2 cloves of finely chopped garlic, 1/2 tsp of worcheschire sauce, and 1/2 tsp of Jack Daniels mustard. It was sooo good! It was slightly difficult mixing it all in one pan, but it all turned out great! It made just enough for 2 large helpings, and an extra bowl for leftovers tomorrow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1483599/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-27T15:01:37.937Z",
                "reviewBody": "GREAT recipe! I have made stroganoff over and over before trying this recipe and never gotten it right. This time, for the first time, it worked. I did use sherry instead of wine, *fresh* mushrooms, and beef bouillion, not stock. But is was YUMMY! Great recipe even for a klutz like me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinginColorado",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/479090/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-19T01:36:09.767Z",
                "reviewBody": "This recipe is okay. There is a beef stroganoff recipe on the back of the Campbells beef broth can that is so much better (and easier!). The mustard gives it great flavor, but to me the butter is overkill. It's just too much. I cut the amount of butter down and you were still able to taste it. I used top sirloin instead of chuck roast, added 1T of worcestshire sauce, and it turned out better. I didn't have green onions, so I didn't add those. Also, I skipped simmering it for an hour. I just brown the meat, then do the rest immediately. It turned out fine! Also, to avoid the flour clumping situation, don't add it directly to the skillet. I mixed it with the beef broth in a bowl, then added the mixture to the skillet. Overall, it's an okay recipe, but I think I'll stick to the Campbells one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimiko Proctor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892522/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Beef Stroganoff III",
            "description": "See how to make a 5-star beef stroganoff recipe.",
            "uploadDate": "2012-05-04T23:12:23.732Z",
            "duration": "PT3M17.572S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3e8905ee-c592-48f1-9bc6-b75285e1b271%2F772f27f4-3424-4e4c-bbd3-8b09ff506fe7%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1622233912001"
        }
    }
]