[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/445/soups-stews-and-chili/soup/beef-soup/",
                    "name": "Beef Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/239488/low-carb-beef-cabbage-stew/",
        "name": "Low-Carb Beef Cabbage Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1600789.jpg",
            "width": 5184,
            "height": 3456
        },
        "datePublished": "2019-04-02T07:03:45.000Z",
        "description": "I modified another recipe on this site for South Beach Diet&reg; Phase 1. Not only is it on my diet, but it tastes delicious! Garnish each serving with sour cream.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H5M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds <a href=\"https://www.allrecipes.com/recipe/14685/slow-cooker-beef-stew-i/\" aria-label=\"beef stew\">beef stew</a> meat, trimmed and cut into 1-inch cubes",
            "1 cube beef bouillon",
            "1 ⅓ cups hot chicken broth",
            "2 large onions, coarsely chopped",
            "1 teaspoon Greek seasoning",
            "¼ teaspoon ground black pepper",
            "2 bay leaves",
            "1 (8 ounce) package shredded cabbage",
            "5 stalks celery, sliced",
            "1 (8 ounce) can whole plum tomatoes, coarsely chopped",
            "1 (8 ounce) can tomato sauce",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cook and stir beef in a large saucepan or Dutch oven until browned, about 5 minutes; drain excess grease.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir beef bouillon into chicken broth in a bowl until dissolved; add to beef.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix onions, Greek seasoning, black pepper, and bay leaves into broth-beef mixture; cover saucepan and simmer until beef is tender, about 1 hour 15 minutes. Add cabbage and celery to broth-beef mixture; cover saucepan and simmer until celery is tender, about 30 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir plum tomatoes, tomato sauce, and salt into broth-beef mixture and simmer, uncovered, until stew is slightly thickened, 15 to 20 minutes. Remove and discard bay leaves before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Beef Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "M. Ecker"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8,
            "ratingCount": 50,
            "itemReviewed": "Low-Carb Beef Cabbage Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "371.9 calories",
            "carbohydrateContent": "9 g",
            "cholesterolContent": "99.5 mg",
            "fatContent": "22.7 g",
            "fiberContent": "2.4 g",
            "proteinContent": "31.8 g",
            "saturatedFatContent": "8.9 g",
            "servingSize": null,
            "sodiumContent": "612.1 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-07-06T01:42:53.393Z",
                "reviewBody": "This is one of the best stews I have ever made!! Bursting with flavor, thick and savory. I made it exactly how the recipe said and I will most definitely be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marissa Welch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14319045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-31T13:07:48.573Z",
                "reviewBody": "This was wonderful! I changed a few things only because I wanted to use what I had in my pantry and frig: My package of stew meat was a little larger than 2 lbs, so I used it all; I used an entire can of chicken broth to avoid waste; my cabbage came in a 16 oz pkg and I used most of it (next time I will use all of it); I used a 16 oz can of diced tomatoes since 8 oz cans are hard to find; my tomato sauce had garlic, basil, and oregano in it. This is definitely a keeper and a stew I will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/paula1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-30T06:08:54.64Z",
                "reviewBody": "This is a great low carb meal.  After browning the meat, I took the meat out and sautéed the onions in the dripping until they were brown --which added another dimension to the taste.  After the onions were brown I added four cloves of garlic and the greek seasoning and sautéed those spices for a few minutes.    I almost doubled the cabbage, used the whole 14 ounce can of tomatoes.  A splash of vinegar and a splash of wine enhanced the finished stew.  Yum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elaine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5061007/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-08T05:59:17.597Z",
                "reviewBody": "I made this but didn't want to use the beef bouillon cube so just used beef broth instead. I had a green head of cabbage leftover so used that instead of bagged so I had to double the liquid to cover all the cabbage and beef. The Greek seasoning I had to find on this site by another reviewer. Added that after I browned the beef. It was delicious! My mistake was adding a can of diced tomatoes to it since I didn't have plum tomatoes or sauce. It changed the flavor dramatically! It was okay according to my husband but will try again without tomatoes. The Greek seasoning made this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13760023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-28T16:03:04.857Z",
                "reviewBody": "I grew up on this stew! My Russian grandmother made it all the time! Sometimes she would add carrots if she had some on hand, and there were always potatoes too, otherwise this is spot on and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Yonchuk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2838801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-03-11T10:25:24.287Z",
                "reviewBody": "Made a few changes and the outcome was very delicious. I didn't have greek seasoning, so I looked it up and made something pretty close to it. I added the seasoning to the meat as it browned, along with the juice of one lemon. I realized at this point that my meat chunks were too big so I took them out of the pan, poured out the drippings, cut the meat into smaller pieces, then added them back to the pan along with a couple splashes of italian dressing. Once the meat was browned, I removed it from the pan and sauteed the onions in the new drippings. I also added about 2 tbsp of greek dressing that was leftover from a takeout meal. I had 1/2 a green bell pepper left in the fridge, so I chopped it up and threw half of them in at this point. After the onions and peppers were soft, I added 3 cloves of garlic, minced, and more of my \"almost\" greek seasoning mix. Then I added the beef back to the pan and poured in enough low sodium beef broth to just cover the beef (about 2 1/2 cups). After the hour and 15 minutes, I added the rest of the chopped green pepper and 1 1/2 cups sliced baby carrots along with the celery and two 10.5 oz bags of shredded cabbage. I needed a to add a little more liquid at this point, but didn't have anymore beef broth, so I used about 3/4 cup chicken stock because that's all I had on hand. Had to let it simmer for 45 minutes instead of 30 so the carrots could soften a little more. With the 8 oz can of tomato sauce, I used a 14.5 oz can of diced tomatoes wi",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "smviolante",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9682724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-01-08T21:47:02.963Z",
                "reviewBody": "Great hearty soup - I did make a few changes. Based on reviews I also used beef broth. I also used 16 oz of shredded cabbage (which happened to be cole slaw mix so a bit of carrot in it) to use the whole package and a 16 oz can of fire roasted diced tomatoes. I increased the Greek seasoning to 2 tsp and used additional broth (I think due to additional cabbage it needed extra broth which diluted the original seasoning measurement). I also cooked the celery and onion in the runoff from browning the beef and then added tomatoes and everything but cabbage in the beginning to allow the onions tomatoes and seasonings time to combine flavors. I cooked on low simmer for an hour then added cabbage. I cooked a little longer than instructed just because I had time which allowed broth to reduce and thicken a bit which intensified flavor. A big hit - will make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "thrashley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thrashley/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-31T14:12:13.477Z",
                "reviewBody": "I started this recipe by making my own Greek seasoning using the seasoning recipe I found in this app. Yummy! I then doubled the stew recipe and used fire roasted tomatoes rather than plum. I cooked in a cast iron Dutch oven and my cooking times were a little shorter. I had unexpected visitors while it cooked and they thought it was delicious! The broth is quite flavorful and it makes a hearty meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FiveSinksFarm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fivesinksfarm/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-26T04:11:45.94Z",
                "reviewBody": "I love this recipe! I followed everything precisely and it was delicious. It fed my boyfriend and I plus gave me lunch for a week. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janine Patterson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7823219/"
                }
            }
        ]
    }
]