[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/239909/ground-beef-and-chopped-cabbage/",
        "name": "Ground Beef and Chopped Cabbage",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1958297.jpg",
            "width": 6768,
            "height": 6768
        },
        "datePublished": "2019-04-02T07:03:55.000Z",
        "description": "This is a hearty meal that's easy to make and keeps well. I use a slotted spoon to serve it with rice and sweet cornbread.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "1 large onion, chopped",
            "1 ½ pounds ground beef",
            "1 teaspoon garlic powder",
            "½ teaspoon red pepper flakes",
            "½ teaspoon Italian seasoning",
            "salt and pepper to taste",
            "1 small head cabbage, chopped",
            "2 (14.5 ounce) cans diced tomatoes",
            "1 (14.5 ounce) can tomato sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a large heavy pot or a 6-quart Dutch oven over medium heat. Cook and stir onion in hot oil until translucent, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Break ground beef into small chunks and add to the pot; cook and stir, continuing to break the beef into smaller pieces, until the beef is completely browned, 5 to 7 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season beef mixture with garlic powder, red pepper flakes, Italian seasoning, and a dash of salt. Stir cabbage, diced tomatoes, and tomato sauce with the beef mixture; bring to a boil, reduce heat to low, and cook mixture at a simmer until cabbage is fork-tender, about 25 minutes. Season with salt and pepper.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "slygusa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.493421052631579,
            "ratingCount": 152,
            "itemReviewed": "Ground Beef and Chopped Cabbage",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "178 calories",
            "carbohydrateContent": "8.7 g",
            "cholesterolContent": "42.6 mg",
            "fatContent": "9.7 g",
            "fiberContent": "2.8 g",
            "proteinContent": "13.3 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "204.4 mg",
            "sugarContent": "5.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-02-26T11:43:00.217Z",
                "reviewBody": "Ground Beef & Chopped Cabbage Haiku: \"Reduced for 1 lb., (and used one can tomatoes.) Needs more seasoning.\"Gotta say that for the ease of prep (and I used a bag of coleslaw mix for the cabbage, making this even easier!) this was nice, comfort food. Had a bite while it was simmering and ended up adding probably 1/2 tsp. more Italian seasoning, along w/ 1/4 tsp. paprika, 1/4 tsp. celery seed, and heavy s&p, as it was a bit lacking in flavor department. (We usually eat our cabbage moosh-mosh dishes w/ kielbasa rather than ground beef, which gives it more flavor, so this just kinda needed a kick. The other kick we gave it was some Sriracha sauce at the table.) Makes a ton, even though I dropped the meat to a pound and the tomatoes to one can, but the leftovers were equally as good, and I imagine that it would also freeze well too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock_lobster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rocklobster/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-17T01:07:56.553Z",
                "reviewBody": "Easy recipe and delicious too.  I added beef broth for added flavor.  I will be making this again.  Thank you for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ginger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15135853/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-17T20:04:33.87Z",
                "reviewBody": "This was a satisfying meal, nothing fancy, but just good, old-fashioned, home-cooked food.  I did find it a bit little weak on flavor, so I did add more seasoning.  Enjoyed, and thanks for sharing your recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-05T03:24:51.427Z",
                "reviewBody": "12-4-2017  ~ I’ve turned out some pretty good things in the kitchen strictly with the purpose in mind of using limited ingredients at hand.  This was the case here.  I suppose I’m unusual for routinely going back and forth from our homes in Wisconsin and in Naples, FL with boxes of produce cleared out from the fridge that I don’t want to waste.  The particular head of cabbage I used for this dish today made the journey here twice, and I was determined NOT to pack it in a suitcase for the third time!  I started out by sautéing a few strips of chopped bacon, then cooked the onions in the bacon fat.  This, I knew, would add another dimension of flavor.  Not a fan of “Italian seasoning,” I seasoned it up with a couple of cloves of fresh minced garlic rather than garlic powder (had the garlic in the suitcase too), basil, oregano, Worcestershire sauce, and Montreal Steak Seasoning - and a couple extra globs of butter didn’t hurt either.  I added fresh mushrooms (yep, brought down here with me in the suitcase).  I eliminated the red pepper flakes, the added bite not being necessary for me.  This is simple, home cooked comfort food, good as is, but there’s nothing wrong with embellishing it a bit. I found this “Suitcase Supper” quite pleasant and very satisfying. Note:  Ideally I think this would be even better with the addition of some rice, but since I restrict carbs I restrained myself from that enticing option.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-05T13:40:06.027Z",
                "reviewBody": "I made several changes! Instead of ground beef I used  ground chicken and \"hot chicken\" sausage, which gave this dish more flavor  and zip! Along with that I used one can each of hot and medium \"Rotel\" and one can of diced tomatoes instead of tomato sauce! Also Kosher salt and pepper to taste! Everything else was as called for. Many comments on this recipe mentioned it being a little bland but with my changes it was excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Biddy Sparks Lamb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17191707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-19T00:50:09.603Z",
                "reviewBody": "I really liked this.  I didn't really measure the ingredients, but used only a pound of ground beef, great low carb meal, really filling n made plenty of left overs for me. my kids 2 &4 not really interested in it, bur then again I wasn't expecting them to",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yellowdaizeez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14373735/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-09-27T07:10:38.803Z",
                "reviewBody": "This was delicious. I don't measure my seasonings and I just add whatever seems will taste good. With that said I used thyme and herbs de Provence, black pepper and herbed salt along with Worcestershire sauce,  garlic, red and sweet onion, ground turkey instead of beef, shredded carrots, eggplant that I had leftover, cabbage, Rotel tomatoes with green chilies, a can of stewed tomatoes AND a can of white beans. We splashed on some hot sauce at the table and it was fantastic. Would make again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Darlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8108349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-02-15T05:27:43.41Z",
                "reviewBody": "I really enjoy this dish! I’ve made it several times now, followed tips from others... more seasoning needed. I used 2T fresh minced garlic, 1T kosher salt, 1T Italian seasoning, 2t crushed red pepper. Also added 1t better than bouillon beef broth (blended in 1/4c hot water) to beef after browned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Terri Hazelwood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13312810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-05T08:55:27.633Z",
                "reviewBody": "I was thinking of making cabbage rolls this evening but remembered I had this recipe in my favs.  So glad, too because it was super easy and quick to make.  Just want to say that I am glad there are reviews that show what people do differently because it really helps to cater to the different tastes in my family.  So, on that note... I added mild Italian sausage with ground chicken and I use real garlic instead of the powder.  Added some shredded carrots and followed the rest of the recipe.  I love the idea of rice, but hubby doesn't, so I made that on the side for whoever wanted to add it.  I don't usually measure my seasonings, I add to taste and it turned out delicious.  Will definitely be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AliciaP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12448903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-01T02:50:46.660Z",
                "reviewBody": "I made this tonight, but failed to read the other reviews - big mistake!  Even though I accidentally added extra Italian seasoning, it was very bland and the sauce was thin and watery.  I was expecting a thicker savory sauce.  I think maybe there should have been two cans of tomato sauce with one can of tomatoes, and maybe some tomato paste.  With the leftovers, I'm going to add some rice to thicken up the sauce and maybe some Worchestershire sauce, smoked paprika and more garlic to see if that helps.  I'd really thought this would be more like stuffed cabbage, but sauce is just way too watery and flavorless - it leaves an unappealing watery puddle when you spoon it over rice.  Sorry I couldn't be as generous as the other reviewers, who apparently rated it based on their improvements.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Disbrow Gratton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/174041/"
                }
            }
        ]
    }
]