[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25311/vegetarian-moussaka/",
        "name": "Vegetarian Moussaka",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8139887.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:43:06.000Z",
        "description": "This recipe always gets rave reviews from vegetarians and non-vegetarians alike. Easy to make, but takes time. Serve with salad.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "8 to 10 servings",
        "recipeIngredient": [
            "1 eggplant, thinly sliced",
            "1 tablespoon olive oil, or more as needed",
            "1 large zucchini, thinly sliced",
            "2 potatoes, thinly sliced ",
            "1 onion, sliced",
            "1 clove garlic, chopped",
            "1 tablespoon white vinegar",
            "1 (14.5 ounce) can whole peeled tomatoes, chopped",
            "½ (14.5 ounce) can lentils, drained with liquid reserved",
            "1 teaspoon dried oregano",
            "2 tablespoons chopped fresh parsley",
            "salt and ground black pepper to taste",
            "1 cup crumbled feta cheese",
            "1 ½ tablespoons butter",
            "2 tablespoons all-purpose flour",
            "1 ¼ cups milk",
            "ground black pepper to taste",
            "1 pinch ground nutmeg",
            "1 egg, beaten",
            "¼ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Sprinkle eggplant slices with salt and set aside for 30 minutes.  Rinse and pat dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium-high heat.  Rinse and pat eggplant dry. Cook eggplant and zucchini in hot oil until lightly browned on both sides, about 3 minutes per side; remove with a slotted spoon to drain on a paper towel-lined plate, reserving as much oil as possible in the skillet\n"
            },
            {
                "@type": "HowToStep",
                "text": "Adding more oil to skillet as needed and let it get hot. Cook potato slices in hot oil until browned, 3 to 5 minutes per side; remove with slotted spoon and drain on a paper towel-lined plate, again reserving oil in the skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Saute onion and garlic in reserved oil until lightly browned, 5 to 7 minutes. Pour in vinegar, bring to a boil, and reduce heat to medium-low; cook until liquid is reduced in volume and thick. Stir in tomatoes, lentils, 1/2 the juice from lentils, oregano and parsley.  Cover, reduce heat to medium-low, and simmer 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Layer about 1/3 of the eggplant, 1/3 of the zucchini, 1/2 the potatoes, 1/2 the onions, and 1/2 the feta into a 13x9-inch baking dish.  Pour tomato mixture over vegetables; repeat layering, finishing with a layer of eggplant and zucchini.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and bake in preheated oven for 25 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir butter, flour, and milk together in a small saucepan; bring to a slow boil, whisking constantly until thick and smooth. Season with pepper and nutmeg; stir.  Remove from heat, cool for 5 minutes, and stir in beaten egg.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour sauce over vegetables and sprinkle with Parmesan cheese. Bake, uncovered, for another 25 to 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Anne Buchanan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.381074168797954,
            "ratingCount": 391,
            "itemReviewed": "Vegetarian Moussaka",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "239.8 calories",
            "carbohydrateContent": "25.5 g",
            "cholesterolContent": "58.2 mg",
            "fatContent": "11.8 g",
            "fiberContent": "4.8 g",
            "proteinContent": "10.2 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "425.7 mg",
            "sugarContent": "9.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-05T17:57:27.837Z",
                "reviewBody": "This was DELICIOUS!  And I agree with previous reviewer, it can be done in no time at all! First, I couldn’t find canned lentils, so I bought a bag and because I was doubling the recipe, I estimated and used ½ the bag.  I soaked them overnight, then added some chicken broth and boiled them for 15-20 minutes.  Agree with previous reviewer....don’t fry each veggie..just roast them all together!  If you don’t have one already, get a mandolin – Pampered Chefs new one is GREAT!  I peeled the eggplant and sliced it up. Then sliced the Zucchini (didn’t peel)  Beset change was that I used RED Potatoes, which I love anyway, but better yet, you don’t have to peel! I put it all in a big roaster pan, coated them with Peanut Oil (can handle higher heat) and roasted them at 450-500 for 30-50 minutes (my oven cooks fast).  While they were cooking, I cooked up my onions and garlic added in the tomatoes, lentils, oregano and parsley and the cooked lentils.    (I took previous recommendation and added some cinnamon to this mixture)\nI layered 1/3 of this vegetables in the bottom of my 9x 13 pan, then ½ of the onion/tomatoes mixture, then sprinkled Feta Cheese.  Repeat (1/3 veggie, rest of onion/tomato/feta) then top with remaining veggies and feta.  Bake for 25 minutes.\nFor the Béchamel sauce – I added more cinnamon and some nutmeg to this and it made it perfect!  Since I had doubled the recipe, I doubled this sauce – but I only used ½.\nI’ve made twice since and am making it again his week for ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURIEBU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1145481/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T23:40:14.007Z",
                "reviewBody": "Comes out excellent but takes a long time to make.  Just to clarify matters, every time the word \"Drain\" is mentioned in steps 1-4, they really mean \"Remove ingredients from skillet and place aside on a plate\".  Otherwise you will be mixing the ingredients all together and not browning them separately.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPINACIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667478/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-10T20:01:30.17Z",
                "reviewBody": "This recipie was very tasty, an excellent blend of flavors. Grilling the vegetables instead of frying was a great idea, tasted great and a time saver.  I omitted the potatoes, however.  I also used a half a cup of dry lentils instead of the canned ones.  Of course I boiled them before adding them to the filling.\r\n\r\nThe only eensy weensy gripe I have about this recipie is that it was very crumbly and fell apart (which of course didn't affect the great taste) when serving.  When I was in Greece, I remember that Moussaka was very firm, and looked kind of like little pieces of cake.  I think I will try blending into a paste about half of the lentil filling with a little egg and flour, and then mix that with the rest of the filling.  That should make it stick together a little more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mistril",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-02T05:10:29.093Z",
                "reviewBody": "I think I have found a new favorite comfort food!!! This was soooo good! I used extra parm on top so it would be extra cheesy. I also used white boiling potatoes white onion peeled the eggplant and soaked and cooked my own lentils. To everyone who says this takes a long time- not true. This was in the oven with less cleanup than any of the Rachael Ray 30 min recipes I've tried and was super super delicious! I will definitely make again! Thanks for the great addition to my collection! Update 3/1/08...second pan made came out even better than the first. I timed it and it was in the oven speedy fast in just over 1/2 an hour...I use a huge pan and cook a lot of the ingredients together then separate them while I'm doing my layers. I brought in half of the pan to work because I just couldn't eat it all...got rave reviews including one from a guy who claims to dislike anything made without meat. I'm so impressed with this recipe I've referred it to a bunch of people. YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THEBOYCANPLAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/526602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-29T03:56:03.71Z",
                "reviewBody": "I almost deducted a star from this for how insanely long it took, but I changed my mind because I remembered that, in addition to the finished product being absolutely wonderful, it also made 3 meals for my husband and I.  \n\nI pan-cooked the eggplant, as per the recipe, but I wound up roasting the potatoes and zucchini (I also ended up having to use almost double the vegetables as were called for.)  I also used crumbled gorgonzola instead of feta and romano instead of parm, since those were all I had on hand, and it still turned out magnificent.  I personally think the use of the lentils in this dish is genius, and the bechamel sauce tied it all together beautifully.  I'm not sure what I did differently from other people, but mine was neither mushy nor crumbly; it was actually perfectly firm and easy to slice through and serve.  It really turned out outstanding.  I will definitely make this again the next time I have an extra few hours. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jjama Llama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2135291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-23T11:14:32.593Z",
                "reviewBody": "I was discouraged from trying this recipe for a long time by the amount of work involved and by my husband who didn't think it sounded good. Well he changed his mind after he tried it. He totally loved it and said that it tasted like it had meat in it and was just like the original. It took a lot of work though. I browned the eggplant in the oven and the zucchini and potato in a skillet on the stove and it went a bit faster that way. I think I could cut the time involved even further by slicing the zucchini and potatoes slightly thicker. Mine were paper-thin and not only did that make for a lot of slices to brown but also the zucchini became very soggy while some of the potatoes were too crisp. My only other complaint is that the moussaka was very liquidy as others have mentioned. Next time I'm going to drain the lentils before adding them to the tomatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAZZMATAZZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-18T19:35:51.817Z",
                "reviewBody": "This had good flavor, but the labor was intense and the proportions were grossly inadequate for a 9x13 casserole. No where near enough to repeat layers, let alone create one complete layer of each. Grilling or broiling the vegetables will be a time saver next time. Using a smaller casserole or doubling all ingredients is a must.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1745124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-22T02:18:13.483Z",
                "reviewBody": "This was surprisingly excellent! I used Braggs Apple Cider Vinegar and I cooked dry lentils instead of using canned used dried parsley and I bought Israeli Feta from a deli smart balance instead of butter and Silk unsweetened soy milk instead of milk. This was phenomenal I did not miss the meat. My picky 14 year old said \"Hey this is actually pretty good!\" It kind of reminds me of lasagne.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "azjost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1530638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-25T04:23:24.717Z",
                "reviewBody": "THis is an amazing recipe! I prefer to omit the feta between layers and just put it on top...you can taste it better that way! I also add more potatoes zucchini and lentils to fill up the 9x13 pan a bit better. I also grill the vegetables to avoid the use of oil. Smells delcious while cooking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRIPLE_LATTE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/533698/"
                }
            }
        ]
    }
]