[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13297/main-dish/seafood/halibut/",
                    "name": "Halibut",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/241116/panko-crusted-halibut-with-white-serrano-and-cilantro-sauce/",
        "name": "Panko Crusted Halibut with White Serrano and Cilantro Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2029910.jpg",
            "width": 1300,
            "height": 960
        },
        "datePublished": "2019-04-02T07:04:18.000Z",
        "description": "Yummy crunchy halibut. You can add additional spices, such as paprika or cayenne pepper, to the flour for breading, if desired.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 (6 ounce) halibut fillets, skin removed",
            "1 ½ teaspoons freshly cracked black pepper, divided",
            "1 ½ teaspoons sea salt, divided",
            "½ cup all-purpose flour",
            "2 eggs, lightly beaten",
            "1 cup panko bread crumbs",
            "2 tablespoons unsalted butter",
            "¼ cup minced shallot",
            "1 teaspoon minced serrano pepper",
            "1 cup half-and-half",
            "1 cup roughly chopped cilantro leaves",
            "1 tablespoon fresh lime juice",
            "½ teaspoon sea salt",
            "¼ cup canola oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season halibut fillets all over with 1 teaspoon cracked black pepper and 1 teaspoon sea salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour, remaining black pepper, and 1/2 teaspoon sea salt together in a shallow bowl. Whisk eggs in another shallow bowl. Pour panko bread crumbs into another shallow bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently roll 1 halibut fillet in flour mixture to coat and shake off any excess. Dip 1 side of fillet into egg, then press egg-coated side into bread crumbs to coat evenly. Place fillet, panko-side up, onto a plate and repeat with remaining fillets. Cover the plate loosely with plastic wrap and refrigerate until cold, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a small saucepan over medium-high heat. Saute shallot and serrano pepper in hot butter until fragrant, about 1 minute. Stir half-and-half and cilantro leaves into shallot mixture, bring to a simmer, and cook, stirring frequently, until reduced by half, 6 to 8 minutes. Remove from heat; stir in lime juice and remaining 1/2 teaspoon sea salt. Puree sauce using an immersion blender until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C). Line a baking sheet with aluminum foil and place an ovenproof wire rack on the baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat canola oil in a nonstick skillet over medium-high heat. Place fillets, panko-side down, in hot oil and cook until golden, about 2 minutes. Flip fillets and transfer, panko-side up, to the wire rack on the prepared baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake fillets in the preheated oven until fish flakes easily with a fork, 6 to 7 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Transfer fillets to plates and top with cilantro sauce.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Halibut"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Andrea S"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.142857142857143,
            "ratingCount": 7,
            "itemReviewed": "Panko Crusted Halibut with White Serrano and Cilantro Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "610.8 calories",
            "carbohydrateContent": "36.4 g",
            "cholesterolContent": "184.4 mg",
            "fatContent": "34.2 g",
            "fiberContent": "1.1 g",
            "proteinContent": "45 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "1170.2 mg",
            "sugarContent": "0.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-02-06T13:33:12.59Z",
                "reviewBody": "My family is a big fan of cilantro cream sauce so I thought this recipe was something we would like. I used haddock instead of halibut because it is more readily available in my area. The preparation of the fish was easy and with the addition of more spices to the flour as the recipe submitter suggested it had a mild but good flavor and a nice crunchy crust. After reducing the cream sauce by half and pureeing the sauce it was too thick so I added some chicken broth to slightly dilute. We were not fans of the flavor of the sauce. Most cilantro lime cream sauces I have made in the past have sour cream which gives them a nice tang. The use of half and half made the sauce too sweet and a tad too rich for us. For our personal taste I would rate the fish a 3-3 1/2 but the sauce a 3.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Happyschmoopies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/happyschmoopies/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-02-22T03:55:08.32Z",
                "reviewBody": "This is a great recipe. I have made it 6-7 times because I was having trouble getting the sauce to the desired consistency; what I ve found works best is to put it in the refrigerator after reducing it on the stove and adding the salt. I feel it s better to put the salt in while it s still hot so the flavor of the salt can be better incorporated in the sauce. Once it s chilled from the refrigerator I add the lime juice and blend it or use a food processor; from experience the blender makes less of a mess. I ll still have to do some more experimentation with the sauce but no matter how it comes out it still tastes great. If you have some time on your hands and halibut it the freezer or fridge then by all means make this recipe it s awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alan_Jensen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/18034513/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-10T14:32:21.343Z",
                "reviewBody": "I made one substitution which was fresh catfish caught from my pond in place of the halibut. This was tasty but I do think there is room for improvement. I only coated one side of the fish with panko and I think coating both sides is a must and there is plenty of egg/panko to do it. I had problems with the sauce. I am not sure what I did wrong but it never did thicken. I went ahead and served it as is instead of taking the time to manually thicken it and it tasted fine but was not visually appealing. I loved the crunch the fish had and I will make this recipe again with a few modifications.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Soup Loving Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/souplovingnicole/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-06T00:39:04.217Z",
                "reviewBody": "My rating reflects the amount of ingredients called for in the coating for the halibut and also the cooking temperature and time of the baking of it. You could get by in my opinion with half the panko and flour and eggs. I even coated both sides of the halibut steaks I used and still had quite a bit left over. I used some Tajin seasoning in the flour mix which added to the flavor! My fish took more time to bake to doneness at that temperature but that could be the result of not knowing the thickness of the 6 oz pieces the submitter was using. I used heavy cream in the cilantro sauce and that worked well. The cilantro I have is beautiful in looks but tasteless so that was disappointing. I would try this recipe again because we loved the flavors. Thanks andrealeigh01!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-08-19T00:11:59.163Z",
                "reviewBody": "This is officially one of my new favorite fish recipes! I made it with orange roughy and it came out very light and flavorful. I make a lot of home-made frozen meals so I am always trying to find new things that freeze and heat up well later. I cut the raw fish up into small personal sized pieces. After I breaded and baked the fish I placed each piece on a tray with some of the sauce on top and froze them separately. I packed them up with brown rice and roasted vegetables. Seriously all of those boxed frozen dinners in the grocery store have nothing on me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MadScientist",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17219783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-07-22T07:55:54.783Z",
                "reviewBody": "I used a Jalapeño pepper which gave a little kick that was great in the Cilantro Cream Sauce! Must use Panko Breadcumbs as they are nice and crunchy! This was a great recipe and I used Whitefish filets fresh from Lake Michigan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maryle Barbe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13837168/"
                }
            }
        ]
    }
]