[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25321/eggplant-parmesan-ii/",
        "name": "Eggplant Parmesan II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F01%2F5068161.jpg",
            "width": 650,
            "height": 465,
            "caption": "Eggplant Parmesan II | Photo by lutzflcat"
        },
        "datePublished": "2019-04-02T06:43:07.000Z",
        "description": "This is a no fry variation of this popular dish, and is just as delicious!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 to 10 servings",
        "recipeIngredient": [
            "3 eggplant, peeled and thinly sliced",
            "2 eggs, beaten",
            "4 cups Italian seasoned bread crumbs",
            "6 cups spaghetti sauce, divided",
            "1 (16 ounce) package mozzarella cheese, shredded and divided",
            "½ cup grated Parmesan cheese, divided",
            "½ teaspoon dried basil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip eggplant slices in egg, then in bread crumbs.  Place in a single layer on a baking sheet.  Bake in preheated oven for 5 minutes on each side.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 9x13 inch baking dish spread spaghetti sauce to cover the bottom.  Place a layer of eggplant slices in the sauce.  Sprinkle with mozzarella and Parmesan cheeses.  Repeat with remaining ingredients, ending with the cheeses.  Sprinkle basil on top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 35 minutes, or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Dolores Gentner-Ryan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.459279038718291,
            "ratingCount": 3745,
            "itemReviewed": "Eggplant Parmesan II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "487.4 calories",
            "carbohydrateContent": "62.1 g",
            "cholesterolContent": "72.8 mg",
            "fatContent": "16 g",
            "fiberContent": "8.8 g",
            "proteinContent": "24.2 g",
            "saturatedFatContent": "6.7 g",
            "servingSize": null,
            "sodiumContent": "1663.1 mg",
            "sugarContent": "19.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-15T00:06:40.51Z",
                "reviewBody": "AWESOMELY GOOD! Ok I'm literally in the middle of making this but had to share my success. This has excellent taste! I have never tried to prepare eggplant although eggplant parmesan is my fav at the restaurant...not anymore! I'll make this at home healthier and cheaper! Taking several bits of advice from previous reviews this is how I did it. \n1) Sweat the 1/4\" slices by sprinkling with sea salt and letting sit for 30 min. Rinse, pat dry w/paper towel (get good & dry)\n2) Dip slices into beaten eggs and coat in gallon sized ziploc bag for easy cleaner breading. I used seasoned bread crumbs and tossed in about 1/4 cup parmesan cheese.\n3)Place on baking sheet coated with EVOO then bake for 7 min at 450, flip and bake add'l 5-7 mins depending on how crisp you like it (mine were nice a crisp @ 7 min per side)\n4) At this point I am eating the slices as is with a fork and they are great! I will be placing them on angel hair pasta and covering with homemade sauce and cheese then baking just to melt it all together. It's wonderful! I plan to try freezing extra slices after they come out of the oven, but before mixing with anything for next time I get a craving!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicci Klinkner Graves",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-16T02:17:58.86Z",
                "reviewBody": "This recipe is worthy of more than 5 stars.  Baking the eggplant instead of frying does not take away from the flavor of the dish one bit.  It does, however, need to bake longer than stated.  I baked mine for about 20 minutes until it was lightly browned.  Also, I chose to sweat the eggplant before breading by peeling, slicing, sprinkling with sea salt and placing in a collander in the sink for about 30 minutes.  This pulls out any bitterness.  Just be sure to rinse it well with water and pat dry with paper towels before breading.  I did two layers of eggplant.  You can layer however you like, you just to be sure the top layer of eggplant is topped with sauce and then cheese.  This is my husband's favorite dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-28T18:06:25.42Z",
                "reviewBody": "This dish turned out quite well - my boyfriend and I both want to make it again. However, 3 eggplants was way too much - next time I will use a good medium sized one and a smaller one. I salted each slice and let it sit for twenty minutes before rinsing in cold water, as per another suggestion, and then found that 2 1/2 cups of breads crumbs and two eggs sans yolks were plenty to cover all the eggplant slices. However, the slices definitely needed to be cooked a little longer than five minutes on a side - next time I might try cooking ten minutes a side. Over all, though, a good recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KELSKELS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677754/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-22T20:35:38.607Z",
                "reviewBody": "Excellent! I scaled this down for 3 servings and ended up using 3 eggs as well as 2 cups of bread crumbs. I made my own \"italian\" version by adding garlic powder, oregano, 2 tbs parmesan, salt, pepper and paprika. I followed some of the reviewer's advice and baked the eggplant for 10 minutes on each side. I recommend everyone do this as the eggplant was just cooked. I also sliced the eggplant to 1/4 inch slices as we don't like them too thin. My husband gave this a 10 out of a 5 :-).\r\n For those of you whose eggplant sticks to the pan without oiling your baking sheet, try parchment paper. ITS EXCELLENT! You don't have to use anything to grease your pans and nothing sticks. You can also reuse it. \r\nThanks so much for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nadia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T01:10:10.717Z",
                "reviewBody": "Positively LOVE this! Have made it several times already. I DO salt the eggplant first, and dip slices in just egg whites only-- no need for the extra fat in the yolks; bake slices 10 min per side; I use healthy choice garlic lovers sauce. One medium eggplant and about 1/2 of a 26 oz jar of sauce seems to be a perfect amount for me and hubby with leftovers for another whole dinner. DELICIOUS!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MichelleRD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/665571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-04T19:18:31.64Z",
                "reviewBody": "Recipe needed a little manipulation but it turned out so good. I added spinach and used Muir glen tomatos. My husband and preschooler loved it. I am giving this recipe 5 stars just because it is a great way to experiment and encourage you to try cooking with eggplant (wich is great and yummy). I read most of the reviews before starting out. The most common problems seemed to be the texture of the eggplant after cooking (undercooking) and the bitterness? (Not really an issue).  So I sliced these very very Thinly, about a quarter of an inch. Salting eggplant to remove bitterness didn't make sense to me because salt will induce osmosis and draw out water which you need to keep the flesh plump. You do not want a withered eggplant. I did my own test and it seemed that the part between the skin and flesh was the most bitter? so I just peeled it more deeply and let it sit in fresh cold water for 15 minutes. The eggplant was not bitter at all. But I think that may also have to do with the variety of eggplant available to you. So try a different variety if your eggplant is really bitter. Finally after cooking my dish for 30 minutes the flesh was still chewy so I had to let it cook for an additional 30 minutes. At this point the eggplant had a great texture. So either the cooking temperature or the time frame was off. So other than these minor setbacks, The meal was really good, it was like an eggplant lasagna. Thanks for the recipe I will make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Ayala Simmons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/898470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-21T23:03:49.05Z",
                "reviewBody": "First of all, jarred spaghetti sauce is a no-no in our house. It only takes a few minutes and a few ingredients to make a quick marinara sauce to pair with this dish.  My tip for cooking the eggplant slices, is to skip breading, frying or baking entirely. Simply slice them, brush with EVOO and grill on both sides until lightly browned. You can use the gas grill or a ridged grill pan or indoor griddle. It really cuts down on the fat, carbs and calories and lets the eggplant, sauce and cheese be the stars. Breading the eggplant adds  too much heaviness and masks the flavors, in my opinion. Also, this tip from Patricia Wells excellent Italian cookbook \"Trattoria\": Do not salt or peel the eggplant.  Fresh eggplant should never be bitter and the peel imparts a rich, deep flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Floridafoodie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5097959/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-01T20:49:36.537Z",
                "reviewBody": "Wonderful recipe!  However, I did use some of the suggestions mentioned in some of the other reviews.  I used 2 good sized eggplants instead of 3.  To remove the bitterness, I salted the eggplant and let it sit for 20-30 minutes and then rinsed with cold water.  And I baked it for 10 minutes on each side.  Came out great.  This recipe is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "2BCREATIVE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/97051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T01:06:18.827Z",
                "reviewBody": "This was a very good easy and healthy version of this dish. I did salt my eggplant first for about 20 min and let stand in colander in the sink..then rinsed it well w/ cold water - it takes the bitterness out of the eggplant. I used Italian breadcrumbs and added some garlic pepper to them. My family loved it and no frying!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOREENB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/234165/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Eggplant Parmesan II",
            "description": "See how to make a delicious no-fry version of eggplant parmesan.",
            "uploadDate": "2012-11-08T00:19:29.332Z",
            "duration": "PT4M8.235S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F8028fa9b-db65-4a8e-84d7-b79be23c4faf%2Fa46c525b-5caa-4f2b-b2a3-6ee73893efc0%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1954487116001"
        }
    }
]