[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25363/slow-cooker-chicken-with-mushroom-wine-sauce/",
        "name": "Slow Cooker Chicken with Mushroom Wine Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1677844.jpg",
            "width": 2272,
            "height": 1704
        },
        "datePublished": "2019-04-02T06:43:08.000Z",
        "description": "This is a creamy, tender and very tasty chicken dish. Cooking it in the slow cooker makes it so easy!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 teaspoon dried minced onion",
            "1 teaspoon dried parsley",
            "¼ cup white wine",
            "¼ teaspoon garlic powder",
            "1 tablespoon milk",
            "1 (4 ounce) can mushroom pieces, drained",
            "salt and pepper to taste",
            "4 boneless, skinless chicken breast halves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a slow cooker, mix  together the soup, onion, parsley, wine, garlic powder, milk, and mushroom pieces. Season with salt and pepper. Place chicken in the slow cooker, covering with the soup mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low setting for 5 to 6 hours, or on High setting for 3 to 4 hours.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "K"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.064516129032258,
            "ratingCount": 372,
            "itemReviewed": "Slow Cooker Chicken with Mushroom Wine Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "207.8 calories",
            "carbohydrateContent": "7.6 g",
            "cholesterolContent": "61.1 mg",
            "fatContent": "7.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "24.9 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "955.9 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-03-06T13:44:38.077Z",
                "reviewBody": "My family loves this recipe.  I did take the advise of other cooks who recommended increasing the milk to 1/4 cup and adding a teaspoon of some sort of seasoning (I've used Bruci's on one occasion and Italian Seasoning on another) to give the gravy some oomph.  I haven't had a problem with the chicken getting dry, but I make sure that the meat stays covered by the gravy by giving it a stir every once in a while throughout the day.  It's possible that by putting the chicken into the pot while the meat was still frozen had something to do with the retention of moisture, too.  The recipe can be made in half the time by increasing the temperature to \"high\" and cooking for 3-4 hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EMVOLIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-14T23:52:24.047Z",
                "reviewBody": "Loved  this recipe and made a few changes to make it my own.  I used White Zinfandel instead of just white wine & Used Two Cans of Progresso Cream of mushroom soup.  The next thing I noticed is that it had a ton of sauce so I added 1 cup of Brown Rice and 1/2 cup of Shelled Edamame.  After tasting it I felt it still needed a little something so I added 1/4 cup of Shredded Parmesan, Romano, and Asiago cheese blend.  YUMMY!!!   This is gonna be a winner for us! THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kenys \"B\"",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1691435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-13T17:05:44.52Z",
                "reviewBody": "My whole family loved this.  I doubled the sauce recipe and it cooked til the chicken was so tender that I just shredded it and mixed it real good.  I served it over angel hair pasta.  I also browned and seasoned the breasts first in garlic oil.  I will definitely  make this again.  Tracy Sue",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACYSUE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/267435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-21T17:02:56.923Z",
                "reviewBody": "I changed this a bit, doing something some slow cooker people might not like: adding an extra pan.  I browned my chicken first (5 pieces) in a big SS skillet.  Season with your favorite spice blend (I used a mix of Lawry's & Mrs. Dash).  Brown on med/med high heat, and then transfer to SC.  I then added about 2TBS butter, and a cup of chopped fresh onion (omit dried).  Drop heat a bit and sautee that about a min or two and add a carton of fresh chopped mushrooms (omit canned) and sautee some more.  Increase wine to about 1/2 cup and add to deglaze pan.  Get wine roiling pretty good, scrape bottom, and add spices (parsley, salt, garlic, pepper, etc).  I then added 2 cans of 'cream of' soup (I had mushroom and chicken in the pantry).  Stir that and let simmer for a few min.  Drop heat to low, increase milk to 1/3 cup, and add to mix.  Stir to incorporate, and then pour over chicken in slow cooker, moving things around to get good coverage.  Cook on low or high as directed, though I think 4-5 hours on low should be enough since you've already browned the chicken... caveat emptor: be aware of how your slow cooker works.  I liked this served over rice with a side of English peas.  Some things I might try next time are adding a few TBS of capers, and/or switching to pearl onions added with mushrooms after deglazing pan.  If you don't mind the extra pan and just a little extra prep time, I think this really works.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "OldBear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4361439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-08T23:28:50.127Z",
                "reviewBody": "this is a great basic recipe! very yummy but i made lots of modifications because we had a snowstorm & i couldnt get to the grocery. i used value pack chick thighs about 9 bone in skin removed. 1 can each cream of chick cream of mush. 1 pk fresh mushrooms half cup white zin & one quarter cup chick broth. thats it. i didnt brown the chicken but i seasoned it with lots of pepper seasoned salt onion powder & paprika. i wouldve added diced onion if i had any. served over egg noodles it was creamy & super yummy! will def make again. (I wrote this review a while back but i have made this dish over and over since then. take time 2 brown the chicken its worth the effort. fresh diced onion is key. but the best tip i discovered is 2 add half a pack of powdered ranch dressing mix into the liquid ingredients.) screw u culinary hags & grads. Shut up & eat it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "linneakron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3457545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-15T19:35:48.78Z",
                "reviewBody": "We loved it. It was so easy to make and to tweak. We had company coming so to make a little more I added a can of cream of chicken to increase the sauce subbed about 1/4 cup sliced green onions for the dried minced onion (because that's what I had) ommitted the milk (because we were out - and didn't want to open a can of evaporated for only 1 T.) and used 1.3 lbs. thawed chicken breast tenders and 3 partially thawed chicken breasts. We served it over Jasmati rice and it was delicious!! It served 4 adults 5 children (ages 2-6) and I had the leftovers for lunch today. Mmm so good. I'll definitely be putting this in the recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAREBANARE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1440757/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-10T19:19:03.297Z",
                "reviewBody": "This was very bland. Needs more onion garlic etc. Also you may want to thicken the gravy as it was very runny. After reading some reviews I made this a second time using dried onion soup mix and it was extremely salty. So I made it a third time and added 4 cloves of fresh minced garlic 1/2 cup white wine 1 T. worcestershire sauce double the mushrooms and before serving I removed the chicken and stirred in 1 cup of sour cream to the sauce and served it over rice. Even with these adjustments my husband and I agreed it still wasn't a keeper. Three strikes and this recipe is OUT!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-17T17:48:24.667Z",
                "reviewBody": "Read numerous reviews and this dish turned-out as I'd anticipated--including 'watery' sauce (due to accumilated condensation from slowcooker lid?). It's not 'exciting/awesome' in flavour but is a very nice chicken recipe with the chicken actually tasting like chicken(!) and not ingredients used to make the sauce. I doubled recipe to 8 breasts which I cut into 1-2\" wide strips due to limited amount of cooktime I had before dinnertime. Added two sliced garlic cloves a cup of chopped onions and cooked on high for 3 hours. Very tender meat very watery sauce very tasty chicken. Next time I'll add sliced carrots for additional texture & color without altering the overall taste of dish by much; if at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HIJIMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1008232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T17:38:38.67Z",
                "reviewBody": "This recipe is great! I added fresh garlic and basil to mine and deleted the onion. The garlic really brings the flavor out in the other ingredients much better. The first time we had this over rice then with the leftovers I chopped up the chicken and served it over a spinach pasta. It was really yummy both ways! Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "D.L. Mowery",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/235180/"
                }
            }
        ]
    }
]