[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/106/appetizers-and-snacks/fruit/",
                    "name": "Fruit",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/245570/chocolate-cranberry-nut-balls/",
        "name": "Chocolate Cranberry Nut Balls",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Chocolate Cranberry Nut Balls"
        },
        "datePublished": "2019-04-02T07:05:42.000Z",
        "description": "I'm gravitating towards the Paleo Diet so I created this high-protein and energy snack recipe out of a desire to eliminate those expensive and so-called nutritious protein bars. I don't want all of the processed carbs that are hidden in them because, quite honestly, they aren't that healthy. These are really tasty and my whole family loves them. I recommend making them fairly small and bite-sized, as they can crumble a little as you're biting into them. Freezing or refrigerating them keeps the messiness down, but they won't spoil if left at room temperature. I eat 4 or 5 with a big glass of water and feel full!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H3M",
        "totalTime": "P0DT8H33M",
        "recipeYield": "10 dozen balls",
        "recipeIngredient": [
            "4 ounces whole grain teff",
            "4 ounces shredded coconut",
            "2 ounces chia seeds",
            "2 ounces milled flax seed",
            "1 pound raw walnuts",
            "12 ounces raw almonds",
            "12 ounces semisweet chocolate chips ",
            "8 ounces chopped dates",
            "5 ounces dried cranberries",
            "4 ounces roasted pumpkin seeds (pepitas)",
            "1 (16 ounce) jar natural peanut butter, melted",
            "6 ounces honey"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place teff in a large skillet over medium heat and toast until fragrant, 3 to 5 minutes. Transfer to a large bowl. Stir in coconut, chia seeds, and milled flax seed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Chop walnuts, almonds, chocolate chips, dates, cranberries, and pumpkin seeds in a food processor, in batches if necessary, until finely chopped and the consistency of coarse breadcrumbs. Add nut mixture to teff mixture and mix thoroughly. Pour peanut butter and honey over nut and teff mixture; mix until evenly distributed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line 2 baking sheets with parchment paper. Roll the teff mixture into bite-size balls and arrange on baking sheets. Wrap sheets well with plastic wrap. Freeze until balls are firm, 8 hours to overnight.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Fruit"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "chefboy1969"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 1,
            "itemReviewed": "Chocolate Cranberry Nut Balls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "107.4 calories",
            "carbohydrateContent": "8.7 g",
            "cholesterolContent": null,
            "fatContent": "7.7 g",
            "fiberContent": "1.7 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "12.6 mg",
            "sugarContent": "5.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2018-11-07T07:30:36.74Z",
                "reviewBody": "Happy to be the first to review and to give it five stars! I m always on the lookout for healthy after school snacks and this one caught my eye because of cranberry in the title. We love cranberry anything! I made this recipe exactly as written including the neff which is something I d not cooked with before. My local store doesn t carry it so I ordered a bag online and had it shipped to me. The recipe lists the ingredients in ounces rather than cups so I used a clear measuring cup that has ounce markings on one side. I chopped up the ingredients individually in my Vitamix and dumped them into a large bowl where I then mixed everything together with a rubber spatula. Melting the peanut butter before mixing it into the other ingredients really helped with holding everything together. I oiled my hands before rolling the bite-sized balls so the mixture wouldn t stick. I didn t have any trouble with the mixture being too crumbly. It held together beautifully. It does take some time to roll all of the balls. I probably got 80 or so from it. The kids all commented on how tasty the snack was as they popped several into their mouths before I even had a chance to freeze them! A delicious and healthy after school snack is a win-win in my book. Thank you for sharing it with us! (I tried one after putting them in the freezer and they taste even better cold! I just stacked them up in a large square Tupperware-type container and didn t have a problem with them sticking together.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tpn1018",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8272819/"
                }
            }
        ]
    }
]