[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/104/appetizers-and-snacks/cheese/",
                    "name": "Cheese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25528/parmesan-spinach-balls/",
        "name": "Parmesan Spinach Balls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F348642.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:43:15.000Z",
        "description": "These delicious little appetizers are always a hit. Serve warm or at room temperature with a good quality mustard. These can be frozen unbaked and popped into the oven when unexpected guests pop in.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "2 (10 ounce) packages frozen chopped spinach, thawed and drained",
            "2 cups Italian-style seasoned bread crumbs",
            "1 cup grated Parmesan cheese",
            "½ cup butter, melted",
            "4 small green onion, finely chopped",
            "4 eggs, lightly beaten",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix the frozen chopped spinach, Italian-style seasoned bread crumbs, Parmesan cheese, butter, green onion, eggs, salt and pepper. Shape the mixture into 1 inch balls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the balls in a single layer on a large baking sheet. Bake in the preheated oven 10 to 15 minutes, until lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Cheese"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "tish"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.275229357798165,
            "ratingCount": 327,
            "itemReviewed": "Parmesan Spinach Balls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "258.2 calories",
            "carbohydrateContent": "19.1 g",
            "cholesterolContent": "107.6 mg",
            "fatContent": "15.6 g",
            "fiberContent": "2.5 g",
            "proteinContent": "11.8 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "632.6 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-18T21:58:03.59Z",
                "reviewBody": "I tried this recipe for a church finger food luncheon. It was well received and several people asked for the recipe. I also had a couple of people say they don't care for spinach but heard others saying how good they were so they tried them and they loved them too. I did follow several of the suggestions offered by other members. I thawed and squeezed dry the spinach before beginning.  I cut the Italian bread crumbs to 1 cup. I used one med. yellow onion (instead of the green onions) and 2 cloves of minced garlic and sauteed those in the 1/2 cup butter. I also took another recommendation and added about 1/3 cup of crumbled bacon.\nI made them no larger than 1 inch and they took every bit of 30 minutes to achieve the light brown. They weren't over cooked in the center at all. They were no where close to being done at 15 minutes. I'd definitely make these again. They were delicious and very well received. But for me they took considerably longer to make and considerably longer to bake than stated in the menu. Partially due to my additions. No matter. They're worth the time either way!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684902/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-14T02:55:31.937Z",
                "reviewBody": "This was super easy to thow together, but I felt it need a little bit more flavor so I added 3-4 cloves of mnced garlic and 1 tsp of cyanne and it gave this recipe the extra flavor and kick it needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Charity",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T19:09:20.437Z",
                "reviewBody": "These were a huge hit at the party! I cut back on the bread crumbs, added garlic and onion powder, cayenne and some yellow onion. I took LGRIER514's advice and rolled the balls into more parm. I served this with a marina sauce and a sweet honey mustard sauce. Excellent and healthy too Tish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:00:37.327Z",
                "reviewBody": "These are pretty good.  I made a batch of them on Friday night for Valentine's Day hors d'oeuvres and only baked a small amount.  My husband and I really enjoyed them.  I froze the rest for a dinner party this week.  I added some cayenne and garlic powder to this recipe and rolled them in fresh grated parmesan before baking as suggested.  I didn't serve a dipping sauce, but I have some pizza sauce left in my refrigerator that I'm going to heat up for my company this week.  I'm going to pull them out of the freezer in advance so they'll thaw since I don't know if I can bake them frozen or not.  Very easy, and definitely a keeper for the freezer. -- P.S. I pulled them out of the freezer the other night and let them defrost before baking them for my guests.  I find that either fresh or defrosted, they need 15 minutes to cook.  They were fabulous, and all of my guests loved them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMY LAMPERT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/618812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-22T18:08:55.467Z",
                "reviewBody": "I made my own variation of these. I only used 1 cup of bread crumbs. I sauteed with the butter 3 cloves of garlic. I also added lots of crumbled bacon. I added extra Parmesan cheese a little paprika and hot sauce. These are absolutely fantastic!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1667059/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-16T17:12:33.95Z",
                "reviewBody": "Pretty good base but I spruced it up a little. I used only 1 1/2 cups bread crumbs added garlic 1 T hot sauce 1 cup sour cream and sauteed 1 cup onion in the butter. I also added some chopped artichoke hearts. I didn't add salt and used only 3 eggs. It gave it much more flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonnie Lang Turnage-Mortgage O",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/413863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-30T22:19:44.097Z",
                "reviewBody": "My husband and I loved these. I only had plain bread crumbs so I added some italian herbs (oregano thyme basil). I took the advise of other reviewers and sauted some garlic and yellow onion in the butter and omitted the green onion. These smelled wonderful while they were baking. I took them to a potluck of about 40 people but few people ate them. A friend of mine (who ate 6) said people just didn't know what they were. Next time I'll label them. This made my husband happy though because he got to eat the left-overs. These things were terrific and my friends don't know what they missed",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-25T21:09:35.907Z",
                "reviewBody": "I love this recipe and all the modifications others have made to suit their tastes.  Here's what we do:  I double the frozen spinach to four 10oz. packages (for more spinach flavor).  Substitute 1 cup of the bread crumbs with 1 cup of blanched almond flour (for lower carbs) and add some extra Italian seasoning to that.  Use 1/4 cup of finely diced white or yellow onion instead of green onion and use 2 whole eggs plus 2 x-lrg egg whites (for less sat fat).  I think the butter adds the richness needed, so I leave that as is.  I don't usually add garlic, b/c I don't want to saute anything for this easy recipe, but I have added garlic raw and a little goes a long way.  A little fresh grated nutmeg (1/4 tsp) is wonderful in this as well.  I usually cook up a  few for our meal that day and then roll out the rest onto a baking sheet lined with parchment and freeze (uncooked) individually on that. Once frozen I transfer them to a freezer bag.  They cook up beautifully from frozen in 25 minutes.  Great to have on hand when company arrives unexpected.   Will have to try them with the recommended Sangiovese, but have served with Sauvignon Blanc very successfully.  I have made this recipe as written and they are fabulous.  But the beauty of them is that they CAN be modified quite successfully to your tastes.  Don't pass this one up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhonda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5377666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:00:36.06Z",
                "reviewBody": "This recipe was hit at my last party! would definitely make it again I also added some garlic & cayenne pepper to give them a kick:-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHYOUNG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/785151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-08T23:49:27.62Z",
                "reviewBody": "I would have given this recipe 4 stars if it had been me who liked it! I made this the other day for a finger food social night but wasn't impressed when I tried it for myself so I wasn't going to take it. My hubby tried it and liked it as did my son so I decided to take it and they really liked it and asked for the recipe! Maybe my taste buds were just off that day - I don't know but it was definitely easy to make (but a bit messy) and quick also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2507406/"
                }
            }
        ]
    }
]