[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25639/tiramisu-layer-cake/",
        "name": "Tiramisu Layer Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4443088.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2019-04-02T06:43:16.000Z",
        "description": "Fancy taste without all the work.  This cake is wonderful for a get together or just a special occasion at home.  Using a box cake mix as a base it's a real time saver!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 - 3 layer 9 inch cake",
        "recipeIngredient": [
            "1 (18.25 ounce) package moist white cake mix",
            "1 teaspoon instant coffee powder ",
            "¼ cup coffee",
            "1 tablespoon coffee flavored liqueur",
            "1 (8 ounce) container mascarpone cheese",
            "½ cup confectioners' sugar",
            "2 tablespoons coffee flavored liqueur",
            "2 cups heavy cream",
            "¼ cup confectioners' sugar",
            "2 tablespoons coffee flavored liqueur",
            "2 tablespoons unsweetened cocoa powder",
            "1 (1 ounce) square semisweet chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 (9 inch) pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the cake mix according to package directions. Divide two thirds of batter between 2 pans. Stir instant coffee into remaining batter; pour into remaining pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely. In a measuring cup, combine brewed coffee and 1 tablespoon coffee liqueur; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the filling:  In a small bowl, using an electric mixer set on low speed, combine mascarpone, 1/2 cup confectioners' sugar and 2 tablespoons coffee liqueur; beat just until smooth. Cover with plastic wrap and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frosting:  In a medium bowl, using an electric mixer set on medium-high speed, beat the cream, 1/4 cup confectioners' sugar and 2 tablespoons coffee liqueur until stiff. Fold 1/2 cup of cream mixture into filling mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble the cake:   Place one plain cake layer on a serving plate. Using a thin skewer, poke holes in cake, about 1 inch apart. Pour one third of reserved coffee mixture over cake, then spread with half of the filling mixture. Top with coffee-flavored cake layer; poke holes in cake. Pour another third of the coffee mixture over the second layer and spread with the remaining filling. Top with remaining cake layer; poke holes in cake. Pour remaining coffee mixture on top. Spread sides and top of cake with frosting. Place cocoa in a sieve and lightly dust top of cake.  Garnish with chocolate curls.  Refrigerate at least 30 minutes before serving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the chocolate curls, use a vegetable peeler and run it down the edge of the chocolate bar.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "bettina"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.764832793959007,
            "ratingCount": 1854,
            "itemReviewed": "Tiramisu Layer Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "465 calories",
            "carbohydrateContent": "46.3 g",
            "cholesterolContent": "77.7 mg",
            "fatContent": "28.9 g",
            "fiberContent": "0.8 g",
            "proteinContent": "4.4 g",
            "saturatedFatContent": "15 g",
            "servingSize": null,
            "sodiumContent": "308.8 mg",
            "sugarContent": "34.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-03T01:36:34.283Z",
                "reviewBody": "Awesome recipe. Seriously, it inspired awe in those who tasted it.\n\nI just wanted to repost a mascarpone substitute I found in another Tiramisu recipe. It worked wonderfully in this one!\n\nHEIDI8803 posted this in Raspberry Tiramisu, not sure which recipe she got it from:\nmascarpone substitute-\n2pkgs cream cheese blended with 1/2 c heavy cream and 5 T sour cream\n\nAnd, to reiterate other advice given by previous reviewers, I too made two of the three cake layers with the instant coffee (I'd've made it three, but the changing colors are beautiful) and I doubled the coffee liquer everywhere it was called for. I think next time I'm going to add chocolate covered coffee beans around the base of the cake.\n\n***Edit*** I've made this a few times now, and learned (the hard way) one big thing on the frosting: It is better to under whip than over. More than five minutes and you risk hitting an icky butter zone. That might be what happened to Nicky. Right at 5 min. works for me. Oh, and believe all the reviews about letting the cake sit overnight. The frosting will set better in that time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1600547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-10T00:33:20.55Z",
                "reviewBody": "AMAZING!  Make this and you will look like a pro!\nMy suggestions:\n1) use 4x as much instant coffee powder in cake batter, and make 2 layers of coffee flavored cake\n2)  i followed another reviewer's suggestion for substituting mascarpone with a mix of cream cheese, sour cream, and heavy cream, and it tastes great and is cheaper\n3)  you must turn the cake upside down when layering, otherwise coffee liqueur will not soak into it\n4)  i used kahlua for liqueur\n5)  I used Duncan Hines supreme white cake mix-it is moist and uses egg whites\n6)  i used a very strong espresso instead of the coffee to give it more flavor...also, instead of making coffee/espresso, just add water to some of the instant coffee powder, it tastes just fine in the cake",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2188142/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-12T17:01:59.543Z",
                "reviewBody": "Used 1 cup of coffee and 3T of  liqueur. Made it twice this way and it turns out so wonderfly moist and flavorful. Oddly the coffee flavor is still very subtle. The cake layers are so moist with the extra liquid it is best to freeze them before you layer them.This way they will not fall apart when stacking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1476783/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-03T21:37:34.653Z",
                "reviewBody": "Thanks for the excellent recipe!  I made this for my father's birthday...he was a professional baker and cake decorator in Europe so the pressure was on.  Everyone agreed it was great.  The frosting was not overly sweet like some can be.  I would, however add more coffee/liquor mixture to the layers next time.  I was afraid the cake would taste too \"boozy\", as there are members of my family that dont drink, but the taste was very subtle.  (good for those that dont like the coffee taste)  I also made the cake layers days ahead of time and simply froze them, took them out of the freezer and assembled the cake the day before the party. When I sprinkled the cocoa powder on the cake I  first carefully placed a paper \"lace\" doily on the cake top and when removed the cake had the lace pattern on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WAYTOGOROXIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T14:55:02.313Z",
                "reviewBody": "Excellent. To make things easier, I used only 2 pans.  I poured half of the cake batter onto 1 deep pan and used a cake slicer to evenly divide it.  I followed the instructions to detail afterward.  Follow these tips for outstanding results: 1. Instead of mixing the instant coffee into the batter, mix 1/4 cup of water with about 1 tbsp of instant cofee powder and mix into the batter.  It tastes like an awesome mocha cake. 2. Also, be generous with the coffee mixture as you're pouring it over your cakes, that way the cake is MOIST.  Don't overdo it though! 3. Buy your MASCARPONE CHEESE at Trader Joes or Sams Club (even cheaper)...it's significantly cheaper there than any other grocery store that I went to. Excellent recipe!! thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "azzilann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1453764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-02T21:41:58.52Z",
                "reviewBody": "I thought that the cake and the filling recipes were wonderful. But when it was time to make the fristing, it turned out horrible. It was extremely watery and tasted sour. I decided to make a simple cream cheese combination frosting instead; and fortunately my cake was saved and everyone loved it. Can anyone tell me what I might have done wrong with the frosting?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "NickyBaby61",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2412874/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-27T04:13:16.09Z",
                "reviewBody": "I thought this cake was great! Following the advice of previous reviews, I make two of the layers with the coffee granulars and one without, doubled the Kahlua everywhere it was called for, and doubled the brewed coffee. I was amazed how fast this came together. Because the layers are so thin they cook and cool very fast. I think I had the whole thing done in under 45 minutes. As a variation, I made this recipe for my husband's birthday and left out all the coffee, kahlua, and coffee granulars and added Chambord to two of the layers, layered sliced strawberries over her marscapone cheese between the cake layers and pressed more slices into the side of the whipped cream frosting. It was very good, like a strawberry shortcake cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2191655/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-14T15:54:19.19Z",
                "reviewBody": "Absolutely delicious!  So easy to make with a beautiful finished outcome.  My whole family adored it and I've made it twice so far.  One note - if you want luscious chocolate curls don't use a square of baking chocolate.  Melt chocolate chips and shortening, refrigerate in a sm. rectangular pan, and shave away.  Great recipe! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Josie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2840879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-22T21:06:44.5Z",
                "reviewBody": "This cake was excellent and easy to make. I baked the cake layers in 9\" springform pans and took roughly 12-13 minutes to bake. Followed some reviewers suggestions and made 2 coffee layers. I didn't want to modify the recipe too much the first time. But next time I will double the coffee/liquor mixture for the layers and add more liquor. I also used heavy whipping cream and it was yummy and so light. Cannot wait to make this cake again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "2winboyz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1397855/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Tiramisu Layer Cake",
            "description": "See how to make surprisingly simple tiramisu cake.",
            "uploadDate": "2012-06-21T01:07:34.983Z",
            "duration": "PT5M42.676S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F610f37f2-7ebe-4edc-ba8b-ce204199a5b3%2F0d417a2e-59ab-4548-abb7-a6ddb33f1ed7%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1699409862001"
        }
    }
]