[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13429/lima-and-navy-bean-and-ham-soup/",
        "name": "Lima and Navy Bean and Ham Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F739305.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This is my creation of a Lima/Navy bean soup.  After years of practice and trying many variations, I like this one the best.  It's a dinner by itself and so good.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 to 10 servings",
        "recipeIngredient": [
            "3 (3.5 ounce) links Italian sausage, casings removed",
            "1 large meaty ham bone or 4 smoked ham hocks",
            "16 ounces dry lima beans",
            "1 (16 ounce) package dried navy beans",
            "2 (14.5 ounce) cans stewed tomatoes",
            "1 (6 ounce) can tomato paste",
            "1 onion, chopped",
            "4 stalks celery, chopped",
            "4 carrots, sliced",
            "4 cloves garlic, minced",
            "¼ cup chopped fresh parsley",
            "3 bay leaves",
            "¼ cup chopped fresh chives",
            "2 tablespoons chopped fresh basil",
            "6 green onions, chopped",
            "1 teaspoon dried thyme",
            "1 teaspoon mustard powder",
            "1 teaspoon ground cayenne pepper",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "2 tablespoons Worcestershire sauce",
            "3 tablespoons chicken bouillon powder",
            "1 (12 fluid ounce) can or bottle beer"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large soup pot, brown the Italian sausage; drain off fat. Add ham bone (or ham hocks), lima beans, navy beans, tomatoes, tomato paste, onion, celery, carrots, garlic, parsley, bay leaves, chives, basil, green onion, thyme, mustard, cayenne pepper, salt, ground black pepper, Worcestershire sauce and chicken base or bouillon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add the can of beer and water to cover all. Bring mixture to a boil, then reduce heat and simmer until beans are tender, about 4 or 5 hours, and the ham has been released from the bone. Refrigerate overnight to let the fat to come to the surface of the soup.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When ready to serve, skim fat, remove ham bone (or hocks), pick off remaining ham from bone and put into soup. Discard bones and bay leaves. Heat soup until warm. Serve and enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Beans and Peas"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Marilyn G."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.446153846153846,
            "ratingCount": 65,
            "itemReviewed": "Lima and Navy Bean and Ham Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "541 calories",
            "carbohydrateContent": "80.8 g",
            "cholesterolContent": "24.3 mg",
            "fatContent": "11.6 g",
            "fiberContent": "25.3 g",
            "proteinContent": "29.8 g",
            "saturatedFatContent": "3.8 g",
            "servingSize": null,
            "sodiumContent": "1636.6 mg",
            "sugarContent": "15.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-15T15:33:14.077Z",
                "reviewBody": "I hate to be the lone dissenter, but I thought this was only okay, and some of the ingredients (which might make the recipe look intimidating to some) were completely unneccesary and actually detracted from the soup's flavor, specifically the sausage and the fresh herbs.  In the interest of economy, I recommend using whatever herbs you have on hand that are in the recipe (only less if dried).  If I made this again, I would omit the sausage, too, and add either ham flavoring or extra ham because my family likes the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CYCLECAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/838585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-13T22:40:18.203Z",
                "reviewBody": "I received a honey-sliced ham for a Christmas gift using the bone for this recipe. I also diced a cup or more of extra ham to add to the soup. This is a terrifically hearty soup with a wonderfully complex flavor. I thought so many ingredients might be gratuitous but the flavor was so good I'd be afraid to leave anything out when I prepare it again. Yes with so many ingredients you will be in the kitchen for awhile. And the beans do take a long time to cook. Still it's all worth it when your family keeps going back for seconds and thirds. As another reviewer mentioned I found myself adding water as the soup continued to thicken. To retain the flavor in adding so much water I also added another teaspoon of chicken bouillon. Adding water did not hurt the flavor. My grocer did not have fresh chives so I used dried. That's the only substitution I made. Don't think twice about making this one! Just do it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T13:41:31.42Z",
                "reviewBody": "You CANNOT mess up this recipe!  First soup from scratch I ever made, and I was snowed in, so I didn't have several of the ingredients.  I substituted cooked fresh tomato and extra paste for the canned tomatoes, lentils for the lima beans, extra white onion for the green onions and chives, and all dried spices instead of fresh.  Still phenomenal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FLORAMICH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697028/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T22:53:13.807Z",
                "reviewBody": "Maybe I'm old fashioned but I prefer the standard navy bean soup to put my ham bone to use. I thought I'd try something different this time... big mistake. This had way too much going on - as well as many unnecessary ingredients (like green onions). The flavors were much too strong.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1345810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-02T19:49:28.603Z",
                "reviewBody": "This is hands down the best bean soup I've ever had in my life. The flavor and blend of spices is amazing. I didn't use the green onions just used extra white onions per another user review. I also used dry spices since I didn't have fresh spices on-hand. Phenomenal!! My husband agrees that this is \"a keeper\"!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1551687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-22T15:15:00.263Z",
                "reviewBody": "Great spice combination very flexible. I wanted to use up some left-over ham and didn't have time to run to the store to get more ingrediants to really follow the recipe so I really butchered it. Essentially I used a reasonable amount of the dried versions of the spices with three cans of beans (pinto black-eyed peas and kidney) instead of dried navy & lima beans used sparkling apple cider instead of beer used extra ham instead of Italian sausage and left out the Worchestshire sauce chives and celery because I didn't have any on hand. I also threw in a green pepper for some color. The spices came out perfect even without measuring and the cayenne added a great kick - my spice-loving fiance was thrilled! Next time I'll try hard apple cider and more of it (don't usually have beer on hand). Sticking with the canned beans too - much faster the whole meal cooked in about an hour including prep.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ethel Ellison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1358485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-03T18:05:51.127Z",
                "reviewBody": "I don't understand all the praise. I thought that the recipe was needlessly complicated and all the extra spices didn't add up to a superior soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CARB101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1434982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-16T20:33:03.157Z",
                "reviewBody": "This was one of the best I have ever had. I made a double batch You need a very very large pan to mix the ingredients. I used a cut up picnic ham cubed with the fat removed instead of ham hocks. I Pulled two gallons out of the mixture and froze them before I started the main cooking process. The remaining mixture had to be cooked in a electric roaster. It was the only thing that was still large enough to cook it all. After the famaly ate all we wanted I took it to work and 10 men were able to have a bowl full. All I heard all afternoon was that bean soup was really good (along with all the reporting from the hind end). A few wanted the recipie for deer camps. By the way I cooked it for several hours in that roaster at 350 degrees and there was not one burnt spot on the bottom of the pan. I'll try the roaster thing for chilli and others that tend to burn on the bottom of the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MROZINSKI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1090544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-28T17:53:47.083Z",
                "reviewBody": "I thought this made a great soup! I did modify it quite a bit though. I didn't want to wait five hours for it to cook! I used 3 cans of great northern beans instead of the dried package and I used one package of frozen lima beans. This cut cooking time down to about an hour. I also used about a pound of italian sausage since that was the smallest package I could find. I tried some Italian style stewed tomatoes which also added some flavor and I substituted chicken broth for water and cut down to 1 tablespoon chicken base. It turned out to be excellent! This was my first chance to use my new food processor from Christmas did that ever make this soup a snap!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2224981/"
                }
            }
        ]
    }
]