[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23074/bobs-stuffed-banana-peppers/",
        "name": "Bob's Stuffed Banana Peppers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F105546.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2000-08-20T21:03:36.000Z",
        "description": "This is an awesome recipe for banana peppers stuffed with an Italian sausage mixture and baked in a delicious tomato sauce. We get requests to make them for the guys my husband works with all the time.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "8 banana peppers",
            "2 tablespoons butter",
            "½ cup chopped onion",
            "½ cup chopped celery",
            "1 (28 ounce) can crushed tomatoes",
            "1 (8 ounce) can tomato sauce",
            "2 cloves garlic, minced",
            "1 teaspoon dried basil",
            "1 teaspoon dried oregano",
            "2 ½ teaspoons salt, divided",
            "½ teaspoon ground black pepper, divided",
            "1 egg",
            "1 teaspoon Worcestershire sauce",
            "½ cup grated Parmesan cheese",
            "1 pound hot Italian sausage",
            "1 pound mild Italian sausage",
            "1 ½ cups bread crumbs"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut off tops of peppers, and remove ribs and seeds. Chop edible portions of tops; set aside. Bring a large pot of salted water to a boil. Add peppers, reduce heat, and simmer until tender but still firm, about 5 minutes. Drain and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat butter in a medium skillet. Saute reserved chopped pepper, onion and celery until tender, 3 to 5 minutes. Stir in crushed tomatoes, tomato sauce and garlic. Season with basil, oregano, 1 1/2 teaspoons salt and 1/4 teaspoon pepper. Simmer uncovered for 10 minutes. Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a large mixing bowl, combine egg, 1 teaspoon salt, 1/4 teaspoon pepper, Worcestershire sauce and Parmesan. Mix in hot sausage, mild sausage, bread crumbs and 1 cup of the tomato sauce mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using a piping bag or sausage stuffer, fill each pepper with the meat mixture. Place in a 3 quart casserole dish, and pour remaining tomato sauce mixture over peppers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake uncovered in preheated oven for 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "LISAPAV"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.579470198675497,
            "ratingCount": 302,
            "itemReviewed": "Bob's Stuffed Banana Peppers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "592.7 calories",
            "carbohydrateContent": "28.5 g",
            "cholesterolContent": "122.6 mg",
            "fatContent": "42.5 g",
            "fiberContent": "5.2 g",
            "proteinContent": "25.1 g",
            "saturatedFatContent": "16.2 g",
            "servingSize": null,
            "sodiumContent": "2125.1 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-15T23:44:46.763Z",
                "reviewBody": "I made this recipe with some slight alterations to save time and it is GREAT!!! #1, for the filling I only buy 1# of hot sausage and cut it in half while still in the package and I freeze the other half in a ziplock bag for next time. Next I add 1 egg, 1/2 cup spaghetti sauce, 1/2 cup parmesan cheese, and a cup of breadcrumbs. \r\nThis much stuffing will fill about a dozen medium sized peppers. The recipe's filling is for WAY more than 8 peppers, so it's better to cut it in half. I still clean and boil the pebbers for 5 minutes and once they're stuffed, I put them in a casserole dish and cover them with purchased spaghetti sauce and bake. When done I cover with shredded mozzarella cheese. It's WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VVARECHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T19:21:04.75Z",
                "reviewBody": "I'm pleased to report I've tried this recipe and made with only a few changes.  Since I had a lot of garden tomatoes, those were used rather than the canned.  I added approx. 2 tbs. sugar to the tomatoes.  Also, after baking approx. 40 minutues I covered with shredded mozarella then continued baking.  Before I bake this next time, I'll try cooking the sausage first and delete the grease that accumulates in the dish after baking.  This, of course, will require less baking time.  I'll also add some Italian Seasoning to the tomato sauce mixture.  This is a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "redrock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5276/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-15T23:45:13.733Z",
                "reviewBody": "The flavor was delicious and this is a terrific way to use up the peppers from the garden.  Note that this recipe calls for entirely too much filling for 8 banana peppers.  I halfed the filling recipe and still had about a cup left over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIEMFRANK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/146085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-08T16:41:21.123Z",
                "reviewBody": "I should first start by saying it is extremely disappointing to choose a highly rated recipe from this site and run into an issue while cooking only to go back and find most reviewers found the very same problem with the recipe and.... went ahead rated it well anyway.  I don't always have time to read all the reviews.  I am giving this one star because I found, like most, that you only need half the filling that this recipe calls for.  And you do not need to go through the tough work of parboiling the peppers.  Just stuff them raw.  Too many bread crumbs in the filling.  Otherwise, sauce is great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sheri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1895503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-12T12:11:09.84Z",
                "reviewBody": "Last year I planted what I thought were green bell peppers (they were mis-labeled). When these banana peppers grew (and I had lots!!!) I had to start searching for recipes. Decided to try this one. I made this recipe last year and just finished up the leftovers that were in the freezer. Very delicious!!! Anyway this year I planted banana peppers on purpose so that I can make this dish again. I found that I had too much sausage mixture and used it to make meatballs so this time I'll half the sausage.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill McLaughlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20594/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-18T21:43:18.437Z",
                "reviewBody": "Thanks to all who have rated this recipe. We do use the HOT variety of peppers for this recipe and yes they are too hot for me but my hubby and neighbors love them hot.  We buy the HOT hungarian wax peppers at the farmers market for these (by the case load I might add) As some of you already know, when you submit a recipe, allrecipes.com tests it and alters it to the way they find it will best perform. So if there is a lot of extra filling for the peppers, that is why. Again thanks to all that have tried and taken the time to review the recipe. Buono Mangia",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISAPAV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/124691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-07T14:22:06.65Z",
                "reviewBody": "This is a great recipe, but it does make a lot of peppers.  I made 28 from the recipe!  I was making these for a trial run before I made them for a family get together and ended up only having to make 1 batch.  Because of the huge amount of peppers I had to make extra of the sauce mixture.  Watch the salt in the sauce 1 1/2 teaspoons does make it taste salty.  I actually ended up using my own sauce to top the peppers with because of how salty it tasted to me, but otherwise they were a hit. I also topped with some grated romano cheese and shredded mozzarella the last 10 mins of baking. I will definitely be making these again.  Also since the recipe made so many peppers I had to freeze some before I could use them for my party.  They froze well.  I was actually thinking of buying more peppers now, while they are on sale, and making another batch and freezing them for later use.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mom of  Two",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2883122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-13T20:27:32.37Z",
                "reviewBody": "My family loved this recipe. This was my first time using peppers and I won't soon forget it (did not wear gloves because my neighbor told me they weren't hot)!! Make sure to wear GLOVES removing the seeds!! I halved the recipe and used 6 larger sized peppers. I par boiled for 3 minutes before filling. There is wayyy too much filling as many reviewers have stated. For presentation I did not cut the tops off but cut lengthwise and removed a small amount of pepper and seeds. My kids were eating these so I used a country sausage and ground chuck mixture. I subbed onion powder in place of the onion. I will make again since we have a ton of peppers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GodivaGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2567051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-15T02:14:19.357Z",
                "reviewBody": "Super delicious. I altered the recipe and used regular pork sausage and ground beef to tame it a bit for my family. I also filled to bell peppers that I needed to use up with the left-over filling. I will be making this one again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHILLY CHIPPY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/676721/"
                }
            }
        ]
    }
]