[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214579/lasagna-bolognese/",
        "name": "Lasagna Bolognese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4738334.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-03T06:30:53.000Z",
        "description": "This lasagna is a special occasion recipe as it's time consuming, but so worth the time and effort. It's very hearty and a great crowd pleaser.  The wine and cinnamon give it a different but pleasant taste.  I like to use a nice dry wine like a Zinfandel or Cabernet Sauvignon, then serve the rest with dinner!  Serve with crunchy bread and a green salad. Bon Appetit!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H55M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound dry lasagna noodles",
            "1 ½ tablespoons olive oil, divided",
            "1 (28 ounce) can Italian whole peeled tomatoes (such as La Valle®)",
            "1 onion, coarsely chopped",
            "2 carrots, coarsely chopped",
            "2 stalks celery, coarsely chopped",
            "3 cloves garlic, coarsely chopped",
            "1 tablespoon fresh sage",
            "1 tablespoon fresh rosemary",
            "2 tablespoons olive oil",
            "1 pound ground beef",
            "1 pound sweet Italian sausage links, removed from casing and crumbled",
            "2 tablespoons all-purpose flour",
            "1 cup dry red wine",
            "¼ cup heavy cream",
            "½ cup grated Parmesan cheese",
            "1 pinch ground cinnamon",
            "1 (16 ounce) container ricotta cheese, broken apart with a fork",
            "3 eggs, lightly beaten",
            "1 pound shredded mozzarella cheese, divided",
            "kosher salt to taste",
            "freshly ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in 1 tablespoon of olive oil. Once the water is boiling, stir in the lasagna noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Drizzle the cooked noodles with about 1 1/2 teaspoons of olive oil to prevent them from sticking together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tomatoes, juice and all, into the work bowl of a food processor and pulse to puree, about 1 minute. Set the tomatoes aside. Place the onion, carrots, celery, garlic, sage, and rosemary into the food processor, and pulse several times, until the vegetables are minced.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons of olive oil in a large saucepan over high heat until smoking hot, and add the minced vegetables. Reduce heat to medium, and cook and stir until the vegetables have softened and are just beginning to brown, about 10 minutes. Stir in the ground beef and Italian sausage, and brown the meat, breaking it apart into crumbles as it cooks, about 10 minutes. When the meat is no longer pink, stir in the flour, and cook and stir about 2 more minutes. Pour in the red wine, bring the mixture to a simmer, and cook, stirring occasionally, until the wine has reduced, about 15 minutes. Pour the pureed tomatoes, cream, Parmesan cheese, and cinnamon into the meat sauce, bring to a boil over medium heat, reduce heat to a simmer, and cover the pan. Cook the sauce, stirring occasionally, for 20 minutes. Set the sauce aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together the ricotta cheese, eggs, 3/4 pound of shredded mozzarella cheese, and kosher salt and pepper. Reserve 1/4 pound of mozzarella for topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with olive oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the lasagna, lay about 4 noodles in the bottom of the prepared baking dish, running the long way, and slightly overlap them to cover the bottom completely. Spread 1/3 of the ricotta cheese mixture over the noodles, and top with 1/4 of the meat sauce. Top with a second layer of noodles, running the short way. Top the second layer with 1/3 of the ricotta cheese mixture and 1/4 of the meat sauce as before; make a 3rd layer of noodles, the last third of the ricotta mixture, and 1/4 of the meat sauce. Place one more layer of noodles, and top with the last 1/4 of the meat sauce. Sprinkle the reserved mozzarella cheese over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until the lasagna is bubbling and the cheese is melted and lightly browned, 45 to 55 minutes. Let the lasagna stand about 5 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MARCIL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1875,
            "ratingCount": 16,
            "itemReviewed": "Lasagna Bolognese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "568.4 calories",
            "carbohydrateContent": "38.3 g",
            "cholesterolContent": "130 mg",
            "fatContent": "29.5 g",
            "fiberContent": "2.6 g",
            "proteinContent": "33.8 g",
            "saturatedFatContent": "12.8 g",
            "servingSize": null,
            "sodiumContent": "857.5 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-01T21:58:35.53Z",
                "reviewBody": "I couldn't find my own recipe somewhere in my kitchen.  This was the closest I came to my own original recipe.  I gave this 4 stars because we didn't like the cinnamon.  I had to start all over.  Things I did differently:  mince all veggies instead of chopping.  This makes a difference in the sauce and flavor blending.  You can use straight Italian sausage, but buy it in bulk instead of messing with casings.  The Butcher at the grocery can give it to you that way.  I always add a layer of Parmesan cheese in between the Ricotta mixture and the Mozzarella layer.  It does make it more cheesier, however, everyone seems to like it better that way.  I also doubled the Ricotta mixture as there wasn't enough to layer all the different layers.  I like my layers to extend throughout the dish, not just in the middle.  As for spices, I added about an extra teaspoon of Pizza seasonings, fresh ground in those little grinders you get at the grocery now.  This is about the best basic recipe on this site that I've found.  The sauce is the best, if you leave out the cinnamon.  You can also take the time to use fresh Roma tomatoes instead of canned for a more authentic flavor.  Canned tomatoes always have a metallic flavor to me.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "yum2001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3039815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-03T18:02:49.777Z",
                "reviewBody": "So delicious and worth the time and effort.  I make a meat sauce very much like this all the time, but I loved the addition of the veggies.  I added a pinch of red pepper flake and some chopped fresh basil towards the end.  Try making your sauce over a weekend when you have time and freeze it.  This sauce would be great for any pasta dish including a baked ziti too!  Thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SweetBasil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/853482/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-01T18:45:36.75Z",
                "reviewBody": "I used this recipe tonight. My husband and I like unusual sauces and this one was unique and actually very good. It's all a matter of personal taste. I made only half a recipe and froze the left overs. It is big if you do it all and I believe is meant for large dinner parties. As for the calories if you don't want calories what are you doing looking at Lasagna recipes? I liked the addition of all the vegetables. I did cut the sage because I wanted to sleep tonight and didn't want heartburn! The sausage gives it plenty of flavor. A good recipe if you want something different. Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Grandma Lizzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2537790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-16T16:55:58.253Z",
                "reviewBody": "I really liked this lasagna...BUT I would use 1 or 2 eggs which would make it less \"cakey \" just a personal taste. I also would go very lightly on the cinnamon. I added shredded zucchini too and it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Merrill Fowler Tibbals",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4461150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-09-05T02:33:57.693Z",
                "reviewBody": "worth the extra time. big hit. I've been making this recipe for  a several years. it's awesome.  The only thing i struggle with is the ratio of tomato sauce to noodle.  For my personal taste sometimes i increase the sauce by 25% to 50% for a wetter lasagna.  This may be due to the brand of noodles I use, or other variable factors that play into lasagna making.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Helen Halia Hanowsky Feeney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4543266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-04T18:24:39.78Z",
                "reviewBody": "Very easy to make. I used lasagna that you dont need to boil at all. This saved me some time. I placed all the ingredients and the pasta sheets according to the directions. Dinner was a hit. I took some to work for lunch but ate it as soon as I got there. I could not wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yazi76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6616604/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-14T22:41:11.763Z",
                "reviewBody": "My first time making this from scratch - definitely a bit more work than I bargained for. I think next time I would make more of the red sauce since I like my lasagna a little saucier and maybe cut down on the parmesean a little as this was a bit salty for my tastes. Overall great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5624341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-17T00:49:51.22Z",
                "reviewBody": "Takes a bit longer to make than it says it does. If you do make it omit the Sage it over powers the taste. I will not be making it again my kids did not enjoy it they said it was \"okay\" I agree just okay.... think they were being nice since they new how long it took to make!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Lois",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4253900/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-05T04:55:07Z",
                "reviewBody": "The calories are wonderful on this lasagna... only 568 per serving.... but I would switch out the olive oil for grapeseed oil. It is a \"greener\" product because it comes from used grapes and you can cook with it at a much higher temperature and it is really healthier for you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6652015/"
                }
            }
        ]
    }
]