[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25908/cottage-cheese-roast/",
        "name": "Cottage Cheese Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F844185.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:43:26.000Z",
        "description": "My kids were raised as vegetarians and this is our favorite 'meat loaf'.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (16 ounce) package creamed cottage cheese",
            "4 eggs, beaten",
            "¼ cup vegetable oil",
            "1 (1 ounce) envelope dry onion soup mix",
            "1 cup finely chopped walnuts",
            "1 ½ cups cornflakes cereal"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Grease a loaf pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine cottage cheese, eggs, vegetable oil, soup mix, walnuts and cereal.  Spoon into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 35 to 40 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegetarian"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KITTYANN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.351020408163265,
            "ratingCount": 245,
            "itemReviewed": "Cottage Cheese Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "277.6 calories",
            "carbohydrateContent": "10.5 g",
            "cholesterolContent": "101.4 mg",
            "fatContent": "21.5 g",
            "fiberContent": "1.3 g",
            "proteinContent": "12.9 g",
            "saturatedFatContent": "4.4 g",
            "servingSize": null,
            "sodiumContent": "609.3 mg",
            "sugarContent": "1.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-07T17:51:19.017Z",
                "reviewBody": "This is one of those recipes that you gather your family or your favorite friend around to help you make so they too can share in the laughs because afterall, it is by far one of the weirdest recipes anyone's yet to see and you just know that nothing good could come of it but it'll sure be a lot of fun concocting the mess and watching it self destruct somewhere along the way.  Well, mixing it up was a real riot--I think my husband and I near cracked a rib from laughing so hard at the mess that was in the bowl...it brought back memories of praying to the porcelain god for sure....:o)  Then we popped in in the oven--and the most amazing thing happened--it actually came out looking like a loaf and it was pretty freakin' tasty--so much so that my carnivore hubby actually took a few slices for lunch one day.  Who knew?\nI followed the recipe exactly as stated--I'm not sure why there's so much oil in the recipe but one could easily use less than half of what's called for.  Once you make this loaf--you will quickly start imaginng all the things you could do to it--like swapping out the onion soup mix for something else, added veggies and other seasonings etc.  This recipe is pretty neat and a lot of fun.  I would recommend it to any skeptic.  The ONLY THING IS THAT I HAD TO BAKE IT LONGER--ABOUT AN HOUR UNTIL IT WAS FIRM IN THE MIDDLE...I checked it at 45 mins and it was still jiggly when I shook the pan so I put it back in there for awhile longer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lina G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1687768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T04:02:01.403Z",
                "reviewBody": "This recipe is wonderful. I added 1 add'l cup of corn flakes, reduced oil to 1/8 c. and used 2 eggs and 2 egg whites, as well as using lowfat cottage cheese. I baked for 60 min. and it was perfect. My toddler loved it too. Next time, I will add shredded carrots and spinach.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IAMAJOY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/810324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-01T19:06:53.03Z",
                "reviewBody": "I love this recipe!  It looks just like a paler meatloaf and it tastes like meatloaf, too!  I've made it several times, trying all sorts of variations and I loved it every time.  I tried it with one less egg, with no oil, with no nuts, with cashews, with a half cup of walnuts, with cooked diced peppers mixed in - all of them delicious.  I always made it with at least 2 cups of corn flakes and always with 2% fat cottage cheese.  It came out great everytime - never too mushy.  I even ate it hot out of the oven and the slices held their shape.  I have no idea what could be causing everyone else's problems.  I used a glass loaf pan and cook it for an hour.  I definately recommend the two cups of corn flakes and leaving out the oil.  Three eggs works just fine and if you love nuts, don't leave them out.  They sound odd but it really works.  I loved it with yellow bell peppers mixed in.  I'm going to try green peppers, carrots, onions, and mushrooms - not all at once.  Give this recipe a shot, it's worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAHLA_KITA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/144667/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T22:37:10.16Z",
                "reviewBody": "This LOOKED just like meatloaf after it was done cooking but it DID NOT taste just like meatloaf as some others have reviewed. It smelled wonderful when it was cooking and looked good. I ate one piece and decided it was too much all-around for me. I dont care for nuts so the taste of walnuts was too overpowering. I love cottage cheese and it was not as prominant as I thought it would be due to the name of the roast. I decided to throw out the rest of the loaf after only one piece. It was just not for me. I got a strange aftertaste in my mouth. I was dissapointed but the only way to know is to try it once right?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "KAILASMITH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-19T00:53:54.883Z",
                "reviewBody": "This is probably the cookiest recipe I've ever tried, but man if it didn't just shock the heck out of me and the family... absolutely wonderful!  I did as other reviewers and cut the oil to 1/8 cup and used only 2 eggs.  Also I didn't use a full packet of onion soup mix, half was PLENTY.  I added mushrooms, onions, garlic, and served with mashed taters and mushroom gravy.  Truely a great meatless meal that filled and satisfied us all.  I WILL make this again!  Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jessi8033",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4995185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-09-26T23:34:11.28Z",
                "reviewBody": "Although it sounded weird and looked gross after being prepared it tasted delicious! The next day it tastes even better! We added 1 extra cup of cornflakes and green onions and served it with mushroom gravy. Some chopped mushrooms next time might be good. Baked for 1 hour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Daniel den Hoed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/640518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-17T21:25:37.653Z",
                "reviewBody": "my mom and i are vegetarian and she's always asking if i'll make this meatloaf for her! it's so good! i use special k cornflakes which i grind to a fine powder in my food processor then i put all of the other ingredients in their and blend until well combined. i've used egg substitute instead of a real egg and it worked well also. this goes great with mashed potatoes! i reccommend baking the meatloaf in two medium sized loaf pans because having it all in one sometimes takes forever to bake all the way through. cranberry sauce is great with this! thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CURIOUS GEORGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/619332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-25T02:27:02.89Z",
                "reviewBody": "I was intrigued by this recipe when I came across it due to the novelty factor and decided I had to try it at least once. I read a number of the reviews and followed some of the modifications -- extra cup of cornflakes one less egg a bit less walnuts addition of garlic and onion powder baking time of 50 minutes. My boyfriend and I had the result for lunch tonight and we were both amazed by how meatloaf-like and fairly tasty it was. Next time I will try making my own onion soup mix however because the one I bought had a bunch of artificial ingredients and left a weird aftertaste.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "YOORA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420755/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-27T18:04:22.607Z",
                "reviewBody": "This meatless loaf was amazing. I would never have guess that cottage cheese and cornflakes could make THIS! I loved it. I used 2 1/2 cups of cornflakes 1/8 cup of oil 1/2 cup of walnuts and added 1 cup of diced onions green peppers & mushrooms. Thanks so much for this recipe. It's wonderful. Hardens after sitting a bit. Can't wait to eat leftovers cold on a sandwich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAINBOMOMS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/706672/"
                }
            }
        ]
    }
]