[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26254/baked-ziti-iv/",
        "name": "Baked Ziti IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F803370.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2019-04-02T06:43:34.000Z",
        "description": "The BEST Baked Ziti!! This has flavor and yields a great amount. Try this recipe; it IS the best!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound dry ziti pasta",
            "1 ½ tablespoons olive oil",
            "1 onion, sliced",
            "1 teaspoon minced fresh rosemary",
            "4 cloves garlic, chopped",
            "½ pound ground beef",
            "½ pound ground pork sausage",
            "1 ½ (26 ounce) jars spaghetti sauce",
            "salt to taste",
            "1 (6 ounce) package provolone cheese, sliced",
            "¾ cup sour cream",
            "¾ cup cottage cheese",
            "1 (6 ounce) package mozzarella cheese, shredded",
            "2 tablespoons freshly grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water for 8 to 10 minutes, or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, heat olive oil in large, heavy skillet over medium heat. Cook onion  in oil until tender. Stir in rosemary and garlic. Transfer to a small bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place ground beef and sausage in the skillet. Cook over medium-high heat until evenly brown. Stir in the onion mixture and the spaghetti sauce. Season with salt. Reduce heat to low, and simmer for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish. In the prepared dish, layer 1/2 of the cooked pasta, provolone cheese, sour cream, cottage cheese, and a little less than 1/2 of the meat mixture. Then layer the rest of the pasta, mozzarella cheese, remaining meat mixture, and Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 20 to 30 minutes, or until heated through and cheeses are melted.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SETHALLEN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.715311004784689,
            "ratingCount": 1254,
            "itemReviewed": "Baked Ziti IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "488.5 calories",
            "carbohydrateContent": "43.8 g",
            "cholesterolContent": "54.9 mg",
            "fatContent": "24.5 g",
            "fiberContent": "3.8 g",
            "proteinContent": "22.1 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "801.4 mg",
            "sugarContent": "9.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-17T16:18:47.813Z",
                "reviewBody": "OK Everyone, I made this last night and it is a keeper !!! Very very good!!! I also did a few changes I used onions and green onions (tops only ). I added some red bell pepper, I used beef and sweet italian sausage. I was a little leary about the rosemary in this sauce, but what ever you do do not leave it out.(oh my god wonderful). Also use fresh rosemary, I used more garlic than call for ofcourse!!. I added basil and Italian seasoning to the meat mixture while cooking. After I added the sauce I added some red wine (a must). Also I added a teaspoon of sugar. Now I also used ricotta instead of cottage cheese, I used a Italian penne pasta (Imported kind found in supermarket). I was also not to sure about the sour cream I do not like it at all, but I used it. Also do not leave it out made a big difference. I layered mine and baked covered for 35 min then uncovered for 10 min more. I served with garlic bread and a soft white wine. HEAVEN!!!.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Claudette P Henry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1922840/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-11T02:54:24.733Z",
                "reviewBody": "Good stuff! This is a really strong recipe at its core. I would just modify some of the basic elements...especially step no. 4. Here are the recommendtions I would make to give this recipe a five star rating:\n1. Mix the sour cream, cottage cheese, mozzarella and parmesan together in a bowl. 2. Mix the pasta into the meat sauce. After spraying the casserole dish with non-stick spray, layer half the pasta/meat sauce in the dish. Spread the cheese mix on top of the bottom layer. Layer the rest of the pasta/meat sauce on top. Finish the casserole by placing the six slices of Provolone cheese and then bake. Twenty minutes at 350 was perfect. \n\nOther changes I made: I used 28 ounces of home made tomato sauce. The recipe was not specific enough for me - it said, \"1 1/2 (26 ounce) jars spaghetti sauce\" ...So is that 26 ounces total? Or is it 39 ounces? Another change I made is I used a pound of ground beef since I did not have the pork sauage on hand. I think the sausage would make it even better. Anyway, this recipe will fullfil a lasagna craving with half the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FoodieGal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1811964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T04:06:00.297Z",
                "reviewBody": "Added some extra spices to the meat mixture--minced garlic. basil, oregeno,salt and pepper.  Used ricotta instead of cottage cheese.  Used 8 oz. of sour cream and 15 oz. of ricotta.  Mixed everything together in a large pot, except for the provolone cheese.  Put a small layer of sauce in the bottom of the pan, threw in half the ziti mixture, then the provolone, then the rest of the ziti. I have been making lasagna for years, and think from now on I will use this recipe....much easier to prepare.  Was a bit leary of the sour cream, but texture was wonderful.  My Italian husband said this was the best ziti he's ever had.  My sons went NUTS over this.  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JODY4W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-29T03:29:57.77Z",
                "reviewBody": "Mine turned out DELICIOUS. This was a great basic recipe. I made several additions/changes: I used ground beef and ground sweet Italian turkey sausage removed from the casings. To the beef mixture I added a pinch of dried rosemary dried oregano dried basil and some red pepper flakes. For the cheese mixture I didn't have sour cream so I used softened 8 oz. cream cheese mixed with 8 oz. of ricotta cheese mixed with 3/4 cup shredded parmesan cheese. After the sauce mix was done I added about half of it to the cooked ziti which I stopped boiling one minute before al dente. Barilla's ziti which I used is 10 mins to al dente but I cooked it for 9 mins. It was perfect for the baked dish. Okay so with half the sauce and beef mixed in with the pasta I layered the pasta with sauce mix in a 9 x 13 pan then placed the layer of provolone cheese on top of that. I then spread the cream cheese/ricotta mix on top of the provolone slices then the rest of the pasta and sauce mix. After that I poured the rest of the marinara/beef mix on it evenly. I had a bit of the cream cheese/ricotta mix left so I dotted it on top of the last layer of sauce then finished with a layer of mozzarella. I baked it at 400 F for 20 minutes until the mozzarella was brown. It was a tasty meal. I think I prefer it over lasagna. My fiancé loved it and ate two huge helpings. I only had one serving because my thighs are huge enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "siamesechin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1775680/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-03T09:34:24.687Z",
                "reviewBody": "As a lasagna lover I love this dish. Easier to make but tastes the same. Also substituted cottage cheese for the more traditional ricotta. Sprinkle on some oregano instead of rosemary for true Italian flavor. Note that the recipe puts ALL of each type of cheese on a certain layer they are not repeated on subsequent layers (i.e. use all your ricotta/provolone on the first layer!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Healthy chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/242967/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-10T20:49:29.28Z",
                "reviewBody": "WONDERFUL!! I was skeptical, cottage cheese?? Okay, I cut the recipe to serve 4. ATE the entire pan myself!! REMADE it for 8 so that the family could try. They loved it! So, I just finished eating the last morsel as I searched for new things to cook. Finding this site was a diaster I am getting nothing done but filling the freezer and running to the grocery store! LOVED IT.. thanks..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GATSBYSOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/722682/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-20T16:34:26.09Z",
                "reviewBody": "Wow, this is good!  I played with it a bit to make it a little more healthy and can't believe how good it turned out!  I subsituted the beef and pork with ground turkey and hot turkey sausage, casings removed.  I also used non-fat cottage cheese and sour cream.  The only thing I'd do differently next time is I'd cut down on the amount of mozarella and provolone cheese - a little too much for my liking.  All in all this got rave reviews from everyone who ate it...A+",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelley W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/377495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-02T16:26:37.267Z",
                "reviewBody": "This turned out well. I used less ground beef and more sausage... went with a Spicy Italian. Browned the onion with the meat and the garlic, used 2 jars Barilla's Boscaiola Sauce (Mushroom and Garlic) and added 1 and 1/2 tsp. dried rosemary to the sauce. Mixed the sour cream (1/2 cup) with the ricotta (15 oz.) and the mozzarella (8 oz.) and parm along with 1 tsp. dried basil and a bit of S & P. I also added an egg to the cheese mixture. Layered some SAUCE FIRST, 1/2 pasta mixed with cheese, 1/2 provalone, more sauce, and repeated, topped with alot more sauce. You might need to open an extra jar. I needed a bit more, but I did use extra cheese.\nGreat pot luck dish. I have used Barilla's Arrabiata Sauce in this as well, and it's really good, too. Tastes even better leftover. Thanks, Seth!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "~TAYLOR~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-22T13:38:52.497Z",
                "reviewBody": "I doubled the recipe but did not necessarily double all of the ingredients. Definitely altered it a bit. I used about 1 1/2lb of ground sirloin which I mixed with garlic rosemary basil oregano and fresh parsley. Also par boiled 1lb of mild Italian sausage and then cut each link in half and then quarters which I then added to the sirloin mixture. I also used ricotta cheese instead of cottage cheese. Mixed the ricotta (15 oz) with about 8 oz of sour cream and 10oz of frozen chopped spinach (make sure it is thawed and all the water squeezed out). Very yummy! I did not use all of the cheese it calls for mostly mozzarella but cut down on the amount of provolone. Did not layer just threw everything into a roaster (much better and easier to mix) and mixed all together. I did put about 1 inch of water on the bottom of roaster along with spraying Pam so there was no sticking. Since I am 100% Italian I made my own sauce and really used a ton of it (probably equivalent to 3 jars of store bought). Sprinkled mozzarella cheese on top. Since I doubled I had to bake longer about 50 minutes. Finishing touch was freshly grated parmesan cheese. Wow! What a hit. Everyone had seconds. Definitely will make again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DLAZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/656277/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-13T01:02:02.280Z",
                "reviewBody": "I do not believe this can be \"the best\" when you have to buy pre-made spaghetti sauce. It will be different for everyone depending on the type of sauce used. I would prefer the sauce included in the recipe, but I will make my own.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MinxyBaby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700894/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Baked Ziti IV",
            "description": "Here's a quick and easy baked ziti recipe, perfect for a weeknight dinner.",
            "uploadDate": "2015-12-15T19:03:43.770Z",
            "duration": "PT2M22.509S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fbcab93b6-b6d3-4f2c-b745-876e4435c0a8%2F81158964-784a-425d-94ec-0c0090b251fd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4662559059001"
        }
    }
]