[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14762/soups-stews-and-chili/chili/pork-chili/",
                    "name": "Pork Chili Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26357/award-winning-chili/",
        "name": "Award Winning Chili",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F997517.jpg",
            "width": 2304,
            "height": 2304
        },
        "datePublished": "2019-04-02T06:43:36.000Z",
        "description": "This delicious chili took 2nd place at our local chili cook-off!  Bet you can't eat just one bowl.  If it is too thick, add water 1/4 cup at a time until you reach desired consistency. Even better tasting the second day!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (14.5 ounce) can stewed tomatoes, chopped",
            "1 (6 ounce) can tomato paste",
            "1 carrot, sliced",
            "1 onion, chopped",
            "2 stalks celery, chopped",
            "¼ cup white wine",
            "1 pinch crushed red pepper flakes",
            "¼ cup chopped green bell pepper",
            "¼ cup chopped red bell pepper",
            "⅓ cup bottled steak sauce",
            "5 slices bacon",
            "1 ½ pounds ground beef",
            "1 (1.25 ounce) package chili seasoning mix",
            "1 teaspoon ground cumin",
            "1 (15 ounce) can kidney beans, drained",
            "1 tablespoon chopped fresh cilantro",
            "1 tablespoon chopped fresh parsley"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large pot over medium-low heat, combine tomatoes, tomato paste, carrot, onion, celery, wine, pepper flakes, bell peppers and steak sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While tomato mixture is simmering, in a large skillet over medium heat, cook bacon until crisp.  Remove to paper towels.  Cook beef in bacon drippings until brown; drain.  Stir chili seasoning into ground beef.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir seasoned beef, cumin and bacon into tomato mixture.  Continue to simmer until vegetables are tender and flavors are well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in beans, cilantro and parsley.  Heat through and serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "Pork Chili Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jennifer"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5996131528046424,
            "ratingCount": 517,
            "itemReviewed": "Award Winning Chili",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "373 calories",
            "carbohydrateContent": "22.5 g",
            "cholesterolContent": "64.2 mg",
            "fatContent": "22.1 g",
            "fiberContent": "6.1 g",
            "proteinContent": "21.7 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "1168.9 mg",
            "sugarContent": "6.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-17T04:21:36.357Z",
                "reviewBody": "I made quite a few changes to this, and boy was it great!  If I haven't mentioned an ingredient in this review, it is because I used what was in the original recipe.  I used 2 1/2 pounds of lean ground beef (I had about 10 people to feed and I like it meaty and thick), so I doubled the chili mix, the kidney beans, steak sauce, green and red pepper, as well as red pepper flakes and cumin. Instead of stewed tomatoes, I used one big (32 oz?) can of organic fire roasted chopped tomatoes with the juice.  I did NOT add carrots or celery.  I added about 1/4 to 1/2 tsp. of cayenne pepper, and about 5 tablespoons of fresh cilantro.  Finally, I shook in some chili powder to taste.  Of course I sprinkle this with freshly grated cheddar before serving and serve corn bread or muffins on the side.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MRONUFRAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/932446/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T17:30:44.797Z",
                "reviewBody": "I have made many a chili. All of which I have loved. However, my wife has loved none. This one however was loved by all. I made it last weekend and my wife wants it again this weekend. I used ground turkey (again, the wife) instead of beef. Also, skipped the bacon (wife). Did it a slow cooker for 10 hours. Excellent! If too mild, a couple of dashes of hotsauce (not for the wife) will do the trick. A definate keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ORION4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/770945/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T19:59:09.577Z",
                "reviewBody": "My husband LOVES chili and I have had a hard time finding a recipe that suited his picky taste. Well this one did it! He and I both really enjoy this chili. It does taste great re-heated. To make things quicker we use the Oscar Meyer real bacon bits found in the salad dressing aisle. It is peices of real chopped bacon in a vacuum sealed bag already cooked. I thought it may make a negative impact on the taste but it really didn't. It cut down our cooking time and also the fat content. Thanks for sharing this recipe!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HLPARKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/208061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-16T01:57:45.53Z",
                "reviewBody": "Awesome!  My husband and I tried this last night, and we are hooked!  I made the following adjustments to fit our tastes/nutritional menu:  we substituted 99% fat free ground turkey for the ground beef; we made our own chili seasoning with cumin, chili powder, cayenne pepper and garlic powder;  we omitted the bacon and tomato paste;  we added half a can of tomato juice (some reviewers suggested water or beef broth, but we like a more tomatoey chili) and a second can of sliced stewed tomatoes;  we added more carrot (we diced 1/3 of a bag of carrot chips), more green and red bell pepper and minced garlic to the mix as well as 2 cans of drained/rinsed organic black beans (in place of the 1 can of kidney beans) and a can of drained white corn.  I also cut down on the parsley to 1/2 tsp and dried cilantro to 1/4 tsp.  Wow!  As the chili cooked, the liquid dissipated a bit, so we added more tomato juice as needed and upped the amount of steak sauce (we used A1) and added more white wine (marsala) to taste.  The result was a very hearty and delicious chili with the most superb taste!  I served it with shredded sharp cheddar cheese and chopped white onion for a kick with a side of organic blue tortilla chips.  We can't wait for leftovers tonight, and we will definitely be making this recipe again and again.  There is so much you can do with this recipe to adjust it to your personal taste preferences, yet the end result will always be great.  Thanks so much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMBER-SAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/324701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T06:48:34.623Z",
                "reviewBody": "This is a five-star chili recipe if there ever was one. We like a meaty chili so I used 2 pounds of ground beef instead of the 1.5 pounds called for. Obviously that required more liquid be added to this already somewhat \"dry\" chili so I added two small cans of tomato sauce--just enough to keep all the ingredients from sticking together like paste. Every few bites one catches a whiff of bacon which is quite pleasant indeed. I used real bacon which I think is clearly the way to go. The 57 Sauce cilantro and parsley all contribute their own subtle additions. This recipe is well planned and I highly recommend it. It takes a little time but is quite worth it. Just excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-13T21:53:38.88Z",
                "reviewBody": "I made this chili and my usual chili recipe for my son's birthday party. All my guests liked this one better..I have found a new chili recipe! I didn't add celery or carrots. At the advice of other reviewers I added a 14.5 ounce can tomato sauce and a 14.5 ounce can beef broth to thin it out. I also added one whole red pepper and one whole green pepper. Even my complete \"country boy\" brother in law raved over this one (and he was skeptical about the wine in the chili!!) It's not very spicey so if you like it hot add a few more pinches of red pepper flakes. VERY GOOD!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "5 in family",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1811450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-31T20:22:28.153Z",
                "reviewBody": "Easy and darn good! I didn't use the carrots but definitely used the bacon and may add a bit more next time. The bacon adds a wonderful smoky base to the chili. Also chopped up a small red-hot chili pepper to spice it up a little. Used Heinz 57 for the steak sauce. The chili lasted all week -- very economical meal planning!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Northstar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-09T19:45:21.25Z",
                "reviewBody": "Definitely a FIVE STAR RECIPE!!! I have made this chili for my family many many times and it never fails to impress! This is by far the best chili recipe I have ever found. We like it spicy so we add chili powder and hot sauce. We also eat it with sour cream chopped onions and cheese. It's even better the second day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CRISTNABLS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667664/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-10T05:41:13.903Z",
                "reviewBody": "This was a good easy chilli recipe. Next time I will leave out the carrots they add a crunch to the chili that it does not need. also I might add something to give it some heat! this version is very mild. We added garlic power and I think it worked out just fine. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/531719/"
                }
            }
        ]
    }
]