[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6749/ciabatta/",
        "name": "Ciabatta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F421598.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1998-06-24T04:09:45.000Z",
        "description": "Take five minutes today to make the starter, also called sponge, and tomorrow you can bake two loaves of this marvelous, slightly sour, rustic Italian bread that has a hearty crust.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P1DT1H0M",
        "recipeYield": "2 10 inch long oval loaves",
        "recipeIngredient": [
            "⅛ teaspoon active dry yeast",
            "2 tablespoons warm water (110 degrees F/45 degrees C)",
            "⅓ cup warm water",
            "1 cup bread flour",
            "½ teaspoon active dry yeast",
            "2 tablespoons warm milk (110 degrees F/45 degrees C)",
            "⅔ cup warm water",
            "1 tablespoon olive oil",
            "2 cups bread flour",
            "1 ½ teaspoons salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To Make Sponge: In a small bowl stir together 1/8 teaspoon of the yeast and the warm water and let stand 5 minutes, or until creamy. In a bowl stir together yeast mixture, 1/3 cup of the water, and 1 cup of the bread flour. Stir 4 minutes, then cover bowl with plastic wrap. Let sponge stand at cool room temperature for at least 12 hours and up to 1 day.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Bread: In a small bowl stir together yeast and milk and let stand 5 minutes, or until creamy. In bowl of a standing electric mixer fitted with dough hook blend together milk mixture, sponge, water, oil, and flour at low speed until flour is just moistened; add salt and mix until smooth and elastic, about 8 minutes. Scrape dough into an oiled bowl and cover with plastic wrap.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let dough rise at room temperature until doubled in bulk, about 1 1/2 hours. (Dough will be sticky and full of air bubbles.) Turn dough out onto a well-floured work surface and cut in half. Transfer each half to a parchment sheet and form into an irregular oval about 9 inches long. Dimple loaves with floured fingers and dust tops with flour. Cover loaves with a dampened kitchen towel. Let loaves rise at room temperature until almost doubled in bulk, 1 1/2 to 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "At least 45 minutes before baking ciabatta, put a baking stone on oven rack in lowest position in oven and preheat oven to 425  F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer 1 loaf on its parchment to a rimless baking sheet with a long side of loaf parallel to far edge of baking sheet. Line up far edge of baking sheet with far edge of stone or tiles, and tilt baking sheet to slide loaf with parchment onto back half of stone or tiles. Transfer remaining loaf to front half of stone in a similar manner. Bake ciabatta loaves 20 minutes, or until pale golden. Cool loaves on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Benoit Hogue"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.551369863013699,
            "ratingCount": 292,
            "itemReviewed": "Ciabatta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "96.1 calories",
            "carbohydrateContent": "17.6 g",
            "cholesterolContent": "0.2 mg",
            "fatContent": "1.3 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "234.5 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-21T17:08:43.61Z",
                "reviewBody": "This was the best bread I've ever made! I prepared the sponge two days in advance and kept it in the fridge. I had no problems with it being too sticky like others mentioned. I cooked it on a pizza stone and basted with water every 5 minutes for a brown, crunchy crust. The parchment did burn a little around the edges while baking, but it was reminiscent of an old Italian bakery. See my picture -this bread is perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Sell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T17:21:10.193Z",
                "reviewBody": "The easiest 'real sourdough' recipie; those without 'aging' of dough lack the genuine ciabatta taste, even though they may get the consistancy right.  This one gets even better with more than one days aging of the 'sponge'.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRC43",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-13T22:15:10.58Z",
                "reviewBody": "I cannot tell you how AMAZING this bread is. 3 loaves were gone in under a day and a half! It is crunchy on the outside, soft and moist on the inside and filled with all these lovely bubbly craters! I replaced the milk with water and just baked on a greased and floured baking sheet and it was still wonderful. I cannot rate this recipe highly enough. I served with olive tapenade and caprese salad for appetizers and it was wonderful. My fiance and family could not get enough of it! They beg for it EVERYDAY. Will certainly make again and again and again! \n\nFirst, the sponge is amazing. Tastes just as good after only sitting for a few hours as it does after 24+. I made it once and left it for 24 hours in a cool place and that made nice fluffy bread without many air pockets. The second time i made the sponge I left it right next to a warm stove top and it rose very quickly and made these HUGE air pockets in my finished product. I only left this for 4 hours but the taste and texture were FANTASTIC and the sponge almost spilled over the rim of the bowl! It was a bit difficult to get out of the bowl because of its stickiness but that was to be expected. For those that thought the sponge needed water, it doesn't. It will look just like a clump of dough in the beginning but if you leave it you'll be pleasantly surprised with a bubbling, frothy, sticky sponge. \n\nSecondly, I made this recipe cautiously because I expected it to be very difficult to handle, but it was not. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gitana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2955976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-04T18:06:07.693Z",
                "reviewBody": "I'll start with the good: I've been making bread for a couple years and this is easily the best bread I've made to date.  It was soft, chewy, soaked up butter like a sponge when I served it.\n\nThe bad: The \"sponge\" measurements didn't work for me.  The measurements given resulted in a softball sized ball of dough, not a sponge.  A sponge, as I know it, should be extremely wet and gooey.  I ended up going with equal parts flour and water, as well as additional yeast.  And while a baking stone may produce a nice crusty bottom I've always felt that it took some of the air out of the bread since you're transferring the dough after it's been proofed.  I just baked them on the parchment paper that had already been sprinkled with some cornmeal.  Sat for 90 minutes and was ready to go in the oven.\n\nSo while the exact recipe would have been a complete flop for me (sponge not spongy) the overall idea and directions are pretty solid.  I'll definitely be making the modified version again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrew Millott",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1991573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-28T21:35:33.897Z",
                "reviewBody": "I have fallen in love with making bread these past few months, and this is the best recipe I have have found, by far. I have made at least 12 loaves with this, and every time I make it, my roommates/friends devour it instantly.   I have modified it a little, though. I found the original recipe to be too dry for my tastes when it came out of the over, so I tripled the olive oil, and it came out moist and delicious. Add more oil to the recipe and you're in great shape. I love this bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "freshfromtheoven",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3555627/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-03T06:05:00.123Z",
                "reviewBody": "My husband and I celebrated our 11 year wedding anniversary with Friends and an Italian meal. Since my husband had visited Italy and collected recipes when we were there the only one missing was a bread recipe. It was a little involved as far as prep time but it was easy GOOD and tasted just like what we had eaten in Florence!!!!!!! I will make it again. For 15 people I made 6 loaves with enough left over for dinner the next night.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MORIAH BENGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643365/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T17:19:52.41Z",
                "reviewBody": "Awesome recipe! It makes such a wonderful crusty bread that it's tempting to eat the whole loaf! I didn't have parchment or a baking stone so I oiled a cookie sheet and sprinkled cornmeal on it before making the loaves. They turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShariV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/898784/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-27T03:41:03.53Z",
                "reviewBody": "I made this bread today and it turned just like the ones I've paid big bucks at the especialty's stores. Great taste and texture. I sent a piece of this bread w/my husband's lunch and he shared w/his friend... Next I know he is calling asking me to give a copy of the recipe to his friend. Hubby compared it w/the breads they serve at fancy restaurants.Everyone in my family love it. The kids even ate it without butter or jam!!!! It is a keeper!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marcia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1574030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-29T17:20:55.35Z",
                "reviewBody": "Great tasting recipe, and a good airy texture to the bread.  Very, very, very sticky.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAM DONALDSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/254194/"
                }
            }
        ]
    }
]