[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6882/french-bread/",
        "name": "French Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F22%2F5175256-2000.jpg",
            "width": 2000,
            "height": 1125
        },
        "datePublished": "1998-08-23T23:43:45.000Z",
        "description": "A crisp, crunchy crust and slightly chewy center make this bread as traditional as the breads served in France.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "2 large loaves",
        "recipeIngredient": [
            "6 cups all-purpose flour",
            "2 ½ (.25 ounce) packages active dry yeast",
            "1 ½ teaspoons salt",
            "2 cups warm water (110 degrees F/45 degrees C)",
            "1 tablespoon cornmeal",
            "1 egg white",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine 2 cups flour, yeast and salt. Stir in 2 cups warm water, and beat until well blended using a stand mixer with a dough hook attachment. Using a wooden spoon, stir in as much of the remaining flour as you can.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, knead in enough flour to make a stiff dough that is smooth and elastic. Knead for about 8 to 10 minutes total. Shape into a ball.  Place dough in a greased bowl, and turn once. Cover, and let rise in a warm place until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch dough down, and divide in half. Turn out onto a lightly floured surface.  Cover, and let rest for 10 minutes. Roll each half into large rectangle. Roll up, starting from a long side. Moisten edge with water and seal. Taper ends.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease a large baking sheet. Sprinkle with cornmeal. Place loaves, seam side down, on the prepared baking sheet. Lightly beat the egg white with 1 tablespoon of water, and brush on. Cover with a damp cloth. Let rise until nearly doubled, 35 to 40 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a very sharp knife, make 3 or 4 diagonal cuts about 1/4 inch deep across top of each loaf. Bake in a preheated 375 degrees F (190 degrees C) oven for 20 minutes. Brush again with egg white mixture. Bake for an additional 15 to 20 minutes, or until bread tests done. If necessary, cover loosely with  foil to prevent over browning. Remove from baking sheet, and cool on a wire rack.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jenn Hall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5439114391143915,
            "ratingCount": 1355,
            "itemReviewed": "French Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "94.3 calories",
            "carbohydrateContent": "19.5 g",
            "cholesterolContent": null,
            "fatContent": "0.3 g",
            "fiberContent": "0.8 g",
            "proteinContent": "2.9 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "119.4 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-08T23:45:34.297Z",
                "reviewBody": "Quick disclaimer...I loved this recipe; great crust with a soft, yet, chewy center.  With that said, I'll poke some holes in the instructions.  First, the recipe does say 2 and 1/2 half packages of yeast--there was some confusion among previous reviewers.  So...1 pg. of active dry yeast = .25 ounces or 2 and 1/2 teaspoons per packet.  I used 5 teaspoons of yeast in my trial batch and it went well.  Secondly, most people (like me) may want to add more salt and some butter.  The trial batch came out a bit bland.  I'm going to add another 1/2 teaspoon of salt and a tablespoon of butter.  Since butter is only 15% water, one tablespoon shouldn't affect your total liquids that much.  One last note, the first rise in my trial batch doubled in 30 minutes.  Luckily the bench proof added another 40 minutes to the rise.  With those adjustments made, this recipe is definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tony Kollman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1514472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T20:04:19.85Z",
                "reviewBody": "All I can say is \"Wow\".  I tried this recipe twice.  The first time I made this, I found the bread to be a bit too dense, but the second time, I added a pinch more yeast and only used 5 cups of flour.  I made a nice long baguette and brushed the loaves with just a beaten egg white (left out the water) and I got a nice crust and a lighter loaf.  Has come out perfect every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANTHONYRIOS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/785296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-05T04:38:37.883Z",
                "reviewBody": "This is a very good & easy french bread recipe.  I first made the bread exactly as described and ended up with dough that was a bit too dense.  The bread was good but a bit thick and a little on the bland side.  Being an experimenter and something of a perfectionist, I decided to give it another try and proofed the yeast in the warm water with a little bit of sugar before making the dough.  I also decreased the flour (noting that the 6c in the ingredient list was more of a guideline and that the real goal was nice, elastic dough) to ~5 1/4 c.  I also  increased the salt amount to 1.5tsp as other reviewers had mentioned.  This batch was considerably lighter and more tasty than the original recipe. While bread making is up to taste, I'll be doing it the second way from now on!  Great recipe and thanks very much for sharing it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "dthomsen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2233283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-20T15:06:37.763Z",
                "reviewBody": "Very easy to make and who doesn't like hot fresh bread right out of the oven!\nI took the time and read most of the reviews, and based on their suggestions the bread came out perfect! So that you don't have to read them all yourself, I've combined them here:  5 cups flour instead of 6, 2(.25 oz) pkgs active dry yeast, 1 Tablespoon salt, and made the cuts in step 4 after the 3rd sentence.  If you use Pure Spring Water(not to be confused with distilled water) and Fine Sea Salt(make sure it's Fine sea salt and not Coarse, and it will dissolve perfectly in your dough), it will make it even better!  Kneading bread is great therapy...it's a great place to take out your frustations!  Don't skimp on kneading time. Set a timer if it helps. If the dough is under-kneaded, the gluten will not be developed enough to allow the dough to rise during fermentation.  Yeast:  1st check the expiration date; old yeast could be dead or too lethargic. Proofing always helps. To Proof yeast: In a medium bowl combine 1/2 cup warm water (100-110 F), 2 teaspoons sugar, and the 2 pkgs of yeast this recipe calls for, let stand 10 minutes. If mixture doubles in volume, the yeast is active. This leaves you with only 1-1/2 cups water to be added to the flour. Great recipe Jenn!  Thank you!!!\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sabra Bartlett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1024916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-03T20:06:45.537Z",
                "reviewBody": "I'll put it to you this way, this recipe made 2 loaves, I planned on serving it with dinner.  When I took it out of the oven I \"decided\" that I had to be the guinea pig, or pig if you will,  because I ate half of 1 loaf.  Then the kids came home from school & they polished off the first loaf, and the second was a quarter gone.  Hubby came home from work & snagged a chunk (suprising because he's not the biggest bread fan), & before I knew it, the four of us (baby had regular bread..egg alergy) were sharing 1/4 of the second loaf with dinner; all staring at it, nobody wanting to \"grab\" because deep down we all knew that we had eaten our share.  This was AWESOME, I sprinkled sesame seeds on the top after adding the egg white.  LOVE IT, THANKS MUCH Jenn!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-03T00:28:56.53Z",
                "reviewBody": "This came out just as I intended, crust was nice and golden, crispy, crunchy and crusty on the outside and soft and chewy on the inside. Exactly what I wanted. Thanks.\n I did add an extra pinch of salt, and a table spoon of suger in hte first step. If you want less dense bread let is rise longer. Also, if you cut the lines in the top of the bread BEFORE you let it rise the second time, that prevents it from falling in (and becomming more dense) when you bake it.\nWhat I think might be really great is to coat the bread with garlic butter, before rolling it up. I think it would make wonderful garlic bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Illisil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2211686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-10T21:04:55.543Z",
                "reviewBody": "Oh my!  This bread is wonderful.  I bake bread almost every week, and decided to try something different.  I did change a couple of things to suit my family's taste.  I proofed my yeast with about a tablespoon of honey in the water.  Also to gain a soft and chewy crust, about 5 minutes before the bread was done I melted about 2 tablespoons of butter and stirred in a tablespoon of honey.  As soon as the bread came out of the oven, I poured this over the top, placed a piece of foil over it, and placed a damp towel over the whole thing.  Let this sit for about 15 minutes and the result will be an amazing bread.  I just hope I don't eat it all before my family gets home for dinner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Brooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1893525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-26T18:31:25.197Z",
                "reviewBody": "I have always been so intimidated by bread making! Well, the first batch was a total disaster! So, knowing there must be some tricks to French bread making, I researched online. Trick no.1: I found out that by adding natural dough enhancers (1/2 tsp soy lecithin added to the liquid ingred., a pinch of citric acid and a dash of ground ginger added to the dry ingred.) you get a fluffier bread that will stay fresh and soft longer. Trick no.2: kneading and flour qty. I used 5 cups flour. The kneading for 10 minutes is a must if you want fluff in your bread. Trick no.3: let it raise!  The dough needs to double (this could mean 15-20 min up to one hour) and you test for doneness by sticking a finger in the middle of the raised dough, making sure the indentation stays and it does not spring back. If it springs back and it is not double in volume, it needs to stay longer. Trick no.4: Roll it thin in the rectangle shape and then roll it up tight forming a thin \"baguette\". After trying many different ways, I decided my breads looked best when I made my diagonal cuts at this step, then I let it raise again for about 10 minutes. One remark: French bread requires a water wash and baking with steam to come out crunchy, eggs are a no-no on this type of bread. To get the steam, simply put an oven safe container on the bottom shelf of the oven and use a water spray pump to mist water over the loaves twice while it's baking, instead of the egg wash the recipe mentions.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kyra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3372597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T05:45:30.513Z",
                "reviewBody": "Perfection! Beautifully fine texture and creamy taste.  I have sensitive teeth however so the hard crust was a little too hard for me.  For a softer, yet still deep golden crust use this as an egg wash.  Mix together 1 egg yolk and 1 tbsp milk, brush over entire loaf before baking.  It's only slightly softer and actually comes out more golden and glossy.  I loved the rolling trick too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peripheree",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/215019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T23:04:20.520Z",
                "reviewBody": "This was fun to make, but the end product was dense and the flavor wasn't that great.  I'll keep hunting.  I think a little sugar would have helped.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Waltrip",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673574/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "French Bread",
            "description": "The crust is crunchy and the center is moist. What’s not to love?",
            "uploadDate": "2012-07-10T18:12:39.955Z",
            "duration": "PT7M1.379S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F83423ba1-6a6e-4906-8bb7-1aa656a727dd%2Fad9acb6e-8925-4bc9-8a19-5bb0388b32e0%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729060991001"
        }
    }
]