[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7106/essene-bread/",
        "name": "Essene Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1009396.jpg",
            "width": 1191,
            "height": 1200
        },
        "datePublished": "1999-03-22T19:03:39.000Z",
        "description": "This is a sprouted bread recipe - very old, and said to have been created back in the biblical days.  Also, this recipe literally, takes days to make. Your efforts and time will be well rewarded with a couple of the most singular breads-solid, sweet, and moist. Wheat berries are available from your local natural foods store.  Traditionally, Essene bread was probably baked on hot rocks under scorching sunlight, but where I and most of us live, this is not possible. Baking at the oven temperatures which I suggest might destroy the sprout enzymes, but monitoring baking loaves for much longer than 2 hours is too long for me. Guaranteeing the preservation of the enzymes might require baking at a very low temperature for perhaps 4 hours. If you have the stamina, then go for it.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 small loaves",
        "recipeIngredient": [
            "3 cups wheat berries",
            "3 cups water to cover",
            "1 tablespoon cornmeal"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beginning several days before you hope to be eating this bread, rinse the wheat berries in cool water, drain and submerge the berries with cool water in a large bowl. Cover the bowl with a plate or cloth, and allow the berries to soak at normal room temperature overnight or for about 12 hours. The berries will soak up a considerable amount of water. Drain the berries in a colander, cover the colander with a plate to prevent the berries from drying out, and set it in a place away from light and where the sun won't shine on it.  Rinse the berries about 3 times a day, and they will soon begin to sprout. In a couple of days the sprouts will reach their optimum length of about l/4 inch. Growth depends on moisture and temperature so be patient.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grind in a food mill or in a food processor.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After grinding, dump the mushed up grain onto a clean work surface. Squeeze and knead the grain for about 10 minutes, and then form up 2 small round, hearth-style loaves with your hands. Sprinkle an insulated cookie sheet with a little bran or cornmeal, and put the loaves on it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheating the oven is not necessary. Cover the loaves with cloches, and bake at 350 degrees F (175 degrees C) for 30 minutes. Then turn the oven down to 325 degrees F (165 degrees C), and bake for approximately 2 hours and 15 minutes more. Allow the breads to cool thoroughly on cooling racks for several hours, and then, because of the high moisture content, store in the refrigerator. For best results, slice this bread thinly, or break with hands\n"
            }
        ],
        "recipeCategory": [
            "Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARBALET"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8181818181818183,
            "ratingCount": 11,
            "itemReviewed": "Essene Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "162.7 calories",
            "carbohydrateContent": "34.6 g",
            "cholesterolContent": null,
            "fatContent": "1 g",
            "fiberContent": "7 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "0.1 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-10T04:02:25.247Z",
                "reviewBody": "I have been looking for a sprouted bread recipe ever since leaving the USA, where I could buy it in the grocery. \r\nThanks so much for submitting this nutritious recipe!  I knew going in that it would take several days to make, so\r\nthe time did not bother me, and we have a heavy duty grinding machine, so that was not a problem either.\r\nI must say, I eat sprouted bread for the super nutritional value, but this bread tastes great!  So sweet, chewy \r\nand crispy all at once.  I am delighted and it will become a staple in our house...  Thanks Holly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THESSA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/265117/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-14T15:53:11.957Z",
                "reviewBody": "Those who said it tasted like grass let their berries sprout to long. Just let them barely sprout a tiny bit. More than that and you get grass.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AuntNellie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2022353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-26T17:29:56.927Z",
                "reviewBody": "I make Essene bread, but my method is a bit different than this recipe.  I like to use quart jars for the sprouting.  I put 1 cup of wheat berries in each quart jar (I do about 10 jars).  Fill jars with cool water, put in a place out of the sunlight and completely cover with a dark, damp towel.  Let sit overnight.  The next morning, I use a colander with a flat bottom, place it over a jar and tip it over the sink to drain it. Rinse and drain well, but gently. Cover completely with damp towel.  Rinse and drain 3 X a day (gently so you don't break the sprouts).  Keep towel damp.  Don't let the sprouts see light at all.  Quart jars will be full when sprouts are ready.  Grind or process (in processor, sprouts will begin to form a ball, and don't overfill processor), leave plain, or add nuts, dried fruit, etc.  Shape into loaves or spread out on cookie sheet.  Bake @ 250 for about 4 hours.  Loaves will be crusty on outside, moist on inside.  Loaves will spring back when pressed with finger.  If sprouts turn green they taste \"grassy\" and lose their sweetness.  Exposure to light will make them green and you don't want that.  Always keep covered with a damp, dark towel. If you spread onto a cookie sheet, cut into squares. I like to use the non-stick cookie sheet covers instead of corn meal, etc.  Bread is best when aged about a day.  Store in fridge, or freeze what you don't use right away. I hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1626314/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-21T14:12:55.217Z",
                "reviewBody": "I followed the directions given and found the sprouting and grinding easy. I baked the two loaves for 5 hours on low heat with covers over each loaf. They were almost too moist. The taste was very grassy. I have had other sprouted breads which did not have this \"grass\" flavor. I am not sure what went wrong. This recipe was so easy to make that I would like to try it again if anyone can suggest what needs to be done to improve the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JOYJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/270027/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-27T20:01:36.987Z",
                "reviewBody": "I'm in the process of sprouting my berries but I found a different recipe that bake at 160-250 degrees for 3-4 hours if anyone had trouble with cooking time and suggests oiling the pan. figured I'd share.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Petra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2821985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-03T18:40:47.66Z",
                "reviewBody": "absolutly wonderful. My signifancant other is on a special caveman diet and this is the only kind of bread he can eat. I added a little honey to the bread about 1/4 cup and it came out tasting like a sweet cake. Much better and much cheaper that comercial varites!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3062499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-21T14:12:45.187Z",
                "reviewBody": "This bread did not work for me. It seemed to lack flavor. I think I have had this with shredded carrots raisins and nuts added which I think would help the taste. I tried this twice without good results. Maybe it is my tecnique.???",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny Claxton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-14T17:15:09.607Z",
                "reviewBody": "It was fun making the sprouts with the kids. It was fun grinding the sprouts by hand with the kids. It was fun entering the baked results in the science fair with the kids. It had the flavor of a huge wet whole grain bran cereal conglomerate and the appearance of a lage horse pie. We ate it with brown sugar and milk for breakfast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "GUINEAPIGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/403246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-30T20:29:27.28Z",
                "reviewBody": "what did i do wrong?? i spent days getting this bread ready but when i baked it (for the time and temperature specified) it got all hard and burnt on the bottom.. like burnt sugar.. too hot maybe? i was really looking forward to trying my hard work:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILLYKITTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15584/"
                }
            }
        ]
    }
]