[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/344/bread/yeast-bread/whole-grain-bread/",
                    "name": "Whole Grain Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15509/bread/yeast-bread/whole-grain-bread/wheat-bread/",
                    "name": "Wheat Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7225/cracked-wheat-sourdough-bread/",
        "name": "Cracked Wheat Sourdough Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8102878.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "1999-07-01T10:46:24.000Z",
        "description": "A hearty grain and seed filled sourdough bread. Any good sourdough starter will work in this bread. The Rye Starter is just an example of one type of starter to use.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 9x5 inch loaves",
        "recipeIngredient": [
            "¾ cup cracked wheat",
            "1 cup hot water",
            "¼ cup margarine, melted",
            "2 tablespoons molasses",
            "2 tablespoons honey",
            "¾ cup nonfat milk",
            "½ cup flax seed",
            "½ cup raw sunflower seeds",
            "2 ½ cups sourdough starter",
            "2 cups whole wheat flour",
            "3 ½ cups bread flour",
            "1 egg, beaten"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl place cracked wheat and pour hot water, (does not need be boiling), over wheat.  Add melted margarine, molasses, honey, nonfat milk, flax seed and sunflower seeds and mix well. Cool to lukewarm and stir in the sourdough starter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a large wooden spoon start stirring in the flours, 1 cup at a time, beginning with the whole wheat then the bread flour. When dough is stiff enough to work, turn out onto a floured surface and knead a good 10 to 12 minutes, working in as little of the remaining flour as necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When smooth and elastic, shape dough into a ball and put it into a greased bowl, turning to coat all sides.  Cover, place in a warm, draft-free spot, and let rise until doubled in bulk, about 1 1/2 hours, punch down risen dough and set aside again to rise in a warm spot until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the second rising is complete, punch down the dough and shape into two loaves.  Place dough in two well-greased 9x5 inch loaf pans, cover and let rise again until doubled in bulk, or until the dough reaches the tops of the pans, about 1 hour.  Brush tops with an egg wash, made by whisking one tablespoon water into one whole egg until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated 375 degree (190 degrees C) oven for 30 minutes, after 15 minutes rotate pans and spray with cold water, continue baking until the loaves test done by the hollow sound made when tapped on the top and bottom.  Cool on racks in the pans for 10 minutes, then turn out onto the racks to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Whole Grain Bread Recipes",
            "Wheat Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JACLYN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5777777777777775,
            "ratingCount": 45,
            "itemReviewed": "Cracked Wheat Sourdough Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "199.9 calories",
            "carbohydrateContent": "36.1 g",
            "cholesterolContent": "8.1 mg",
            "fatContent": "3.9 g",
            "fiberContent": "4 g",
            "proteinContent": "7.4 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "35.8 mg",
            "sugarContent": "3.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-08-12T23:18:23.217Z",
                "reviewBody": "I questioned the fact that there is no salt in this recipe and made it according to directions anyway. It is a terrific bread and the addition of salt would make it even better. I found an identical recipe that calls for 1 1/2 tsp salt.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Echo44",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-02T19:28:57.343Z",
                "reviewBody": "I changed this recipe slightly to work with what we had on hand. I used 1 cup freshly chopped flax seed. (The body just passes out whole flax seed and you lose the nurtitional value unless you chop or grind it) I will try it with the sunflower seeds added in the future but was out of them at this time. I used butter rather than margarine and used all freshly ground Hard White Prarie Gold Wheat. I cracked the Prarie Gold for the cracked wheat. I was boiling potatoes to mash so I poured the water off of them for the hot water in the recipe. The bread turned out great. My entire family loved it. We even made sandwiches out of it. It was suprisingly light for a bread that had seeds in it. One daughter said it made great toast. My Husband is a very picky eater and requested I send some in his lunch today. This is a bread I will bake again and again. Thanks for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EATINHEALTHY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1016689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-06T14:04:55.153Z",
                "reviewBody": "This is very good, hearty without being overly heavy.  I agree with another reviewer that it could use a little salt, and it does make 2 HUGE loaves.  My starter is a very sweet and liquidy one -- I find that it works best if I feed 2 cups of it with a cup of flour and let sit overnight, then proceed from there.  I also found that it needs a much longer rise time.  I don't know how you get sourdough bread without any additional yeast to rise this quickly.  I give the first rise overnight, the second rise does not need quite as long.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ESTEPHAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1180947/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-06T01:54:21.67Z",
                "reviewBody": "Absolutely wonderful! I left our the sunflower seeds didn't have any and used butter instead of margarine never use the stuff. Tastes wonderful great texture. Rate this on 5 stars for sure!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAEVEN6",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/459686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-02T18:50:14.343Z",
                "reviewBody": "This made a great loaf of bread. I placed it on baking stones and made a freeform loaf.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elaine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/elaine3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-25T02:44:05.263Z",
                "reviewBody": "I am new to bread making so maybe I am doing something wrong but this bread just doesn't turn out right. I have made it twice and I must have had to potent of a starter because in the first rise after the hour and a half it had tripled.... same for the second rise. Then when I put it in the pans it hardly rose at all and the bit that it did rise it fell flat after putting th egg wash on and while baking. Today I made it again this time with a more aged starter. It rose about right for the first two rises and rose good for the pan rise (although it took two hours instead of the one called for) but again fell after I put the egg wash on (I was very gentle) and baking. It didn't fall as much this time though. The bread tastes too \"sour\" and doesn't have good \"bread\" texture. (I am sure that is from falling.) I might try making this again but with half the starter called for and then just let it rise once before putting it in the pans. I am afraid to waste my time again though. sigh (BTW: Last week I made a basic sourdough bread recipe with the same sourdoug starter and it worked out perfect so I don't think it is my starter.) The bread did rise (with no extra yeast) and so many other people like it that I give it four stars. Maybe I am doing something wrong and maybe other people like bread that \"sour\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-06T01:54:06.687Z",
                "reviewBody": "This is a wonderful \"meaty\" bread! It was devoured immediately in my house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/209823/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-21T18:28:39.96Z",
                "reviewBody": "I am relatively new to sourdough (3 months or so).  I made this bread with my own \"homegrown\" sourdough made from white flour and pineapple juice.  It worked! - it just took time and patience.  I've been baking some sort of sourdough bread weekly since then.  I love a heavy bread that is full of whole grains and this is one of those.  At first I made the bread as written but have tried variations (added oatmeal, used only molasses vs. half honey etc.).  My sourdough works best when well fed - I usually keep it in the refrigerator during the week and take it our Thursday night or Friday morning for Saturday baking.  My base (the amount kept for later baking) is a small amount (1/4 cup or so) to allow for multiple feedings of flour and water just before baking spaced about 6 to 8 hours apart.  Well fed starter makes the difference for me as to whether my bread will rise without using commercial yeast.  Before putting back into the refrigerator I feed the small amount reserved from baking (1/4 cup) with an equal amount of flour and a very small amount of water to make a very thick batter - this helps the starter to keep in the cold until taken back out a day or so before baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GMac",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3216281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-06T01:54:02.7Z",
                "reviewBody": "I thoroughly enjoyed this recipe and my kids and Husband surprised me by wanting more and more of it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARA LOU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/582411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-10T19:44:43.643Z",
                "reviewBody": "Every bread recipe needs salt. I added my normal 3/4 tsp salt/loaf. Without salt the bread will rise way to fast and have a dead flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKINGGIRL415",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1378881/"
                }
            }
        ]
    }
]