[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14730/soups-stews-and-chili/stews/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26425/hearty-beef-stew/",
        "name": "Hearty Beef Stew",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8640896.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2019-04-02T06:43:38.000Z",
        "description": "This hearty beef stew will put some meat on your bones.  The teriyaki sauce adds a nice zest to the flavor of the stew.  The meat comes out moist and tender.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT6H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound cubed beef stew meat",
            "¼ cup all-purpose flour",
            "1 tablespoon paprika",
            "salt and pepper to taste",
            "2 cups beef broth",
            "1 ½ tablespoons teriyaki sauce",
            "1 onion, chopped",
            "3 carrots, sliced",
            "1 stalk celery, sliced",
            "2 potatoes, cubed",
            "½ pound mushrooms, quartered",
            "2 cloves garlic, minced",
            "1 bay leaf"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place beef stew meat into a slow cooker. In a small bowl, mix together flour, paprika, salt, and pepper; sprinkle over beef stew meat, stirring to coat. Stir in beef broth, teriyaki sauce, onion, carrots, celery, potatoes, mushrooms, garlic and bay leaf.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on Low 6 hours, stirring occasionally.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "EIORE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.223880597014926,
            "ratingCount": 201,
            "itemReviewed": "Hearty Beef Stew",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "318.8 calories",
            "carbohydrateContent": "19.9 g",
            "cholesterolContent": "62.5 mg",
            "fatContent": "16.3 g",
            "fiberContent": "4.3 g",
            "proteinContent": "23.5 g",
            "saturatedFatContent": "6.3 g",
            "servingSize": null,
            "sodiumContent": "735.3 mg",
            "sugarContent": "5.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-01-03T03:32:38.86Z",
                "reviewBody": "This is a wonderful starter recipe. Here is my variation as well as some of the advice I followed by others... We were out of beef broth so I used two beef granules in two and a half cups of water. I omitted the mushrooms and added chopped up green peppers. I also added an extra potato and more carrots. Because some complained about the potatoes not being done I \"par\" cooked the potatoes in the microwave (2 minutes covered in water-drained and added) I was out of teriyaki sauce so I made a simple substitute--a little bit of cooking sherry soy sauce ginger and garlic. It worked beautifully.. Also--to avoid the flour excess some spoke of brown your stew meat in the 1/4 cup of flour before adding it to the crock pot. The spices I included were garlic seasoning salt a pack of onion soup mix a pinch of ground cloves and patrika salt and pepper. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jessica-Rabbit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2618462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-11T18:23:43.793Z",
                "reviewBody": "I had just turned on the full crock pot before I read the reviews.. that's not like me! But at least I did read them in time to add a little liquid. I added roughly 2/3 Cup of Beef Stock and 1/3 cup of Worchestershire Sause. I doubled the recipe, by the way.  The Texture of the stew was really good. It's thick and just the way I like stew. Except for the Potatoes. I cooked for 5 hours, 3 hours on high and 2 hours on low, and the potatoes were still a little crunchy. I used Baby Yellow Potatoes, cut into less approx. 1/2 inch peices (at their thickest points) So I thought for sure they would cook, but alas, they did not. So cook on high! And the BIGGEST complaint I had about this dish was the paprika. If you do not use large amounts of paprika on a regular basis... DO NOT ADD IT! you can add a tiny bit, like 1/4 of what's called for, but if you are not familiar with the acidic tart earthy flavor, you probably wont like tablespoons of it in your stew. And the liauid you add. You should make it Reduced Beef Stock. Which means Buy Beef stock, put it in a saucepan and boil gently until it is reduced down to the volume of the amount of liquid you want to add. It will be very strong, and that's ok. It has the job of basically flavoring the whole stew.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Sy Chandell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/241057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-31T17:35:24.187Z",
                "reviewBody": "This stew was JUST what I was looking for!!! I doubled the recipe and we barely had any left from 6 adults!!! I added one more carrot celery stalk and potato than what the recipe called for because I LOVE lots of stuff in my stew.:) I also omitted the mushrooms (friends we had over don't like them) and added about 1.5 cups of frozen peas. I added about 1/4 cup more flour towards the end to make it thicker. Also I used 1 can of low sodium beef broth and 1 can of regular and it came out just fine with less sodium! Because I doubled the recipe mine cooked for 8-9 hours but it was a hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "S Griffin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1674974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-14T22:56:22.223Z",
                "reviewBody": "The first time I made this stew it was exactly what I was looking for. I took the advice and added 1tbsp worchestershire sauce an extra 1/2c beef broth reduced the paprika to 1/4tsp and about 2tbsp of lipton's onion soup mix a 1/4 tsp both of salt & pepper I added a bay leaf and added about 2tbsp corn starch at the end to thicken it up. It was WONDERFUL husband loved it definitely will make again.-------- It's been 3 years now and this is one of my favorite recipies ever! I've perfected it I still do everything the same just upped the wocersershire sauce to 2 1/2 tblsp and I've always doubled the veggies. It's so important that you layer everything by how long it takes to cook. I put the meat on the bottom then the potatos then the carrots with the mushrooms and celery on top. The slower and longer you cook it the more tender and flavorful everything is. I LOVE this recipe!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "E'Lise C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2667515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-25T03:08:01.59Z",
                "reviewBody": "ABSOLUTELY DELICIOUS! We are a family of six so I doubled everything. My four kids are picky eaters and they loved it they even had seconds that made me happy. The only thing I changed was that I started dinner at 4pm so I didn't have 6 hours to cook. What I did was cook the meat 45 minutes on the stovetop with 4 cups water garlic and onion. Then drained the water added the mixture to coat the meat then added everything else as indicated in the receipe. And cooked it on medium heat for another 45 minutes. I made an easy 15 minute corn bread receipe. And dinner was on the table by 6:30pm. Thank you very much for the receipe this is the first time I used this website. I will definitely pass this receipe on and use your website again for more receipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2505652/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-04T21:50:38.403Z",
                "reviewBody": "This is excellent!! I don't know why it only has 4 stars... I made a few changes however: I didn't use any celery but chopped up two potatoes into big pieces instead. Also I used beef round steak b/c I had it on hand. BUT I would actually do it again - since the round steak was a bit thin and already tenderized little pieces of it \"floated off\" while cooking so every bite of the stew had beef in it. There were of course still big chunks throughout. Some people complained of a \"sweet funny taste\" - I thought it tasted perfect. I cooked it on low for 8 hours and it was perfect. Trust the recipe don't change anything except any vegetables you might like to take out or add.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1879389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T20:19:52.077Z",
                "reviewBody": "This recipe has been updated to include 2 cups beef broth in the ingredient list. - The Staff",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the allrecipes staff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T21:42:32.257Z",
                "reviewBody": "Absolutely a wonderful stew. My Aunt and Uncle moved into a new house and hadn't had a home-cooked mean in over a week. I whipped this up and it was a real God-send. I threw in a can of peas and a can of corn at the end. I also added some worchestershire sauce for some added zest. It makes a great leftover too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYVOLFAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/238852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-01T22:42:45.42Z",
                "reviewBody": "Didn't have terriyaki so I used soy sauce. I too will add worschestire sauce next time. Very tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MILLERP165",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512793/"
                }
            }
        ]
    }
]