[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8937/busy-day-chicken-rice-casserole/",
        "name": "Busy Day Chicken Rice Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6152212.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "1999-05-15T20:40:45.000Z",
        "description": "This is my family's favorite one dish meal - mine too, since it is so easy to put together! I use skinless, boneless chicken breasts but mixed chicken pieces can be used, too. I also use the low fat, low sodium canned soups and the taste is still great!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (10.75 ounce) can  condensed cream of celery soup",
            "1 cup water",
            "1 cup uncooked white rice",
            "1 (4.5 ounce) can mushrooms, drained",
            "1 pinch garlic powder",
            "ground black pepper to taste",
            "1 (1 ounce) package dry onion soup mix",
            "8 skinless, boneless chicken breast halves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl combine the mushroom soup, celery soup, water, rice, mushrooms, garlic powder and black pepper. Mix all together. Pour mixture into a 9x13 inch baking dish and spread on bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lay chicken pieces over soup mixture and sprinkle dry onion soup mix over all. Cover tightly with aluminum foil and bake in the preheated oven for 1 to 1 1/2 hours or until chicken is cooked through and no longer pink inside.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0875,
            "ratingCount": 480,
            "itemReviewed": "Busy Day Chicken Rice Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "291.1 calories",
            "carbohydrateContent": "27.7 g",
            "cholesterolContent": "72.6 mg",
            "fatContent": "5.7 g",
            "fiberContent": "1.2 g",
            "proteinContent": "30.5 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "988 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-24T12:48:31.03Z",
                "reviewBody": "Whenever my family want something warm and comforting I make this dish. I use chicken thighs personal preference I chop onions and garlic and fry those up then use the oil and drippings from the onions/garlic to brown the chicken before placing it in the baking dish with the rice mixture...I use garlic/onion powder...seasoning salt...cracked black pepper...this recipe can be as bland...or as seasoned as you like it......",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MamaDigger",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1896268/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-19T23:49:45.217Z",
                "reviewBody": "I remember my mom making a very similar recipe when I was a kid and it was one of my favorite dishes. I was finally able to find the recipe again here! I do increase the rice by about half a cup and add about a cup of milk with everything else (so there are two cups of liquid). Since you usually use twice as much water as rice I think the extra milk helps. Also it is very important to cover this dish with foil while it cooks and to stir it about every 20-30 minutes or so. Stirring it will help the rice cook more evenly so you don't end up with crunchy rice and I believe covering it helps keep the moisture in so that the liquid you want your rice to absorb doesn't end up as steam. If you follow those two rules I think you'll have success with this recipe. It's a good no-fuss meal! Oh and I also mix the onion soup in with the rice mixture - I think it would be too strong just sprinkled on top but mixed in it gives a good flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MELS MARTINEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-25T12:47:31.84Z",
                "reviewBody": "This is an amazing recipe!  I've made it at least 10 times in the past 6 months and I never tire of it.  It's one of my husbands favorites!  I've used all different types of meat (chicken drumsticks, chicken breast, even pork chops!).  I also add in some sort of frozen vegetable -- usually defrosted spinach or broccoli.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Marshall Mobed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/107520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-29T02:44:34.077Z",
                "reviewBody": "Oooookaaay..I changed a few things up with this recipe and it turned out excellent in the end so maybe you might like to try this too. I precooked the rice so that eliminated the need for water. I used all ingredients listed and THEN added a tsp of cayenne pepper, a tbs of mustard, and 2 c of cheddar cheese to top it all off. I also used shredded chicken breasts and just stirred it and the onion soup mix in to the whole concoction. I mixed all ingredients and put it in the pan at the 350 and heated it through. This was wonderful...almost a completely new recipe but I still have to give the author credit for an excellent base recipe. The melted cheddar was awesome and the mustard and cayenne gave it a kick...oh...I also put a tsp of salt in it too. My whole fam loved it but since I had to add so much to add flavor I give it only a 4.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Samantha Stinson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1096575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-07T21:13:56.403Z",
                "reviewBody": "This turned out perfect. It was gorgeous (especially with the bright colored veggies i added in) and tasted very good maybe a little plain. The rice was tender (DO NOT remove the foil) and it had to cook no longer than an hour and a half. The chicken (I used thin sliced) was very moist. I made some changes: I added a 10.5 ounce can of \"fiesta corn\" (a canned mix of corn and peppers) with only a little of the liquid from that added in. Then i added a cup of frozen defrosted peas. I also used 1/4 cup of white wine and 3/4 cup of water. Next time i might up this amount to make it equal each a half cup. I added into the mixture a small amount of onion soup mix which i would increase next time. Then to top off the chicken i mixed plain bread crumbs with dried basil a pinch of cayenne pepper and some more onion soup mix. If you use this bread topping make a lot to cover the whole top. It adds a nice flavor to the chicken.At the end to make it crisp up a bit remove the foil raise the temperature very high and cook for a few more minutes. oh also i couldnt find cream of celery so i used cream of chicken. Don't expect a dish with a lot of sauce. The rice soaks it all up but that's what i expected. Very good dish. Family loved it. Will make again and again! You really didnt have to worry about it at all while it was in the oven. Jus DO NOT remove the foil during cooking! Make sure it is super sealed for maximum tenderness of the rice and chicken!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "2Yung2Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1396551/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-19T13:05:56.14Z",
                "reviewBody": "This was pretty good and real easy. I didn't find it too salty at all. I did mix the onion soup mix in with the other soups though. I added some broccoli too because I like the green stuff. I put it in the oven at about 200 degrees and let it cook for 3-4 hrs. I was out and this was great because the chicken just fell apart. My husband thought this was great too and it made great leftovers",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PENNYTOMLINSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-28T23:44:01.75Z",
                "reviewBody": "Great recipe. I appreciate that the ingredients are common - making it quick to put together. For better flavor I used CREAM OF CHICKEN & HERBS soup and one can of BROCCOLI CHEESE. The plain cream of chicken or mushroom does not have much flavor at all. I also used more water as others suggested so that the rice was cooked thoroughly. I used a WILD RICE mix (white brown and wild rice) instead of just white rice and topped with crushed whole wheat crackers. GREAT! Will definitely make many more time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Steph",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2110812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:28:13.397Z",
                "reviewBody": "This is a GREAT casserole that everyone can enjoy. And the title is perfect...if your in a hurry you can whip this up and bake while you do other things around the house and wow...you have a hotdish that the whole family loves. Thank you Carol!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-19T13:03:57.233Z",
                "reviewBody": "This recipe was very easy and delicious. I used 2 cans of low-fat cream of mushroom soup and an 8 oz. can of mushrooms. I also used minced garlic instead of garlic powder. This is a definite do-over at our house. Thanks Carol!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/262805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-01T18:03:56.153Z",
                "reviewBody": "Quick to put togehter but definitely not exciting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SIOCHANLEAT82",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452954/"
                }
            }
        ]
    }
]