[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8954/spicy-chicken-curry/",
        "name": "Spicy Chicken Curry",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F18676.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "1999-07-31T01:29:12.000Z",
        "description": "Garam Masala, similar but NOT identical to curry powder, can be found in East Indian food shops and sometimes in the 'Ethnic Foods' section at the supermarket. Serve hot with fried bread or rice, if desired.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "5 servings",
        "recipeIngredient": [
            "1 pound skinless, boneless chicken breast halves, cut into bite size pieces",
            "2 onions, chopped",
            "4 green chile peppers, chopped",
            "4 tablespoons vegetable oil",
            "2 tablespoons ginger garlic paste",
            "1 tablespoon poppy seeds",
            "2 tablespoons chili powder",
            "2 cups water",
            "1 tablespoon garam masala",
            "1 pinch ground turmeric",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse chicken pieces and pat dry. Set aside. Grind poppy seeds into a paste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, saute onions and green chiles in oil until golden brown. Add ginger garlic paste and continue to saute. Add poppy seed paste and reserved chicken pieces, continuing to saute. Stir all together; after chicken is well mixed with the 'gravy', add the red chili powder and pour 2 cups of water over the mixture. Cover skillet and let simmer about 12 to 15 minutes, until chicken is cooked through.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After chicken is 'well-boiled' (the oil should be floating on top of the skillet liquid), add the garam masala and turmeric powder and turn off the stove. Stir all together and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SAI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.7906976744186047,
            "ratingCount": 43,
            "itemReviewed": "Spicy Chicken Curry",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "266.3 calories",
            "carbohydrateContent": "10.6 g",
            "cholesterolContent": "52.7 mg",
            "fatContent": "13.8 g",
            "fiberContent": "3 g",
            "proteinContent": "23 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "303.7 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-22T19:26:05.123Z",
                "reviewBody": "This is an awesome recipe! My family and I tend to like very spicy food...I add triple the chili powder, twice the garlic, twice the garam masala (available from the grocery) and one half the chili's to the recipe. I have had RAVE reviews when I made it served over rice --in fact, when I made it for a person from India, he said it was just \"like home\".  For ginger garlic paste, I just mix ginger powder with the pressed garlic prior to adding it to the curry mix. This is also terrific heated up the next day for a little less spicy taste. Weloved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HALLY_C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/732773/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-19T18:49:51.67Z",
                "reviewBody": "This is an excellent, easy to make chicken curry with great flavor, and better yet, it doesn't require the laundry list of ingredients that some other recipes do.  For those experimenting with Indian cooking for the first time, I have a few tips and suggestions, as one who makes Indian food more often than not:  First of all, the poppy seeds are used to achieve a slightly creamy texture.  If you don't have them, use a little more than a tablespoon of unsalted cashews (or use salted and reduce the salt a little) and grind to a coarse powder.  You'll get the same effect, and cashews are frequently used in Indian recipes, so the flavor will be great.  Second, ginger garlic paste is a shortcut used in Indian cooking for peeling and chopping fresh garlic and ginger.  It can be replaced by fresh grated, pressed, or chopped ginger and garlic in a 1:1 ratio for the same total volume.  You're better off not using powdered spices here.  Finally, you'll get the best flavor using fresh chilies, not canned.  If you like a little less spice, use 1-2 jalapenos rather than 4 small hot chilies and reduce the chili powder.  Garam masala is not the same as curry powder - it's a less pungent mixture including cloves, cinnamon, mace, pepper, and other spices.  I try to avoid substituting the two, and find that garam masala has a milder, less overpowering flavor.  It's worth the effort to find it, but you can make your own from commonly available spices.  I hope this helps!  Happy curry making!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sms_2010",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5067854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-27T21:18:32.483Z",
                "reviewBody": "This was my first attempt at a curry dish, but it was incredibly easy and didn't take as long to prepare as I thought it would (I should have prepared the dough for the naan way in advance!).  I couldn't find the garam masala or the ginger garlic paste, so I used curry powder and made a paste using ginger powder, garlic powder and a little bit of olive oil.  I worked out really well, although I will still try to find the more authentic ingredients.  I served this for guests with basmati rice and naan.  Excellent, excellent meal that received great reviews.  Thanks so much for submitting the recipe.  Do you have any recipes that are strictly vegetable?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GochisosamaDeshita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/681880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-27T21:19:06.453Z",
                "reviewBody": "This was an excellent recipe!! Once you have the ingredients ( I had to hunt for the garem masala and ginger-garlic paste) the cooking is remarkably quick and easy for such a tasty dish. I've never had Indian cuisine and was curious about it , now I'm glad I tried it out. I'm eager for more recipes and hope they are as tasty as this one. I used a can of mild green chiles from the mexican section of our supermarket and omitted the poppy seeds. Once again, this dish is awesome. It's just spicy enough without being overwhelming.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KITTRELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/467988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-05T22:18:39.373Z",
                "reviewBody": "Instead of chili peppers (as the kind Americans use are generally mild), I used canned jalapeno slices (chopped); and as I didn't have garlic-ginger paste, I mashed together a couple of garlic cloves and some chopped fresh ginger. The spiciness was perfect (the warm-your-throat kind, not the mouth-on-fire kind), but I thought there was something lacking in flavor. Were I to make this again, I would probably use more garlic, maybe 1/2 cup less water, and more garam masala. Also, I served this over coconut rice - an accompanyment I would recommend.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1451169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T08:34:24.2Z",
                "reviewBody": "Wow talk about a delicious, fun\r\nfast recipe.  I made it for people who\r\nwere skeptical of Indian food, and they \r\nLOVED it.  It will definitley go into\r\nmy permanent recipe drawer!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAXGRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/126781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T08:34:20.077Z",
                "reviewBody": "Maybe I did something wrong...but between the ingredients saying poppyseeds and the recipe saying poppyseed paste...and saying cook until 'well boiled'?! This wasn't spicy and my husband said \"Don't bother making this again.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "CHICKADEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/711860/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-23T08:34:23.31Z",
                "reviewBody": "Extremely good and very authentic tasting. I used jalepenos instead of Indian chilis however and that proved to be a rather bad decision: it was brutally hot but tasty nonetheless. I look forward to following the recipe a bit more closely in the future!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BURCK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/400204/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-22T16:01:39.337Z",
                "reviewBody": "Very good. But because I was only cooking for myself I only used 2 peppers and 2 tbsps of oil. I should also have cut the water in half. It ended up a little watery. Also how does one properly turn poppyseeds into a paste? I had a very tough time with that. Any suggestions?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sarahc9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2369845/"
                }
            }
        ]
    }
]