[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/95/pasta-and-noodles/",
                    "name": "Pasta and Noodles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/494/pasta-and-noodles/homemade-pasta/",
                    "name": "Homemade Pasta Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11899/basic-pasta/",
        "name": "Basic Pasta",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4545122.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "1999-04-08T20:41:24.000Z",
        "description": "An easy recipe and simple to double or triple, depending on amount needed. Hope you enjoy!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 servings",
        "recipeIngredient": [
            "1 egg, beaten",
            "½ teaspoon salt",
            "1 cup all-purpose flour",
            "2 tablespoons water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium sized bowl, combine flour and salt. Make a well in the flour, add the slightly beaten egg, and mix. Mixture should form a stiff dough.  If needed, stir in 1 to 2 tablespoons water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, knead dough for about 3 to 4 minutes. With a pasta machine or by hand roll dough out to desired thinness. Use machine or knife to cut into strips of desired width.\n"
            }
        ],
        "recipeCategory": [
            "Pasta and Noodles",
            "Homemade Pasta Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Pat"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.54054054054054,
            "ratingCount": 592,
            "itemReviewed": "Basic Pasta",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "175.5 calories",
            "carbohydrateContent": "31.9 g",
            "cholesterolContent": "62 mg",
            "fatContent": "2.1 g",
            "fiberContent": "1.1 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "412 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-19T20:24:23.12Z",
                "reviewBody": "I just made this recipe for the first time.  I am an experienced pasta maker, using various machines, rollers etc. This is by far the easiest to handle and has an excellent flavor.  I used a kitchen-aid to mix the dough, but did the final kneading by hand.  I doubled it the first time I used it.  I added 1 tablespoon of olive oil in place of some of the water as well.  After kneading, I covered it in plastic wrap and let it rest for about 15 minutes.  Awesome performance in the rollers, and cutters and a better recipe than the Kitchen-Aid manual which I have always found to be too dry no matter what I do.  This is awesome and now my go to recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1919492/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-27T13:22:07.797Z",
                "reviewBody": "I tried this today decreasing the salt to 1/4 tsp. and adding 1 tsp. of olive oil. Most doughs need to rest after being worked so that they will roll out easier and this dough definitely benefitted from resting (to let the gluten relax). \n\nI doubled the recipe to \"play around\" and cut fettucine sized strips as well as 1\" wide strips. I also cut some wider and tried my hand at a few herb-seasoned ricotta-filled ravioli and then cut some wider still and used that same filling to make some free-form lasagnes. Everything boiled up wonderfully... tender and delicate! Yum! Can't wait to try some of the noodles/pasta in some homemade turkey soup after Thanksgiving!\n\nAll I can say, after my first attempt at homemade pasta is you gotta try it! And you DON'T need a pasta machine either! Keep your rolling pin and work surface well-floured, keep a pastry brush handy to brush excess flour off the rolled dough, and keep a stainless steel dough scraper handy just in case you do get a bit of adhering to the work surface.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DianeF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-06T21:28:52.7Z",
                "reviewBody": "I have been making homemade pasta for years. If I am going to be serving it the same day, I use cake flour. If I am going to dry it and store it, I add a ½ cup of semolina flour. I also add one or two tablespoons of extra virgin olive oil. \r\nThis basic recipe is perfect for beginners to the world of fresh pasta making. For those who have had a difficult time, keep trying. You will improve with practice. The addition of additional ingredients such as different seasons and herbs lends itself very redily to this recipe. The secret to pasta making is simple. LET IT REST!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADDIE001",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1380115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-30T06:33:38.217Z",
                "reviewBody": "I've always heard that there's nothing like fresh pasta, I was VERY pleasantly surprised at how true this was:-)It was fun and felt great making fresh pasta. I felt like one of those professional cooks in a fine restaurant:-)I'm glad I read the other reviewer's tips. I let the dough rest about 45 min. Could've let 30 min., but was busy. I think the extra time resting before rolling made dough more easy to work with. I had no trouble working with it. You don't really need a pasta machine unless you want to make spaghetti or some other pasta, etc. This was great for me since I don't have one, but want to defenately buy one now. I have very limited space to work with, my counter is about the width of a regular stovetop, maybe(sp?) smaller. What I would recommend if you have a small workspace is that when you have let the dough rest, whatever amount of servings you are making, divide the dough into that many parts, and work one at a time. Actually think takes less time this way. Another tip: If rolling, to keep even thickness, don't double roll,etc over one part of the dough then continue on to next part,etc. Roll one way one time over whole piece of dough. If dough creates a roll, simply pick up dough and lay back down and continue. I let the dough dry by leaving it spread on the counter. I used a pizza cutter to cut dough. I will make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ISORTGAMMM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1302854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T17:53:17.56Z",
                "reviewBody": "Wonderful!!\r\n\r\nI doubled the recipe and it was a great smooth dense dough..It was good rolling out and yummy  to eat!\r\nI rolled it out and rolled it up like a jelly roll(with out flouer on it) and cut thin strips to make fettichini and dried the strips on a broom stick covered with a towel being held up between 2 chairs, I let them dry totally and pakaged half the amount for storage and boiled the other half and it was VERY GOOD!! Please try it..So easy, fun and so GOOD!!\r\n\r\nThanks!!\r\n\r\nThanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMATULLAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/140998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-25T17:10:50.097Z",
                "reviewBody": "My first attempt at homemade pasta and it was so easy! I added about 1/2 Tbl olive oil as it seemed to dry without it. I used the kitchenaide dough attachment to mix it. Then let it sit for 45 minutes. I had wrapped it in wax paper and it stuck to the paper! Scraped it off and rolled it out on the floured kitchen table. After that I realized I should have rolled it on a cutting board so I picked it up and moved it. Once on the cutting board I used a pizza cutter to make long thin slices. Pizza cutter worked very well - i had various sizes due to not caring about consistency. (My husband said he liked the thinner ones better.) Then I laid them all out on a floured dinner plate and covered it with wax paper until it was time to cook (2 hours later). I should have kept the pieces more separated as some of them got stuck together. Next time I'll leave them on the cutting board but spread them out more and let them dry that way. It was easy to make with just a rolling pin. We're going to use this recipe as a base to make homemade ravioli next!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "watergrrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2048546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-07T20:58:39.577Z",
                "reviewBody": "This was the first time making the pasta from scratch and I was surprized at how simple it was. My husband wanted homemade noodles with the homemade chicken soup I made (submitted by Jill) and everyone LOVED it. We tripled the recipe & added the noodles to the soup and let them boil for about 15 minuites and served. I saved the leftovers and they tasted even better the second time!!! We use a pizza cutter to cut the noodles & it works GREAT!!!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CRYSTALYNN21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-01T22:29:55.657Z",
                "reviewBody": "I tried making a batch of homemade noodles years ago and it was a total disaster! I have made 3 batches of these in the last two weeks. They have turned out perfect everytime! Great receipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "spiralmaster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/119490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-26T02:20:14.107Z",
                "reviewBody": "WOW - this was sooooo easy and sooooo good! I had always thought making pasta would be tricky without a pasta maker but it was really quick and easy and it turned out delicious! I used some olive oil to make the dough easier to work with and I let it sit for about 30 min before cutting it. I will never buy pasta again now that I know how easy it is to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILLYSARAHC123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/843317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-09T02:53:01.847Z",
                "reviewBody": "I started with this recipe with no changes. It was dry and course and wouldn't stick together. Then I added some oil and more water (about 5 Tbl) all together. It finally made a dough ball so I let it rest like some of the other reviews said. It was tough to roll out so I couldn't get the dough thin enough. My noodles turned out way too thick. The taste was fine but overall very disappointing. I will continue to buy pasta at the store.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Cullum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2792037/"
                }
            }
        ]
    }
]