[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15328/main-dish/savory-pies/pasties/",
                    "name": "Pasty Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12164/coal-miners-pasties/",
        "name": "Coal Miners Pasties",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F21349.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "1998-05-06T11:42:48.000Z",
        "description": "Coal miners in the Midwest would take these for their lunch. They keep warm rather long wrapped in a towel. Some housewives would stuff one end with a savory filling, and the other with a sweet one. That way you could have your dessert with your dinner! For a true coal miner meal experience, be sure to roughly chop the potatoes.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "6 pasties",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "2 teaspoons salt",
            "1 ½ cups lard",
            "10 tablespoons ice water",
            "2 pounds top round steak, cut into 1/4 inch cubes",
            "5 red potatoes, peeled and chopped",
            "3 turnips, peeled and cubed",
            "1 ½ cups chopped onion",
            "1 teaspoon freshly ground black pepper",
            "1 tablespoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the flour, 2 teaspoons of salt, and the lard in a bowl. Quickly rub the lard into the flour with your fingertips until it resembles small peas.  Pour in the ice water, and form into a ball.  Add more water if it feels too dry.  Divide the dough into 6 balls, and wrap in plastic.  Chill one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, combine the meat, turnips, potatoes, onions, remaining 1 tablespoon salt, and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (205 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out one of the balls on a floured surface to about 1/4 inch thick.  Using a cake pan, trace a 9 inch circle in the dough; cut out the circle.  Place about 1 1/2 cups of the meat mixture into the middle of the circle.  Fold the edges of the circle up to meet along the top of the meat filling, and crimp the dough along the top to seal.  Repeat until all dough is used up.  With a spatula, transfer the pasties  to an ungreased sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the pasties for 45 minutes, or until golden.  Serve hot or at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Pasty Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kevin Ryan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.170212765957447,
            "ratingCount": 47,
            "itemReviewed": "Coal Miners Pasties",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1186.3 calories",
            "carbohydrateContent": "98.9 g",
            "cholesterolContent": "140.9 mg",
            "fatContent": "66.6 g",
            "fiberContent": "7.3 g",
            "proteinContent": "45.4 g",
            "saturatedFatContent": "25.9 g",
            "servingSize": null,
            "sodiumContent": "2202.8 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-11T18:01:09.827Z",
                "reviewBody": "This recipie was pretty good and enjoyed by the family however I would recommened that you make up some beef gravy or other sauce to go with it. By itself it is tasty but a little plain. Also this recipie makes A LOT as the pasties are very large. One pastie could feed 2 people especially kids. I browned my beef first just to form a slight crust on the beef and I also added about a tablespoon of flour to the beef mixture before baking to thicken up the juices a bit. Next time I'd try addind garlic powder to the beef to see if that makes it a little more flavorful. Thanks for the recipie Kevin!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jkaeekj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/912899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T01:52:11.34Z",
                "reviewBody": "NB: A word to the wise - if you are visiting England, and want to experience a really decent Cornish pastie (this recipe barely hints at the gastronomic delights you can encounter there), you MUST get a pastie at Stein's deli, Padstowe (they are a tad spendy but they really are worth it), or Pronto Pastie, almost any place in the West Country. Also, for the most delightful cream teas and scones (scones are like biscuits but they come with clotted cream and strawberry jam) visit any of the tea shops at Boscastle - a pot of tea for 2 plus 2 fist-sized scones and jam and cream will set you back about $6! Boscastle is a truly beautiful, breath-taking fishing village, and you won't be disappointed!) ANYWAY, the pasties in this recipe were alright. I have eaten enough Cornish pasties in Cornwall to know a good one when I see it (or taste a good one when I taste it??), and this wasn't it really. The pastry was ok, though I much prefer a puff-pastry shell. The innards were dry and pretty tasteless, despite the fact I added A LOT of freshly-ground pepper, which is how traditional pasties are supposed to be... I suspect that good Cornish pasties can only be found it Cornwall....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-24T19:41:32.33Z",
                "reviewBody": "These are excellent.  I was born and raised in northern Wisconsin and my dad worked in northern Michigan for 10 years so we are very familiar with pasties.  I make mine with ground chuck, carrots, onions, red potatoes, and rutabega.  I also use the refrigerated Pillsbury pie crust (not the frozen Pet-Ritz kind) which makes them quick and easy to make and they still taste great.  Now living in Texas with my Texas-born husband, he insists I add chili power and cumin to the filling.  So nontraditional, but it's still good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sweets",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664630/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-12T19:37:17.733Z",
                "reviewBody": "These are close to the pasties I grew up with... My mother always just made regular pie pastry and used rutabega instead of turnip and white pepper... They are great hot warm cold or fried (if there are any leftovers)!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Brendans.mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/257/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-06T15:47:01.807Z",
                "reviewBody": "Grew up on my mom's pasties. We use Round Steak & Pork shoulder. Carrots Ohion Potato. Always eat them with ketchup. I'm not so good at the pastry but found that Pillsbury Pie Crust-in the red box is exactly the same taste as mom's crust. Always moist and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "joyce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1682016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-06T13:43:21.523Z",
                "reviewBody": "This is my favorite dish! I made it when I was in the military and it was an instant success with everyone. They last forever and taste great at room temp. The juices stay where they are and the pastie shell is the perfict blend of flavors to mix with the vege meat mix. I ate 3 of them when I made it the 1st time:-) I just couldnt stop. All in all a definate Yum Yum dish thats perfict for lunches and hiking trips and camping due to the fact it doesnt need to be heated to taste good. Just keep the shell from breaking and letting the juices out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MikeyB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2194217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-05T21:32:43.17Z",
                "reviewBody": "This recipe came out great! Cooked perfectly; very nice flakey crust with a beautifully moist meat/vegetable interior. Only compliant is there was a lot of leftover veggies. Next time I'll only use 3 potatoes 1 large turnip and 1 onion. See Time Life American Cooking: Eastern Heartland cookbook which has photos on how to assemble.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "queenoffun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2057450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-08T23:01:01.643Z",
                "reviewBody": "This was my first attempt to make pasties. My husband is used to the Upper MI Finnish pasties and this one was pretty close. I used shortening for the crust instead of lard since I had it on hand and it made the crust a little too dry. I also used rutabaga instead of turnips and it added a great flavor. The meat was probably too lean so be careful what cut you buy. Next time I will add carrots which most UP MI ones have. Overall I was very pleased with my first attempt. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sharon H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2201931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-08T14:19:36.077Z",
                "reviewBody": "nice recipe although a little too dry. Top round is the wrong cut here - you want a cheap fatty cut which will help the moisture level. Puff pastry as one reviewer suggests is not at all authentic. Although of course if you like it by all means. YTou can get authentic pasties around the old Cornish mining towns in Southwest Wisconsin (around Cassville)...good stuff.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SMPARSONS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037935/"
                }
            }
        ]
    }
]