[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13290/main-dish/seafood/",
                    "name": "Seafood Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/13302/main-dish/seafood/crab/",
                    "name": "Crab",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12765/baked-seafood-au-gratin/",
        "name": "Baked Seafood Au Gratin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F69672.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-07-02T17:00:59.000Z",
        "description": "This was my Mom's favorite seafood recipe, she is now 88, I am 60 and this is my all time favorite seafood recipe also. I have had guests, who, when invited to dinner, specifically request this to be served.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 onion, chopped",
            "1 green bell pepper, chopped",
            "1 cup butter, divided",
            "1 cup all-purpose flour, divided",
            "1 pound fresh crabmeat",
            "4 cups water",
            "1 pound fresh shrimp, peeled and deveined",
            "½ pound small scallops",
            "½ pound flounder fillets",
            "3 cups milk",
            "1 cup shredded sharp Cheddar cheese",
            "1 tablespoon distilled white vinegar",
            "1 teaspoon Worcestershire sauce",
            "½ teaspoon salt",
            "1 pinch ground black pepper",
            "1 dash hot pepper sauce",
            "½ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a heavy skillet, saute the onion and the pepper in 1/2 cup of butter. Cook until tender. Mix in 1/2 cup of the flour, and cook over medium heat for 10 minutes, stirring frequently. Stir in crabmeat, remove from heat, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large Dutch oven, bring the water to a boil. Add the shrimp, scallops, and flounder, and simmer for 3 minutes. Drain, reserving 1 cup of the cooking liquid, and set the seafood aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a heavy saucepan, melt the remaining 1/2 cup butter over low heat. Stir in remaining 1/2 cup flour. Cook and stir constantly for 1 minute. Gradually add the milk plus the 1 cup reserved cooking liquid. Raise heat to medium; cook, stirring constantly, until the mixture is thickened and bubbly. Mix in the shredded Cheddar cheese, vinegar, Worcestershire sauce, salt, pepper, and hot sauce. Stir in cooked seafood.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x13 inch baking dish. Press crabmeat mixture into the bottom of the prepared pan. Spoon the seafood mixture over the crabmeat crust, and sprinkle with the Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 30 minutes, or until lightly browned. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Seafood Main Dishes",
            "Crab"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HYBRID101"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.385093167701863,
            "ratingCount": 322,
            "itemReviewed": "Baked Seafood Au Gratin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "565.8 calories",
            "carbohydrateContent": "20.4 g",
            "cholesterolContent": "233.3 mg",
            "fatContent": "34.2 g",
            "fiberContent": "0.9 g",
            "proteinContent": "42.8 g",
            "saturatedFatContent": "20.6 g",
            "servingSize": null,
            "sodiumContent": "858.9 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-12T00:50:09.763Z",
                "reviewBody": "A few slight changes (reduced green pepper to 1/2 as I know my family's tastes). I turned the heat off immediately after adding the seafood and removed it after 3 minutes. Then I added some shrimp shells to the cooking water, reduced the seafood cooking water down to 2 cups, to make a more concentrated broth, strained it and used all of that and cut back on the milk called for by 1 cup. (thus 2 cups milk/2 cups reduced seafood broth... resulting in a much more veloute-like and less bechamel-like sauce) Using Monterey Jack cheese, much lighter in flavor, also created an overall lighter taste to the dish, without overpowering the seafood.\r\n\r\nI omitted the flounder and added more scallops. Next time I will try monkfish, which has a texture very much like lobster and holds together nicely when cooked.\r\n\r\nSince many have mentioned how good it tastes leftover/reheated, I made this in the morning, chilled it, brought it to room temp. prior to reheating and made my and my guests dinner experience much more relaxed. I served it over white rice along with lightly steamed asparagus and passed warmed homemade bread. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DianeF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T00:38:37.733Z",
                "reviewBody": "I actually wish I could have offered 4 1/2 stars instead of 5 because I would like to make a recommendation that would make it taste even better.  My family and I thought it was very good but too pasty.  I think if the flour were maybe a 1/4 cup less and cooked for less time then the recipe suggests, it wouldn't come out so pasty like.  All in all though, very good.  I changed the seafood a little and didn't use fillet bits but 1 lb of shrimp, 1lb of lump crab and 1lb of scallops.  I also served it over rice and steamed broccoli.  Also, the recipe took more than 20 minutes to prepare...more like 30+ for me because of peeling the shrimp prior to mixing all the seafood with the other ingredients.  It is an expensive dish as other reviews have suggested but it's worth it and definitely something to serve when you have dinner guests.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAURA MO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/720837/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-27T19:01:18.013Z",
                "reviewBody": "This was awesome and leftovers were even better!  The only changes I did was... instead of water, I used 2 cups clam juice (major flavor booster) and only 2 cups milk.  Pretty much followed the main recipe other than that.  thanks for sharing a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OODLES_OR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/557764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-21T06:38:40.03Z",
                "reviewBody": "Thoroughly sublime! I'm a seafood fanatic and this was exactly what I wanted. I do not like flounder so I used tilapia because I had some in the freezer and bay scallops because they're smaller and more flavorful. To reiterate what others have said it takes longer than 20 minutes I'd allow an hour for preparation plus 30 minutes bake time. I had no trouble with the sauce at all it turned out very rich creamy and silky smooth and I used 1% milk. It takes about 15 minutes to get the onion and pepper caramelized properly and about 10 minutes simmer for the white sauce before adding the cheese etc. Keep stirring and it will thicken! A basic knowledge of making roux is the key to good sauce. I used 3 cans of crabmeat not fresh. I served with homemade garlic basil breadsticks a tossed salad and white wine. Superb! Thanks for sharing;-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIVIANA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/207003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T00:32:41.95Z",
                "reviewBody": "Great recipes! I cut the recipes in half for just the two of us turned out real well. I served it with yummy cheddar biscuits (like the ones at Red Lobster) perfect!!! Here's the recipe for the cheddar biscuits... (makes about 8 biscuits) 2 cups Bisquick baking mix 2/3 cup milk 1/2 cup shredded sharp cheddar cheese 1/4 cup butter - melted 2 cloves of garlic - minced 1 tbsp fresh parsley 1/2 tsp salt -Combine Bisquick milk and cheddar and beat with a wooden spoon for about 30 seconds. -Spoon on to greased cookie sheet. Smooth tops down with spoon. -Bake in 450 degree oven for 8 minutes. -Combine butter garlic parsley and salt. Brush the mixture over top of the biscuits before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOOOCY79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/817301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-28T17:21:59.28Z",
                "reviewBody": "I'm giving this 5 stars even tho I didn't follow recipe because I'm sure it would be great as is. Did the crust part as in recipe then used 2 8 oz. bottles of clam juice and 1/2 cup white wine for liquid instead of water.Used 1-1/2 lb. shrimp 1 lb. scallops. 12.oz flounder 1 lb.lobster chunks for seafood (used more seafood because a lot of people said it was runny) used 2 cups heavy cream and the liquid I cooked seafood in.Used 1 cup parmeasan cheese 4 oz. cream cheese 1 cup 3 cheese blend (mozz.cheddar provolone).Used white wine vinegar and left out salt.It came out out of this world every one at Easter loved it (20)people. Cooked each seafood ingedient separatly since I didn't use the 4 cups of water so they would cook evenly just took them out of liquid returned to boil and put the next one in just took a few min. longer and eack seafood was cooked perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CODEACE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-18T16:15:55.903Z",
                "reviewBody": "Excellent! I recommend using only the freshest seafood and only real crab meat. We had it with angel hair pasta and a spinach salad. Yes it is expensive but good seafood makes all the difference. And it is still cheaper than eating in a restuarant! My whole family (inlcuding my 2 year old and 3 1/2 year old) finished their plates and my husband had 2 huge servings. It takes alot of work so definitely give yourself the extra time but it is well worth it. I rate it 5 stars for a home cooked meal. It isn't a 5 star quality restuarant meal but I'm not a 5 star restaurant chef and it is one of the best things I've ever made at home.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Teresa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-03T01:39:53.78Z",
                "reviewBody": "I was in charge of Good Friday dinner and my father in law absolutely hates fish. I upped the amount of scallops and just left out the fish. He's a picky eater and I can always tell teh success of a meal by how many helpings he has. He had 3 with this meal. To make things easy use canned crab (3 Diamond brand best). It tastes just as good and costs a lot less. I added garlic to the peppers and onions for added flavor. Use pre-cooked shrimp to speed things up a little and this way you don't run the risk of making the shrimp curled and tough by overcooking it. I used jalapeno pepperjack cheese in lieu of cheddar and topped it with a mixture of parmesean and bread crumbs. My kitchen smelled wonderful while this was cooking! My family has a new favorite recipe. Although you use a lot of dishes making this its okay because all you need to go along with it is salad and bread. I served mine over rice pilaf. Although it could also make a hearty stew served in a bread bowl too. Similar to seafood newburgh.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SNICK8699",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/618130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-17T02:51:48.077Z",
                "reviewBody": "We really enjoyed this recipie even though I'm not all that fond of seafood. I did have to make a couple of substitutions; canned crabmeat and orange roughy instead of flounder. And I will definetely buy prepared shrimp! I had some problems with the flour sauce thickening and I'm not sure the dish even set right (it took almost twice as long cooking time before the top browned). But it still tasted wonderful and it's definetly something I'd like to try again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VKetron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/602151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-01T15:12:09.187Z",
                "reviewBody": "Okay..what did I do wrong? It was horrible and I was really disappointed after spending so much money on it. I used the canned Phillips crabmeat and I also omitted the fish but followed the recipe exactly. I think the Cheese did not go well with the seafood combination. May have been better with a wine sauce instead. I also used the bags of Med. Frozen Shrimp so maybe I should have used all FRESH seafood instead?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Carolyn Jarvis Schmitt",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1411132/"
                }
            }
        ]
    }
]