[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14722/soups-stews-and-chili/soup/chicken-soup/chicken-noodle-soup/",
                    "name": "Chicken Noodle Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12932/lemon-chicken-soup-i/",
        "name": "Lemon Chicken Soup I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F726525.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-01-24T16:16:29.000Z",
        "description": "Slightly tangy and quite filling! For added flavor use fat free chicken stock in place of water.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 pounds whole chicken",
            "8 cups water",
            "½ (16 ounce) package uncooked orzo pasta",
            "2 eggs",
            "2 lemons",
            "salt to taste",
            "ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large soup pot, cook chicken in water until the meat begins to fall off the bone.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Skim fat off stock.  Remove the chicken from pot, and set aside to cool.  Add pasta to stock, and cook for about 10 minutes.  Shut off heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, beat 2 eggs with the juice of 2 lemons until foamy.  Whisk 1 cup stock slowly into the egg/lemon mixture.  Repeat with another cup of stock, and pour mixture into soup.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bone chicken, and add meat to soup.  Stir well.  Add salt and pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes",
            "Chicken Noodle Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "tgoodie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.254237288135593,
            "ratingCount": 59,
            "itemReviewed": "Lemon Chicken Soup I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "817.6 calories",
            "carbohydrateContent": "31.8 g",
            "cholesterolContent": "289 mg",
            "fatContent": "47.9 g",
            "fiberContent": "2.9 g",
            "proteinContent": "63.9 g",
            "saturatedFatContent": "13.7 g",
            "servingSize": null,
            "sodiumContent": "238.1 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:47:28.177Z",
                "reviewBody": "Excellent & Delicious!!!This is similar to Avgolemono which is the most popular Greek soup. I've been making this soup for my whole family over and over again and everyone loves this soup better than chicken noodle. Even my husband and son love it too! My husband is always asking the next day do you have any of that soup left over? I make it for my in-laws who are Greek and they love it better than the Greek original! They love the the addition of the chicken. The only thing I do different is add 1 onion and 2 cloves of garlic chopped fine and 2 chicken boullions to a large pot of water and I use 2 large lemons and 3 eggs. This is our family's favorite soup! You just don't know what you're missing until you have tried this soup!!!This recipe should be number one in the top 10.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GARLICKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30449/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-02T15:23:55.037Z",
                "reviewBody": "I first rated this soup in December, 2000, and I am still making it today (January, 2011).  I have read all of the reviews and have come to the conclusion that if you want this to be a great soup, you need to start with homemade broth/stock.  Last night, I made the chicken stock for this soup with a Tyson Value pack of chicken, consisting of 3 thighs, 3 chicken backs and two chicken breasts, all with bone and skin.  I boned and skinned the chicken breasts and put the skin and bone in my stock pot, but set the breast meat aside for later use in another recipe.  Here is how I make my stock.  2 quarts of water, the chicken (skin and all) 2 celery stalks, each cut in 4 pieces, a large onion quartered, 5 whole black peppercorns, 3 whole cloves, 3 chicken bouillon cubes. For a clear stock bring almost but not quite to a boil and immediately turn heat down to low simmer .  Simmer for 1 hour.  Pour into a colander and let chicken cool.  In the meantime, put the strained broth in a pot with a lid and place it in the fridge.  I left mine overnight to cool.  Once cool, take the lid off and skim the lovely yellow chicken fat off the top.  Then proceed with the recipe as written.  All the flavor of the celery, onion, pepper and clove will be in the broth, and you won't have to add it.  Quite honestly, you can add any flavorings to the stock...carrots, bay leaf, however you want your soup to taste, but to be true to the recipe, don't add too much or you lose the character of the soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula Kelsay McFarland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/184913/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-21T13:43:04.89Z",
                "reviewBody": "This was a very good and different soup. I made a few alterations...I added chopped fresh spinich just before serving and almost doubled the broth as the lemon flavor was too overpowering even for a lemon lover like me! I also cooked the orzo on the side and added to each bowl at serving time. I find that cooking and storing the pasta on the side eliminates it from soaking up the broth and becoming soggy. Very good overall and freezes well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kauaieg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/245307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-21T23:38:29.61Z",
                "reviewBody": "This recipe was just okay. I read many reviews before I made it and I took many helpful suggestions from the reviews. While I was boiling the chicken I added fresh ginger to the water. Once I removed the chicken I added 3 stalks of celery a handful of diced baby carrots 4 cloves of pressed garlic zest of one lemon and 2 small onions. At the suggestion of others I added two more cups of water and only used one lemon. I also added about a tablespoon of chicken bullion granules. Once I added everything it became a 5 star recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2289262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-12T05:50:46.633Z",
                "reviewBody": "Read through many of the reviews for suggestions on how to spice this up; it's a great basic recipe. You'll need to add salt and/or stock to really get a chicken flavor and be mindful not to add too many lemons; it can quickly become overwhelming (if you do try some brown sugar to mellow it). Consider onions garlic ground cloves spinach and if presentation is important think through how to clear the broth (skimming or a cheesecloth to get rid of the fat). Don't overcook the orzo either or it will turn to mush.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "David Pinkus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/562480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-23T17:41:21.89Z",
                "reviewBody": "I made this soup exactly as indicated (only I doubled it for a family dinner). It was a big hit and we will definitely have this again. It was not too salty so I assume that it really depends on the brand of chicken soup base you use to make it. DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bmatheson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1610064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T20:30:57.373Z",
                "reviewBody": "Very good! I ended up making chicken stock the day before like one of the reviews provided instructions for (whole chicken whole onion 2 stalks celery bay leaves salt all spice) left overnight in the fridge. I also removed the meat from the chicken but needed to let it cool for a while first. The next day I skimmed the stock and strained through a cheese cloth. Then I heated the stock added the chicken and waited for it to boil then added some elbow macaroni and the egg/lemon/stock mixture. We've never had this before but will add into our rotation!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2434185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T16:37:33.28Z",
                "reviewBody": "This was really good.. I used less chicken - 3 bone-in skinless breasts versus the 4 lbs called for. There was a ton of meat - I only used half and saved the rest. I added half an onion as well. It was a very flavourful soup. The lemon gave it a nice refreshing touch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CATHY HUNTER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595279/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-05T18:46:44.883Z",
                "reviewBody": "This was absolutely delicious! I didn't have to change a thing about it! The soup became creamy and delicious after the eggs and lemon were added and was so perfect! Definitely don't make this if you don't like lemon - but I'm a lemon lover and it was FANTASTIC!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Kitsune",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3751907/"
                }
            }
        ]
    }
]