[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/170/soups-stews-and-chili/soup/beans-and-peas/",
                    "name": "Beans and Peas",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14727/soups-stews-and-chili/soup/beans-and-peas/black-bean-soup/",
                    "name": "Black Bean Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12933/pattys-moms-black-bean-soup/",
        "name": "Patty's Mom's Black Bean Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F519693.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-01-24T15:15:44.000Z",
        "description": "This is a simple recipe, yet it is the best black bean soup I've tried.  I have   been lucky to get home smoked ham, and used the bone from it.  I've   also made it with smoked ham hocks I've gotten from the butcher.  Of  course the home smoked ham makes the soup superlative, the butcher bone made it wonderful.  Either way, I think you'll enjoy it.  It can be made spicy if that's the way you prefer it.  It can also be topped with sour cream.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT3H20M",
        "totalTime": "P0DT11H50M",
        "recipeYield": "4 - 6 servings",
        "recipeIngredient": [
            "2 cups dry black beans",
            "8 cups water",
            "1 tablespoon margarine",
            "3 stalks celery, chopped",
            "3 onions, chopped",
            "2 bay leaves",
            "1 tablespoon chopped fresh parsley",
            "½ teaspoon salt",
            "⅛ teaspoon ground black pepper",
            "1 smoked ham bone (with some meat on it)",
            "⅔ cup dry sherry"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the beans overnight in a pan of water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain off the soaking water. Simmer beans in 8 cups of water until soft.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the beans are cooking, saute the chopped onion and celery in margarine until golden. Add the vegetables to the soup pot along with bay leaves, parsley, salt, pepper, and ham bone. Cook over medium heat for 3 hours, adding water if needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After the beans are cooked and soft, remove the ham. Set aside. Cool soup, and puree in batches. Return the soup to the pot, and add dry sherry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut the meat off the bone, and add the meat to the soup. Cook over low heat until warmed through, and adjust seasonings.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Beans and Peas",
            "Black Bean Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Beverly"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.382978723404255,
            "ratingCount": 47,
            "itemReviewed": "Patty's Mom's Black Bean Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "344.7 calories",
            "carbohydrateContent": "60.4 g",
            "cholesterolContent": null,
            "fatContent": "3.3 g",
            "fiberContent": "13.3 g",
            "proteinContent": "17.7 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "474.9 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-04T16:21:58.97Z",
                "reviewBody": "I first made Patty's BB soup about a year ago, but didn't think to post a review. However, I was preparing to e-mail this recipe to my daughter and was shocked to see it only had 2 reviews!  This soup was so much yummier than other Black Bean soups I tried out.  First of all, to those that feel it takes to long for the bean prepartion.....really, one can skip the overnight soak.  That mostly helps as far as keeping you quite so \"windy\" after eating.  The sherry is a most!  Do not skip it or any other sherry you may have on hand.  I slow cook mine for the better part of a day because we like our soup rather thick.  Oh, and one more thing!  I once tried dipping this soup over rice, ala`Red Beans & Rice.  Yeah!  Majorially yummy!  A side of corn bread muffins and it's all about heaven.  Thanks Patty's Mom!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FLOWERBUFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1206185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-12T15:29:45.157Z",
                "reviewBody": "Great soup, I changed the cooking method and used my slow cooker. I added the ham bone, soaked beans, cooked onions & celery along with rest of the ingriendents to the cooker. I also added cumin and cayenne to the soup. Cooked on low for 8 hours. Pureed the soup with an immersion blender, a lot easier! Topped soup with cheese and crumbled tortilla chips.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KulinaryKeri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1070707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-11T00:14:47.187Z",
                "reviewBody": "Excellent black bean soup.  I'll be using this recipe from now on. \n\nI was in a hurry, so I used three large cans of black beans, which I drained and rinsed.  Added a carton of chicken broth and tossed everything else into the mix.  Only other change I made was to add garlic and a teeny bit of cilantro.\n\nThanks, Patty's Mom!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea Gatley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/andreagatley/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-10T19:47:33.187Z",
                "reviewBody": "This is a very good soup. Yes it takes a long time. Why do beans take SO long to get done? Man. But the combination of flavors is excellent. I have always enjoyed sherry as a finisher in soups and I wasn't disappointed this time around. The only thing keeping this recipe from a five-star rating is the investment of time it takes to prepare... soaking the beans overnight waiting for the beans to soften etc. Other than that it's a great recipe. Do note I had to at least double the amount of salt. And don't forget to remove the bay leaves before you blend the mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-19T00:09:00.263Z",
                "reviewBody": "I made this with a ham hock and pretty much as written. Unfortunately I just realized right now that I forgot the sherry! I pureed about half of the beans trying to thicken the soup without losing all the texture. It was good but I don't know if I'll try it again. Needed more flavor but I don't know how much I lost by forgetting the sherry...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane LaLonde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1009264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-18T19:21:17.477Z",
                "reviewBody": "I've never tried making soup from dried beans or from using a leftover ham bone. But this was a great soup to do both of those things with for the first time! My whole family loved it. My kids' couldn't get enough of it and are already asking when we can have it again. I followed the directions as written. But at the end I made a few adjustments because it just tasted like it was missing a level of flavor somehow. I would suggest using some chicken stock or chicken flavor boost packs instead of just adding more and more water. I also added a little cumin Old Bay seasoning garlic powder onion powder and lots more black pepper. It really brought the flavor up to where I thought it should be. I didn't blend any of the soup like it stated. Instead I used the back of the spoon and kind of smashed the beans up against the side of the pot and that gave just enough mashed beans to give it that soup substance. My husband discovered that once it was cooled that it made for a great dip for tortilla chips as well! Can't wait to make this again definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Dohms Tegen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9166634/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-26T16:15:35.347Z",
                "reviewBody": "This is such a simple and tasty recipe. Blending the black beans makes it distinctive. Without that I think it would be just another black bean soup. I used a hand blender in the pot and was done in minutes. I didn't have a hambone so I used beef stock concentrate and diced ham--was wonderful this way too. An extremely easy and economical soup. Will definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rijg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3429042/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-07T21:00:48.907Z",
                "reviewBody": "I personalized this one a bit. Used black and white beans 1 can of each used 6 cups water 2 cups chicken broth no sherry added cumin and chili powder and also added green peppers. SOOOO yummy! And easy! I let it cook for about 3 hours fished out the ham pureed it in the pot with a hand mixer ripped off the good pieces of ham and threw them back in and done! A delicious soup! Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nicoleb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5789033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-24T20:38:15.213Z",
                "reviewBody": "this is a great soup and it makes a ton. the only changes i made were to sub some of the water with some ham broth i had in the freezer from when i do a baked ham and i forgot the sherry. it was delic husband loved it also. mine was pretty salty but i think that was my fault as the ham broth is salty oh and i cooked it for quite a while so had to add extra chicken broth to keep it soupy. all in all i'll use this recipe again",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "leda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2883541/"
                }
            }
        ]
    }
]