[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/181/soups-stews-and-chili/soup/noodle-soup/",
                    "name": "Noodle Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13206/grandmas-chicken-noodle-soup/",
        "name": "Grandma's Chicken Noodle Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4485921.jpg",
            "width": 2100,
            "height": 1500
        },
        "datePublished": "1999-04-18T02:25:26.000Z",
        "description": "This is a recipe that was given to me by my grandmother.  It is a very savory and tasty soup and I believe that all will like it.  If you would like to add even more flavor, try using smoked chicken!!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 ½ cups wide egg noodles",
            "1 teaspoon vegetable oil",
            "12 cups chicken broth",
            "1 ½ tablespoons salt",
            "1 teaspoon poultry seasoning",
            "1 cup chopped celery",
            "1 cup chopped onion",
            "⅓ cup cornstarch",
            "¼ cup water",
            "3 cups diced, cooked chicken meat"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add egg noodles and oil, and boil for 8 minutes, or until tender. Drain, and rinse under cool running water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan or Dutch oven, combine broth, salt, and poultry seasoning. Bring to a boil. Stir in celery and onion. Reduce heat, cover, and simmer 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix cornstarch and water together until cornstarch is completely dissolved. Gradually add to soup, stirring constantly. Stir in noodles and chicken, and heat through.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Noodle Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CORWYNN DARKHOLME"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.576307363927428,
            "ratingCount": 1874,
            "itemReviewed": "Grandma's Chicken Noodle Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "146.5 calories",
            "carbohydrateContent": "11.4 g",
            "cholesterolContent": "32.9 mg",
            "fatContent": "3.6 g",
            "fiberContent": "0.7 g",
            "proteinContent": "15.7 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "1663.8 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-10-28T15:11:04.64Z",
                "reviewBody": "With a little creativity, this became one of the best soups I have ever made.  I started off mixing low sodium broth with regular sodium to cut the salt.  (I like the flavors to come from other ingredients.) The key is to add an ENTIRE cooked rotisserie chicken to the broth with the veggies.  Be sure to pour in the drippings from the pan.  Let this simmer for about 15 minutes, then remove chicken and add the meat back in.  This gives it the most amazing flavor!  I also added peas, carrots, fresh garlic, basil, bay leaves and fresh cracked pepper.  Superb!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHESSACAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/771162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-20T13:56:15.53Z",
                "reviewBody": "Thank goodness for everyone sharing their reviews.  I made this last night for a good friend who is just home from surgery and she gobbled down 2 bowls as soon as I showed up.  Here's what I did:  12 cups chicken broth is 96 oz., which is 2 large cans of broth.  I bought one regular can and one low fat/low sodium and tossed about a teaspoon or so more salt in throughout the cooking process.  Also made it easy on myself and picked up a roasted chicken from the grocery store; it's cheap, easy, has great flavor and really makes the soup chock full of chicken.  I tossed in about 1/2 bag of frozen carrot slices along with the onions and celery and also just tossed the noodles directly into the soup to cook.  I added a little black pepper for some pep.  This is a delicious recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Hamilton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/737915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T04:47:45.46Z",
                "reviewBody": "Well if you attempt to make this soup, do so using your common sense.  If you don't like things salty, well then omit some of the salt, because it is obvious that the broth will pretty much contain any salt needed.  I used my own broth from scratch & added carrots (whats chicken soup without carrots?)  I used small pasta shells (out of egg noodles - sick of shopping), which I didn't add oil to.  Salt to taste after the starch, because that is when your going to need it.  Thanks & Happy Holidays!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-27T16:15:41.78Z",
                "reviewBody": "Just had a bowl at work for lunch -- delicious! I read all reviews and made the following changes: Used 6 cans reg chicken broth, 6 cans low sodium.  Brought it all to a boil and added 1 cup each chopped onion, celery and carrots.  Added noodles, 2 bay leaves, 1 clove chopped garlic, fresh black pepper and oregano.  Added an ENTIRE rotissierie chicken and covered.  Simmered fifteen minutes and then took chicken out, removed meat and put back in pot.  Simmered thirty more minutes.  I'm taking it to a sick friend today -- it does make a TON so next time will freeze some for this winter.  I'm usually not one to change recipes, but followed other's advice and it turned out great -- not too salty as so many posters have noted.  The key is using half low sodium chicken broth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2152197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T02:37:44.373Z",
                "reviewBody": "Good standard chicken noodle soup.  Save yourself a step...don't pre cook the egg noodles.  Throw them in about 15 mins. before you plan on serving.  Cooking the soup longer wont hurt it and you'll be minus one pot for clean up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GUAVAGIRLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/300999/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-17T18:30:15.4Z",
                "reviewBody": "With a few tweaks, this was hands down the best chicken noodle soup I have ever eaten. My changes were: Saute the onions and celery with GARLIC in 2T butter until lightly golden, then add in the broth. Add 1T butter, black pepper, dried basil, and just a dash of cayenne pepper to the broth. When the broth is boiling, add in a whole cooked rotisserie chicken you pick up from the store. Cover and let simmer for 5-10 minutes. Remove the chicken and take the meat off the bone, shredding to the consistency you like. Meanwhile, add the egg noodles directly to the broth. There's no need to cook them separately. When the noodles are close to being done, add in the shredded chicken and chopped green onions. Let boil until heated through and the egg noodles are done.  This was seriously delicious. I didn't have poultry seasoning on hand, so I'm not sure what I was missing with that flavor. The rotisserie chicken gave it plenty of flavor, though. I also used low-sodium chicken broth and did not add ANY extra salt.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitschy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2652008/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T04:47:35.41Z",
                "reviewBody": "Sorry, but I just don't see what's so great about this particular recipe. Can't figure out what everyone's raving about. It's good, but not great. You don't need oil to cook pasta, the oil just floats to the top of the water. Just stirring the pasts every so often while it's cooking is sufficent. And you don't need salt to cook your pasta either. And the AMOUNT of salt called for in this recipe! WOW! Who needs all that salt? There's plenty of salt in the canned chicken broth. Even if your using homemade broth, you still don't need that amount of salt.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BC Survivor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/629596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-23T23:43:27.107Z",
                "reviewBody": "I have made this soup 5 times now and everyone can not get enough. I even give it out to friends. We're not big on salt so I think it's safe to say a teaspoon is plenty. I bake 6 chicken breasts (with skin and bone) first, and cube the meat as soon as they're cooled. I also add carrots. College Inn chicken stock is the stock to use! and Mullers extra wide noodles. They stay firm. I throw in a couple of the breast bones when simmering for more flavor and remove later. What a wonderful soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KVSMITH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648780/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:28:28.977Z",
                "reviewBody": "Now I remember why I have always stuck to my mom's chicken noodle soup recipe...this was a disaster! I read the reviews carefully and omitted the salt added extra celery 1 1/2cup cut carrots and reduced the broth to 10 1/2 cups. However although I was going to add potato flakes instead of cornstarch I put the potato flakes away and used cornstarch. I poured the \"mix\" in slowly but a chemical reaction occurred causing the soup to \"foam\" over...I lost apprx another cup and a half (which is now all over my stove). Still I wish I would have used potato flakes because the cornstarch gave the soup almost a \"fishy\" flavor. Oh most of all chicken broth itself is high in sodium so even though I omitted the salt ingrediant there was plenty in the 9 cups of broth left....can we say sea water? TOO SALTY and I wasted a lot of ingrediants!! Sorry will not make again nor will I recommend!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Grandma’s Chicken Noodle Soup",
            "description": "See how to make a savory, 5-star chicken noodle soup.",
            "uploadDate": "2012-06-13T20:52:57.716Z",
            "duration": "PT2M27.731S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7d092ea9-eb94-49fb-8721-9181c7e3d2c9%2F1cade014-9ada-4986-8360-ecf0c6c9c99e%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1688029325001"
        }
    }
]