[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13310/split-pea-soup-atu/",
        "name": "Split Pea Soup Atu",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F523910.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "1999-03-06T15:54:45.000Z",
        "description": "A great split pea soup to enjoy.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "2 cups dried split peas",
            "6 cups chicken broth",
            "8 cups water",
            "½ teaspoon hot pepper sauce",
            "2 ham hocks",
            "1 onion, chopped",
            "2 potatoes, peeled and diced",
            "2 bay leaves",
            "4 teaspoons dried dill weed",
            "½ teaspoon ground white pepper",
            "2 tablespoons chicken bouillon powder",
            "2 tablespoons soy sauce",
            "½ teaspoon crushed red pepper flakes",
            "2 cups whole milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large stock pot, add split green peas, chicken broth, water, hot pepper sauce, ham hocks, chopped onion, diced potatoes, bay leaves, dried dill weed, white pepper, chicken soup base, soy sauce and red pepper flakes and bring to boil.  Reduce heat and simmer, covered for about 1 hour, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove ham hocks and trim off fat.  Remove ham from bone and cut into small pieces and return to pot.  Simmer soup, covered for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove 6 cups of soup and puree in a food processor or blender and return to pot.  Stir in milk and bring back to a boil and then serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "William Anatooskin"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.568807339449541,
            "ratingCount": 109,
            "itemReviewed": "Split Pea Soup Atu",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "211.7 calories",
            "carbohydrateContent": "22.6 g",
            "cholesterolContent": "20.5 mg",
            "fatContent": "7.2 g",
            "fiberContent": "7.1 g",
            "proteinContent": "14.2 g",
            "saturatedFatContent": "2.6 g",
            "servingSize": null,
            "sodiumContent": "704.1 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-06T01:07:47.903Z",
                "reviewBody": "Thanks to the reviewers, I started off by cutting the water in half. Was glad I did since we prefer hearty soups. Highly suggest smoked ham hocks. Other additions include an extra pound of smoked ham, 3 stalks celery, 3 carrots, garlic powder, fresh parsley, thyme, marjoram, and sage. Thank you so much for this recipe!  I have finally outperformed the legendary mother-in-law.  Update: Freezing works on this soup, but I've recently decided I prefer halving the recipe so we can eat all of it fresh!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBERLY KAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/517165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T00:30:55.49Z",
                "reviewBody": "This is a fabulous recipe made even better by taking tips from a few of the reviewers who've already posted.  Nice color, nice balance of flavors, very homey and comforting!  I served this with some great crusty rolls and a nice green salad, and it was a HUGE hit even with my finicky teens.  Here's what I did to \"doctor\" it up:  \r\n\r\nFirst, I cut back by half on the water.  Second, I added about a Tbsp or so each of fresh sage, thyme and parsley (toward the end of cooking) and maybe half that amount of dried marjoram (because I couldn't find any fresh).  Third, instead of ham hocks which my family doesn't like (or need :-)), I bought some wonderful smoky ham at the deli counter, cubed it up and added about 1/2 lb of it right at the beginning of cooking, then used the remainder to garnish.  I did add one chicken bouillon cube but used low sodium chicken broth and added no additional salt, and it came out nicely.  Last, I added some nice-sized chunks of carrots and celery, and cut my potatoes into larger chunks too, to give the soup a more hearty flavor and appearance.  \r\n\r\nOne last tip -- This recipe makes a very large batch of soup, and I knew we would tire of it before it was eaten.  So I froze half of it at the stage AFTER pureeing but BEFORE adding any milk.  We'll enjoy it again one wintry evening!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEGALPEACH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/481752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T11:50:09.193Z",
                "reviewBody": "Good recipe. Have made several versions with bacon, hamhocks, and ham bones. I prefer using smoked hamhocks and I always add some small diced boiled potato, carrots and about a cup and a half of cooked ham slice to the pot after I cream it. Makes it a little heartier and serve it with garlic bread and a salad. Very nice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWALSIP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-26T03:02:15.497Z",
                "reviewBody": "This is by far the best pea soup I've ever had though I made some changes. I used 1/2 lb bacon instead of hamhocks (since I had it in my freezer already) frying the bacon in the stockpot disposing of 1/3 the grease and reserving the crispy bacon for garnish later. After the grease was cool I added the rest of the ingredients. I did take the bay out after 1/2 hour of simmering (afraid of too strong a taste) and reduced the amount of milk at the end as I thought this soup was too thin for my taste. I doubled the simmer time and it turned out just thick enough. I will use this recipe from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NUNPUNCH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/613040/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-14T00:32:01.443Z",
                "reviewBody": "A word to the wise: ALWAYS READ REVIEW SUGGESTIONS before preparing a recipe. I made this recipe pretty much as instructed (I substituted a dash of cayenne for the red pepper flakes and substituted 1 tbsp \"TASTEFULLY SIMPLE brand spinach & herb mix\"...as it was the only thing on hand will dill in it). The recipe was way to watery for my family. I tried to salvage it by pureeing 3 cans of drained peas (it's all I had on hand) with a little of the broth and returned it to the pot. It was still watery so I thickened it with 1/2 c flour and 1 c water. This really increased the number of servings so as not to dilute the flavor I added 1/2 cup of TASTEFULLY SIMPLE product \"Bacon Bacon\" (dried seasoned bacon bits). The flavor of the soup was great... my 5 year old ate 3 bowls! I froze the remainder in single serving portions using a vacuum sealer system and will have soup for weeks to come!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BAILEYRN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/768710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T11:49:00.99Z",
                "reviewBody": "As much as I love split pea soup I hardly ever make it because the recipe I have although delicious is very time consuming. I found this to be very good and so quick and easy. I cut the water to 4 cups and would recommend using low sodium chicken broth as the chicken bouillion powder is very salty. I will make this again (and soon).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookin'mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/249327/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:07:50.427Z",
                "reviewBody": "Very good!! I did what everyone said to half the water I used more chicken broth than water so I don't have to use boullion added ham garlic powder dried thyme and parsley!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Novi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2545092/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T05:58:14.543Z",
                "reviewBody": "I cut the water back by 2 cups and the soup still came out a little too thin for us but the flavor was very good and hubby & kids all enjoyed it very much. I think next time I will cut down on the dill just a bit and cut out either the pepper flakes or the hot sauce because it was just a tad too hot for my taste. I will also cut out the chicken bouillon powder (in favor of more chicken stock instead of water) as it seemed to make it too salty. Overall a very good soup that I will no doubt make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Homestead Grandma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/homesteadgrandma/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-23T20:45:01.733Z",
                "reviewBody": "This soup was great. I increased the split peas by 50% added an extra potato to make it more hearty and omitted the milk to save on calories. Everyone in my family liked it which doesn't happen as often as I'd like!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAWANDMEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-16T02:50:47.48Z",
                "reviewBody": "Rats when am I going to learn to read at least a FEW reviews BEFOREHAND. I was in a hurry and this one had a great star rating anyway. Turns out those great ratings were given by reviewers who changed the recipe. Add to that not being very familiar with making (only eating) pea soup I didn't see this one coming. VERY watery so either there's a mistake with the amount of liquid or this is not a traditional pea soup recipe. The flavor was a little weak as well when I compare it to others I've tasted. I never did add the milk at the end which would have watered it down even more. I tried adding instant potato flakes to thicken it which worked fairly well but didn't want to alter the flavor by adding too much. This really only needs the 6 cups of broth and no milk for that amount of split peas. Leave out the water all together.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            }
        ]
    }
]