[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16563/soups-stews-and-chili/soup/tortilla-soup/",
                    "name": "Tortilla Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13351/chicken-tortilla-soup-i/",
        "name": "Chicken Tortilla Soup I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F26%2FChicken-Tortilla-Soup-2000.jpg",
            "width": 2000,
            "height": 1125,
            "caption": "Chicken Tortilla Soup I"
        },
        "datePublished": "1999-01-25T18:40:26.000Z",
        "description": "This chicken tortilla soup is quick to make, flavorful, and filling! Serve with warm corn bread or tortillas. This also freezes well. Garnish with chopped fresh avocado, Monterey Jack cheese, crushed tortilla chips, or green onion!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 onion, chopped",
            "3 cloves garlic, minced",
            "1 tablespoon olive oil",
            "2 teaspoons chili powder",
            "1 teaspoon dried oregano",
            "1 (28 ounce) can crushed tomatoes",
            "1 (10.5 ounce) can condensed chicken broth",
            "1 ¼ cups water",
            "1 cup whole corn kernels, cooked",
            "1 cup white hominy",
            "1 (4 ounce) can chopped green chile peppers",
            "1 (15 ounce) can black beans, rinsed and drained",
            "¼ cup chopped fresh cilantro",
            "2 boneless chicken breast halves, cooked and cut into bite-sized pieces",
            "crushed tortilla chips",
            "sliced avocado",
            "shredded Monterey Jack cheese",
            "chopped green onions"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium stock pot, heat oil over medium heat. Saute onion and garlic in oil until soft.  Stir in chili powder, oregano, tomatoes, broth, and water. Bring to a boil, and simmer for 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in corn, hominy, chiles, beans, cilantro, and chicken. Simmer for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Ladle soup into individual serving bowls, and top with crushed tortilla chips, avocado slices, cheese, and chopped green onion.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Tortilla Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Star Pooley"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.687625754527163,
            "ratingCount": 1988,
            "itemReviewed": "Chicken Tortilla Soup I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "376.7 calories",
            "carbohydrateContent": "30.9 g",
            "cholesterolContent": "46.1 mg",
            "fatContent": "19.1 g",
            "fiberContent": "8.7 g",
            "proteinContent": "23.1 g",
            "saturatedFatContent": "7.2 g",
            "servingSize": null,
            "sodiumContent": "943.2 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-12T17:44:36.263Z",
                "reviewBody": "I read every single review (all 114) prior to making this soup, so I changed a few things.  It turned out wonderfully!!  Here's how I did it:  I diced two boneless, skinless chicken breasts and cooked them prior to starting with the olive oil, 2 cloves garlic and 1/2 cup diced onion.  Then I added 4 cans condensed chicken broth (many people said the soup was very thick - chili-like consistency, and I wanted more of a soup).  I also added a can of water (filled a broth can with water).  I added the crushed tomatoes (28 oz), the hominy (15 oz), the diced green chili peppers (4 oz), 1 tsp each of cumin (instead of oregano as many reviewers suggested), lime juice and garlic powder, and 1/2 tsp of chili powder.  I brought to a boil and let simmer for 1 hour (as others also suggested).  Top with shredded monterey jack cheese and garnish w/ tortilla chips.  EXCELLENT!  My husband said it tasted just like the chicken tortilla soup we'd had at Chili's - which was what I was aiming for!!  I think the sour cream would have been a good topping as well, maybe next time.  Thank you for a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNANTHONY99",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/852946/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-05T15:53:12.95Z",
                "reviewBody": "My husband and I loved this soup - it tastes just like the chicken tortilla soup I've had at restaurants.  I made the following changes.  I first sauteed cut up chicken breast in a little olive oil, with salt and pepper and garlic powder, and then I shredded the chicken.  I used 4 cloves of garlic, because we love garlic!  I substituted 2 tsp of cumin for the oregano.  I added 2 cans of chicken broth and omitted the water.  I don't particularly like hominy, so I substituted 2 cups of frozen white corn.  And I didn't have any canned green chile peppers, so I used half a can of diced jalepenos.  I topped off the soup with Monterey Jack Cheese, crushed tortilla chips, fresh minced Cilantro and a little sour cream .  It was wonderful!  I served the soup with Mexican cornbread (basically cornbread mix to which I added diced jalepenos and 1 1/2 cups of Monterey Jack).  I definitely be making this soup again !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KMSERGENT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/826361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-07T16:03:16.64Z",
                "reviewBody": "I can't say enough good things about this recipe!! Suffice to say that I've made it at least 6 times in the past several months.  It's such a good, hearty soup, and so easy to make. I've made it for friends several times and EVERYONE has asked for the recipe. Here's what I've learned: \n1) Make sure you use FRESH cilantro.  It truly does make a difference.\n2) I bake the chicken and chop it up (rather than shredding) using my Pampered Chef hand chopper. REALLY fast and much easier than shredding.\n3) Eliminate the water and use another can of chicken broth instead.\n4) Omit the oregano - use 1 teaspoon of cumin (as others suggested) instead.\n5) Rather than shredding Monteray Jack, I find that Kraft shredded Mexican cheese works just as well and is easier/faster.\n6) I've never had a ripe avacado on hand, and though I'm sure it would be good, it's not necessary because this soup is already delicious. 7)I add sour cream as an additional garnish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris_E",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-07T19:13:21.52Z",
                "reviewBody": "Not sure if people are rating this recipe based on their personal revisions, but as written this recipe does not deliver. It's too watery, it needs more time to cook, and it completely lacks in spice/flavor. Luckily I had a couple ingredients on hand to fix it, and the end result was wonderful and the whole family asked to have it again (soon). So I will share my changes:  1) Use shredded chicken - it's more like what you'd get in a restaurant. 2) Let this soup simmer in a crock pot - I did it on low for a total of 5 hours. It thickens the soup and helps the flavors blend. 3) Substitute the water for chicken broth (I used a total of 3 cups of broth). 4) Skip the hominy - one cup of corn is enough. Add an extra 4oz can of green chilis.  5) ADD A PACKET OF TACO SEASONING (I had McCormick's on hand) and increase the chili powder by 1 tsp. Add a sprinkle of cumin and a little salt (or garlic salt). 6) Add 8-10 finely crushed tortilla chips (baked are ok) into the soup (they'll cook down so you won't have crunchy bites but they add a good flavor - it is TORTILLA soup, right?) 7) After simmering for 4 1/2 hours, stir in 1/2 cup of sour cream. Continue to simmer for 30 minutes. This is what really puts the soup over the top and gives is a creamy texture similar to what I've had in most restaurants. 8) Serve with diced avocado, shredded cheese, and more tortilla chips for crumbling.  End result - awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "VD711",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-09T13:46:57.687Z",
                "reviewBody": "Not like the tortilla soup I had in Mexico, but very good with some changes other reviewers suggested. I started with the base and it tasted bland so I added cumin and more chili powder (salt and pepper to taste) and let this simmer (after only 10 minutes the tomatoes still taste raw). I recommend an hour.  Towards the end, add the chicken and beans-they only need to be heated through.  I have no clue what condensed chicken broth is, so I used regular broth. I ended up adding 2 more cups of chicken broth, as it was too thick. Topped with cheese, tortilla chips, Franks hot sauce and sour cream and it was pretty and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nikki Sell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1485486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-27T18:49:50.497Z",
                "reviewBody": "So delicious!! I only gave this four stars because this is the second time I've made it; the first time I followed the recipe exactly but this time I modified it slightly. My changes made it even better! I used a pre-cooked chicken omitted the oregano and cilantro added 1 tsp cumin and used 1 tsp regular chile powder plus 1 tsp ancho chile powder. It was aMAzing!! I STRONGLY recommend the ancho chile powder to those who can find it...it gave it such an awesome flavor! Next time I may just use all ancho and none of the regular... Will DEFINITELY make again!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RedRobynNAU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-28T20:12:42.53Z",
                "reviewBody": "GREAT - We are big soup lovers and make many kinds of soup all year round. My husband, son and I love this soup. I have made this soup at least 4 times over the last year. I usually double the recipe and saute the chicken breasts in a little olive oil with garlic powder and black pepper then shred before adding to the soup just before the simmering step. I also use additional chicken broth instead of water and add 1 jar of salsa. Sometimes I add hominy, sometimes not. I also add cumin and some lemon juice to taste. HOWEVER, I always let the soup simmer for at least a hour or more on low heat to let the flavors come together. This makes it even better the next day. This is very good topped with sour cream, chopped green onions and shredded cheddar or pepper jack cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PammyJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609096/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-28T19:21:55.333Z",
                "reviewBody": "We loved this soup!  I didn't add the oregano because that seems like an Italian herb.  Instead I added cumin.  Be sure to use crushed tomatoes and not whole or chopped.  The crushed is thicker, the others are too watery.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maryann Fellner-Rapp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/152127/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-06T07:30:30.81Z",
                "reviewBody": "Excellent lightly spicy soup, Star! I think the base flavor needed \"something\" though. The oregano was a little too prominent, to me. I added 1/4 cup red wine (boil off the alcohol for a few minutes) Did the trick. WAY GREAT! Oh, and I thought it needed to be cooked a little LONGER (10-15 minutes, simmering) to blend flavors.  If you do, don't add the (we prefer slightly shredded to chunks)chicken until last few minutes or it will be \"mushy\". If you like chili and chicken TRY THIS RECIPE. You won't even need the toppings-great without too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Tortilla Soup I",
            "description": "See how to make a quick, 5-star chicken soup that’s filling and delicious.",
            "uploadDate": "2012-06-13T21:10:12.818Z",
            "duration": "PT3M27.874S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc20e356f-9c1f-47db-a202-aa818cc49348%2F0140adf6-ac75-472d-bc60-82c51c5fda0b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1688044252001"
        }
    }
]