[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13368/chicken-corn-soup-i/",
        "name": "Chicken Corn Soup I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1768852.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "A real Pennsylvania Dutch favorite! I have made this several times over the years.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 (4 pound) chicken",
            "1 onion, chopped",
            "4 quarts water",
            "1 (10 ounce) package frozen whole kernel corn",
            "½ cup chopped celery",
            "salt and pepper to taste",
            "1 cup all-purpose flour",
            "1 pinch salt",
            "1 egg",
            "¼ cup milk",
            "2 hard-cooked eggs, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large stock pot cover chicken and onion with water.  Cook slowly until tender, approximately 1 hour. Remove chicken, let cool and remove meat from bones. Cut meat into 1 inch pieces, discard skin and  bones.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut corn from cobs if using fresh corn.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add corn, cut up chicken, celery to stock pot and season with salt and pepper.  Simmer soup for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl make rivels by mixing together flour, salt, egg, and enough milk to form small crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop rivels into soup and add hard boiled eggs. Simmer for 15 minutes and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Teresa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5476190476190474,
            "ratingCount": 42,
            "itemReviewed": "Chicken Corn Soup I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "271.1 calories",
            "carbohydrateContent": "14.2 g",
            "cholesterolContent": "117.6 mg",
            "fatContent": "12.4 g",
            "fiberContent": "1.1 g",
            "proteinContent": "24.7 g",
            "saturatedFatContent": "3.5 g",
            "servingSize": null,
            "sodiumContent": "90 mg",
            "sugarContent": "0.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-19T04:59:41.647Z",
                "reviewBody": "I added parsley to suit myself and instead of water I substituted Swansons Chicken Broth... this has got to be some of the best soup I ever tasted. I used frozen yellow & white baby corn 16 oz. bags and I was told afterward that an additional can of cream corn may have brought the flavor of the corn out better. I made enough for a church \"Soup-er Bowl\" 36 servings and used 14 lbs of chicken 48 cups of chicken broth and 3 lbs of corn. And plenty of rivels! DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gordon S. Hampton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2287969/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T17:16:57.097Z",
                "reviewBody": "My Husband is from PA where this soup is pretty much a regular in most homes and he's talked about it for years now! We've lived in NC since we've been married so he hasn't had his \"chicken corn soup fix!\" I found this recipe recently and it seemed easy enough so I gave it a try. I loooved it and my Husband had 3 bowls in one setting and said it tasted exactly how he remembered it! I followed the driections pretty much the way they are but I cut down on the cooking time by using chicken broth in place of water and using a rotisserie chicken (shredded). It was quick and easy. I loved the rivels and I think next time I will put more in. I'm also gonna take the advice of another reviewer and try adding in a can of cream corn to the mixture next time - although it is good without it!. This soup was very deilicious and I will most definitley be making it for years to come!!! Thanks for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MarineWife",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5543898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-09T04:38:28.953Z",
                "reviewBody": "I'd never heard of rivals and had to try them! So I made a quicker easier version of this recipe because I didn't have a whole chicken. Started with a mirepoix 1 onion 2 ribs celery 1 carrot sauted in 2 T. margarine for flavor and color. Added 1 large boneless skinless diced chicken breast 1 can of corn with liquid and 4 cups of water. Then used 4 teaspoons of chicken soup base Orrington Farms brand is excellent NAYY. Also added a little dry Thyme. Then for the rivals I used half whole wheat flour to make them healthier and added 1/2 teaspoon salt for flavor. My crumbles of dough were around pea size. I didn't use the hard cooked eggs. This soup was great...I love the rivals! I made a 3 quart pan full and only ate one little bowl because it's very filling. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEWVERYTALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1282015/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T17:16:57Z",
                "reviewBody": "I'm from Lancaster County and grew up eating chicken corn soup! This is a good recipe for it. Some people add carrots and some don't like the hard boiled eggs but NEVER potatoes to true chicken corn soup! For the rivels the \"dough\" should really be called batter. There is no mystery and almost no way to mess up. The dough should resemble a thick pancake batter. How big they are in your soup depends on how large a dough \"plop\" you use. They do not resemble \"balls\" while making them because the dough is too sticky to make a ball shape.They do make little balls when cooked though. But size is up to you. I've had large rivels and small ones. I personally like them about the size of a small marble when cooked. The easiest way I have found to get the rivels into the pot (because the dough/batter is sticky) is to first scoop up a level (or just a bit rounded) teaspoonful of the batter. Use your index finger against the edge of the spoon to push and cut off a bit of dough (whatever size you like) and it should stick to the fingerprint side of your index finger. Use the back of the spoon to then push the dough from your finger into the pot. (yes there is still more dough on the spoon but it won't fall off because it is sticky.) Keep pushing pieces of dough from the spoon. (about 6-8 rivels from one spoon of batter/dough) If it gets stuck to the back of the spoon touch the piece of dough to the hot soup. Once I can get in rhythm I can do all the rivels in about 5 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "margie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4134214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-11T01:26:03.45Z",
                "reviewBody": "I had never heard of this. I thought it tasted like a chicken and dumplings type of soup- only with tiny dumplings. My 3 toddlers ate a whole bowl each! As always I think soups taste better on the second day. I added more corn. The boiled eggs do give it a little something extra I may add 3 next time! Would someone please post a pic of these \"rivels\" so that I can see what I am supposed to be making?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hollie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3450243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-16T11:45:17.997Z",
                "reviewBody": "I cooked this recipe and it turned out really well and fed my family so i give it top marks and i recommend it to anyone who loves tasty soups!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SEPHIROTH772",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1185559/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-02T17:52:41.413Z",
                "reviewBody": "This soup is wonderful comfort food! I wanted to get it on the table a little faster for Sunday dinner so I used chicken stock and skinless boneless chicken thighs instead of whole chicken and water. I simmered the thighs and chopped onion in the broth for about 20 minutes. I also used mini pasta instead of making the rivals and I added a dash of nutmeg at the last minute. It was delicious and my kids and I just loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mallmarie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2383135/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-12T18:53:12.373Z",
                "reviewBody": "This soup is an excellent old fashioned rivel soup and I can't imagine anyone not giving it 5 stars. It takes some time to make but is well worth it. Thanks for a wonderful addition to my recipe box!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2242068/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-05T18:12:27.78Z",
                "reviewBody": "Delicious! My mom's been making this soup since I was little and I tried it myself after finding this recipe. I did things a little different since I had a chicken carcus leftover with lots of chicken on it so I boiled that for an hour and then picked the chicken off (had to add some chicken broth though) and then made the soup also added carrots and parsely. Rivvels are wonderful. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELLENEJ22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1168691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-11T12:15:03.007Z",
                "reviewBody": "I made this last night but I think I must have done something wrong. I followed the instructions exactly but when the soup was finished it tasted greasy and had globs of grease from the chicken fat floating in the broth. In the past I've always chilled the stock from the chicken and removed the fat that floats to the top and hardens then used what was left. This recipe didn't call for that so I went with what the instructions said. We couldn't finish a bowl of it because of the greasy taste:-( I think I'll try this again one day but remove the grease from the stock first. It sounds like it has the potential to be a very good soup. Does anyone else have any ideas on why mine tasted so greasy? The chicken didn't seem to have an excess of fat on it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Zoe Emiko",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16627035/"
                }
            }
        ]
    }
]