[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14605/rump-roast-au-jus/",
        "name": "Rump Roast Au Jus",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F259543.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1999-10-05T01:30:54.000Z",
        "description": "This is a wonderful way to do rump roast in the slow cooker. It creates a wonderful juice while it cooks; serve the juice over individual servings of beef. You'll want the cut to be between 4 and 5 pounds.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT10H0M",
        "totalTime": "P0DT10H10M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon ground black pepper",
            "1 tablespoon paprika",
            "2 teaspoons chili powder",
            "½ teaspoon celery salt",
            "½ teaspoon ground cayenne pepper",
            "½ teaspoon garlic powder",
            "¼ teaspoon mustard powder",
            "1 (4 pound) rump roast",
            "½ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together black pepper, paprika, chili powder, celery salt, cayenne pepper, garlic powder, and mustard powder. Rub mixture over the surface of the meat. Place roast in a slow cooker, and add 1/2 cup water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on Low for 8 to 10 hours. When meat is tender and well done, transfer roast to a serving platter. Skim fat from juices, and strain; serve with meat.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ardith Simon"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.085106382978723,
            "ratingCount": 235,
            "itemReviewed": "Rump Roast Au Jus",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357.6 calories",
            "carbohydrateContent": "1.6 g",
            "cholesterolContent": "120.9 mg",
            "fatContent": "17.6 g",
            "fiberContent": "0.8 g",
            "proteinContent": "45.5 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "161 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-24T14:41:16.367Z",
                "reviewBody": "OK, I will try not to let this get too long but I have a lot to say.  Some people are rating this recipe based upon what they cooked which did not match up well with the actual recipe.  One person complains of mushy vegetables and vegetables are not even in the recipe.  And those who complain it is too spicy - duh - look at the ingredients!  I looked at this recipe and instantly knew I would not make it based upon the peppery/spicy ingredients.  I certainly would not have made it and then given it a low rating for being too peppery.  This recipe did, however, give me a good idea about how to go about cooking what I had in mind.  The only similarity between what I cooked and this recipe was I used a rump roast and I used a slow cooker.  I used my own seasonings (garlic inserted into meat and a rub of garlic pepper, celery salt and tarragon) used 1 cup beef broth and 1/2 cup red wine and just popped it in the slow cooker for 7 hours with chunks of onion.  It turned out very very tender, moist and tasty.  Anyone complaining about tough, dry meat either has a problem with their slow cooker not being on a low enough temperature or a problem with the cut of meat they are using.  I had no problems with fatty juice at all - did strain it through cheesecloth before serving.  Thanks for the recipe - it gave me an idea of what to do even though I didn't follow it this time.  I will possibly use the recipe as written if making meat for chili, enchiladas, burritos or tacos!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "deedee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2228031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-04T16:40:40.56Z",
                "reviewBody": "This is the BEST crockpot beef recipe I have ever tried.  I sub seasoned salt for celery salt and cut back the pepper to 1 tsp.  Didn't use cayenne and used 1 1/2 cups water mixed with Lipton onion soup mix.  After about 6 hours on low, I slice it (or shred) and put back in the au jus for another hour.  I serve it on toasted hamburger buns from the bakery and then drizzle some au jus (just a bit) on the top half of bun.  Add provolone cheese and broil for a minute.  Serve au jus on the side for dipping!!  It is ALWAYS a hit!  My picky kids can't get enough!!!**UPDATE* I tried it with the Cayenne and it gave it a nice kick, not too hot!  I plan on adding it from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Cowan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1947046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-26T23:47:18.92Z",
                "reviewBody": "This is a great basic recipe but it needs a little tweaking. First of all it calls for way too much pepper--cut it down from 1 Tablespoon to 1 teaspoon.  I also reduced 1 Tablespoon paprika to 1 1/2 teaspoons paprika.  In addition, I added 1 teaspoon onion powder.  I omitted the 2 teaspoons chili powder, but, to compensate, I changed the 1/2 cup water to 1/2 cup beef bouillion.  I also added 3 medium chopped potatoes and 3 large chopped carrots.  Mine turned out wonderful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GINARENEE1776",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1268483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T00:41:45.24Z",
                "reviewBody": "This recipe is unbelievable. I make a nice size roast and there are no leftovers. It's got a nice kick but not overwhelming. The au jus is wonderful. I like to freeze anything that is left.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/413506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-27T02:17:38.833Z",
                "reviewBody": "I followed the other reader's suggestions and added 1 t. black pepper 2 t. paprika 1 t. chili powder 1/2 t. celery salt 1/2 t. ground cayenne 1 t. onion powder 1/2 t. garlic powder 1/4 t. mustard powder 1 envelope Dry Onion Soup and I added 2 or more cups of water. I slow cooked this on low for 8 hours and the meat was so tender it just fell apart. I drained the broth and added more salt and pepper to bring out the flavor of the beef. Then I placed the beef on a hoagie roll sprinkled it with grated swiss cheese melted the cheese in the microwave for 40 seconds and we dipped the sandwhiches in the au jus to make a delicious French Dip Sandwhich. My family thought they were fabulous and I loved how easy they were to prepare!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DearHeartK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1701981/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-29T00:44:52.263Z",
                "reviewBody": "I thought this recipe was great my family loved it! I would not cook it for more than 8 hours flip the meat half way though so juices flow both ways.red wine is great with this meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pcs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1747539/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-04T19:53:36.62Z",
                "reviewBody": "I will gladly give this recipe 5 stars. It simply tastes wonderful to everyone I know of. I've made it quite a few times and most likely will never stop. Thank You.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Grein",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2438466/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T19:02:52.95Z",
                "reviewBody": "This is very good. I had a 3 1/2 pound roast. I followed the recipe except I used coffee rather than water. It's really not spicy my 4 year old and 2 year old sons didn't even think it was spicy. I'll definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ATOBOLS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1454346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-10T00:16:42.757Z",
                "reviewBody": "My husband loves this recipe! He is very picky and usually does not express much pleasure over any food or recipe unless it's absolutely fantastic. I liked it too except I would prefer less chili powder since I don't go for very hot and spicy dishes. It was too spicy for our 4 year old daughter. Use the leftovers to make fantastic open-faced beef and mashed potato sandwiches on white bread(preferably homemade)! Use the leftover juices to make a gravy. My husband raved over this leftover dish also and he usually despises leftovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-24T16:01:12.17Z",
                "reviewBody": "Over spiced on the outside and bland on the inside. I'm always on the hunt for a recipe that will help me figure out what to do with a rump roast to make it taste like more than a cheap hunk of meat. This was not it. The pepper was overwhelming and even with the long slow cooking time it was still rather tough. Overall too unpleasant to enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "DARLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/919751/"
                }
            }
        ]
    }
]