[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/104/appetizers-and-snacks/cheese/",
                    "name": "Cheese",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1228/appetizers-and-snacks/cheese/nachos/",
                    "name": "Nachos Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26924/restaurant-style-chicken-nachos/",
        "name": "Restaurant Style Chicken Nachos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F745665.jpg",
            "width": 1176,
            "height": 1093
        },
        "datePublished": "2019-04-02T06:43:48.000Z",
        "description": "This delicious and easy to prepare recipe is sure to be a big hit! Hearty enough for a meal. The key is the meat filling -- it also makes a great filling for tacos and quesadillas. This recipe can be modified to meet your own taste. I recommend  serving with sour cream and  guacamole. Be creative!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 cloves garlic, crushed",
            "6 green onions, sliced, white parts and tops separated",
            "3 tablespoons canola oil",
            "1 shredded, cooked, whole chicken breast ",
            "salt and pepper to taste",
            "1 cup salsa",
            "½ (12 ounce) package tortilla chips",
            "1 (8 ounce) package shredded Cheddar/Monterey Jack cheese blend",
            "½ large tomato, diced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 12 inch skillet over medium heat, cook and stir the garlic and white parts of the green onions in canola oil until tender. Mix in shredded chicken, salt and pepper. Toss until well coated with oil. Stir in the salsa.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange tortilla chips on a large baking sheet. Spoon the chicken mixture over tortilla chips. Top with Cheddar/Monterey Jack cheese blend and tomato. Bake in the preheated oven 10 minutes, or until cheese has melted. Remove from heat and sprinkle with green onion tops before serving.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Cheese",
            "Nachos Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LAURA B."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.612312811980034,
            "ratingCount": 601,
            "itemReviewed": "Restaurant Style Chicken Nachos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "406.9 calories",
            "carbohydrateContent": "24.4 g",
            "cholesterolContent": "54.2 mg",
            "fatContent": "25.7 g",
            "fiberContent": "2.8 g",
            "proteinContent": "21.4 g",
            "saturatedFatContent": "8.1 g",
            "servingSize": null,
            "sodiumContent": "669.6 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-03T13:25:36.06Z",
                "reviewBody": "I made this as listed, and it was very good.  I think making the changes other reviewers suggested will make it a 5 star dish.  I will add taco seasoning to the chicken next time, as it could use a little more kick.  I also like the idea of adding black beans and corn to the mixture, to make it a little more substantial and get some extra veggies into my kids at the same time.  Heating the chips first for 5 minutes would help keep them crisp too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CTCOOK1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1224726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-24T09:11:19.86Z",
                "reviewBody": "I have made this recipe literally dozens of times since discovering it, in multiple ways, and I believe I have tweaked it enough to get the perfect nacho recipe! As is, this recipe gets 4 stars. The chicken mixture is a little bland, and I prefer more toppings (olives, jalapenos, etc.) on my nachos. \n\nMy tips and changes for the perfect chicken nachos (according to my tastes, at least):\n\n1. Use rotisserie chicken from the grocery store, or cook your own chicken breast first. Do NOT use canned chicken or the pre-cooked, packaged chicken chunks! They give it a weird flavour and don't shred as nicely.\n\n2. Shred, don't chop, the chicken. It's so much smoother and melt-in-your-mouth-y this way.\n\n3. Add taco seasoning (or your own blend of spices) to the onions while you saute them. Use a lot so it coats the chicken when you add it.\n\n4. Along with the chicken, stir in some rinsed canned black beans and some frozen corn kernels (don't need to thaw). Don't use a \"southwestern-style\" salsa that has these ingredients included, as I found that it didn't provide the texture contrast you get from using canned beans or the bites of sweetness you get from frozen corn.\n\n5. Pre-bake the tortilla chips ~5min before adding the chicken mixture so the chips stay crispy.\n\n6. Add more toppings! I add sliced black olives and lots of sliced jalapenos along with the tomatoes. Sometimes I will also toss on some diced green or red bell pepper for crunch.\n\nServe with sour cream for the perfect nachos!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lyssador",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3195012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-23T22:22:12.92Z",
                "reviewBody": "This recipe is awesome!!!!  My husband loved it...so did the kids!  I used  Kirkland Signature Premium Chunk (Costco brand)canned Chicken Breast (12.5oz can) It really worked out well.  I also used shredded cheddar and mozzerella cheese, cause that's what I had in the house!  Next time I will try adding refried beans, black olives, and jalapeno peppers to add a little spice!  I already have my family hounding me to make it again!  Very easy to make.  Recommend you try this one first!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kermie4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/829431/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:27:10.41Z",
                "reviewBody": "Mmmmmmm nachos are the best! I used ground turkey in this recipe along with a can of black beans cumin jalapeno peppers and garlic and onion powders. In addition to the shredded cheeses I decided to go all the way and also make a cheese sauce using cheddar and pepper jack. I don't like soggy nachos so I baked the chips by themselves to really crisp them up and then put the meat mixture on top added the cheese and served. This is the FIRST time I've ever seen hubby eat nachos. Delicious Laura!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-11T18:15:30.03Z",
                "reviewBody": "This was simply excellent!!  I used the advice to warm the chips before adding the chicken mixture.  I purchased the Tostitos Gold chips because they are thicker and it worked out very well.  After cooking the chicken I added a taco mix for more kick and used a mixture of mild and medium salsa.  I used montery pepper jack cheese and some cheddar.  I added black olives for flavor and color.  All my friends raved and wanted the recipe!  I even saved a small plate for the next day and it was still delicious warmed up in the oven.  Thanks for a recipe I will use often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShellyGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1141346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-11T08:11:45.687Z",
                "reviewBody": "very good! we topped the tortilla chips with refried beans (canned) and then added the chicken mix etc. Also didn't used the tomato just salsa was fine. Quick and tasty!The whole family enjoyed it:) thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRISA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/420951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-11T21:11:46.623Z",
                "reviewBody": "These were really really really good! They really did taste like they were from a restaurant. I seasoned the chicken with taco seasoning added some refried beans and served with sour cream! My hubby and I ate them for a meal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin Chory Valenti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/484057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-17T23:43:50.203Z",
                "reviewBody": "Amazing recipe! I cubed the chicken instead of shredding it (just a personal preference) and also added 1/4 of a bag McCormick Mild Taco Seasoning Mix. Jalapeno peppers diced green chiles and pepper-jack as well as cheddar cheese completed it! I also warmed the chips prior to baking with the chicken/cheese mixture. I also make my own salsa and it is a perfect addition to this recipe! Thanks for sharing! Extra Note: The way I make these are for spicy lovers! They are super hot and super good!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SexyCadence311",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2308112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T09:59:57.09Z",
                "reviewBody": "I give this 5 stars because it was extremely easy to make had a yummy taste as is and allows you to make lots of changes/additions. I added some extra seasonings to the chicken I sprinkled some paprika garlic powder and just a hint of chile pepper in addition to the salt and pepper. In the future I was thinking of adding lots more chicken maybe even some beans and maybe corn. Regardless I really liked this recipe had a wonderful taste. Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PIBETS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/709633/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-10T15:58:23.207Z",
                "reviewBody": "Good recipe but not worth 5 Stars because so many changes are needed. First thing cover the baking sheet with foil and spray with Pam for easier serving and clean-up. Rather than season the chicken I addes taco mix to refried beans (heated). Used Organic chips with added flax (healthier and more fiber) first layer a light dusting of cheese to keep chips from getting soggy then warmed chicken then drop warmed beans by spoonful all over then sprinkled with corn (adds texture and a touch of sweetness) and more shredded cheese. Because everything has been pre-heated you can put in broiler for 1-2 min. this will lightly toast the chips and keep everything from being soggy. I pull the foil right off the sheet and put on a platter and dollop with salsa chopped avocado or guacamole and sour cream to make it special. Serve with a side of limes to squeeze on top if wanted and caesar salad for a nice meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "dbray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2350755/"
                }
            }
        ]
    }
]