[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/661/meat-and-poultry/chicken/chicken-thighs/",
                    "name": "Chicken Thigh Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/15229/thighs-on-rice/",
        "name": "Thighs on Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3963117.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1999-07-01T16:29:16.000Z",
        "description": "This is a VERY simple, quick and tasty recipe, and a special treat for all of you thigh lovers out there in 'Chickenland'! (Note: Small thighs work better for this recipe. Sometimes I parboil the chicken, then remove my two cups of water from the pot).",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 cubes  chicken bouillon",
            "1 tablespoon water",
            "1 cup uncooked white rice",
            "¼ cup butter",
            "1 onion, chopped",
            "2 cups water",
            "6 chicken thighs",
            "1 teaspoon Italian-style seasoning"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve bouillon in 1 tablespoon water. In a medium bowl combine the rice, butter/margarine, onion and 2 cups water. Mix well and pour mixture into a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place thighs on top of rice mixture and season to taste. Bake in the preheated oven for 35 to 45 minutes (depends on the size of the thighs).\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Chicken Thigh Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol B."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.0880829015544045,
            "ratingCount": 386,
            "itemReviewed": "Thighs on Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "394.4 calories",
            "carbohydrateContent": "28 g",
            "cholesterolContent": "99.5 mg",
            "fatContent": "22.3 g",
            "fiberContent": "0.9 g",
            "proteinContent": "18.9 g",
            "saturatedFatContent": "9 g",
            "servingSize": null,
            "sodiumContent": "513.5 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-07-01T18:19:28.937Z",
                "reviewBody": "This is an easy way to cook thighs.  It is the kind of recipe you can adjust easily to your own taste, so I like it.  I'm going to say what I did to put out a few more ideas to people who might try this recipe.\r\n\r\nI used 2 1/2 cups water, brown rice, 2 cloves minced garlic, olive oil instead of butter since I didn't have much butter around, and I skipped the step with bouillion and 1 tbsp. water.  \r\n\r\nThe extra water is for the brown rice, which needs more water  I ended up with a little extra liquid, but it was absorbed when my food cooled off.  Next time I will use 2 1/4 cups water.  I parboiled the rice for 20 minutes with the bouilion, water, onion, oil, and 2 cloves minced garlic so I wouldn't have to bake it longer, as brown rice takes two to three times longer to cook than white rice.\r\n\r\nI removed the skins to cut the fat content and shook lemon pepper on top of the thighs before baking.  I also added some sliced chile peppers and fresh parsley before baking because I like heat.  If you add fresh parsley, you will get more taste if you add it toward the end of baking, which I forgot to do.\r\n\r\nI ended up baking it 45 minutes to make sure the rice cooked through.  You won't need to cook it as long if you use small thighs and white rice, though.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CLOUDSSUNRAIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/173221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-24T21:26:22.85Z",
                "reviewBody": "5 stars with these changes... Here are some Cooking 101 tips. Heat a couple tablespoons of olive oil in a dutch oven over medium high heat. Season chicken (thighs OR drumsticks) with S&P and brown for 4-5 minutes per side. Remove from pot. Saute the onion (and celery, carrots, mushrooms) for 2-3 minutes in the same pot. Then add rice, broth, melted butter, and Italian seasoning (only 1/2 tsp.) and stir together. Put browned chicken on top of rice and cover with a tight fitting lid. Bake for 35-45 minutes. Cooks perfectly every time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cassie W.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2439641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-20T00:25:51.75Z",
                "reviewBody": "I gave it a four after doing a few things other reviewers posted.  I heated the butter, buillion, water, onion, and minced garlic just until butter melts, then poured this over the rice.  I didn't have italian seasonings so I used seasoned salt and rubbed into chicken thighs (skin off).  Once the chicken & rice was completed I added a handful of shredded cheese onto the rice.  Turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "aprlcook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1866953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-28T19:56:48.623Z",
                "reviewBody": "I took advantage of some previous suggestions and used skinless thighes, only ONE bouillon cube, cut back on the butter and increased the cooking time to 55 minutes.  Then I added 1/2 cup white wine (since some reviews indicated more liquid AND more flavor is needed), black pepper, 2 cloves crushed garlic and a nice amount of fresh parsley.  With these modifications, I give this recipe a 4 and a half.  I like that the rice goes in the mix too -- it's one less pot to clean! I used Carolina white rice since the cooking time is a bit longer than some other white rice brands.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CATHYSOL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/549836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-11T04:53:06.25Z",
                "reviewBody": "great recipe. I mixed in a can of cream of mushrooms, sliced carrots, sliced celery,minced garlic cloves, substituted about 1/3 cup of barley for 1/3 cup of rice. and preseasoned the rice mixture. Topped with 8 bone in thighs rubbed in season baked covered at 350 for 1 hour then kicked temp to 475 for 30 min then pulled out and topped with shredded cheddar tossed back into oven for 5 minutes. turned out a little greasy but I left my chix skins on ( Best part )  Yum",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chris",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1552340/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-26T01:29:28.113Z",
                "reviewBody": "This was so yummy!!! I never give less stars just because I added to it or made it my own,So this is totally a 5!!  I did read the reviews and put more water. I also brown my chicken ..sliced mushrooms And It was amazing!My husband asked what the dish was called so he could request it for dinner!LOL! TO EVERYONE WHO GIVES A RECIPE LESS STARS BECAUSE THEY ADDED TO IT OR FOLLOWED ADVICE FROM A REVIEW..THE RECIPE IS PUT UP TO THE COOKS LIKING SHE/HE MAKES IT LIKE THEY LIKE IT! ITS OUR JOB TO READ THE REVIEWS AND ADD SOMETHING TO IT!!!!MAYBE YOU LIKE TO SEASON THE HECK OUT OF THINGS(LIKE ME) MAYBE YOU HATE ALOT OF SEASONING.THE COOK THAT PUTS THE RECIPE UP ONLY GIVES US AN IDEA..SO PUT SOME EFFORT IN TO IT GUYS AND DONT EXPECT THE COOK TO MAKE IT JUST THE WAY YOU AND YOUR FAMILY LIKES!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal O'Connell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10147998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T21:38:05.397Z",
                "reviewBody": "This was a defintie '5' fpr my husband and I liked it ok too. I used skinless thighs, added garlic and cut up fresh mushrooms. I did have to cook for an extra 20 mins, but it came out perfect. Next time I will use less margarine, I would also add some peas or corn for a little extra vegetable. My husband asked if I wanted leftovers for my lunch because he wanted to eat it all, plus he kept going, \"this one's a keeper\"\r\nVery easy.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anna K. Crossley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/697796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-15T16:36:51.073Z",
                "reviewBody": "I read through many of the reviews and decided to make this last night with a few modifications.  Instead of butter, I used olive oil, and I added a half cup more water.  I also chopped a clove of garlic with the chopped onion.  I didn't use bouillon cubes and instead used chicken broth, and I threw in some frozen vegetables (peas and carrots) with the rice, and a few cherry tomatoes from the garden.  I added some garlic powder to the spices as well.  To ensure everything cooked evenly, I stirred the rice a couple times during cooking and turned the chicken over as well.    This was really easy to make and the whole thing was ready in about an hour (prep and cooking), so it was a great meal to make after a long day at work.  My boyfriend raved about it and had seconds, and continued raving about it long after we'd finished eating.  It's definitely something I'll make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2418368/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-08T15:20:44.403Z",
                "reviewBody": "We enjoyed this recipe.  Think of it as a base to which you can personalize for your family.  I added carrots, mushrooms, garlic, Mrs. Dash, and exra Italian seasoning.  I halved the onion amount, and didn't add the butter, but added a splash of olive oil.  Next time, I don't think I will add any fat, the thighs don't need it.  I also covered it.  This it not fancy, but an easy dinner that you can throw together and stick in the oven 1-1.5 hours before dinner.  Definatly a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/372061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T22:02:59.360Z",
                "reviewBody": "I found this incredibly bland.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Delia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340824/"
                }
            }
        ]
    }
]