[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/286012/chocolate-dipped-palmiers-orejas-con-chocolate/",
        "name": "Chocolate-Dipped Palmiers (Orejas con Chocolate)",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Chocolate-Dipped Palmiers (Orejas con Chocolate)"
        },
        "datePublished": "2021-11-25T09:17:00.000Z",
        "description": "Orejas (the word means \"ears\") are our version of French palmiers: puff pastry coated generously on both sides with cinnamon sugar, rolled up, and sliced into cookies that look like hearts, or the ears they're named after. As the cookies bake, the sugar coating melts and caramelizes; we like them dark, crusty, and crunchy. Excerpted from PATI JINICH TREASURES OF THE MEXICAN TABLE: Classic Recipes, Local Secrets © 2021 by Pati Jinich. Photography © 2021 by Angie Mosier. Reproduced by permission of Mariner Books, an imprint of HarperCollins Publishers. All rights reserved.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT3H15M",
        "recipeYield": "40 palmiers",
        "recipeIngredient": [
            "2 ⅔ cups all-purpose flour",
            "¾ teaspoon kosher salt, divided, or to taste",
            "¾ pound cold unsalted butter, cut into small chunks",
            "¾ cup ice water",
            "1 ½ cups white sugar",
            "1 teaspoon ground cinnamon",
            "½ cup heavy cream",
            "¼ pound bittersweet chocolate, finely chopped",
            "rainbow sprinkles as needed (optional)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place flour and 1/2 teaspoon kosher salt in a food processor. Add butter and pulse a few times until it has broken down into bits about the size of peas. Gradually add water, pulsing until you have a very crumbly mixture; it should not come together into a ball of dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly flour your work surface and your hands and scrape the mixture out of the food processor. Gently press it together into one piece with your hands; do not knead. Lightly flour a rolling pin and roll out the dough into a more or less equilateral triangle that is 3/4- to 1-inch thick. The dough will still be ragged and the corners slightly rounded.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold the two bottom tips of the triangle over to meet in the middle, then fold the top down, without overlapping the folded flaps (the dough will look like an envelope). Turn the dough clockwise a quarter turn and roll out it into a rectangle about 1/3 inch thick. (Folding and rolling the dough several times will create the pastry's flaky layers.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold the two long sides over to meet in the center, without overlapping, then fold the dough in half from top to bottom. Turn the dough clockwise another quarter turn and roll out into another rough triangle. Repeat the folding and rolling process 2 more times, for a total of 3 turns. Tightly wrap the puff pastry in plastic wrap and refrigerate for at least 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix sugar, cinnamon, and remaining kosher salt together in a bowl. Spread 1 cup of the cinnamon sugar into a large rectangle on a large work surface. Place the puff pastry on the center of the cinnamon sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With a rolling pin, gently roll the pastry out into a large 12x12-inch rectangle about 1/4-inch thick. Sprinkle the top of the rectangle evenly with the remaining cinnamon sugar. Without cutting all the way through the dough, score a line lengthwise down the middle of the puff pastry rectangle with the back of a knife or a ruler. Tightly roll up each long side of the dough to the center line, creating two long rolled spirals that meet in the middle. Gently press the two rolls together in the middle. Cut the rolled pastry crosswise in half and wrap each roll in plastic wrap. Refrigerate for at least 30 minutes (see note).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape the cinnamon sugar remaining on the work surface into a wide bowl or onto a plate and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C) with racks in the upper and lower thirds. Line two baking sheets with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Take one roll at a time from the refrigerator and slice crosswise into 1/2-inch thick slices. Dip both sides of the slices in the remaining cinnamon sugar to coat, and place on the baking sheets, leaving 1 inch between the slices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 10 to 12 minutes, then switch the baking sheets from top to bottom. Bake until the cookies are golden brown, 8 to 10 minutes more. If they appear to be browning too fast or if the caramel is burning at all, turn the heat down to 375 degrees F (190 degrees C) after the first 10 minutes. Transfer the cookies to a cooling rack and cool completely. Repeat with the remaining puff pastry and cinnamon sugar.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring the cream to a simmer in a small saucepan. Place the chocolate in a medium bowl and pour the hot cream over it. Let sit for 5 minutes, then stir until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "If using sprinkles, place them on a small plate. Place a piece of parchment under the cooling rack to catch drips. Dip the top of each cookie into the chocolate and then, if using sprinkles, lightly press the chocolate-dipped side into them, and return to the cooling rack. Let the chocolate set before serving or storing.\n"
            }
        ],
        "recipeCategory": [],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Pati Jinich"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Chocolate-Dipped Palmiers (Orejas con Chocolate)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "146.7 calories",
            "carbohydrateContent": "15.6 g",
            "cholesterolContent": "22.5 mg",
            "fatContent": "9 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "5.7 g",
            "servingSize": null,
            "sodiumContent": "38.5 mg",
            "sugarContent": "8.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]