[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
                    "name": "Jams and Jellies Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/35899/watermelon-preserves/",
        "name": "Watermelon Preserves",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F35684.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-20T01:50:13.000Z",
        "description": "A wonderful watermelon preserve that will keep the flavor of summer handy all year. Great on toast or English muffins.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT2H10M",
        "totalTime": "P0DT2H25M",
        "recipeYield": "5 cups",
        "recipeIngredient": [
            "2 pounds watermelon",
            "3 cups white sugar",
            "3 lemons - rinsed, sliced and seeded"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove the green rind of the melon, and dice the white part into small cubes, leaving the red flesh mostly intact. Remove seeds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a heavy stockpot, combine 4 cups of the prepared watermelon, sugar and lemons. Bring to a boil over medium heat, and let the mixture boil slowly for 2 hours, stirring occasionally. The temperature of the mixture should be at 220 degrees F (105 degrees C) so the jam will set.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes",
            "Jams and Jellies Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lesa Caruso"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6315789473684212,
            "ratingCount": 19,
            "itemReviewed": "Watermelon Preserves",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "66.5 calories",
            "carbohydrateContent": "17.6 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.5 g",
            "proteinContent": "0.2 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "0.5 mg",
            "sugarContent": "16.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-27T14:50:11.217Z",
                "reviewBody": "This is a good recipe for a different kind of preserve. It is beautiful to look at. I made a few changes though and would make a few more the next time I make it. First I used one orange and one lemon. Second I only simmered for one hour and it was perfect. It set up beautifully. It has a good flavor but it is really more of a marmalade. The other thing is that when I was through simmering the lemon and orange were still pretty big so I took my kitchen shears and cut through the mixture until the peel was nice size; I will do this before the simmering next time. Other than that if you are looking for a \"different\" recipe then you should definitely try this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "willbake4shoes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/381648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-10T15:10:54.883Z",
                "reviewBody": "With adjustment for cooking only 1 hour (even at high elevation 7200 ft.) this came out just fine. Doesn't taste a lot like watermelon - more like citrus \"marmelade\"; but that could be because the watermelon I used wasn't that good to begin with - which is why I used it! As recipe is written it only made a little more than 3 half-pints. I made the first batch with 2 lemons 1 orange. I'm now cooking a 2nd batch which I doubled using 1 grapefruit 2 oranges and 2 lemons. I ran all the citrus through the food processor using the grating attachment. Seeds membranes mostly stayed above the grater; but additional seeds and membranes can be easily picked out of the pot while cooking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cmartcookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-12T22:17:15.157Z",
                "reviewBody": "I think this recipe is wrong - it seems as though the mixture should boil for only 1 hour. I followed the directions to a T and after 2 hours the mixture was very burned. I think with only 1 hour of boil time it would be perfect. May try again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "MASHWORTH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/783528/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-19T14:10:13.023Z",
                "reviewBody": "This did not end up tasting at all watermelon-y to us just very strongly lemon flavored. I love the idea but in reality it was a big disappointment to my family. If you like lemon a lot you might want to give it a try but if you are looking for a melon flavored preserve this probably is not the recipe for you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ScottFamily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2019509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-20T22:57:58.893Z",
                "reviewBody": "This made 2-1/2 pints for me. They set like preserves should...not too thick more like a thick pancake syrup perhaps. The flavor is great and my dad liked them. Of course so far everyone has turned a nose up at the thought of them...but that makes more for me!!! Was my very first time making these....easy to do. I am making a 2nd batch of a different recipe to compare...though the other didn't mention leaving any of the flesh part of the melon so I didn't. will have to see which batch I prefer. So far it is this one...simply for ease and least ingredients. Now to compare flavors!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3109966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-19T22:55:56.667Z",
                "reviewBody": "Great recipe but I made a few adaptions based on prior reviews. I used about 2.5 lbs of watermelon rind ( was about 1 1/4 of a small sugar baby watermelon) 4.5 cups of sugar 2 navel oranges thinly sliced on a mandolin( entire orange added) 1/4 cup lemon juice 2 tsp powered ginger and 1 cup of watermelon juice ( I blended some watermelon pink flesh and strained through a sieve reserving 1 cup of liquid). I brought it to a slow boil with lid on to prevent the preserve from developing crystals later and cooked it for about 2 hours until it had reduced to about 1/2 stirring about every 15 minutes until it was thick and syrupy and did not run after being placed on a cold plate after about a minute ( did not use a thermometer). Then processed in a boiling water bath for 10 minutes. It came out delicious like a marmalade. With the adaptions I made 5 1/2 pints. Plan to make more!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13791170/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-04T16:51:37.11Z",
                "reviewBody": "i agree there's too many lemons. my grandmother was famous for her watermelon preserves and made it almost exactly the same but with only one lemon and about 1/2 tsp of cloves. as kids we couldn't wait to get to mawmaw gussie's house for our treat of fresh biscuits watermelon preserves and cafe au lait! she lived in lafayette louisiana btw...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11967435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-09-13T00:45:28.58Z",
                "reviewBody": "Please forgive I haven't made this yet. Dad was the expert on tasting watermelon rind preserves: his sister Orene always won the blue ribbon ergo his opinion was accurate. Pappy (granddad a farmer) was famous for the best watermelons in New Albany Mississippi area. Dad: Rind has to be thick but tender with no green left on - green parts cook up tasteless and leathery. Which is extremely hard to find because those traits mean melons don't ship well (break easily) and were bred out of fruit in commerce now. Pappy's melons were so intensely flavored you'd dream of them all winter! Their rinds trimmed of all green and pink were over 1\" thick and snow white. Today rinds are thin tough as nails greenish. Farmers tell me to hunt out seeded watermelons especially heirloom types which are the sweetest and best tasting anyway. Farmers have to grow some to pollinate seedless ones. Also Dad said lemon spoils the flavor completely. Orene didn't use it. The flavor should be reminiscent of citron. Factoid: a white meat watermelon was grown in the south just for it's rind which was candied and used as a substitute for more expensive citron. Dad passed 1 year ago age 96.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BonJon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21392641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-25T22:21:18.737Z",
                "reviewBody": "Just finished making these. Got five half pints. They look beautiful so far and they are all sitting except for one that is in the fridge for us to try tonight. I tried a little from the pot and it was delish. I followed the recommendation to use lemon and orange and can't wait to try this on some toast. Does anyone on here have a recommendation on where to store it and for how long? Did anyone leave it a while before opening the jar? I haven't canned in a while so I was hoping to get some advice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karly-Barney Kelsay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5858070/"
                }
            }
        ]
    }
]