[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/211/salad/fruit-salads/",
                    "name": "Fruit Salad Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15137/salad/fruit-salads/strawberry-salad/",
                    "name": "Strawberry Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/143132/something-different-fruit-salad/",
        "name": "'Something Different' Fruit Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F108312.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-20T01:50:28.000Z",
        "description": "A little lime, salt, and honey go a long way in this dish created out of sheer boredom. One night last summer we were grilling fish and corn, yet again.  When I asked my boyfriend what he wanted as a second side dish, all he said was, 'something different.'  I decided to try a twist on the traditional fruit salad that I grew up eating, and it was a huge hit!  The best thing about this recipe is that most fruits are great with the dressing, so you can use your favorites or whatever is in season.",
        "prepTime": "P0DT0H25M",
        "cookTime": null,
        "totalTime": "P0DT0H25M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "¼ cup fresh lime juice",
            "3 tablespoons honey",
            "2 teaspoons salt",
            "½ teaspoon ground cayenne pepper",
            "1 pound fresh strawberries, hulled and quartered lengthwise",
            "3 cups cubed seedless watermelon",
            "1 fresh pineapple - peeled, cored and cut into 1 inch chunks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together the lime juice, honey, salt, and cayenne pepper in the bottom of a large salad bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Toss the strawberries, watermelon, and pineapple with the dressing. Chill the fruit salad until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Fruit Salad Recipes",
            "Strawberry Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "FYRECRACKER"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8181818181818183,
            "ratingCount": 33,
            "itemReviewed": "'Something Different' Fruit Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "60.8 calories",
            "carbohydrateContent": "15.8 g",
            "cholesterolContent": null,
            "fatContent": "0.2 g",
            "fiberContent": "1.5 g",
            "proteinContent": "0.7 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "389.1 mg",
            "sugarContent": "12.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-11T22:32:58.813Z",
                "reviewBody": "This is my recipe and I wanted to mention that YES at first it can taste salty - you need to let it sit for a few minutes. Salt pulls the juice out of fruits and when an adequate amount of juice is released it makes a nice sauce without tasting salty. Also if you buy underripe fruit they wont be very juicy and you wont get a good balance of flavors. Hope this helps anyone else who considers trying this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FYRECRACKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1286968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-18T18:24:26.047Z",
                "reviewBody": "My boyfriend LOVED this salad.  I didn't think he would because of the cayanne pepper; he doesn't like spicy food. But he begs me to make this all the time. I mean every week.  I originally made the salad for a Mexican themed Tapas night with his parents and a bunch of their friends and this salad was a big hit.  I made the sauce exactly as directed the first time but since I am a little more liberal with the honey and lime and cayenne and it's just as good (I measure mostly by eye and \"feel\"). I never do more salt as you can definitely taste it in the marinade. I do INSIST however that you make this the day before, it's sooo good that we almost never eat it same day.  My typical fruits: canteloupe, honeydew, pineapple (must have), mango, papaya.  I also tried strawberries the first time but I insist they get a little too mushy from the marinade and they soak up a bit too much marinade.  My other tip: big bite sizes pieces!  The first time I diced the pieces small to look more like a fruit salsa but they took on too much marinade and weren't as good. \"Chunky\" sizes make for the best fruit-marinade ratio. :)  Enjoy! This Mexican Fruit Salad is very good any way you slice it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alexis May Tanner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alexis/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-08T18:28:42.187Z",
                "reviewBody": "This was very good. It seemed a bit salty at first but that mellowed as the salad sat and the juices released. I like the addition of the cayenne--it reminds me of Mexican candy (mango-flavored hard candy coated with chili powder and cayenne) and it's not too spicy at all. I added some honeydew for color and because salt complements melon perfectly. Next time I'll add mango as well (8/11/07). UPDATE: I eat fruit for breakfast every day and I've found I can make up a batch of this on Sundays and just keep adding fruit to it throughout the week (my favorite combo is cantaloupe honeydew mango and watermelon)--the juices combine with the dressing and the flavor lasts all week.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kym Cox Surridge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1867459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-26T23:41:24.19Z",
                "reviewBody": "This is fabulous! A flavorful snack that's great for a hot day. I made it with a nectarine an apple 1.5 cups blueberries 3 cups watermelon a can of organic pineapples half a pound strawberries and a quarter of a cantelope. Substituted pineapple juice for the honey added a handful of chopped fresh mint and left out the salt completely (added it when I ate it if I wanted to) - delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3787880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-25T23:41:49.84Z",
                "reviewBody": "Made this for a baby shower at work--apparently I thought the extra heat from the cayenne might induce labor. I loved it--couldn't find any melon, so I subbed in diced pears and apples, I also zested the limes before juicing them, and added a some coconut flakes. It was a big hit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Noel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2604295/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-30T00:17:02.777Z",
                "reviewBody": "Mexicans always put lime salt and chile powder on fruit. We wouldn't eat fruit any other way. So the \"something different\" for me was putting honey in the mix. I cut up 2 mangoes 1 honeydew 1 cantalope and 1 pineapple. I did add more lime juice because the honey was a little too sweet for me. And I used chile powder instead of cayenne. This was excellent everyone loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jessitlv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-17T19:50:58.8Z",
                "reviewBody": "Really good. I liked the heat from the cayenne and the salt with the sweet fruit. I cut this down to a couple of servings and I used kosher salt and only a sprinkle of it and about 1/8 tsp (a really good sized pinch) of cayenne. I preferred the flavor this had with the pineapple and mango over the strawberries and grapes. I think maybe the tropical fruits are better suited for this dressing? If you don't like spice you probably won't like this. It wasn't spicy hot but had a little warmth to it. This is really similar to my favorite fruit topping of Trecha's brand chile powder for fruit so if you like that you'll like this salad. Thanks I liked this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "~TxCin~ILove2Ck",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1197175/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-01T13:31:13.03Z",
                "reviewBody": "Definitely something different! I adjusted the \"sauce\" ingredients for a half recipe and opted for canned fruit as nothing looked appealing at the grocery store. If doing this and making a half recipe reduce the salt to 1/4 tsp. or a pinch or two as the fruit will not release juices to dilute it. I would also use a pinch or two of chile powder next time as it was slightly too hot. It has a nice balance of flavours sure to be a hit at brunch! I topped it off with some granola for a \"crunch\" factor. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RMSR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-22T08:38:58.03Z",
                "reviewBody": "I had really sweet pineapple and watermelon so I ended up deciding not to use any honey. I did use the full amount of salt though - and it turned out great! Tomorrow I'm going to blend the leftovers with ice for a virgin margarita slushy... Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-15T22:16:39.887Z",
                "reviewBody": "I brought this \"different\" salad to a tailgate with friends. The general consensus was that this was not a win. The cayenne pepper was overwhelming and ruined the fruit. This was a waste of money & an embarrassing contribution to the event.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "amgian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1550297/"
                }
            }
        ]
    }
]