[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8707/chicken-enchilada-casserole-i/",
        "name": "Chicken Enchilada Casserole I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F47911.jpg",
            "width": 2816,
            "height": 2112
        },
        "datePublished": "1999-04-23T13:31:26.000Z",
        "description": "A delicious recipe that is easy to make, and can be prepared the day before and baked the next day. These enchiladas are almost like a Mexican lasagna!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 pounds skinless, boneless chicken breast halves - cooked and diced",
            "1 (10.75 ounce) can  condensed cream of celery soup",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "1 (10 ounce) can enchilada sauce",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers",
            "1 (4 ounce) can diced green chiles",
            "1 onion, chopped",
            "1 pinch garlic powder",
            "1 cup chicken broth",
            "1 teaspoon chili powder",
            "16 ounces processed cheese spread",
            "10 (6 inch) corn tortillas"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 5 quart pot combine the chicken, cream of celery soup, cream of chicken soup, enchilada sauce, diced tomatoes and green chiles, onion, garlic, chicken broth, chili powder and cheese. Heat over medium high until the cheese is melted and all of the ingredients are mixed together well.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a 9x13 inch baking dish, layer the mixture and the tortillas like you would lasagna. Make sure to put a thin layer of the mixture on the bottom of the baking dish to prevent sticking. After layering, place dish in the preheated oven and bake for 45 minutes to 1 hour, until cheese starts to brown and bubble. Let stand and cool for at least 10 minutes before serving!\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "PANZER33"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.424657534246576,
            "ratingCount": 219,
            "itemReviewed": "Chicken Enchilada Casserole I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "532.8 calories",
            "carbohydrateContent": "30.5 g",
            "cholesterolContent": "139.2 mg",
            "fatContent": "24.9 g",
            "fiberContent": "3.6 g",
            "proteinContent": "46.6 g",
            "saturatedFatContent": "12.1 g",
            "servingSize": null,
            "sodiumContent": "2042.9 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-10T04:04:03.47Z",
                "reviewBody": "Yes yes and yes! This was outstanding. I made the following changes. Omited the chicken broth, drained the tomatoes, sauteed the onion w/garlic, added 1 can of rinsed and drained black beans, used a total of 16oz of shredded mexican cheese on top of each layer (instead of the processed cheese), cut the corn tortillas into strips for easier eating and finally added some sliced jalapenos and black olives. With these changes, it wasn't runny at all, a nice thick cheesy casserole. I highly recommend you make this recipe with my changes! It was delicious!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "2010",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2067459/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-16T13:06:22.857Z",
                "reviewBody": "This recipe turned out great with a bit of tweaking. To save time, (and money!) instead of buying and cooking chicken breast I bought a rotisserie chicken from the supermarket and stripped it of its meat...it shredded well!  Like others, I didn't use the cheese spread but instead used grated old cheddar on top of every layer.  Because I didn't need to melt the cheese into the mixture as I would have if I used the cheese spread, I omitted the step of heating all of the ingredients together on the stove and just mixed them up in a bowl.  I used both of the soups but not the chicken broth.  When I mixed the ingredients, I put everything in the sauce together except for the chicken pieces and reserved a cup or so and then added the chicken.  I used the reserved sauce for spreading on the bottom of the casserole under the first layer of tortillas and for on top of the last layer.  I used more tortillas then they called for, and did three layers...tortillas, chicken sauce, cheese, repeated it, and then finally one last layer of tortillas topped with a thin layer of the reserved sauce and then grated cheese.  The casserole was not runny at all, I believe the extra top layer of tortillas helps absorb some of the extra liquid.  I also drained my chiles and tomatoes well.  I also made this dish the night before and took it to a friend's for supper then next day, it cut out in perfect squares that we easily reheated in the microwave and everyone had seconds!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lilchevyshortbox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2400897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-31T15:08:43.17Z",
                "reviewBody": "I gave this dish 5 stars and 2 thumbs up because it really is tasty. This turned out beautifully because I left out the chicken broth.  I'm sure it would have been runny if I had added it like other reviewers have stated.  It was a little on the spicy side but that can be easily adjusted by the temperature of the green chilies. My grandfather who is not fond of \"hot or spicy\" foods had more than one helping.  This is totally a casserole dish if you leave out the access liquid.  Great recipe Kyle!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-22T23:21:43.937Z",
                "reviewBody": "Husband has already requested I make this again.  I substituted flour tortillas for corn.  I would decrease the amount of liquid--maybe drain the tomatoes or leave out broth.  Oh, and since I HATE velveeta, I just omitted it and topped each layed with shredded real cheese.  Over all, a pretty good recipe.  Super simple to make, which is always a big fat plus.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MOM2TRAPPER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1252209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T19:02:39.717Z",
                "reviewBody": "Honestly the sauce is to die for...very tasty but as a layered casserole...its way too runny. Maybe if you added more chicken to thicken it. OR instead of layering the tortillas i might try tearing them in bits and mixing them in with the casserole OR as another reviewer suggested skip the tortillas altogether and just use the sauce as an appetizer dip by shredding the chicken instead of chunks. I'm not giving up on this one yet (it really is good) but it just doesn't seem to cook as intended!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-21T19:50:58.95Z",
                "reviewBody": "BEAUTIFUL!   A few changes...1) I eliminated the chicken broth and cream of celery.  I just mix a can of enchilada sauce with cream of chicken.  2) I saute some onions, sliced garlic, and red bell pepper and add it to the mix.   3) I make sure to drain the can of tomatoes and green chillis because doing that and eliminating the chicken broth leaves the mixture with a nice thick consistency 4) I add a can of drained black beans!   5) I layer torn up corn tortillas, chicken mixture, and cheese.  Then I top it with sliced black olives and jalapenos from my garden!!!  It is even better on the second day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sassagrass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3198334/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-21T10:25:46.64Z",
                "reviewBody": "I usually like to make recipes as is before I tweak them but after reading the recipe and the reviews I did omit the broth I also didn't have velvetta so use a mexican blend cheese. I was surprised at how well this turned out. Everyone liked it and there were no leftovers. Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cooking 101",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1793893/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-07T11:37:39.153Z",
                "reviewBody": "This recipe came out a little bit runny...I think next time I will cut down the chicken broth. It was really tasty though...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINNYG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/35974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-12T21:47:58.31Z",
                "reviewBody": "Very good. I agree that the chicken broth should be omitted. I added Black Beans and used Shredded Cheese instead of the processed cheese. I also used chicken thighs instead of the white meat. The dark meat is a little more moist.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MKipp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1209738/"
                }
            }
        ]
    }
]