[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22122/mexican-beef-casserole/",
        "name": "Mexican Beef Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6220741.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-10-04T14:49:31.000Z",
        "description": "This a very easy and tasty casserole; great with a salad, chips and salsa.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound lean ground beef",
            "1 (15 ounce) can ranch-style beans",
            "1 (14.5 ounce) can peeled and diced tomatoes",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (12 ounce) package corn tortillas",
            "4 cups shredded Cheddar cheese",
            "2 tablespoons chili powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brown the ground beef in a large skillet over medium high heat. Add chili powder, beans, tomatoes and soup; mix well and heat thoroughly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a 13x9 inch dish with tortillas. Then make a layer with the meat mixture. Make another row of tortillas, then finish off with rest of meat mixture.  Top with grated cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated oven for 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BHUDDLESTON"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.455516014234876,
            "ratingCount": 562,
            "itemReviewed": "Mexican Beef Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "383.4 calories",
            "carbohydrateContent": "21.8 g",
            "cholesterolContent": "71.1 mg",
            "fatContent": "22.9 g",
            "fiberContent": "4.4 g",
            "proteinContent": "22.4 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "719.1 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-18T15:12:58.607Z",
                "reviewBody": "wasn't sure what ranch style beans were so used kidney beans the first time I made it, adults liked it, kids not so much: the next time I used refried beans,everyone LOVED it. I have made this about 6 times in the last few months since I first tried it. I do add taco seasoning to it as well and the last time I made it, I spread salsa over the top after it was baked..OH MY GOSH, heaven in a pan.Wonderful served with sour cream.Thank you, thank-you",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHEEKYMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1371249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T05:01:00.077Z",
                "reviewBody": "This is a good, easy dish.  Some modifications: I'd use flour tortillas, and definitely a small can of green chiles for flavor (green chiles are not hot, just flavorful), and I would use pinto beans instead.  I would also add about 4 oz of sour cream in with the other ingredients (you can do this with almost any recipe that calls for cream of mushroom soup).  In addition to adding flavor, it also keeps it from being \"dry\" as one person mentioned.  Another way to keep it from getting dry would be to use a teaspoon or two of the juices from each ingredient (tomatoes, chiles, beans).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1590037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-03T14:40:11.973Z",
                "reviewBody": "This is excelent dish. I followed other reviewers suggestions and add almost 1/2 envelope of taco seasoning to beef, sautee one medium onion while browning meat, used 1/2 tsp of chilli powder (i do not like spicy food) and added small can of mushrooms. I put a very thin layer of meat mixture on the bottom of pan and put cheese on all the layers. I also sprinkled jalapenos peppers on half of the dish to spicy it up for my husband. I served it with the choice of sour cream and salsa. We both really enjoyed it. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Zuzana Halbgewachs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1578150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-19T22:00:35.093Z",
                "reviewBody": "This recipe turned out really well. I gave it four stars because as my husband would say, \"I tweeked it some\". I have to admit, at first I was a little hesitant to put cream of mushroom soup in a mexican casserole, but it was good. I did use Ranch Style Beans, I believe that they add a certain flavor that only they can add. I have many recipes using Ranch Beans and I am grateful that they are a common staple in South Texas. I used a can of Rotel tomatoes and I used flour tortillas. I ommited the chili powder and instead used a half a packet of taco seasoning. I browned the ground beef with onion and then seasoned it with Tony's (I put that in everything!) and garlic powder. I did as others suggested and put a small amount of meat mixture on the bottom of the pan, then layered the tortillas then meat then cheese, then repeated the layers once more. I also don't measure cheese, I just add what looks good, but I probably used approximately 2 cups instead of the 4 that's listed. I also used Mexican Blend shredded cheese. \nOverall it was very good and was a nice dinner on a cold and wet night.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stacey Walker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/inkedtexaslady/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-01T16:55:35.263Z",
                "reviewBody": "mmmmmmm!!!!  This was SO good!  It highly exceeded my expectations.  I was mainly only cooking it because DH has been bugging me about cooking more mexican, but it was surprisingly good for being so simple.  I followed other reviewers' suggestions and made the following changes: added 1/2 packet of taco seasoning, sauteed onions while the ground beef was browning, used 1/2 can of mexican Rotel (DH isn't a fan of tomatoes, hence the 1/2 instead of whole can), put cheese on all the layers (didn't need 4 full cups), sprinkled chili powder instead of using 2 full tbsp, and put a very thin layer of meat mixture on bottom of dish.  I used flour tortillas because that was all I had and chili beans because I couldn't find ranch at the store, but I'd like to try it with the corn tortillas next time.  And it's just as delicious the next day!  DH even ate it as leftovers and that is a rarity.  Thanks so much!  It's definitely becoming a regular.  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133792/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-02T00:53:25.123Z",
                "reviewBody": "This was excelent. I did make some changes though, I didn't have any tortillas so I used Baked Doritos. I also didn't have the ranch style beans so I used some left over beans I had made with the 15 bean soup and chicken thighs. Only used 2 cups cheese (all I had0. Then I added some frozen corn, onions, and salsa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Virginia I",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1698061/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-22T19:45:12.293Z",
                "reviewBody": "This is very good and easy to make.  I decided to layer the cheese throughout the casserole because 4 cups of cheese just sitting on top of the casserole seems like a lot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachel Johnston Dansie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/99742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-14T08:49:33.153Z",
                "reviewBody": "I had to make a last minute change to this.  I ran out of chili powder, so inplace of it I put a package of Lipton Taco Rice in the meat toward the end of browning.  I also used a can of refried beans instead of ranch.  Then I topped it off with shredded lettuce and sour cream.  My wife is Mexican....she LOVED it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "maxmankins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1598540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-23T23:55:54.62Z",
                "reviewBody": "I used flour tortillas and took previous reviewers suggestions and spread a little mixture on the bottom of the pan. I made two smaller pans instead of one big one and froze pan 2. Haven't cooked it yet to see if it freezes well but figured it was worth a shot. The fresh one was absolutely fabulous, and actually very healthy. Used 98% fat free cream of chicken soup, it was all I had, some 2% shredded mexican blend cheese (didn't use nearly as much as called for, just a personal preference), and 1/2 ex lean ground turkey and 1/2 ex lean ground beef. I also added taco seasoning to the meat when browning. Never would have thought of using soup in a mexican casserole, but this is outstanding and totally easy to whip up. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "charlie54933",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2178442/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-06T10:33:05.557Z",
                "reviewBody": "Mexican Casserole Haiku: \"Messy meal to eat. Needs a flavor boost as well. Not bad just not great.\" My husband thought this was good me not so much. The smooshy tortilla layers in there seemed unnecessary (make broken tortilla chips baked on top would've been better?) the color was unappealing (ranch-style bean liquid cream mushroom soup = ew) and the flavor was pretty lacking even though I added 2 TB of \"Taco Seasoning I.\" Not sure I'd make this again w/o some major tweaks but it was fun to try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rock_lobster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rocklobster/"
                }
            }
        ]
    }
]