[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22286/shredded-beef-enchiladas/",
        "name": "Shredded Beef Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F274061.jpg",
            "width": 2592,
            "height": 1944
        },
        "datePublished": "2000-10-06T13:49:19.000Z",
        "description": "This is a great (time-consuming, but worth it) recipe.  I keep losing it so I thought I'd post it on the web.  Enjoy.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "3 pounds beef chuck roast",
            "¼ cup water",
            "1 ½ cups beef broth",
            "3 tablespoons red wine vinegar",
            "2 tablespoons chili powder",
            "1 tablespoon ground cumin",
            "1 large onion, chopped",
            "2 (4 ounce) cans chopped green chile peppers",
            "1 tablespoon all-purpose flour",
            "2 cups sour cream",
            "3 cups shredded Monterey Jack cheese, divided",
            "1 cup oil for frying",
            "20 (6 inch) corn tortillas"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place roast in a large saucepan that has a tight-fitting lid. Pour in water, cover, and simmer on low for 30 minutes. Increase heat to medium/high, and brown the roast on all sides. Once the water has boiled away, pour in the beef broth, vinegar, chili powder and 1 tablespoon of cumin. Cover tightly and reduce heat to low. Simmer for 1 1/2 to 2  hours or until the beef falls apart when you try to pick it up.  Shred  the beef, using 2 forks or your fingers. Place shredded beef back into the saucepan with all the juices, and let cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, saute the onion until just soft, not browned. Mix in flour and green chilies. Stir constantly for 2 minutes to cook the flour taste out. Stir in sour cream and 2 cups of Monterey Jack cheese. Cook on low for 10 minutes, stirring often, until the cheese is all melted and mixed. Set aside and let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large heavy skillet, heat the olive oil. Using tongs dip the tortillas, one at a time, into the oil for 30 seconds each side. Drain on paper towels.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Spread 4 tablespoons of sour cream mixture down the center of the tortilla. Top with about the same amount of beef.  Roll up and place seam side down in one or two 8x11 inch baking dish.  Repeat for each tortilla. Continue until you are out of the filling. Sprinkle with remaining Monterey Jack cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a pre-heated oven for 30 minutes or until cheese is melted and bubbling.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Christy Campbell"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.562874251497006,
            "ratingCount": 501,
            "itemReviewed": "Shredded Beef Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "576.9 calories",
            "carbohydrateContent": "30.1 g",
            "cholesterolContent": "112.3 mg",
            "fatContent": "38 g",
            "fiberContent": "4.4 g",
            "proteinContent": "30 g",
            "saturatedFatContent": "18.6 g",
            "servingSize": null,
            "sodiumContent": "666.8 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-02T19:51:38.827Z",
                "reviewBody": "Very good recipe!  Even my children liked it!  I made the beef in my crockpot and let it go all day.\r\nI used torn flour tortillas insteed if the corn tortillas and layered them in a 13x9 inch pan with 1/2 the sour cream mixture, 1/2 the beef, another layer of torn tortillas, and then repeated all layers.  Topped off the last layer of tortillas with 2 Cups of cheese.  The casserole approach saved time, and it was easier to dish up smaller portions for the kids.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/482178/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T20:33:15.64Z",
                "reviewBody": "I can't count the number of times I've made just the shredded beef portion (Step 1) of this recipe -- it's wonderfully tasty!  I add the onions and green peppers to the meat while it is simmering, together with an 8-ounce can of La Costena home style Mexican hot sauce for extra zest.  I always double the quantities for the sauce, too, because the tortillas soak up so much - and the flavor is so great, it's good to have extra.  Try keeping some extra shredded beef in the sauce in the freezer for last-minute dinners.  What a time-saver!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cmartcookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-05-04T00:59:22.467Z",
                "reviewBody": "I'm going to give this a 4 stars for the meat. I seared the roast in some bacon drippings on it's own. I also added 1 can Rotel cilantro/lime tomatoes and a couple of smoked Chipotle chilies to braising ingredients. Once tender, shredded and then chopped coarsely. I didn't bother w/separate grn chili/sour crm/cheese sauce as I don't care for s.cream in the filling. Instead, I put the prepared beef in a bowl adding the grn chilies along with some of the cooking juice. At this point I store in fridge until next day. When I was ready to assemble I veered off from this recipe and finished up in my own style. I really like the shredded beef even if I added a couple ingredients. By cooking the meat a day ahead, I find making any style enchiladas that much easier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MakeItWork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/makeitwork/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-22T02:39:23.457Z",
                "reviewBody": "I'm actually cooking this now! and have a question- what are people usin for the red sauce that goes on top? Or is this recipe better with out? A few people mentioned it and I didn't know if I should give it a try? Thanks for any feedback!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "winelover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2762412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-04T01:55:49.457Z",
                "reviewBody": "The best Enchiladas recipe I have ever tried! Wonderful!\n\nTo reduce effort, cook the pot roast in a crock pot for 4 hours on high with the beef broth, red wine vinegar, chili powder, and ground cumin as instructed (or cook about 2  to 2 1/2 hours on the stove top on low in a heavy covered pot until the roast is ready to fall apart). \n\nSkim fat from leftover broth because we want to take care of our hearts.\n\nPrepare as instructed in the original recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy in Disguise",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2233879/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-14T00:09:40.14Z",
                "reviewBody": "I agree with a number of other reviewers that while the meat itself is really quite good - tender, juicy and flavorful, the enchiladas themselves were disappointing.  I had higher hopes for this than was delivered. First of all, after reading through the recipe I knew this would be dry without some kind of sauce, so I poured green enchilada sauce over them before topping with the cheese and baking. It helped somewhat, but this was still a mediocre dish, tasting more of the corn tortillas than anything else. (I've now determined that flour tortillas are definitely better than corn tortillas!) One reviewer said it best when she said these were \"edible and forgettable,\"  and another who remarked that the meat was great...just not in these enchiladas. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-25T02:48:25.907Z",
                "reviewBody": "I really liked these enchiladas. I didn't find them to be that time consuming but I started with having some shredded beef and looking for a way to cook it so I didn't spend time on that. Next time I'll start from the beginning because my meat was not prepared according to the recipe and it sounds really good! I changed a fewv things. I used non-fat flour tortillas as that's all I had. I didn't use oil but I made some enchilada sauce from this site called 10 minute enchilada sauce. Instead of the oil I poured some sauce in the pan and covered both sides of the tortilla with the sauce. Then I followed the recipe with the cheese sauce and the meat. I only had low fat sour cream and it was fine. Also I didn't have any onions so they were left out. Anyway I poured the left over sauce on top and covered it with cheese. I'm not sure how much and it wasn't the kind called for in the recipe. It was a combination of grated mexican cheese mozarella and some irish cheese. (Can you tell I was cleaning out the fridge?) Anyway it was absoultely great!!!!! Next time I'll shop for the recipe and do it right. Edited to add: I made this again. I put all the ingredients for the beef in a crockpot for 8 hours on low. The flavor of the meat is OUT OF THIS WORLD! I found myself eating the meat as I rolled the enchiladas and there is none left over! YUM! One more thing I ran out of cheese sauce before I ran out of meat so I would double the cheese sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy Redican",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1320139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-01T16:13:21.39Z",
                "reviewBody": "Oh my....this was absoultely DELICIOUS!!!  I can't tell you Christy how much we enjoyed this meat.  I used about 2-1/2 lbs of beef stew meat.  I left out the water and mixed the beef broth, vinegar and spices in my crockpot and then added the beef.  I let that cook on HIGH for about 8 hours.  I chopped up 1 large white onion, 4 garlic cloves and a red bell pepper and sauteed it in a large pot until soft and then transfered the meat from the crockpot.  I added a 4 oz can of chopped green chilies and turned the heat on med-hi and let most of the liquid boil off and ended up with the most tender and flavorful shredded beef I've ever made.  I did have to add quite a bit of salt to achieve the right taste (we love salt).  I skipped the sour cream and rather than making enchiladas, I let everyone assemble burritos with flour tortillas.  I made my own pico de gallo to go along with this and grated some fresh pepper-jack cheese.  I will definitley use this again and plan on passing this recipe along to others.  Thanks a million!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-07T16:39:27.1Z",
                "reviewBody": "I made this for a party and everyone asked for the recipe.  Delicious.  I made it exactly as written except that I poured Red Enchilada Sauce (recipe on this site) over the top before sprinkling the cheese and baked.  A bit time consuming but worth the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2248592/"
                }
            }
        ]
    }
]