[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26085/oaxacan-tacos/",
        "name": "Oaxacan Tacos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F648701.jpg",
            "width": 2288,
            "height": 1712
        },
        "datePublished": "2001-01-08T05:44:43.000Z",
        "description": "I learned how to make these tacos while a man from Oaxaca, Mexico lived with my family.  They are traditional Mexican tacos and one of the best things I know how to make. The steak may be broiled or grilled if you prefer.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "18 tacos",
        "recipeIngredient": [
            "2 pounds top sirloin steak, cut into thin strips",
            "salt and ground black pepper to taste",
            "¼ cup vegetable oil",
            "18 (6 inch) corn tortillas",
            "1 onion, diced",
            "4 fresh jalapeno peppers, seeded and chopped",
            "1 bunch fresh cilantro, chopped",
            "4 limes, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat. Saute steak in hot skillet until browned on the outside and cooked through, about 5 minutes. Season with salt and pepper. Remove to a plate and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in the same skillet. Place a tortilla in the hot oil and cook, turning once, until tortilla is lightly browned and flexible. Repeat with remaining tortillas.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place tortillas on a plate and top each with steak, onion, jalapeno, and cilantro. Squeeze lime juice over the top.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.573333333333333,
            "ratingCount": 300,
            "itemReviewed": "Oaxacan Tacos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "379 calories",
            "carbohydrateContent": "28.1 g",
            "cholesterolContent": "58.5 mg",
            "fatContent": "21.4 g",
            "fiberContent": "4.7 g",
            "proteinContent": "20.3 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "69.2 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-31T15:23:51.45Z",
                "reviewBody": "My husband and I are big fans of authentic Mexican restaurants and he was always hinting that I should be able to cook like that too. Well, you should have seen the look on his face when I made these tacos and they tasted EXACTLY like the ones we had eaten there!!  Not bad for a gringo!! :-)\r\n\r\nI've tweaked the recipe a little - I buy really thinly cut pieces of meat and then cut them into small cubes (that's the way they do it at the restaurants I've had this dish in) and then I  marinate the beef in some lime juice and salt and pepper first. I also cook the onions and pepper for a few minutes before adding the beef and cilantro and leave some raw for garnish. I also make the pico de gallo recipe on this site to serve with it. It's also not bad served with flour tortillas if you want to avoid the oil from frying the corn tortillas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SKEETERGIRL87",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/867362/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-01T18:09:27.92Z",
                "reviewBody": "Tasted great, but just a note to inexperienced cooks like myself: wear gloves when you chop the jalapenos! I didn't know any better, and chopped them up with my bare hands. My hands were painfully burning for hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RED100STARS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/783159/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-01T18:12:15.013Z",
                "reviewBody": "Being from the Northeast I never ate much Mexican but when I briefly lived in the Midwest I learned to make these sort of tacos. The locals called them tortillas but I later found out the tortilla was just the corn wrapping and not the name of the dish. We made them with all the usual taco fillings like seasoned hamburg lettuce and tomato onions cheese sour cream and taco sauce. The secret is the soft corn tortilla that you do not fry until it is crunchy but rather until it is limp and pliable. It frys very fast. Plop one at a time in the hot oil. It will puff up then turn it. When it puffs again remove it immediately to drain the oil on a paper towel. The dish known as soft tacos is usually made with the already soft flour tortilla. I way love these soft corn tortillas better than those and the crunchy corn type.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JUSTCYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/36207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-11T05:56:30.797Z",
                "reviewBody": "WOW WOW WOW!!!! These are absolutely the BEST THING I HAVE MADE FROM THIS SITE! If you are into \"Americanized\" mexican food then these tacos aren't for you. However if you love traditional mexican then you MUST TRY these! My entire family can't get them out of their head. We have had them 3 times in 8 days. The flavors are simple but come together to make an incredible authentic tasting taco. LOVE THESE! We prepared the recipe exactly as written. I highly recommend you try them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MelindaD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2224341/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-22T02:17:52.617Z",
                "reviewBody": "My husband and I LOVE this recipe!. The simplicity of flavors is wonderful. At first I was worried about the jalapeno being too hot (first time making authenic mexican food) but it wasn't at all. The lime was delicious and we added cumin and a touch of garlic salt when frying the meat. I get compliments from everyone that I serve this to..who KNOWS how authentic mexican food should taste like---that would be my in-laws. Flour tortillas sour cream and chi chi's salsa have no place in a dish like this. Serve with Goya Arroz con Frijoles Negros y Coronas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Senora Hern",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-07T08:54:40.717Z",
                "reviewBody": "I made these for dinner tonight and they are awesome! Very simple easy tasty and very authentic. My former neighbors had a housekeeper from Central America and these are very much like the tacos she made for us except she made the corn tortillas by hand without a press even! Do try to get the highest quality top sirloin that you can find - it does make a difference. I recommend Whole Foods Market all-natural beef if you have a store in your area. They are a little more expensive but it is worth it for the taste and tenderness. Also if you don't like hot food remove all the seeds and veins from the peppers before you chop them. That's where most of the heat comes from. The only thing that I did differently was like another reviewer I marinated the sliced steak with a little fresh squeezed lime salt and pepper for about 10 or 15 minutes (just long enough to have a Corona) before I seared it then added a little more salt and pepper after cooking. Also coated my cast iron skillet with a tiny amount of oil just enough to prevent sticking. Lola thanks so much for sharing this!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NolaFoodie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1440988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-06T20:17:43.647Z",
                "reviewBody": "I really liked this recipe but I altered it somewhat. I did not fry the tortillas just used them soft. And I cooked my onions with the steak and then tossed the steak & onions w/the salt pepper and lime juice in a bowl and let it sit in the fridge for half an hour. The steak just cooked in oil by itself did not have much taste. Also I added shredded cheddar cheese and put homemade guacamole in my taco. Next time and I WILL make it again it was yummy I will use flank steat b/c the cut the recipe calls for is so much more expensive. Thank you Lola I enjoyed this meal and can't wait for my leftovers tonight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BUTTERFLYGARDENER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T00:12:45.89Z",
                "reviewBody": "These were terrible. Way too much oil to fry tortillas and cilantro and lime were not enough to make these taste like anything. Will not make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "RPHGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/784942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-13T00:27:55.437Z",
                "reviewBody": "WOW! Who knew that these bundles of lightly seasoned steak tacos would be so flavorful! I was doubtful that it would taste so good but I was wrong! I wasn't able to find corn tortillas so I purchased flour instead. I was SCARED of the jalapenos (I DON'T like hot food... rather I can't eat hot food comfortably) but they were fantastic! The lime and cilantro are the keys to the flavor in my opinion and since I love both I added a little extra on my tacos then my husband's. I also couldn't help myself but purchased a 5 layer \"Mexican\" party dip that had salsa cheese sour cream guacamole and diced tomatoes and added 2 spoonfuls to top off the tacos. Just wonderful! Met and exceeded my requirements for a weekday family meal which are easy to make YUMMY and fast to cook! My Texan husband was quite pleased with them so I take that as a sign that these are up to par.:) I definitely will be making this again in the very near future.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JKROBERTS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/663238/"
                }
            }
        ]
    }
]