[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/26602/enchilada-casserole-iii/",
        "name": "Enchilada Casserole III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F72122.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2020-06-23T21:50:22.000Z",
        "description": "This is a layered casserole that is always a favorite with my husband and kids. Served with Spanish rice and a green salad, it is sure to please everyone.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (1.5 ounce) package dry enchilada sauce mix",
            "1 (6 ounce) can tomato paste",
            "¾ cup water",
            "1 ½ pounds ground beef",
            "1 teaspoon garlic salt",
            "½ teaspoon onion powder",
            "1 (16 ounce) can refried beans",
            "1 (12 ounce) package corn tortillas",
            "1 cup shredded Cheddar cheese",
            "1 cup shredded Monterey Jack cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix the dry enchilada sauce according to package directions, replacing tomato sauce with the tomato paste and water\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, brown the ground beef with garlic salt and onion powder; drain fat. Mix refried beans and 1/2 cup of the prepared enchilada sauce with the meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip enough corn tortillas to cover the bottom of a 3 quart casserole dish in the remaining enchilada sauce. Arrange tortillas in the dish. Spoon in half of the meat mixture, covering the tortillas. Spread half of the Cheddar and Monterey Jack cheeses over the meat. Cover with another layer tortillas dipped in enchilada sauce. Spoon in remaining meat mixture and top with a final layer of tortillas dipped in enchilada sauce. Pour any remaining sauce over the layers and top with remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover and bake in preheated oven for 20 minutes. Remove from oven and let sit for 5 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kathy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.378119001919385,
            "ratingCount": 521,
            "itemReviewed": "Enchilada Casserole III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "448.6 calories",
            "carbohydrateContent": "34.6 g",
            "cholesterolContent": "86.9 mg",
            "fatContent": "22 g",
            "fiberContent": "7.5 g",
            "proteinContent": "28.4 g",
            "saturatedFatContent": "10.7 g",
            "servingSize": null,
            "sodiumContent": "1522.1 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-04T21:20:08.13Z",
                "reviewBody": "I made this EXACTLY as listed and give it 5 stars. If I had made any changes, I could not give it any stars since it would not longer be the recipe at hand. I don't understand you people. You decide to try a recipe but make an inordinate amount of changes to it FIRST, then rate it. Aren't you just rating your own version of this recipe? Why don't you people just follow the original recipe, rate it, then make the recipe again with your changes. Is there no honestly around at all that so many would rate highly a recipe, no less, that they have changed and personalized?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maureen Frusha-Boutwell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2838424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-27T22:21:39.113Z",
                "reviewBody": "This was a VERY good enchilada casserole!  Definitley a keeper for me!  As other reviewers, I eliminated the first 3 ingredients and simply purchased red enchilada sauce at the store.  Also, instead of the can of refried beans I used a can of black beans, drained but not rinsed.\nFor the beef mixture I added cumin and chili powder, as well as part of an envelope of taco seasoning.  At the end before I put the last layer of cheese on I poured about 1/2 a cup of enchilada sauce over the top.  I also used more cheese than called for, and used the 4 cheese mexican blend.\nMakes a TON of food, but I'm looking forward to leftovers tonight!!!\nUPDATE:  Sept. 2008 - I love this recipe!  What I do now is brown the pound and a half of beef (90/10 sirloin), drain MOST of the grease, and add one package of taco seasoning (I like McCormicks) and whatever amt of water it calls for.  Cook this for a few minutes and then add a can of diced green chiles, a can of drained black beans, and a can of fire-roasted diced tomatoes.  Cook this all together for a few more minutes, and theen layer with LOTS of cheese, and the tortillas dipped in the sauce.  Top with EXTRA sauce, and lots of cheese!\nAlso, when I make this I make it in TWO square glass dishes, and put one in the freezer.\nServe this topped with some chopped romaine lettuce, fresh pico de gallo, and sour cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie Wiens Craddock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707132/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-14T00:29:19.233Z",
                "reviewBody": "My whole family loved this casserole. I made some changes that were suggested and they were right. I baked the tortillas for about 5 minutes to get them crunchy and I was glad I did and I used 2 cans of enchilada sauce instead of the packet seasoning I might use 3 next time and I used double the amount of cheese. Next time I make this dish I am going to use green chiles and diced tomatoes and maybe even some olives. Great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Edmunds-Howell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1996409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-12T19:41:04.577Z",
                "reviewBody": "I have made this twice now with a few changes. I used the premade can enchilada sauce instead of a packet mix. Instead of adding the onion and garlic spices to the hamburger I added some taco seasoning. Turned out great and the reheated leftover tasted just as good. I will be making this one alot! Be sure to spray your pan with a nonstick spray, helps with the cleanup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DDNELSON2631",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/110460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-05T15:14:09.533Z",
                "reviewBody": "This was a quick, easy dinner. I halved the recipe and baked it in an 8x8 pan - and that made two big dinner servings for me and the boyfriend, with two nice-sized lunch portions leftover! A few modifications: 1) browned the ground beef with 1/2 diced onion, a 4oz can of green chiles (drained), lots of chili powder, cumin, and garlic salt. I used about nine corn tortillas (just tear them to make them fit into the pan) and did not \"brown\" them as others suggested - enchiladas are not crispy, so I didn't see any reason to crisp up the tortillas. I layered as suggested, but used a total of 2 cups of pepperjack cheese (so, double the cheese called for since I cut the recipe in half). Also, I had to bake it for 30 minutes to get it hot all the way through - 20 minutes wasn't enough. The only change I will make next time is to add more enchilada sauce - I did pour some over the top of the casserole, but there should be a layer in the middle as well for extra flavor and moisture. Overall, a tasty and easy recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VD711",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-07T02:22:51.083Z",
                "reviewBody": "I took the advice of several other reviewers and made mine using 2lbs of extra lean ground beef, jar of medium enchilada sauce. I added 1/2 c chopped onions, 1/2 tsp cumin, 1/2 tsp chili powder to meat after browning. Added a lot more cheese. Topped with extra cheese and sliced black olives. Served with shredded lettuce, diced tomatoes, sliced jalapenos, and chopped onions. \r\n\r\nVery good, the whole family liked it. \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-07T19:44:36.093Z",
                "reviewBody": "This recipe has good structure but I found it needed more texture. I made a few adjustments by adding 1/2lb more meat a little more sauce green and white onion black olives and diced bell pepper for flavor and color through-out. Tweek this to your personal taste and you've go a winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZOEEZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/687252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-18T18:57:30.077Z",
                "reviewBody": "This was absolutely wonderful! My grocery store doesn't sell the dry packet of enchilada sauce so I used one can. The only other thing that I did differently was use flour tortillas since I'm not a big fan of the corn tortillas. It was delicious. Next time I think that I will serve it with lettuce tomato and salsa to serve on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "willbake4shoes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/381648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-01T17:52:18.867Z",
                "reviewBody": "This was very good! I also used canned enchilada sauce instead of powdered and put taco seasoning in the hamburger. Instead of layering the tortillas I filled them with meat and rolled them. I then covered with green chiles olives red sauce and cheese on the top. For the last 5 minutes I uncovered so the cheese would be bubbly like it's served in the restaraunt. I served with spanish rice and sour cream. My family loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Busy Bee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2149813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-16T19:23:36.257Z",
                "reviewBody": "I was craving Mexican Food but didn't want to run to the store- I had everything for this recipe except refried beans. I used black beans instead and I think it turned out just fine! I will make this recipe again as written with refried beans next time. Overall a quick and easy recipe and the household liked it but no one RAVED about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tynne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4094932/"
                }
            }
        ]
    }
]