[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17874/main-dish/tacos/",
                    "name": "Taco Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/37336/carne-asada-tacos/",
        "name": "Carne Asada Tacos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5362069.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2020-06-23T21:50:24.000Z",
        "description": "Easy and flavorful. You will love these tacos! You can use top sirloin, New York, filet mignon or similar cuts of beef.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 ½ pounds boneless beef top sirloin, cut into thin bite-size slices",
            "½ teaspoon salt",
            "1 teaspoon freshly ground black pepper",
            "crushed red pepper to taste",
            "1 lime",
            "1 (28 ounce) can tomatillos",
            "2 fresh jalapeno peppers, seeded",
            "4 tablespoons canola oil, divided",
            "1 (10.5 ounce) can beef broth",
            "12 (6 inch) corn tortillas",
            "½ large onion, chopped",
            "2 tomatoes, chopped",
            "1 avocado - peeled, pitted and sliced",
            "1 bunch fresh cilantro, chopped",
            "1 lemon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place sliced meat into a shallow bowl, and season with salt, black pepper, and crushed red pepper. Squeeze the lime juice over the meat, and turn until evenly coated. Cover, and refrigerate for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a blender or food processor, combine tomatillo and jalapeno. Puree for 15 to 20 seconds, or until thick. Heat 1 tablespoon oil in a large skillet over medium high heat. Carefully pour in tomatillo mixture. Cook, stirring frequently, for 5 minutes. Stir in beef broth. Reduce heat, and simmer for 20 to 30 minutes, or until mixture coats a spoon. Transfer mixture to a serving dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat  tablespoon oil in a large skillet over high heat. Stir in 1/3 of the beef, and saute for 1 minute. Transfer to serving dish. Repeat with remaining beef. Meanwhile, heat tortillas in the oven or microwave, according to package instructions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, place two tortillas on top of each other. Add desired amount of meat, spoon over some tomatillo mixture. Top with onions, tomatoes, avocado and cilantro. Garnish with a wedge of lemon, to be squeezed over taco before eating.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Taco Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DIALIEN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.476415094339623,
            "ratingCount": 212,
            "itemReviewed": "Carne Asada Tacos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "472.2 calories",
            "carbohydrateContent": "40.1 g",
            "cholesterolContent": "69.2 mg",
            "fatContent": "22.8 g",
            "fiberContent": "12.9 g",
            "proteinContent": "30.4 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "873 mg",
            "sugarContent": "4.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-05-26T04:21:35.047Z",
                "reviewBody": "I used La Victoria Salsa Verde(16 0z Jar) and that takes all the work out of prepping the sauce, leaving just the time it takes to cook it down. This sauce is made with Tomatillos and jalapenos-it came out great! This is a recipe worth trying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOMATOSUZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/715910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-28T19:07:35.46Z",
                "reviewBody": "My family comes from Mexico and my grandmother made a similar recipe which I always loved. I'm so thrilled to have found this one. I used fresh tomatillos instead of canned and more limes(key limes make it even better if you can get them). Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/912501/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T16:07:21.257Z",
                "reviewBody": "I grew quite a few tomatillo plants this year and when I saw how much I ended up with I thought maybe I had made a mistake.  I mean, you can only eat so much salsa verde! But then I tried this recipe, substituting my fresh tomatillos for the canned. And now I know what I'll be doing with all those tomatillos that now have made their way into the freezer! Oh, this was so good!  SURPRISINGLY good, Hubs said!  I made a couple of minor changes, but nothing that made much difference in terms of staying true to the recipe  - threw a couple of garlic cloves in with the tomatillos and jalapeno and used flour tortillas rather than the corn (I've tried, but I just don't like them). I used No Name Steaks which I always keep on hand for quick sauteed meals like this.  They're very tender and so easy to slice thinly while they're still partially frozen. But I digress - this dish was so flavorful and had such character!  LOVED it!  Had to leave out the red pepper for Hubs but this had so much going for it in the way of flavor, color and texture that it wasn't even missed. To my way of thinking this is a perfect recipe, and a perfect dish.  This was so delicious I'll probably be dreaming about it tonight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-07T15:23:33.527Z",
                "reviewBody": "Being from northern México I have a suggestion for you to make this tacos much better.\nFirst heat a grill or pan, season meat with salted tenderizer and cook it whole turning once.  Once ready, let it stand for about 10 minutes and chop it.  Now it is ready for tacos!  Any salsa will do (green or red) as this is according to taste.  Don´t forget shredded swiss cheese on top and avocado slices.  Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5056296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-19T16:14:29.453Z",
                "reviewBody": "this is a very good recipe for carne asada tacos! I used flank steak seasoned with salt black pepper and 2 limes. Omitted the crushed red pepper flakes. Marinated for 7 hours. I did not buy a can of tomatillos since I had some fresh ones on hand. My preparation for the salsa verde is: 6 tomatillos husked rinsed half of a white onion cut up one jalapneo seeded stemed 3 fresh garlic cloves placed on a baking sheet. I roasted these in the oven at 400 degrees for 30 minutes or until I noticed they got soft. I added them all to a blender along with a bunch of fresh cilantro. Added salt black pepper and the juice of a lime. Once blended I set it aside. I heated a little canola oil (blended) in a skillet and added the meat cut up sauteed for 1 minute. Carne Asadas came out very tender juicy and full of flavor. The salsa verde sauce was not too spicy hot and full of nice flavor from the tomatoes and seasonings. I completed this dish with \"Homemade Flour Tortillas \" \"Spanish Rice \" also from this website. Topped it off with chopped tomatoes diced avocados onions and fresh cilantro. I did not serve a wedge of lemon only a lime. A meal worth making again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T18:33:04.777Z",
                "reviewBody": "I loved these! I was raised in Mexico and they reminded me of the tacos from the street vendors we used to eat. Our mexican \"fast food!\" One change I made was to cut the meat into tiny pieces (diced I guess!) I heated the tortillas in the microwave between two damp paper towels and then cooked them in a bit of oil for a few seconds on each side which makes them softer. I didn't make the salsa used Herdez salsa verde. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2185280/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-29T17:54:50.153Z",
                "reviewBody": "Absolutely tasty! Prefer a bit more heat but as recipe states: salt pepper and crushed red pepper to taste. Next time a little more crushed red pepper should do it for me. If you're searching for something of mexican flavor stop right here you've found it. An excellent dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GREGW9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1101832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-07T20:45:21.047Z",
                "reviewBody": "Pretty good - Steam the corn tortillas vs oven/toaster (flour tortillas would probably work OK too). Also salsa needs some salt. Food prep time was very reasonable. Very attractive dish with all of the condiments assembled.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/878339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-13T01:49:50.607Z",
                "reviewBody": "The tomatilla sauce was a lot of work for the end result.  Also, canned tomatillas were very difficult to find...I used fresh instead.  This was so-so - not great, but not bad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHIE71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615473/"
                }
            }
        ]
    }
]