[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/44989/quick-and-easy-green-chile-chicken-enchilada-casserole/",
        "name": "Quick and Easy Green Chile Chicken Enchilada Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F250948.jpg",
            "width": null,
            "height": null,
            "caption": "Quick and Easy Green Chile Chicken Enchilada Casserole"
        },
        "datePublished": "2020-06-23T21:50:26.000Z",
        "description": "I got my picture in the paper for this one! My friends' husbands always fall in love with this when I bring it to parties! My 4 picky kids eat it! If you want to skip the charring step, simply tear the tortillas into fourths so they absorb the sauce better.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves",
            "garlic salt to taste",
            "18 (6 inch) corn tortillas, torn in half",
            "1 (28 ounce) can green chile enchilada sauce",
            "1 (16 ounce) package shredded Monterey Jack cheese",
            "1 (8 ounce) container reduced fat sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Season chicken with garlic salt. Arrange in the prepared baking dish. Bake 45 minutes in the preheated oven, until no longer pink and juices run clear. Cool, shred, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "With metal tongs, char each tortilla half over the open flame of a gas stove burner for about 1 minute, until lightly puffed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour about 1/2 inch enchilada sauce in the bottom of a medium baking dish, and arrange 6 tortillas in a single layer. Top with 1/2 the chicken, 1/3 cheese, 1/2 the sour cream, and 1/3 of the remaining enchilada sauce. Repeat. Coat remaining tortillas thoroughly with remaining enchilada sauce, and arrange on top of the layers. Sprinkle with remaining cheese, and top with any remaining enchilada sauce\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and bake 45 minutes in the preheated oven. Cool slightly before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SGRCOOKI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4302554027504915,
            "ratingCount": 1018,
            "itemReviewed": "Quick and Easy Green Chile Chicken Enchilada Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "488.1 calories",
            "carbohydrateContent": "32.6 g",
            "cholesterolContent": "95 mg",
            "fatContent": "25.2 g",
            "fiberContent": "3.7 g",
            "proteinContent": "33.1 g",
            "saturatedFatContent": "13.2 g",
            "servingSize": null,
            "sodiumContent": "955.2 mg",
            "sugarContent": "2.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-07-03T14:12:11.733Z",
                "reviewBody": "Excellent recipe. I served this tonight for dinner and my family loved it. I used the entire 28 oz. of the green chile enchilada sauce and did not have a soupy casserole. Here's how I prepared this recipe: I used a 9x13 baking dish and greased it with Crisco. To save time, I used two boxes of Tyson's diced chicken breast meat located in the freezer section at the grocery store. I cooked the chicken breast meat in a skillet and used cooking shears to further cut up the diced chicken meat. I seasoned the chicken with garlic salt as instructed. I did not char my tortillas. I tore each tortilla into about 6 pieces. After placing 1/2\" of sauce on the bottom of the baking dish, I placed the rest of the sauce into a pie plate to coat the remaining torn tortilla pieces as instructed. I did not pour any of the sauce onto the layers. I found that coating all the remaining torn tortilla pieces completely soaked up all the sauce. Maybe that is how I avoided a soupy casserole as others have experienced. I don't know that for sure though. I added the sour cream to the cooked chicken and mixed it up. I found the mixed chicken and sour cream mixture easier to spread than trying to spread sour cream on top of the chicken and shredded cheese. After baking, I let it sit for about 10 minutes before serving. I am delighted to have found this recipe. I hope you try it.I served this with spanish rice and warmed tortilla chips.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele O'Sullivan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10642/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-20T20:30:42.2Z",
                "reviewBody": "Have made this twice - once following the recipe exactly, which I am rating three stars as it was bland and lacked significant flavor.  Secondly, I would give it a five based on changes made to the recipe:  1.)  Sauteed red and green bell pepper, white and red onion and fresh garlic together, then chopped the veggies in large pieces and added a handful of fresh cilantro.  2.)  Parboiled the chicken in chicken stock, onion and garlic and then cut into mouth size pieces.  3.)  Mixed the veggies in with the chicken and added a 4 ounce can of salsa verde.  4.)  Added one packet of chicken taco seasonings, 2 teaspoons of cumin, and one small can of green chilis to the chicken/ veggie mix.  5.)  Added the sour cream to the chicken/ veggie mixture to make spreading easier.  6.)  Used 9 green chili corn tortillas and 9 chipolte corn tortillas in place of regular corn tortillas.  7.)  Used a mix of Monterey and Pepper Jack cheese in lieu of straight Monterey Jack.  8.)  Let it cook 30 minutes more than the recipe stated to avoid the soupiness other reviewers remarked on.  9.)  Added another 1/2 cup of cheese during the last 30 minutes of cook time.  Waited until the cheese started to bubble and brown!  And a big plus - if you like freezing casseroles, this one is a perfect one to try as I couldn't tell the difference between the one I made and cooked the same day and the one I froze.  Definitely a keeper and worthy of 5 stars with the listed alterations.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-23T10:39:46.937Z",
                "reviewBody": "This recipe is GREAT!  I made this recipe twice.  The first time I made it exactly the way the directions told me to except I did't char the tortillas, and it didn't turn out soupy or bland,  It was perfect.  The second time I charred the tortillas, and after cooking the tortilla's turned to mush.  It was still yummy, but didn't look nice.  So I think I just won't char the tortilla's next time.  I would definitely mix the chicken with the sour cream like other reviews suggested.  It is too hard to spread the sour cream over the cheese.  My favorite mexican dish at restaurants is Enchiladas Verdes, and this recipe can hold it's own against the best Enchiladas Verdes I've ever had before.  I highly recommend this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOSTERKR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/919748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-31T22:26:24.873Z",
                "reviewBody": "Delicious!! My husband and I liked this alot. He had 3 servings! This was so simple to make and clean up was minimal! So much quicker and easier than making enchiladas the old fashioned way. It wasn't runny, mushy, or \"ugly looking\" at all. I took the advice of other users and mixed the chicken with the sour cream before adding it to the dish. I also skipped the charring of the tortillas. I guess that's why the tortillas didn't turn out mushy. I added chopped green onions and it gave it some extra flavor. Other than that, I wouldn't change a thing and will definitely be making this again!!  UPDATE: It's been 2 years since my review. I add Mexican season or taco seasoning to the chicken & sour cream mixture. It makes it even more flavorful. Sometimes I make it with red sauce, sometimes green. Instead of baking the chicken, I boil it in a pot of water and add 1 clove of garlic to the water to give the chicken a little bit more flavor. I love this recipe so much. I make this for parties and friends. I have coworkers actually request that I make this for them sometimes. Try this recipe, you won't regret it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimiko Proctor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1892522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-13T22:04:33.967Z",
                "reviewBody": "Oh My Goodness!!!! This was such a big hit! We had friends over for a Dinner/Game Night with a Mexican theme (b/c I am Hispanic) and EVERYONE LOVED THIS DISH!!! I am very bias when it comes to Mexican food, but I gave this one a try, and I'm so glad I did. I used both Medium Green Chili Sauce, and Mild Red Sauce. I also boiled the chicken with Garlic Salt (as suggested by others) and then shredded and added a dash of red pepper (cheyenne) to the chicken. And I also mixed it with the sour cream. I started with Green sauce on the bottom, and then alternated between the green and red. I also did not char the tortillas. I cut in 4th's. \r\nI cannot rave enough about the casserole. It was so yummy! And everyone wanted the recipe.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIMPLE MOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/903110/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-03T14:13:46.717Z",
                "reviewBody": "I Love this recipe! I made a couple of adjustments to make it work better for me. I grilled my chicken on my George Foreman and browned my tortilla's in a skillet on the stove. My husband asked me to add black olives. I used 20 oz of the chile sauce. It was absolutely wonderful. Thank you! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "3TIGGERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-29T15:10:43.513Z",
                "reviewBody": "I began making this dish a few years ago. I add in lots of cilantro, a 1/2 TBSP of lemon juice, one jalapeno and blend it with the store bought green enchilada sauce for improved flavor. Alternately, you can make your own green enchilada sauce by simply boiling tomatillos (they look like green tomatoes - remove the skins first, wait until they become blistered and blend in blender). This is my most requested recipe at all social events. This is a must make!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAELIAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1086444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-14T15:45:17.567Z",
                "reviewBody": "This is a quick and easy recipe. I used precooked chicken to save time that I just diced quickly. I put the 1/2 inch of sauce in the bottom of a greased 9x13 pan and then added whole tortillas that I dipped in the remaining enchilada sauce. I mixed the chicken and sour cream together and spread over the tortillas. On the final layer I poured the remaining sauce over the tortillas. I covered with foil and baked. I didn't add the cheese on top until the very end because I was afraid it would burn.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-03T14:13:21.903Z",
                "reviewBody": "I was too hungry to bake the chicken so I cooked it on the stovetop. Since I was too hungry to let it cool before shredding the chicken I chopped it up with my food chopper. I skipped the charring step since I don't have a gas stove but I tore tortillas into fourths as suggested. WOW! This recipe was great!! My fiance and I both loved it and almost finished the whole pan in one sitting. I'll definetely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAH FROM IOWA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/407467/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Easy Chile Chicken Enchilada Casserole",
            "description": "Try this quick and easy green chile chicken enchilada casserole.",
            "uploadDate": "2012-05-22T23:57:23.571Z",
            "duration": "PT2M59.763S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F186e8b41-05d0-41ef-b5ef-32b7d0869a4d%2F0046e453-bfd0-4165-acbb-d0dc7344c033%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1651267479001"
        }
    }
]