[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/51156/spinach-enchiladas-verde/",
        "name": "Spinach Enchiladas Verde",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7930519.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-23T21:50:27.000Z",
        "description": "This is super simple, and even hard-core Texan meat eaters who have never eaten a vegetable in their lives like it. You can substitute yogurt for the sour cream if you want a lighter version.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup light sour cream",
            "1 (7 ounce) can green salsa",
            "1 bunch fresh spinach, rinsed and thinly sliced",
            "2 cups shredded Monterey Jack cheese",
            "1 (10 ounce) package corn tortillas"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together half of the sour cream and the green salsa. Spread enough to coat the bottom into a 9x13 inch baking dish. On each tortilla, spread a small amount of the salsa and sour cream in the center. Lay a small handful of spinach over that, and sprinkle with Monterey Jack cheese. Roll up, secure with a toothpick and place into the baking dish. When all of the tortillas are in the pan, pour the remaining salsa over the top and sprinkle with the remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes in the preheated oven, until the enchiladas are browned and heated through.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "NICEGIRL512"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.395522388059701,
            "ratingCount": 402,
            "itemReviewed": "Spinach Enchiladas Verde",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "321.1 calories",
            "carbohydrateContent": "27.1 g",
            "cholesterolContent": "49.3 mg",
            "fatContent": "17.8 g",
            "fiberContent": "4.2 g",
            "proteinContent": "14.7 g",
            "saturatedFatContent": "10.4 g",
            "servingSize": null,
            "sodiumContent": "392.7 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-04T00:30:22.813Z",
                "reviewBody": "We loved this recipe!  I made homemade green sauce (look for a recipe for salsa verde...it's really easy to make), and the trick to keeping the corn tortillas from falling apart is to dip them briefly in hot oil in a pan (drain them on paper towels on a plate after doing this).  It's tricky, but it makes the tortillas flexible enough to roll.  Will probably make more salsa verde to use on them next time, too.\nEdited on 1/3/09:  Making the separate enchiladas became too much of a hassle, so now I make this as a casserole (layering the spinach, the cheese/sour cream, and the corn tortillas, ending with the sauce on top).  Much easier, and we make it more often now! Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DivaMommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/224436/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-14T00:14:54.7Z",
                "reviewBody": "This recipe was AMAZING.  No Joke.  I made it for my family tonight (I'm 19), and everyone loved them.  I don't follow recipes too well though, I'm pretty sure I added a lot more cheese than called for.  I also ran out of green sauce for the top and was too lazy to go to the store so I made some more up with just regular salsa and made stripes on top and it looked great and tasted really well also.  Like the previous reviewer though, my tortillas fell apart a little so next time I may try frying them in oil a little before hand.  I really didn't mind them falling apart though because it tasted the same.  But yeah, I registered on this site just so I could write a review for this recipe.  That's how good it is....so go make it...now.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JPeg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1982748/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-29T21:06:34.553Z",
                "reviewBody": "Ok, actually I'd give this 3 1/2 stars. I followed the recipe as written but since I couldn't find a mild green salsa, I increased the sour cream a bit to cut the heat.\n\nThe corn tortillas taste great but are a pain to work with. They unroll and tear. I tried putting them seam side down and that didn't work either. Whoever suggested making this as layered enchiladas was smart! \n\nI like spinach, but I did find these a bit too spinachy. If I make this again, I'd probably add chicken and/or beans and maybe some corn or mushrooms or something.\n\nThe sour cream/salsa mix is tasty. The monterrey jack cheese is also excellent.\n\nBottom line: I suggest adding more things to the filling and layering rather than rolling the tortillas.\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Steph",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1540228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-04T21:20:03.52Z",
                "reviewBody": "So good, so easy. Perfect winter comfort food! I followed it almost as is except I stir fried 1 1/2 onion + 1/2 a red pepper + 1 cup of mushrooms with some cumin powder, salt, pep, paprika, garlic powder and chili powder. I also added half a finely diced jalapeno pepper to the salsa verde/sour cream mixture as the salsa I bought was mild and I like spice. After adding the sauce to the tortilla, I spooned some of the stir fried veggies, then I added the spinach + cheese and a bit more sauce. Cooked for the time stated. I can't wait to make these again! I'm a vegetarian and haven't enchiladas since I quit meat (1 yr ago!!!) because I didn't think veggie ones would compare, boy was I wrong! BTW I added much more salsa verde sauce then called for, almost double.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "veggiegreengirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2582771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-02T23:46:28.743Z",
                "reviewBody": "Made a few changes in that we used low fat yogurt instead of sour cream and added some shredded roasted chicken in with the spinach. It was fantastic! The flavors blend perfectly the Salsa Verde and the yogurt made a delicious sauce. We did not roll our enchiladas but stacked them instead in a round casserole dish and in the order of tortilla sauce spinach chicken cheese and repeat. Then poured the remaining sauce on the top of the last tortilla and added the remaining cheese. It's much faster to prepare that way and doesn't take away from the taste of the dish in anyway. This recipe is a keeper thanks for sharing it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2656342/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-30T19:43:17.41Z",
                "reviewBody": "Yummy! This stuff is GOOD! Also GREAT reviews from my fiance. Followed the ingredients for the most part (except using a different type of tortilla) but got off a little on the propotions. Didn't have bunches of spinach only baby spinach in a bag. Ended up using twelve ounces light sour cream sixteen ounces Herdez Salsa Verde two six-ounce bags of baby spinach and two cups of shredded cheese. Used multi-grain wraps (NOT whole wheat which I find dry); love the multi-grain...they add texture but don't taste heavy or gummy; always use them for enchiladas. Followed the directions except for the bright idea to wilt the sliced spinach in the microwave just to make it easier to handle. Well I ended up having to blot and squeeze and squeeze and blot. You get the picture. Another reviewer mentioned watery...so maybe a good thing in the end as all of the water I squeezed out of the spinach would have cooked out into the dish. We will fer sure make this again maybe adding onions or shredded spiced chicken; using pepper jack cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Thisni Caza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1060346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-03T15:22:49.653Z",
                "reviewBody": "Excellent recipe my husband and I both loved it! I've aded sauteed mushrooms and onions as someone suggested and it turned out great! This recipe also works great with chicken (I use rotisserie or simply boil a chicken breast) instead of spinach. To follow up: the tortillas tend to fall apart when rolled. To eliminate this problem heat up oil in a frying pan and quickly dip tortillas in the hot oil before rolling them up.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2328499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-18T13:26:52.217Z",
                "reviewBody": "We're trying to eat vegetarian and this recipe was a hit from my pure Texan husband to my 4 year old and 2 year old twins. Really tasty. I served it with Mexican rice beans and guacamole. Yummy quick easy economical and healthy. This is definitely a keeper for us.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cmonicat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2028126/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-30T18:53:54.12Z",
                "reviewBody": "Excellent flavor followed other reviewers' advice and added some more flavor to filling -- cumin dried onion flakes and a lot more garlic -- it was so easy and very good. I served it with Mexican rice made in a rice cooker it was the perfect combination. I'll be making this one again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Helenarose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2468264/"
                }
            }
        ]
    }
]