[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/59900/authentic-enchiladas-verdes/",
        "name": "Authentic Enchiladas Verdes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4513747.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2003-03-28T17:43:33.000Z",
        "description": "These enchiladas are made with a fresh green salsa, just like you would find in a Mexican restaurant or better yet, in a Mexican home.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 bone-in chicken breast halves",
            "2 cups chicken broth",
            "¼ white onion",
            "1 clove garlic",
            "2 teaspoons salt",
            "1 pound fresh tomatillos, husks removed",
            "5 serrano peppers",
            "¼ white onion",
            "1 clove garlic",
            "1 pinch salt",
            "12 corn tortillas",
            "¼ cup vegetable oil",
            "1 cup crumbled queso fresco",
            "½ white onion, chopped",
            "1 bunch fresh cilantro, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a saucepan, combine chicken breast  with chicken broth, one quarter onion, a clove of garlic, and 2 teaspoons salt.  Bring to a boil, and then boil for 20 minutes. Reserve broth, set chicken aside to cool, and discard onion and garlic. When cool enough to handle, shred chicken with your hands.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place tomatillos and serrano chiles in a pot with water, enough to cover them.  Bring to boil, and continue boiling until tomatillos turn a different shade of green (from bright green to a dull, army green).  Strain tomatillos and chiles, and place in a blender with another quarter piece of onion, 1 clove garlic, and a pinch of salt.  Pour in reserved chicken broth, so that liquid just covers the veggies in the blender by about an inch.  Blend all ingredients until they are completely pureed.  Pour salsa in a medium saucepan, and bring to a low boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour oil in a frying pan, and allow to get very hot.  Slightly fry tortillas one by one in hot oil, setting each on a paper towel afterwards to soak some of the oil. Finally, dip slightly fried tortillas in low-boiling green salsa, until tortillas become soft again.  Place on plates, 3 per person.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fill or top tortillas with shredded chicken, then extra green sauce.  Top with crumbled cheese, chopped onion, and chopped cilantro.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "PattiVerde"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.703703703703703,
            "ratingCount": 621,
            "itemReviewed": "Authentic Enchiladas Verdes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "559.4 calories",
            "carbohydrateContent": "48.9 g",
            "cholesterolContent": "84 mg",
            "fatContent": "25 g",
            "fiberContent": "8.2 g",
            "proteinContent": "37.1 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "1344 mg",
            "sugarContent": "6.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-25T14:20:04.833Z",
                "reviewBody": "To start with, let me say that I am Mexican, living in mexico and probably my english will not be very good, so I will try my best to make this review. If you come to Mexico, this is what you will get if you order enchiladas in a restaurant. This is the REAL and authentic enchilada and we always make fun of the \"mexican\" food in the US. \n\nLet me give you some advice on how to ensure this doesnt go wrong. When using tomatillos buy the smallest ones, because the bigger are bitter. The peppers you cand reduce or increase the amount depending on how hot you like it, it really depends on your taste. When you fry the tortilla, it doesnt mean deep-fry... you just coat it in really hot oil. The tortilla still has to be flexible enough to manage and after you fill the tortilla with the chicken, put the salsa on top. Instead of salt use chicken broth powder (sorry if thats not the name, but I hope you know what I mean). The enchiladas are served with sour cream, queso fresco and onion. Now, I have never seen queso fresco (mexican cheese) in the US... but again, I dont live there. I guess now in the mexican stores they might sell it but whatever cheese you have is fine i guess. And I guess you can add the cilantro for extra flavor.\n\nIm glad that people know how to make REAL enchiladas in the US",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROSA MARINA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/900123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-17T00:39:33.233Z",
                "reviewBody": "These were, in my husband's words, \"Boombastic Baby!\"  The only complaint we had is that there wasn't enough verde sauce.  DOUBLE THE SAUCE! It's AWESOME! I followed the basic idea of the recipe, making these few changes.  After frying the tortillas and dipping in salsa verde, I filled with sour cream, the chicken, some onions and the cheese.  Rolled them up, put them in a 9x13 pan, covered with remaining salsa verde and cheese and baked in a 425 degree oven till the cheese was melty.  We only wished they were SWIMMING in this AWESOME sauce!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Bovenkamp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-20T01:03:57.25Z",
                "reviewBody": "As a follow-up to my previous review, I made the salsa from this recipe again this time using serranos and I have to say that they gave the sauce a much better flavor than the jalapenos. I added them one by one to the blender  (one serrano was plenty to give it a \"kick\" but not overpower the flavor with heat...but others may like to add more. 5 serranos would have been insane for us!). I also found that it was best to add the chicken stock gradually instead of all at once, until you were happy with the consitancy because the amount of liquid in the recipe can make the sauce too watery otherwise. Very yummy and easy to make. I will be making this verde salsa often!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIASA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-08T18:00:31.183Z",
                "reviewBody": "I am Mexican and this is a wonderful recipe.  Few tips: if you can fill the tortillas with chicken and FRY to make the perfect taco then dip in green sauce you`ll get crunchier enchiladas...if you only top the fried tortilla soaked in salsa and top with chicken you are having \"tostadas de pollo\".  Anyway you go you can top your dish with lettuce, sour cream, crumbled cheese, chopped onion and cilantro...mmmm...Thumbs up PattyVerde!! great recipe girl!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ERIKA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/852172/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-03T16:32:27.51Z",
                "reviewBody": "I tried to stick with the recipe as closely as possible but ultimately had to put my own spin on this. It's hard to teach an old dog new tricks! I deviated a bit by mixing up the cooked chicken with just enough sour cream to bind it. When I filled the tortillas with the chicken I also added a handful of shredded Mexican cheese blend to each. I did top them with the salsa (used only two Serranos) which I sieved to get rid of the seeds and make as smooth as possible the Queso Fresco (good stuff by the way) thinly sliced onion and chopped cilantro - and finally a dollop of sour cream. I SO enjoyed these! Homemade salsa I believe makes all the difference! I made half the recipe of enchiladas but kept the amount of salsa the same and it was just right. For us anyway the amount of sauce as written in the recipe would not have been enough. I did resist the temptation to bake these as that's what I'm used to. I loved them like this but have to say I still prefer the NON-authentic method of baking them topped with a mess of gooey melted cheese!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-29T15:46:11.013Z",
                "reviewBody": "Wow. This recipe is fabulous. I did make a few changes but not with the green sauce which made the recipe superb. (Though did only add 3 serranos per others suggestion). I used 3 boneless skinless breasts and prepared as directed also sauteed some onion and garlic with the shredded chicken. Rolled up like regular enchiladas with mexican blend cheese and sauce inside and out topped with more cheese and baked for 20 minutes so they'd already be assembled. Served with extra sauce on the side. Best enchiladas I've ever had! Thank you thank you thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELLENEJ22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1168691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-26T17:01:20.353Z",
                "reviewBody": "excellent authentic sauce! the only modifications I made was to strain the pureed tomatillo mix back into the saucepan after blending and simmered until the consistency of light tomato sauce. The straining after blending removes all of the seeds skins and other bits of solids. Enchilada sauce should be very smooth...it's not a salsa. Don't be worried about the heat (I used 3 huge jalapenos)because the corn tortilla needs a strong flavor compliment. I have also used this for Chilaquilles verdes for breakfast... a very adaptable sauce. Also congradulations for a recipe with the Mexican style of enchiladas.. you will never find those swimming in sauce bbaked mushy things south of the border! Thanks!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Hintz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1827547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-13T14:05:53.827Z",
                "reviewBody": "I'm making it again for about the 10th time. It is our go to sauce for anything \"Mexican\". I plan to poach eggs this morning and serve with fried tortilla's. I always double or triple the recipe and use it all week. It also freezes well. The only changes I make are to use chicken stock instead of water and what ever chili'e I have in the garden.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FISHGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2038729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-27T05:55:05.917Z",
                "reviewBody": "The flavor was good but the consistency/texture leaved a lot to be desired. I shouldn't have shredded the chicken quite so finely for a start. But it also needed something to provide some bite - corn or bell peppers or something. With some tweaking, this could be really excellent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            }
        ]
    }
]