[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/116/appetizers-and-snacks/spicy/",
                    "name": "Spicy",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69067/chicken-taquitos/",
        "name": "Chicken Taquitos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4664855.jpg",
            "width": 3024,
            "height": 3025
        },
        "datePublished": "2020-06-23T21:50:32.000Z",
        "description": "Smoked cheese and green salsa give these crispy chicken taquitos that extra yum! Thinner corn tortillas will work the best. If you can't find the smoked cheese blend in your area, try using regular smoked Cheddar or Monterey Jack cheese.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "20 taquitos",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves - cooked and shredded",
            "1 ½ cups shredded smoked Cheddar and Swiss cheese blend",
            "1 (7 ounce) can green salsa",
            "1 cup chopped onion",
            "20 (6 inch) corn tortillas",
            "1 quart peanut oil for frying, or as needed",
            "1 cup sour cream",
            "1 cup chunky salsa",
            "1 cup guacamole"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the shredded chicken, cheese, green salsa, and onion. Spoon about 1 1/2 tablespoons of the mixture onto tortillas, or enough so that when rolled up, each one is about 1 inch wide. Filling should not come to close to the ends, or it will fall out. Secure rolls with toothpicks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry rolls 4 or 5 at a time so there is enough room between them for even cooking. Cook for 3 to 5 minutes, or until golden brown. Once they float, I leave them in for about another minute. If the taquitos are not crisp when cool, you haven't cooked them long enough. Drain on paper towels. Serve with sour cream, salsa and guacamole for dipping.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Spicy"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HeidiS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.421875,
            "ratingCount": 128,
            "itemReviewed": "Chicken Taquitos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "226.6 calories",
            "carbohydrateContent": "15.4 g",
            "cholesterolContent": "32.4 mg",
            "fatContent": "13.9 g",
            "fiberContent": "2.4 g",
            "proteinContent": "10.9 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "207.2 mg",
            "sugarContent": "1.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-07T00:27:15.983Z",
                "reviewBody": "The main thing that I wanted to comment on for those who may be looking, I had to tweak this recipe by using green enchilada sauce in place of the green salsa, and I opted to bake the taquitos instead of frying them.  We had good success by baking them for 9-10 minutes on a cooking sheet at 500 degrees.  Before putting them in the oven, we would baste the corn tortillas with olive oil.  Worked great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catman-do",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/768906/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-16T14:18:10.78Z",
                "reviewBody": "Wow \"hslonka\", these were fantastic and what a great way to use up leftover chicken! I used regular flour tortillas and shredded cheddar because that's all I had in the house and they were still delicious. To make the tortillas more pliable, I gave them a steam bath by wrapping them in a damp paper towel and placing them in the microwave for a minute. To eliminate the open ends, don't place the filling in the middle, but close to the end toward you. Much like you would assemble an egg roll, start by folding the right and left sides inward and then roll forward while continuing to tuck in the sides as you go. The little bit of moisture from the microwave will also help seal them. Once rolled give them a good firm press and then thread your toothpicks. Yummy and thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-14T17:00:58.25Z",
                "reviewBody": "I couldn't get the tortillas to stay rolled long enough to fry them. I even tried 2 different packs of corn tortillas with no luck. I may try this again but first steam the corn tortillas before even attempting to roll them again. I ended up throwing away 1/2 a package of corn tortillas.:o( Attempted again this time I steamed the tortillas first so they would roll easier. However when I put them in the oil they stuck to the bottom & ripped apart. So I decided I could bake them instead so I steamed each tortilla sprayed the bottom of a glass baking dish with oil and sprayed the tops of the tortillas with oil as well. They came out just right and were very good. I placed some shredded cheddar cheese on top of them at the very end of baking time. I baked them about 10 minutes but didn t actually time it exactly. Served with tomatillo salsa & sour cream & Mexican rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dragngirle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1996543/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-18T00:43:23.263Z",
                "reviewBody": "Ok. I'll admit I'm bias. I LOVE TAQUITOS!!!!! Regardless this is a great recipe. The entire family loves it. I love it because I can double the recipe and make a whole bunch at once and freeze the rest. Yes you do have to warm the shells before rolling. Hint for freezing: Freeze the taquitos BEFORE frying them. Then just fry them frozen. Don't need tooth picks for those and they stay together nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MINDERK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/784415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-28T01:54:00.933Z",
                "reviewBody": "my Grandmother thought me to make taquitos manageable when frying by lightly coating the outside end of the tortilla on the with a flour paste (mix 3 tsp flour 2 tsp water to a thick batter)Its like using flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ale",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2783700/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-22T19:08:43.687Z",
                "reviewBody": "Instead of chicken I use leftover pork from the Kalua Pig in a Slow Cooker recipe (found on this site- yummmm!)... especially helpful if you can't find smoked cheese. Also if you can't find smoked cheese you can always stir in a couple drops of liquid smoke (more or less to taste) with the shredded chicken mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MY4JS1239",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/802168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-08T16:02:15.053Z",
                "reviewBody": "WoW! This was a huge hit! We doubled it and served it at a party and nobody wanted to quite eating them. The only changes I made were instead of smoked I used Sharp cheddar with the swiss and I used green onions. The \"green\" Salsa I am assuming is salsa verde?? That is all I could find and I only used half because I didnt buy enough. It didnt matter much though. I had put the chicken it a crock with garlic and onion for a few hours till the meat was tender and fell apart. The filling was so delicious. I also didnt have peanut oil so just used canola....worked fine. Served it with Guacamole Sour Cream & Salsa. The taquitos I usually have have hardly any filling. I like to get as much in there as I can. It makes it harder to keep together when rolling and frying but is so much more flavorful when you are eating them. Absolutly one of my favorite recipes I have made!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JenaGayle Jack Hatch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2910955/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-09T20:29:52.61Z",
                "reviewBody": "It took me a couple of tries to figure out that I needed to \"loosen up\" my tortillas before rolling them (the kept breaking!!)  I wrapped them in a damp paper towel and popped them into the microwave for about 30 seconds and that made them much easier to work with.  Kids loved them!  Thought I had made too many and it turns out- I didn't make enough!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LEOCHICK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1295891/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-07T18:25:28.64Z",
                "reviewBody": "Too bad my husband doesn't like corn tortillas because these taquitos are delicious and I want to have them all the time! The key to making them turn out is not to use too much filling. The taquitos I've always seen are only as big around as your finger. So use a teeny bit of filling and wrap the warmed tortilla tightly before securing with toothpicks. I just wish they were as good when baked instead of deep fried.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-09T19:52:47.577Z",
                "reviewBody": "I bought the thinnest corn tortillas I could find gave them a steam bath and toothpicked them to get them to stay rolled but they just wouldn't. Next time I think I will flavor the chicken a little extra and use a different kind of tortilla. Not a bad recipe in all but not exactly what I had in mind.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BRINAJOY05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/918804/"
                }
            }
        ]
    }
]