[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/71380/poblano-chicken-enchilada-casserole/",
        "name": "Poblano Chicken Enchilada Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F962767.jpg",
            "width": 1200,
            "height": 1197
        },
        "datePublished": "2020-06-23T21:50:33.000Z",
        "description": "I've begun making my enchiladas casserole style, which saves a lot time, not to mention burned fingers. :) However, everyone still raves over my enchiladas, and this recipe recently earned a round of applause when I made them on a skiing holiday. The sauce is actually a modified Alfredo recipe and is also great over fajitas.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "6 tablespoons butter, divided",
            "6 skinless, boneless chicken breast halves",
            "2 fresh poblano peppers, seeded and sliced into strips",
            "4 fresh jalapeno peppers, seeded and diced",
            "2 cloves garlic, chopped",
            "1 lime, halved",
            "¼ cup all-purpose flour",
            "1 pint half-and-half",
            "1 bunch fresh cilantro, chopped",
            "1 (8 ounce) package fresh mushrooms, sliced",
            "2 ounces sour cream",
            "12 (6 inch) corn tortillas",
            "4 cups shredded mozzarella cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt 2 tablespoons butter in a large skillet over medium heat. Place the chicken breasts in the skillet. Mix in the poblano peppers, jalapeno peppers, and garlic. Squeeze the juice from one lime half over the chicken, and place the lime peel and pulp into the skillet. Cover, and simmer 25 minutes, stirring occasionally, until chicken juices run clear. Remove from heat, cool, and cut chicken into cubes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1/4 cup butter in a medium saucepan over low heat. Gradually stir in the flour and half-and-half. Mix in the cilantro, mushrooms, sour cream, and juice of remaining lime half. Cook and stir 10 minutes, until mushrooms are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line the bottom of a 9x13 inch baking dish with 6 tortillas. Arrange 1/2 the chicken and pepper mixture over the tortillas. Sprinkle with 1 cup cheese, and cover with remaining tortillas. Layer with remaining chicken and pepper mixture, and pour the cilantro sauce evenly over the casserole. Top with remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 25 minutes in the preheated oven, until cheese is melted and lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "TYGERCOOKS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.114649681528663,
            "ratingCount": 157,
            "itemReviewed": "Poblano Chicken Enchilada Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "541.6 calories",
            "carbohydrateContent": "29 g",
            "cholesterolContent": "138.4 mg",
            "fatContent": "30.7 g",
            "fiberContent": "4.1 g",
            "proteinContent": "38.6 g",
            "saturatedFatContent": "17.9 g",
            "servingSize": null,
            "sodiumContent": "512.4 mg",
            "sugarContent": "2.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-07T12:46:31.687Z",
                "reviewBody": "I took the advice of others and altered this recipe slightly.  So... I seasoned the chicken with fajita spice (made the mistake of not adding salt - the chicken really needs 1/2 tsp salt). I was worried that the peppers would make it too hot (used 1/2 the amount) - next time I would use all the peppers.  I roasted and peeled the poblano peppers - before adding them - they added incredible flavor. I used jalapeno jack and cheddar cheese - and reduced the amount by half. Since I left out 1/2 the cheese the result was bordering on being dry.  Next time I would increase the amount of sauce.  The sauce was great with that hint of lime, but it needed 1/2 tsp of salt too. (Maybe reducing the cheese makes this recipe in need of salt?) The mushrooms didn't add much and I don't really think of them as fitting in a Mexican style dish - I'd leave them out next time. Lastly, for ease of serving I cut the tortillas into squares and lined the pan.  Dad and 2 kids gave thumbs up, and ate it with green tomatillos sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TORA.V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/785444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-12T01:01:36.103Z",
                "reviewBody": "My family LOVES this recipe, including my Grandpa-in-law who doesn't like anything new!  I've made this many times for company and friends and have always gotten requests for the recipe.  I do put in more poblanos (4-6), doubled the sauce, used 1/2 bunch cilantro, skipped the mushrooms since I don't like them, and added salt.  I have made this with both flour and corn tortillas and prefer the corn with this recipe.  Hope this helps.  Enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3269520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-10T15:24:21.397Z",
                "reviewBody": "I've learned a couple of things, while making this recipe, that I'll do differently next time. First, I'll roast and peel the Poblanos before slicing them. Second, I'll shred the chicken as I'd like a more authentic texture. It's very rare that I prepare a recipe as written, and I did feel it was lacking a certain flavor, maybe I'll discover it next time around.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelley Rose Peters",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/839863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-08T19:24:05.123Z",
                "reviewBody": "This was pretty good.  I used half the cilantro and the flavor was good... if I had used it all I think it would have been too overpowering.  I also added onions to the mix - but onions go into everything I cook.  My husband liked it also, so we will probably be making it again.  I will probably add some more half and half to the sauce - it was really thick - but still tasted yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TREE_TIGGER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/412294/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-24T23:14:08.75Z",
                "reviewBody": "I personally loved it, while once I added some salt and twicked it. I cubed the chicken before cooking and added about 1/4 cup of chopped onion to the chicken mixture. I also diced the tortillas up like I do for King Ranch chicken. I used an additional chicken breast too. I reduced the jalepeno peppers to 2 since they were huge. Used low-fat cheeses, butter and sour cream.\r\nMy picky brother did not like it. Not for picky eaters. My favorite ingrediants are chicken, mushrooms, pepppers; so I love this recipe.\r\nOh yeah I also changed the cheese to cheddar/monterray jack blend.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LIBBY1979",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/566114/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-21T14:29:53.79Z",
                "reviewBody": "This was a great dish.   I halved the recipe for my husband and I.  I used flour tortillas because I really don't like corn tortillas.  I had to season the chicken a little.  I used cumin and garlic powder.  I added half a jar of salsa verde to the chicken and peppers.  I didn't add the mushrooms - they didn't really seem like they belonged. I only used half a bunch of cilantro and I'm glad I did.  It added great flavor to the sauce, but it was a little overpowering.  Next time I will double the sauce to put it in both layers, but still only use half the cilantro.  Don't be afraid to use all the peppers.  I like spicy food and was afraid it would be too spicy, but it wasn't.  We'll definitely make it again. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather Reis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2149404/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-12T16:49:30.89Z",
                "reviewBody": "Totally disapointing. With all those peppers I was expecting more of a punch with the chicken but it was quite bland. The sauce was not that flavorful either. I am not a star chef so I am not sure what it needs but it sure needs a pick me up. Mu husband said it wasn't that bad but then proceeded to cover his plate in Tapatio. We will finish the leftovers but I'll probably never see this one on my table again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "smoreta",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-16T06:00:48.123Z",
                "reviewBody": "i made this for our christmas party...wasn't very impressive...lacked a lot of flavor and was a little on the slimy side...won't make again sorry",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "KAMMELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1116145/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-23T23:25:01.34Z",
                "reviewBody": "This is a good recipe. I made the chicken in a crockpot and guess what no poblanos in my grocery store. I used some salsa and the liquid from a bottle of roasted red peppers. After it cooked and cooled I shredded it and mixed in one can of jalepeno peppers diced and some more roasted red pepper juice. It still needed something so I squeezed in a ton of lime juice and made the rest of the recipe as written. It was really good. I loved the cilantro sauce. Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOMSMUM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/649156/"
                }
            }
        ]
    }
]