[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17874/main-dish/tacos/",
                    "name": "Taco Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17878/main-dish/tacos/beef/",
                    "name": "Beef",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/70935/taqueria-style-tacos-carne-asada/",
        "name": "Taqueria Style Tacos - Carne Asada",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F08%2F70935-Taqueria-Style-Tacos-Carne-Asada.jpg",
            "width": 819,
            "height": 819
        },
        "datePublished": "2020-06-23T21:50:33.000Z",
        "description": "This is a great recipe for authentic Mexican taqueria style carne asada tacos (beef tacos). These are served on the soft corn tortillas, unlike the American version of tacos.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "3 pounds flank steak",
            "⅓ cup white vinegar",
            "½ cup soy sauce",
            "4 cloves garlic, minced",
            "2 limes, juiced",
            "½ cup olive oil",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper",
            "1 teaspoon ground white pepper",
            "1 teaspoon garlic powder",
            "1 teaspoon chili powder",
            "1 teaspoon dried oregano",
            "1 teaspoon ground cumin",
            "1 teaspoon paprika",
            "1 white onion, chopped",
            "½ cup chopped fresh cilantro",
            "1 lime, juiced",
            "2 large tomatoes, chopped",
            "2 jalapeno peppers, chopped",
            "1 white onion, quartered",
            "4 cloves garlic, peeled",
            "4 dried New Mexico chile pods",
            "1 pinch salt and pepper to taste",
            "1 (32 ounce) package corn tortillas",
            "2 cups grated cotija cheese",
            "2 limes, cut into wedges"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Lay the flank steak in a large glass baking dish. In a medium bowl, whisk together the vinegar, soy sauce, 4 cloves of garlic, juice of two limes, and olive oil. Season with salt, black pepper, white pepper, garlic powder, chili powder, oregano, cumin and paprika. Whisk until well blended, then pour over the steak in the dish. Turn over once to coat both sides. Cover with plastic wrap, and marinate for 1 to 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together 1 chopped white onion, cilantro, and the juice of 1 lime. Set aside to use as a relish for the tacos.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a skillet over medium-high heat. Toast chile pods in the skillet for a few minutes, then remove to a bowl of water to soak for about 30 minutes. Preheat the oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tomatoes, 1 onion, jalapenos, and 4 cloves of garlic onto a baking sheet. Roast in the oven for about 20 minutes, until toasted but not burnt.  Place the roasted vegetables, and soaked chile pods into a blender or food processor, along with salt and pepper. Puree until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a large skillet over medium-high heat. Cut the marinated flank steak into cubes or strips. Cook, stirring constantly, until the meat is cooked through and most of the liquid has evaporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Warm the tortillas in a skillet for about a minute on each side to make them pliable. Tortillas may also be warmed in a microwave oven. Arrange two or three tortillas on a plate, and lay a generous amount of beef over them. Top with a sprinkle of the onion relish and a large spoonful of the pureed salsa. Add as much cheese as you like. Garnish with lime wedges, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Taco Recipes",
            "Beef"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "STANICKS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.678740157480315,
            "ratingCount": 1270,
            "itemReviewed": "Taqueria Style Tacos - Carne Asada",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "369 calories",
            "carbohydrateContent": "32.2 g",
            "cholesterolContent": "44.1 mg",
            "fatContent": "19.7 g",
            "fiberContent": "5 g",
            "proteinContent": "18.1 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "839.8 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-29T19:48:59.423Z",
                "reviewBody": "4/29/07-I made this again last night & made some alterations to the recipe...and it was FABULOUS!  It is now a 5 star recipe for us.  With the changes I made it now tastes like authentic carne asada.  My husband & our friend were raving about it.  I decreased the amount of soy sauce to 1/3 cup & used half reg/half low sodium.  I decreased the vinegar to 1/4 cup.  I omitted the lime juice & instead used 1/3 cup low acid orange juice & the juice from half a lg lemon.  I decreased the oil to  1/3 cup (half olive, half vegetable).  I used flap meat.  \n\nOriginal review from 3/07:  This is a great marinade.  The reason I only gave it four stars is because this did not taste like \"authentic\" carne asada.  We live in San Diego Co, 10 mi. north of the Tijuana border & regularly travel deep into Baja.  We've also lived in AZ just a few mi. from the MX border.  We've never had carne asada that tasted like this.  We'll keep looking for that perfect carne asada recipe.  I used half low sodium soy sauce, and half regular soy sauce, and I decreased the salt just a bit.  The level of saltiness came out just right.  I also increased the recipe to serve 24 people (plus added an additional pound of meat to that) for a party of 15 adults (13 were Marines)& there were no leftovers.  I used flap steak (from Costco)...very tender, & although it was really marbled, there were no chunks of fat in it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Miller Motley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cook4mycrew/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-16T21:15:21.14Z",
                "reviewBody": "This recipe is very very good. I have a couple tips though. First, follow the recipe EXACT. Don't substitute; it won't turn out the same. Next, put the marinade in the blender & blend for a couple of minutes, believe it or not, this makes a difference. Finally, if you can, marinate overnight. Along with the blending, this gives the ingredients time to sit & really get into the meat. I've made this lots & lots of times & there are never left overs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pinky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2219283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-30T19:30:43.18Z",
                "reviewBody": "Growing up in a Latino family I had always been very particular with which authentic recipes I wanted to keep.  However I could never get over my love for the restaurant style taste of Carne Asada.  I searched high and low and finally I fell upon this recipe.  I LOVE THIS MARINADE!!!  The meat tastes so delicious.  If you're looking to imitate the zingy tasting Mexican Restaurant Style Carne Asada,...this is the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "REBEKAHNORMAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1328978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-18T23:46:34.06Z",
                "reviewBody": "This is a recipe that I tried about 9 months ago and have been making it once per week ever since.  Everyone who tries this LOVES it!  However, I have tweaked it a little to suit our tastes.  I follow the directions exactly on the marinade---it is fantastic---but I do not use flank steak.  I buy what is called \"flap meat\" here at my local Costco (Southern CA) which is basically a tri tip roast sliced lengthwise about 1/2 inch thick.  It is thinner and more tender than flank steak and seems to \"absorb\" more of the flavor of the marinade.  Then we grill the meat for about 5 minutes per side (instead of pan frying)and chop it up after it is cooked.  My only other changes are that I serve these on warm FLOUR tortillas, and we always include fresh guacamole---this may not be \"authentic\", but this is how my family likes them.  These are just the BEST tacos ever!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kris L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1229429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-07T03:09:34.843Z",
                "reviewBody": "11/07/06:  UPDATE: THESE ARE WONDERFUL MADE IN THE CROCKPOT!!!!  \n\n Update:  Have made this recipe at least four times since I have first posted.  The onion relish is superb! ** I wish more stars were visible!!!  THIS IS DELICIOUS!!!!!  and I'm only talking about the marinade!  Next time I will make everything for the true taste experience, but when my kids are sneaking into the kitchen to steal slices of the meat before dinner, I know I have a winner!  I used flat cut brisket because it was on sale, but next time I'll use flank steak as directed or flap meat or carne asada meat as others have suggested because it was pretty chewy.  But no matter, because it was just heavenly! Next time I will also slice the meat into thinner slices because I had to re-cut every slice after it was cooked.  I also boiled the remaining marinade in the grill pan I used and poured it over the meat in a bowl before I placed the meat on the tortillas. I served it with homemade refried beans, and this is a new family favorite.  Thank you, thank you for such a delish recipe!\n4/6/06: Had to add---make this on a night that you plan to clean your stovetop because it splatters!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Labbylover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1537497/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-31T17:46:46.79Z",
                "reviewBody": "This had good flavor but wasn't at all authentic in my opinion. In Houston the Mexican population is vast (TONS of Mexican restaurants) but I have never tasted meat like this (I think it had to do with having soy sauce as the base for the marinade). The meat was a bit chewy as well (I used flank steak and marinated it overnight). I would suggest leaving the meat whole while cooking lowering the heat some then slicing it afterward. The \"relish\" really needed a chopped tomato (which it then becomes \"pico de gallo \" a 'must' with these types of tacos). The pureed salsa was great however! As a side note cotija cheese is often labeled as \"Queso Fresco\" in the stores. Thanks for the recipe - I'm going to keep looking though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-30T14:11:23.7Z",
                "reviewBody": "Classic true tacos. This may look like alot but actually it's really easy to prepare. The one thing I do to make things easier is freeze the beef for 30 minutes slice thin then marinate. By doing this you only need to marinate for 30-60 minutes and every last morsel of meat gets flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VORCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1128921/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-18T17:38:27.293Z",
                "reviewBody": "This is all about the marinade!  It is wonderful.  Be sure to bring your meat and marinade to room temperature before cooking.  Makes a delicious difference!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kevin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1434236/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-06T14:51:01.76Z",
                "reviewBody": "While tasty, the meat did not taste anything like authentic taqueria meat.  I used flap meat as others suggested, and I was pleased with the results. The onion relish everyone is raving about was just onions and cilantro with a squirt of lime juice.  Certainly nothing spectacular.  I made the salsa as directed, except I threw in a couple of big tomatillas.  They were on sale for 67 cents a pound.  The salsa was good, but it tasted a lot like commercial bottled salsa. All in all, this was way too much work for such mediocre results.  I won't make it again.  Anyone who lives in the southwest and has access to the real thing will not be impressed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Taqueria-Style Tacos (Carne Asada)",
            "description": "See how to make authentic taqueria-style beef tacos.",
            "uploadDate": "2012-11-13T23:10:53.358Z",
            "duration": "PT7M47.842S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F90d6bce9-3038-48f1-a9be-2c79dbde9ddc%2F8b1a145c-d948-42ed-abcf-f56ff24e9dba%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1967256166001"
        }
    }
]