[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77917/authentic-mexican-enchiladas/",
        "name": "Authentic Mexican Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2325228.jpg",
            "width": 1080,
            "height": 1920
        },
        "datePublished": "2020-06-23T21:50:37.000Z",
        "description": "This is the real thing! Corn tortillas are dipped in a home made sauce, fried, filled with Mexican queso fresco, then topped with sour cream, lettuce and tomato. My mother in law is from Mexico and taught me to make this delicious dish! Serve with authentic refried beans, it has a taste different from the norm--so good!",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 dried chile de arbol peppers",
            "1 clove garlic",
            "1 teaspoon salt",
            "¾ cup water",
            "1 cup vegetable oil for frying",
            "18 (6 inch) corn tortillas",
            "3 cups crumbled queso fresco",
            "1 cup sour cream",
            "1 cup shredded lettuce",
            "2 medium tomatoes, thinly sliced",
            "½ cup chopped green onions"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Snap the tops off of the dried chilies, and place in a saucepan with enough water to cover. Bring to a boil, and simmer for 15 minutes. Drain the water, and place chilies into a food processor or blender with the garlic and salt. Puree until smooth. Press sauce through a strainer, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium heat. Soak each tortilla in the sauce, then place in the hot oil. Turn over almost immediately, and fry for about 5 seconds on the other side. Remove to a plate that is lined with paper towels. The easiest way to do this is to fry the tortillas and stack them directly on top of each other until you have fried them all. This will keep the tortillas pliable until you are ready to fill them.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Take one fried tortilla at a time, and fill with about 2 tablespoons of the queso fresco. Roll up, and place seam side down on a plate. Place three of these on each plate. Top in the following order: Start with a layer of sour cream, then a small handful of lettuce, three tomato slices, 2 more tablespoons of queso fresco, and finally, 1 tablespoon of green onions.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Becky"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.243589743589744,
            "ratingCount": 78,
            "itemReviewed": "Authentic Mexican Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "477.3 calories",
            "carbohydrateContent": "46.1 g",
            "cholesterolContent": "56.7 mg",
            "fatContent": "24.3 g",
            "fiberContent": "5.7 g",
            "proteinContent": "21.1 g",
            "saturatedFatContent": "12.2 g",
            "servingSize": null,
            "sodiumContent": "609.1 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-06T20:27:39.327Z",
                "reviewBody": "Pretty close to the real thing, lacks a little flavor.  Here's how my mom makes them.  Roast the chilies on a flat grill or pan till they are roasted on all sides, (watch them so they don't burn, this will be quick;  brings out the flavor a little more).  This shouldn't take long.  Immediately soak them in hot water till they are soft.  In a blender add the chilies (remove tops and seeds depending on how hot you want it), water (a bit at a time), add onion, garlic, oregano and salt.  (the measurements are small, but you will get them down depending on your taste).  My mom also adds Masa Harina (the corn meal used to make tamales) to thicken it a little if it is too runny.  Strain the mixture into a warm pan to keep hot.  The tortillas are fried a little bit first then dipped in the sauce.  If you don't want to fry them I have also heated them in a pan or grill till they are slightly crispy.  We make our enchiladas as layers so simply piling them on top of each other with layers of cheese, shredded chicken (to the chicken we add a little of the enchilada sauce first), and onions.  YUM :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "GourmetBabe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-03T07:02:31.17Z",
                "reviewBody": "THIS IS AN AUTHENTIC RECIPE AND GOOD! BUT TRY USING CHIHUAHUA CHEESE INSTEAD \"YOU WILL GET IT MORE CHEESY OR TRY THE ORIGINAL MEXICAN COTIJA!FORE A MORE DRIER ENCHILADA. ALSO TRY FRYING YOUR TORTILLA A BIT FIRST THEN DIPPING INTO THE CHILI MIXTURE THEN ADDING YOUR ITEMS TO AVOID LOTS OF SPLATTERS AND UNCALLED FOR GREASE BURNS & BLISTERS! OTHERWISE THIS IS A PERFECT RECIPE AND EVEN MORE WITH SEASONED CHICKEN WITH SAUTED ONIONS TOMATOES AND GARLIC TILL A BIT DRY...ADDED TO THE CHEESE WHICH IS MY ABSOLUTE FAVORITE AND SO SO FILLING!WE EAT THIS REGULARLY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "VREYES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/211389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-25T23:40:04.697Z",
                "reviewBody": "I agree with the other reviewers that the draining of the chiles doesn't make sense. I blended them with the liquid and then strained it back in the sauce pan put it back on the heat to cook down a bit. Dipping first in the sauce fried out the flavor of the sauce. I also agree that the filling should be a melting cheese like Chihuahua and save the queso fresco for the toping. Over all the flavor was good but the instructions seem to be missing pieces and vague. Maybe if we could all learn the recipe from her mother in law we'd get it! Thanks for a recipe that is truly mexican in style and not one of those oven baked drowned in sauce and cheese things most people in the US think of a enchiladas! If you have a mexican grocery in your area use crema instead of sour cream... lighter and more tangy on the tongue! (Don't forget a few slices of advocado and a sqweeze of lime on top!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Hintz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1827547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-13T22:29:18.69Z",
                "reviewBody": "These are authentic! My husband is from Mexico and he said they were just like he had at the fiestas and ferias. I love finding real mexican recipes like this. It is not an americanized version of enchiladas if that is what some may be looking for. These are the real deal!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chynna-Destiny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2247820/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-25T21:50:27.513Z",
                "reviewBody": "These tasted very authentic just like mom used to make. For a lot less work and still great taste I sometimes use the \"Las Palmas\" red enchilada sauce. Also while more difficult they taste better when dipped in the sauce first then fried in oil since the oil cooks the sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JanethAngel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1569089/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-12T14:41:00.523Z",
                "reviewBody": "When I lived in Los Angeles one of my dearest friends was a lovely woman from Mexico who came to my home evenings every week and taught me how to cook authentic Mexican recipes. This recipe was one of my favorites and it is so simple with pure tastes. However as with everything I touch I add a twist. A gorgeous combination of Arbol and Ancho chiles makes this sauce sing as well as adding a very scant amount of cumin (don't go overboard as this spice packs a punch with its distinct pungency). I also prefer to make my own corn tortillas as it's the simplest thing in the world and you are guaranteed the freshest possible ingredients. By adding a bit of chopped green onion and mild green chiles to the cheese filling you score big points in flavor and still keep the authenticity alive. I tend to like my enchiladas oozing melted cheese so after I plate them I add a spoonful of sauce a bit more crumbled queso cheese on top and slip it into a hot oven for a few minutes. Add the crema (or sour cream) tomatoes and lettuce and voila perfection! These are decadent and so wonderful. Also occasionally try the same recipe without the cheese and substitute spicey chicken and roasted potatoes. Mmmmmmmmmm....soooo good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patricia Wensley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3134615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-14T14:03:53.827Z",
                "reviewBody": "Help! I must have done something wrong. The recipe says to drain the water from the chilis which I did but after adding the garlic and salt all I had was a paste. I couldn't dip the torillas in paste. How do you get a liquid if you drain the water. Otherwise the enchiladas weren't too bad but not what I thought.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "SEG1234",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/916762/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-18T17:11:23.847Z",
                "reviewBody": "This is as authentic as you can get for Mexican food. I make a very similar recipe but with a chile verde sauce. You can either dip the tortilla in the oil and then the sauce or vise versa. I prefer to do oil and then sauce that way I can drain the oil on paper towels without losing any of the sauce. For the sauce do not drain the water when it's done boiling use that blend instead of new water. Also to flavor the sauce try adding onion and the chicken bullion with tomato flavor--trust me it makes it taste wonderful! Just throw everything into the blender and blend. You can use whatever dried peppers you have on hand (chile de arbol peppers tend to be more spicier than the other dried varieties). Instead of rolling the tortillas you can stack or just fold them over (like the picture). Although queso fresco doesn't melt very well you can't beat the light and delicious flavor. I always use this cheese for my enchiladas. I like to add chopped onions to the filling too. And lastly before you serve these pop them in the microwave to melt the cheese a little. My husband who is Mexican loves them with either a cheese and onion filling or with cheese onion and chicken. Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-02T20:36:01.833Z",
                "reviewBody": "Awesomesauce! I'm glad somebody finally put something like this up. I never heard or ate enchiladas that were baked in a casserole pan and everytime I eat Mexican I refuse to eat enchiladas cuz they're not made the \"right\" way. LOL. My mom is from mexico too and she taught me to dip flour tortillas in sauce then fry and while frying add ingredients such as cheese beef/chicken onions etc...So delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "meretsoleil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2884877/"
                }
            }
        ]
    }
]