[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/84482/slow-cooker-enchiladas/",
        "name": "Slow Cooker Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4544700.jpg",
            "width": 1704,
            "height": 1704
        },
        "datePublished": "2020-06-23T21:50:38.000Z",
        "description": "An old Mexican classic with a new twist. Anytime we have a potluck, I am asked to bring these. Can be made with chicken or beef.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "6 Servings",
        "recipeIngredient": [
            "1 pound lean ground beef",
            "10 (6 inch) corn tortillas, quartered",
            "1 (1 ounce) package taco seasoning mix",
            "1 ¼ cups water",
            "1 (12 ounce) jar chunky salsa",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (10.75 ounce) can  condensed cream of chicken soup",
            "4 cups shredded Mexican cheese blend"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Crumble the ground beef into a skillet over medium-high heat. Cook and stir until evenly browned. Add taco seasoning and water; simmer for 15 minutes over low heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the salsa, cream of mushroom soup and cream of chicken soup. Mix in most of the cheese, reserving 3/4 cup for later.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a layer of  tortillas covering the bottom of a slow cooker. Scoop a layer of the ground beef over that, and then spoon a layer of the cheese mixture. Repeat the layers until you run out of stuff, ending with a layer of tortillas on the top. Top with remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook on High for 45 minutes to 1 hour.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "AIMS312"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.259061833688699,
            "ratingCount": 938,
            "itemReviewed": "Slow Cooker Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "711.7 calories",
            "carbohydrateContent": "36 g",
            "cholesterolContent": "141.9 mg",
            "fatContent": "45.6 g",
            "fiberContent": "3.6 g",
            "proteinContent": "40.9 g",
            "saturatedFatContent": "25.6 g",
            "servingSize": null,
            "sodiumContent": "2089.4 mg",
            "sugarContent": "3.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-28T03:21:18.89Z",
                "reviewBody": "After reading many of the reviews on this recipe, I modified the dish as follows: slow-cooked a 1&1/2 lb roast and diced yellow onion all day in two cans of soup, taco seasoning and 1/2 C water. Removed meat and shredded it, poured the seasoned soup mix into a bowl and stirred in the salsa, cheese, 1/2 C sour cream, and fresh cilantro. Stirred meat back into this mixture and started the layers. I sprinkled sliced olives on top of every layer. Cooked on high until the top layer of cheese looked melted (about 75 minutes). I kept my tortillas in the fridge all day, and that may have kept them from crumbling into mush while they cooked. All my husband and I could say while eating this was \"oh my god this is good!\", and we had to force ourselves NOT to eat the whole thing in one night. Reheated portions the next day (microwave for lunch, and oven for dinner), and it was even tastier!\n\n[ETA]: I have made this several times for potlucks at work, using the ground beef and doubling the amounts. I prep it the night before and put my 6 quart crock in the fridge, then heat it the next day at work. If you sprinkle cheese on top of every salsa/soup layer, and use a DOUBLE-thick layer of corn tortilla wedges, the tortillas do not get very mushy, even after sitting in the fridge overnight.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Misha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/130466/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-27T14:44:00.583Z",
                "reviewBody": "We had a potluck at work last week and our notice was the day before at 4:30. GEE, THANKS!!! \n\nSeeing that I didn't have much time to prepare, I found this recipe and figured it would be quick and simple to make. I'm so glad I found it!!\n\nI did make a few minor changes: I saw that quite a few people had noted that theirs had turned out \"goopy\" so I used 2 lbs of meat and also mixed in a can of drained black beans to give it some added substance. I reduced the water down to 3/4 cup and also cut the cheese in half (only used 2 cups). I used 1 and a 1/2 cups for the soup mixture and left the remaining 1/2 cup for the top. It was AWESOME!!!! It smelt, tasted and also presented itself very nicely!!! \n\nI was a little skeptical because I like to try out my recipes beforehand but this turned out to be a huge hit. There were no leftovers (which was a downfall for my family!!!) and I had to send out a mass email with the recipe because everyone kept coming by my office asking for it. \n\nThanks so much for such a great recipe!!!! This is definately a keeper =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen Billingslea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2465814/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-28T23:44:16.467Z",
                "reviewBody": "This was very tasty!  I altered the recipe a bit though...  In slow cooker I used 4 frozen chicken breasts with the soups and taco seasoning.  Cooked all day and then shredded the chicken and added kidney beans to make the enchilada filling. This is the perfect consistency and very good! Then I made enchiladas with the filling and cheese.  This recipe is a keeper!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SANDRA DEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/524651/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-16T18:04:00.323Z",
                "reviewBody": "I was excited when I saw this on the weekly email. Slow Cooker Enchiladas, what a great idea.\n\n I was dissapointed as soon as I saw the ingredient list. with plastic/fake ingredients like \"Taco Seasoning Mix\", \"Condensed Cream of Chicken Soup\", and \"Shredded Cheese Blend.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "bill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3621249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-22T15:28:02.14Z",
                "reviewBody": "Definately do not use flour tortillas - it turns into mush.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "3angelsmommie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2295856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T21:10:24.81Z",
                "reviewBody": "Over all a very good recipe!  I made a few alterations based on some other reviews, which I would suggest to others:  Use at least 1.5 lbs of beef.  Substitute regular soup w/ healthy choice low sodium (you could definitely  get away with one can!) since this dish is salty enough.  I used 12 corn tortillas, but I could suggest using more...even doubling the layers if you're a big tortilla fan b/c they seem to get lost in the mix.  Definitely don't need 4 cups of cheese (I used between 2 and 3).  I put a layer of refried black beans...one can...next time I will use 2 or 3 cans.  I also baked this in a casserole dish at 350 for 40 min.  Didn't see the point of using my slow cooker...unless you're planning to leave and then come back.  My husband suggested using crunchy tortillas next time or even layering some Fritos corn chips!  I will try that next time.  The only thing I was disappointed in was that this dish turned out more like a dip than an enchilada casserole.  Oh-and did I mention my 2 year old asked for seconds? :D   ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tryntbhealthy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2456330/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-01T20:39:58.467Z",
                "reviewBody": "I sit here with the serving spoon eating the last little tidbits from the crock couldn t let any of it go to waste it s that yummy. Never imagined that the soups would leave this dish tasting Mexicany but they are subtle and let the other flavors shine. I like trying new recipes as is the first time but didn t have enough salsa or cheese on hand so substituted Mexican style tomatoes with green chilies (Rotel) and substituted a mixture of cheddar pepper jack and cream cheese. Next time I will add green onions for color plus I like them and double the amount of corn tortillas I like them too. The only problem I had was that I cooked it for 2 hours and still had to zap it a little to finish melting the cheese perhaps my crock pot cooks at a lower temperature than yours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LOVEBREEZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/711690/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-17T22:43:58.967Z",
                "reviewBody": "Made this recipe exactly as stated (except adding sliced black olives to the top) and it was just OK; it was kind of bland even though I used spicy taco seasoning for the beef. But when served over a bed of fresh shredded lettuce and tomatoes then covered with my favorite brand of taco sauce it went from 2-stars to 4-stars! The black olives on top were a big help too. Next time I'll probably use a mixture of pepper jack and habanero cheddar cheeses to add some spice to it. I'll probably also add in another 50% ground beef as there wasn't much to go around and I'll use about half as much water in the meat. Worth trying for sure though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Magill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/477960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-11T01:13:50.383Z",
                "reviewBody": "I used this recipe as a base but made some adjustments and holy heck they were good! First off, I used 1lb ground turkey instead of beef. Second, after adding the taco seasoning and water to simmer I added a small can of rinsed black beans. Third, I substituted the cream of mushroom soup for Santa Fe cooking creme (to add creaminess and spice!) and used chunky black bean and roasted corn salsa. Since I used a 6quart crockpot I didn't quarter the tortillas, I left them whole and placed them 3 across. I cooked these on low for 3 hours, and the last half hour with the lid off to evaporate some of the moisture and brown the top. Delicious! I will definitely make them again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Liv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3970406/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Enchiladas",
            "description": "See how to put a simple twist on a classic Mexican casserole.",
            "uploadDate": "2013-04-16T22:29:25.119Z",
            "duration": "PT2M37.824S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5c5707f8-2314-4959-855b-efcaff459256%2F26a114c9-827a-4689-b606-2d2b9dbc6e8c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2305841502001"
        }
    }
]