[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/95753/funky-enchilada-casserole/",
        "name": "Funky Enchilada Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4581936.jpg",
            "width": 1358,
            "height": 960
        },
        "datePublished": "2020-06-23T21:50:47.000Z",
        "description": "My good friend brought this to me in the hospital after I had just had a baby. My husband promptly took it home and ate the entire thing without sharing. I had to remake it myself to find out what he'd been raving about. I've made a few adjustments and so can you according to your tastes! This is a great casserole to make because some of the canned ingredients you may already have. Serve with sour cream, hot sauce, and cold diced tomatoes or salsa if you like. Maybe even serve some chips and guacamole to round it out.",
        "prepTime": "P0DT0H35M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 tablespoon olive oil",
            "1 pound skinless, boneless chicken breast meat - cubed",
            "1 tablespoon ground cumin, or to taste",
            "1 tablespoon dry Mexican or taco seasoning",
            "1 pinch cayenne pepper",
            "1 medium onion, chopped",
            "5 cloves garlic, chopped",
            "1 red bell pepper, seeded and chopped",
            "1 yellow bell pepper, seeded and chopped",
            "1 orange bell pepper, seeded and chopped",
            "1 (15.5 ounce) can black beans, rinsed and drained",
            "1 (15 ounce) can kidney beans, rinsed and drained",
            "1 (10 ounce) package frozen corn kernels",
            "12 (6 inch) corn tortillas",
            "½ bunch fresh cilantro, chopped",
            "2 cups shredded pepperjack cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium heat. Add the chicken and season with cumin, Mexican seasoning and cayenne pepper. Stir in the onion and garlic and cook until chicken is browned, about 5 minutes. Add red, yellow and orange peppers; cook and stir for another 5 minutes, then mix in the black beans, kidney beans and corn. Remove from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line the bottom and sides of a 9x13 inch baking dish with corn tortillas. Pour in the skillet mixture then top with cilantro and pepperjack cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 25 to 30 minutes in the preheated oven, until the cheese is starting to brown on top. Let stand for 10 minutes, then serve with your favorite Mexican food toppings.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Anne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.363636363636363,
            "ratingCount": 77,
            "itemReviewed": "Funky Enchilada Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "594.8 calories",
            "carbohydrateContent": "65.4 g",
            "cholesterolContent": "91.1 mg",
            "fatContent": "20.1 g",
            "fiberContent": "15.1 g",
            "proteinContent": "40.7 g",
            "saturatedFatContent": "8.8 g",
            "servingSize": null,
            "sodiumContent": "888.9 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-17T21:33:29.653Z",
                "reviewBody": "I tried this recipe today because it sounded good and I had all the ingredients in my pantry. It tasted fine I would make it again if I were in need of a quick meal but I just found it okay. I wouldn't go out of my way and plan on making it. I found that it didn't come together at all when you put it on your plate it just falls apart it's just a bunch of cubed chicken and beans there is really no need to put it in the oven you could skip the tortillas (they're awkward as a crust anyways) melt the cheese on top of the stove and then maybe wrap it all in flour tortillas. That would be better I think. I would not make it to drop off at someone's house it's just not that good; but it is an okay quick meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MomWhoCooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1710296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-05T00:59:46.03Z",
                "reviewBody": "this recipe was really yummy. I did add a few things to it like black olives, \nI also put enchilada sauce on bottom of cake pan so shells wouldn't stick. And on tortilla shells spread refried beans on them put chicken mixture in and topped with a little more enchilada sauce. cilantro and  cheese",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindalou",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2104831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-05T13:54:54.547Z",
                "reviewBody": "I made this recipe last week and I thought it was absolutely great. I actually passed it on to my mexican friend who loves enchiladas but has a 2 year old and no time for prep these days. It was so easy and it tasted fabulous just like an enchilada minus the time investment. I love the idea below of substituting the tortillas for chips that would make it perfecto! It is definitely not a meal that you want to make if you're looking for something that looks pretty. I did it in a casserole dish cut it in to squares w/a pizza cutter and served. It did fall apart but I wasn't looking to impress with presentation so that was okay. I stored the rest for lunch all week and everyone at work kept asking what smelled so good. The other thing that I love is that it is packed with nutrient dense ingredients that have lots of fiber whole products and protein. It's a perfect and healthy (if you go light on the cheese) family meal. I give it an a",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "danielle_friel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2146111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-29T22:11:38.45Z",
                "reviewBody": "I LOVED this recipe. I'm new to cooking so when I say this was easy to make. I mean it. The best thing for this recipe is to make sure you have all of your ingredients chopped up and ready to cook. Otherwise you might burn the meat if you re off chopping more veggies. I also substituted the chicken with ground beef. And it was still great. One of the things I might changed about this is instead of having full corn tortilla on the bottom of the pan I would make it have chips. Just because when I cooked it it was hard to cut as well eat. My family just ended up scraping off the tortilla and just using chips instead. Something to think about before you cook it. The taste was GREAT. And I m a picky eater so to say that it really means something. Try it! You ll never want to lose this fabulous recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy Carver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2049016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-28T19:00:59.147Z",
                "reviewBody": "i put chips on the bottom as suggested and next time would probably layer them throughout because this is just like nachos. delicious. instead of a taco seasoning packet i used cumin paprika chili powder and garlic salt. i'll add more cayenne next time. this is easy and yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mama cowpoke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2203965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-18T01:33:28.713Z",
                "reviewBody": "I really liked this casserole! I made only one change to the original recipe - after reading the reviews I decided to use the crunchy tostada shells (like a flat crispy taco shell) broken into 2 or 3 pieces and laid on the bottom of the pan instead of regular corn tortillas. This came out to a nice crumbly corn crust for the casserole and I can see how regular corn tortillas could probably be mushier and harder to cut if used. i will definitely use the tostadas again the next time b/c i really liked the flavor it added. Otherwise I thought this was a great recipe as is. I served it with a dollop of sour cream salsa and some diced avocados on top and spanish rice as a side. Easy great thing to have in the frig for leftovers something to leave for the babysitter etc. I made it for a friend who just had a baby and they really liked it too it's a comfort food type of dish. I also like that is uses mostly whole ingredients not a bunch of processed stuff!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PhotograMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/992030/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-08T13:57:03.84Z",
                "reviewBody": "So YUM! I used ground turkey made my own taco seasoning (less sodium) reduced the cumin and skipped the cilantro. I layered this like a lasagna using enchilada sauce on the bottom and between the layers. I can't wait to have the leftovers for lunch today! Thank you Anne!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-10T19:14:49.137Z",
                "reviewBody": "This is good to use with pantry/on hand ingredients. I used only one can of organic black beans and omitted the kidney beans. I used my own homemade taco seasoning. I also used a corn-flour tortilla blend. This was super easy to throw together though it wasn't a huge hit which was a surprize. It was quite dry. I think had I been thinking I'd have added in some homemade enchilada sauce. This would make a good nacho topping. Just when it's baked it's just....dry. I made my own casa (mexican sour cream) dressing over the top which helped.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-03T15:14:26.3Z",
                "reviewBody": "This was really good. The kids had a hard time with the pepperjack cheese but we loved it! I used just Black Beans because we do not like kidneys.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Zeke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2125096/"
                }
            }
        ]
    }
]