[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/183179/jollyrogers-chilaquiles/",
        "name": "Jollyrogers' Chilaquiles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1088680.jpg",
            "width": 4068,
            "height": 2727
        },
        "datePublished": "2020-06-23T21:51:22.000Z",
        "description": "This is a Mexican casserole that my Grandpa used to make every Thanksgiving and Christmas. The smell alone makes me feel like I am six years old and waiting for dinner to start. This recipe has been handed down from my Grandpa to my dad to me. The original recipe did not call for teaspoons or tablespoons, but with ounces and pounds. It can be made with or without chorizo. I prefer it with soy-based meatless chorizo substitute, which also makes it a good dish for vegetarians.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 onion, chopped",
            "1 (6 ounce) can sliced black olives",
            "½ cup white vinegar, divided",
            "1 tablespoon vegetable oil",
            "½ pound chorizo or bulk spicy pork sausage",
            "12 (7 inch) corn tortillas, cut into 1-inch pieces",
            "¼ cup vegetable oil",
            "1 ½ tablespoons all-purpose flour",
            "3 (8 ounce) cans tomato sauce",
            "1 (7.75 ounce) can Mexican style hot tomato sauce (such as El Pato Salsa de Chile Fresco®)",
            "1 cup water",
            "1 ½ teaspoons unsweetened cocoa powder",
            "1 teaspoon white sugar",
            "1 tablespoon white vinegar",
            "1 tablespoon dried oregano",
            "1 tablespoon taco seasoning mix",
            "1 (4 ounce) can diced green chiles, drained",
            "¾ cup crumbled cotija or feta cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Put chopped onion and sliced olives in separate small bowls and combine each with 1/4 cup of vinegar. Set aside to marinate. Meanwhile, heat the vegetable oil in a skillet over medium heat. Stir in the chorizo, breaking it apart into crumbles as it cooks, about 10 minutes. Remove the chorizo from the skillet and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1/4 cup of oil in the skillet and add the tortilla pieces, cooking and stirring over medium-low heat until just beginning to get crisp and golden at the edges, about 10 minutes. Remove skillet from heat and drain the tortillas; pour 1 tablespoon of the oil into a saucepan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the saucepan over medium-low heat until hot but not smoking.  Add the flour, and cook and stir until smooth, about 1 minute.  Pour in the regular and hot tomato sauces, water, browned chorizo, cocoa powder, sugar, 1 tablespoon of vinegar, oregano, and taco seasoning.  Simmer the sauce about 5 minutes to blend the flavors. Stir in diced chiles and tortillas.  Simmer about 10 minutes more, stirring occasionally, until tortillas have softened and the mixture is thick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain the onion and olives.  Spoon a layer of tortilla mixture evenly into a 2 quart baking dish or serving dish, and follow with a layer of about 2 tablespoons marinated onion, then a layer of 2 tablespoons olives, followed by a layer of 1/4 cup cheese.  Repeat layers twice more. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "JOLLYROGERS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.421052631578948,
            "ratingCount": 19,
            "itemReviewed": "Jollyrogers' Chilaquiles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "414.1 calories",
            "carbohydrateContent": "31.6 g",
            "cholesterolContent": "38 mg",
            "fatContent": "26.9 g",
            "fiberContent": "5.3 g",
            "proteinContent": "13.7 g",
            "saturatedFatContent": "8.3 g",
            "servingSize": null,
            "sodiumContent": "1513.7 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-12-22T02:46:33.92Z",
                "reviewBody": "These are the best Chilaquiles I have ever tasted! I made them for a Blue Bunny Ice Cream Party celebrated on New Years Eve at my local community center. At 11 o' clock at night they were served to 63 guests and not one person did'nt go back for seconds! They were a big hit! I make them every sunday night now! My friends can't stay away! Thank you for this delicious recipe becuase my family and I couldn't be happier! I owe you big time!:) -starcafe",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "starcafe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3399815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-03T17:20:54.507Z",
                "reviewBody": "I've made chilaquiles many different ways for years and my family loves them but not this recipe. Too much sauce and not enough tortillas for me. Also I didn't like the vinegar soaked onions. When I was done cooking it I was thrown off by the final product and couldn't imagine eating it like it was. I quickly cooked up some eggs and served them on top to save the meal. I've always made my chilaquiles with eggs anyway. I also didn't use parm cheese I mean parm cheese? seriously? I crumbled queso fresco instead. I'll stick to my favorite traditional recipe from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jessitlv",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2340752/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T17:32:21.497Z",
                "reviewBody": "not sure why the directions say parmesan cheese when that's not in the ingredients list but if you use the cotija you'll be a happy eater!! YUMMY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allypal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2213860/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-22T20:27:59.347Z",
                "reviewBody": "Never heard of this dish before so I didn't know what to expect. Very very tasty a little on the spicy side (from the chorizo) and not very substantial - more like a thick meatless chili. I followed the recipe exactly used all the optional ingredients but used shredded cheddar. I think I'll make this again as it was very tasty but instead not fry the tortillas (very labor intensive to fry them crisp just to turn around and put them in a sauce to soften) OR use the corn tortillas to make enchiladas and pour the sauce over. UPDATE: I wanted to make this had all the ingreds except only flour tortillas. The difference in taste and texture was huge - do not substitute with flour tortillas.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2456451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-23T19:36:20.593Z",
                "reviewBody": "I'd never even heard of this particular dish but it looked good and decided to give it a shot. Like Betty I cannot seem to find corn tortilla's here in Jersey so I too used the chips instead. Just because I had it in the house I poached boneless chicken breasts which I shredded and added to the dish. I always use cocoa powder in my chile and love that layer of flavor not to mention the nice color it gives the sauce so if it sounds strange to anyone give it a go; you won't be sorry. My daughter went nuts over this recipe and immediately gave it five stars. (Update on this recipe: Important and sorry but I forgot to include that I could not find the tomato sauce suggested in the recipe so I used plain sauce and added a bit of cayenne. A friend of mine did use the hot tomato sauce and he was sorry he did. Beware it's quite spicy) Very good JollyRogers and thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-17T23:12:30.717Z",
                "reviewBody": "I made enchiladas and used the essentially used it as the sauce. Super Duper Fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NOVITSKYS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1345455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-02T16:31:14.497Z",
                "reviewBody": "Super delicious!! Layered mine with onions olives and black beans marinated in vinegar plus cilantro. Used cchorizo. Outstanding! Eggs with it would be awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Wille",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/420214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-27T19:52:58.05Z",
                "reviewBody": "Great hearty casserole type dish when one has company! We made it with vegetarian sausage and it turned out wonderful. I would add a little more cocoa powder and would possibly add a layer of black beans marinated in red wine vinegar. Served with sour cream...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "brianita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3236511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-04T17:25:07.093Z",
                "reviewBody": "Delicious. I didn't fry the corn tortillas and instead cooked them in the oven until crispy to make a bit healthier. It worked very well. I also didn't marinate the onions and olives in the vinegar. I just cooked them in with the tortilla mixture as usually don't like vegetables marinated in vinegar. I added the mexican style hot sauce on top as it didn't say where to add it into the recipe. I used soy burger crumbles as my husband is a vegetarian and I also used more taco seasoning that called for (by accident) and was still delicious. Great recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "daisytk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3858693/"
                }
            }
        ]
    }
]