[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/213700/enchiladas-verdes/",
        "name": "Enchiladas Verdes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F03%2F102063987-Enchiladas-Verde-meredith.jpg",
            "width": 650,
            "height": 465
        },
        "datePublished": "2020-06-23T21:51:25.000Z",
        "description": "I learned this recipe from an amazing cook from Puebla. I've been perfecting it for over 15 years and realized that it was time to share it when my foodie friends tried to drink the sauce out of the saucepan. I use the roasted or baked chicken from the grocery store. I did it once only to save time, but found that they are tastier. Be conservative with the cream and the cheese. Do not use sour cream!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "9 enchiladas",
        "recipeIngredient": [
            "2 cloves garlic",
            "3 serrano peppers",
            "2 ¼ pounds small green tomatillos, husks removed",
            "1 cup vegetable oil for frying",
            "9 corn tortillas",
            "3 cups water",
            "4 teaspoons chicken bouillon granules",
            "½ store-bought rotisserie chicken, meat removed and shredded",
            "¼ head iceberg lettuce, shredded",
            "1 cup cilantro leaves",
            "1 (8 ounce) container Mexican crema, crema fresca",
            "1 cup grated cotija cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cover a large griddle with aluminum foil and preheat to medium-high.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook the garlic, serrano peppers, and tomatillos on the hot griddle until toasted and blackened, turning occasionally, about 5 minutes for the garlic, 10 minutes for the peppers, and 15 minutes for the tomatillos. Remove to a bowl and allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a small, deep skillet to 350 degrees F (175 degrees C). Using kitchen tongs, fry the tortillas individually, turning them once. They shouldn't be in the hot oil for more than 5 seconds per side. Remove excess oil with paper towels and keep warm. Remember that the hotter the oil, the less that the tortillas will absorb.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the toasted garlic, serrano peppers, tomatillos, and the water in a blender and blend until smooth; pour into a saucepan over medium heat and bring to a boil. Dissolve the chicken bouillon into the mixture, reduce heat to medium-low, and cook at a simmer until slightly thickened, about 10 minutes. The sauce shouldn't be too thick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Soak three tortillas in the sauce, one at a time, for a few seconds, fill them with shredded chicken, sprinkle the meat with some of the sauce, roll them and place them seam side down on a pasta bowl. Spoon a generous amount of sauce over them and top them with lettuce, cilantro, crema, and cotija cheese. Pour a little more sauce over the whole thing if desired. Repeat the procedure twice more. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "gem"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.65929203539823,
            "ratingCount": 226,
            "itemReviewed": "Enchiladas Verdes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "304.1 calories",
            "carbohydrateContent": "20.8 g",
            "cholesterolContent": "69.6 mg",
            "fatContent": "20.9 g",
            "fiberContent": "4.2 g",
            "proteinContent": "11.6 g",
            "saturatedFatContent": "10.3 g",
            "servingSize": null,
            "sodiumContent": "222.3 mg",
            "sugarContent": "6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-04-28T16:44:08.587Z",
                "reviewBody": "Sooooo good! and easy to prepare. One suggestion broil the tomatillos and garlic instead of doing it on the griddle it only takes a couple min. also if you want to cut calories cook your tortillas with cooking spray on a hot pan, to me they still taste like they've been deep fried. Gracias Gema! Elvira S.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elvira Silva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3516359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-03T17:36:43.96Z",
                "reviewBody": "This comports with my own recipe and is obviously authentic because it calls for CORN tortillas (NOT flour!), cotija cheese, and crema (\"not sour cream\").  If you cannot find cotija cheese and cream at your market, substitute mild parmesan for the former and for the crema, try this: Put a tablespoon of plain yogurt in a cup of milk and let sit for 24 hours.  It works!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GormandJim",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2807323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-19T15:53:00.09Z",
                "reviewBody": "Wow! Better than any dish we have had in a mexican restaurant for sure. I will say that this recipe is a lot of work to prepare as well as to gather the ingredients. We live in a small town and I had to go to several stores in order to find the peppers and the 2 cheeses. I finally located the cheeses at a mexican store. Since there were no instructions to seed the chilis, I used them with the seeds which made the sauce extremely HOT and although the crema helped offset the heat, they are too hot for children or sensitive adults. My husband loved them so much that he is willing to help make them in the future which is a miracle in itself since he does NOT cook. I will definetly make them in the future and will also double the recipe and serve to company. I wouldn't change any of the ingredients or add a thing. This recipe is fantastic as is and believe me, the extra work was well worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rivka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/302428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T18:53:16.05Z",
                "reviewBody": "Fantastic! The recipe itself is nice and simple and the taste is very authentic. I made this as written except I broiled my tomatillos garlic and peppers in the oven removing each as they blackened - just thought it was easier. This sauce also has the potential to be a bit salty for me - I cut the amount of bouillon in half and was thrilled with the outcome so you may want to start with 2 tsp and go up to your taste when the sauce is done. Also note that serranos are spicy so 1 or 2 will do if you are a heat sensitive - I'm not so 3 was perfect. Excellent easy recipe. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyByrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sunnyb/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-04T22:49:04.063Z",
                "reviewBody": "All 4 of my grandparents were born and raised in Jalisco, Mexico. I know authentic Mexican and this recipe is authentic. It is a very time consuming recipe but worth it. My family has always de-seeded their peppers after toasting them on a cast iron griddle or \"comal\".  Cotija is a dry salty cheese. I find Greek Feta to be as salty and crumbly as Cotija - and neither melts. Sometimes I see Mexican Crema in small cans that look similar to Eagle Brand Condensed Milk.Crema is thick but pourable unlike sour cream. You can make crema by simply adding about two teaspoons of buttermilk to one cup of heavy cream and heating it to just about 100° (use a food thermometer). Remove from the heat and let stand in a warm spot overnight. When it has thickened slightly, stir gently and refrigerate until thoroughly chilled and thickened.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris Diaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chris/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T17:02:08.78Z",
                "reviewBody": "This is a keeper! I had only tried something as good in Mexico City. I used table cream (media crema) which tastes more like the real Mexican cream. To save myself some calories I brushed both sizes of the tortillas with olive oil and baked them for 5 to 10 minutes at 350 degrees. The meal was a total success. My neighbors could't have enough. I would definitely make it again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4818031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-08T17:08:19.113Z",
                "reviewBody": "These were the best chicken enchiladas I've had in a long time. I won't be ordering them in restaurants, as these are better - I'll be making them myself! The sauce was so yummy, and so simple to make. Gema is right, light on the cream and cheese brings the flavors of the sauce out. And I love using the deli roasted chicken, makes it very easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lynn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-12T19:23:26.217Z",
                "reviewBody": "This has got to be one of the best mexican recipes that I have ever tried and I live in Texas and eat Tex-Mex often. I made it exactly as the recipe suggested found the cheese at the local grocery store HEB. My teenage daughter has claimed the last two and put them up to take for lunch tomorrow; her favorite part? The cilantro. She says it brings out the other flavors. 11-1-2010 Tried the recipe with tofu that was scrambled in a frying pan with chili powder salt and cumin powder. It was wonderful!! 12-3-2010 I have made this 3 more times now. I definitely recommend adding sauce to the chicken in the enchilada before rolling it up. The sauce is the best part! We tried this one time without the cilantro and it just wasn't as good. All of the ingredients are important to the final taste. We ran out of cotija cheese on the last batch and substituted parmesan cheese; it worked very nicely.7-5-2011We were in a hurry and tried this with a bottled green sauce it just wasn't very good. The sauce in this recipe really is the star of the show. We have also found that 2 serrano peppers work as well as 2 jalapeno peppers. 7-12-15 This has become a go-to for my family. Changes: boil a chicken & use broth to make the sauce; broil veggies to save time; make blue tortillas instead of store bought. These things are time consuming but make for a really awesome tasting product.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ellen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2439214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-24T14:54:48.693Z",
                "reviewBody": "I'm always a fan of doing as much as I can myself to make it more authentic. I buy a whole chicken and boil it. I season it with garlic, salt and onion. After the chicken is boiled let it cool down and then clean it and place all the chicken in a bowl. SAVE THE BROTH!\n\nOnce you do that DOUBLE THE SAUCE!! I really only double the tomatillos and keep around 3-5 serrano peppers. I personally like to boil the tomatillos and peppers but you can also broil them in the oven for a great taste too (cut in half and place the skin side up until browned).\n\nLet the tomatillos and peppers cool down a little and then you want to place into a blender, it usually takes two batches to do this for me. Now, place half of the tomatillos, serranos, cilantro, 1 cup of the chicken broth you just saved!, and half of a white onion. Blend to liquid and place in a sauce pan. Season with salt to taste.\n\nMaking it this way is uhmayzing! I do it all the time and it's how the Mexican side of my family taught me how to make it. If you can buy from a local tortilla shop, you're already much better off than you could be with the store brands. I like the white corn but it's up to you. When you cook the tortillas in oil, it is SOO much easier having someone else help you. I also like to add Queso Fresco cheese inside the enchiladas. We like to make a line where my mom does the tortillas and soaks the oil on the side and then places them in the sauce for me to fill. Cover enchiladas with sauce and 350 for 30 min!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Clayton Barnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4767150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-18T19:56:01.483Z",
                "reviewBody": "followed the directions close as possible while demonstrating in-front of a class but had to make a few alterations. Such as the amount of water i would have used maybe 1 cup maybe less considering after i poured maybe 2 cups it got super liquidy and i had to put cornstarch in to thicken it up. As for the roasting the garlic peppers and tamatillos that went down the drain completely; I had to stick them in the oven after 30 minutes and not seeing much difference. Over all the sauce was good and everyone liked the dish but i would have left out cotija cheese beacuse people were complaining it tasted rubbery (i'm not sure if that's how the cheese is supposed to taste) overall i wouldn't mind making this again only if i didn't have to go out and buy the ingredients.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "caitlin.s",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3906023/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Enchiladas Verdes",
            "description": "An authentic Puebla enchilada recipe!",
            "uploadDate": "2017-09-08T17:38:43.433Z",
            "duration": "PT1M17.5S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F12ffc489-b585-413d-aaf5-f29664b034ac%2F5c621f7b-d202-4c49-b9d6-1959da382f4d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5569388429001"
        }
    }
]