[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235629/sfogliatelle-ricce/",
        "name": "Sfogliatelle Ricce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1099443.jpg",
            "width": 1529,
            "height": 2048
        },
        "datePublished": "2020-06-24T04:50:10.000Z",
        "description": "I searched high and low for a recipe for this delicious pastry, originally prepared only for the aristocratic Renaissance set in Italy. There are only a few recipes online in English, and they assume you know quite about bit about baking or were just wrong. I've tried to simplify the process. It's a challenging recipe that requires a lot of time and some special techniques. Don't be upset if you don't get it right the first time. NOTE: The dough is a formula, so the ingredient measures are weights. It matters. The rest is less critical, so I used volumes.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT6H30M",
        "recipeYield": "16 pastries",
        "recipeIngredient": [
            "12 ⅓ ounces bread flour",
            "5 ⅓ ounces semolina flour",
            "⅓ ounce kosher salt",
            "6 ½ fluid ounces water, or more if needed",
            "⅔ fluid ounce honey",
            "1 ⅔ cups whole-milk ricotta cheese",
            "1 cup water",
            "½ cup white sugar",
            "⅔ cup semolina flour",
            "2 large egg yolks",
            "2 teaspoons vanilla extract",
            "¼ teaspoon ground cinnamon",
            "2 tablespoons finely chopped candied orange peel",
            "½ cup unsalted butter, room temperature",
            "½ cup lard, room temperature",
            "¼ cup confectioners' sugar for dusting"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix bread flour, 5 1/3 ounces semolina flour, and kosher salt together in a large bowl; add water and honey and mix. The dough will be very dry, like pasta. If there is still dry flour after a few minutes of mixing, add up to 2 teaspoons more water to ensure all the flour is moistened.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough onto a counter. Knead a few minutes until the dough is smooth, firm, and not tacky. While firm, the dough must also be workable. Divide the dough into four pieces and flatten. Cover dough with plastic wrap when not working with it. Run each piece through a pasta machine on its widest setting a dozen or so times, folding in half and rotating the sheet 45 degrees each time (see Cook's Note). Dust with flour very sparingly, only if needed to prevent tearing. Repeat with all four pieces. Wrap dough in plastic wrap and refrigerate for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend ricotta cheese in a food processor until smooth. Boil 1 cup of water and stir in the sugar. Sift in the semolina, whisking to avoid clumping. It will immediately thicken up. Reduce heat to low, fold in the ricotta, and cook for another 2 minutes, stirring constantly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pan from heat and return filling to food processor. While processor is running, add egg yolks, one at a time, until fully combined. Add vanilla, cinnamon, and candied orange peel and pulse to mix. Transfer filling to a bowl. Cool to room temperature, cover with plastic wrap, and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide each dough piece into four pieces. Cover dough with plastic wrap. Place clean kitchen towels over a work surface. Lay each sheet of dough on the towels while you roll out the remaining sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Run each piece through the pasta machine on progressively smaller settings until dough is as thin as possible. After running it through the pasta machine, stretch each sheet as wide as you can without tearing. Dough sheets should stretch to three times their original width and be so thin you can see through it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a sheet of parchment paper on a work surface. Melt butter and lard. Place the first sheet of pastry on the parchment. Brush the dough with the butter-lard mixture. Lay the second sheet above the first, overlapping a half-inch or so. Roll the sheets up into a tight cylinder, leaving about an inch to overlap the next sheet. Lay the third dough sheet on the parchment, overlapping the second sheet, and brush with the butter mixture. Continue rolling up the log of dough, repeating until all the dough pieces are brushed with the butter mixture and rolled up. Wrap dough log in the parchment sheet and wrap entirely with plastic wrap; refrigerate for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. Place filling mixture in a pastry bag or a 1 gallon zipper bag with the corner snipped off.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut cylinder of dough into half-inch slices; you should have 16 to 20 pieces. Holding the dough in both hands, use your thumbs to flatten the dough piece from the center outwards. Form flattened slice into a cone shape. Pipe filling into center, close partially, and repeat with remaining dough and filling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until dough turns golden brown and starts to \"peel\" back from the pastries, 20 to 30 minutes. You can baste the pastries a couple of times with the leftover butter and lard mixture during baking, if you like. Dust with confectioners' sugar before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "popperdoogles"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.076923076923077,
            "ratingCount": 13,
            "itemReviewed": "Sfogliatelle Ricce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "270.6 calories",
            "carbohydrateContent": "33.5 g",
            "cholesterolContent": "46.9 mg",
            "fatContent": "13.2 g",
            "fiberContent": "0.9 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "239.5 mg",
            "sugarContent": "9.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-01-23T21:42:58.817Z",
                "reviewBody": "A couple of notes:  I love how allrecipes cleaned up my recipe!  They changed a couple of minor things, though, which I understand.  \n\nSteps 5 and 6 in the directions are a little different that I would do it too, thought it might work as described. However you do it, always keep the dough covered when not working it to keep it from drying. A very light dusting of flour (I just brush the sheets with a flour-covered hand) will keep the sheets from sticking to each other) The way I make the dough roll is just to roll all the dough through the machine til very thin, then one at a time, stretch the dough from one end, brushing with fat and rolling until I get to the end, then start the next piece, overlapping them just enough to keep the sheets together.  This way, the dough doesn't dry out. Either way, you should be able to stretch the dough to at least twice the width it was as a sheet after its last trip through the pasta machine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "popperdoogles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10642435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-09T00:03:33.333Z",
                "reviewBody": "I can buy sfogliatelle ricce from the Italian bakeries where I live, which are made like this recipe. I have to admit that I am not a fan of the baked ricotta filling after having tasted the American version of the sfogliatelle, the lobster tail at Mike's Pastry in Boston. I have searched high and low and cannot find a lobster tail locally, so I resorted to making my own and used this recipe for the dough. The difference between the traditional sfogliatelle ricce and the lobster tail is that the lobster tails are not filled and baked with the ricotta filling, but are instead filled and baked with pate a choux (eclair paste)in order to expand and elongate their shape, which will resemble a lobster's tail. Then, after they cool, they are injected with a creamy filling that is basically diplomat cream (pastry cream mixed with whipped cream). \nI can vouch for the quality of the dough in this recipe, but I did not use the ricotta filling, so I cannot comment on that. I definitely had to add more water, even more than the recommended 2 teaspoons to get the correct consistency. After forming the shells, I filled them with choux paste and baked at 425 F for 10 minutes and at 375 for 10 more minutes. The choux paste forms a hollow cavity that can be filled with anything you desire. I do recommend the diplomat cream, but would try others in the future, such as sweetened mascarpone and whipped cream with chocolate and cherries; a chocolate diplomat cream; or a hazelnut cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SugarMogill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-23T21:57:50.227Z",
                "reviewBody": "YEAH! This is exactly the kind of complicated, multi-step, can't-find-locally kind of recipe I totally geek out on. First off, this was really fun to make. When I sliced into the dough log after it chilled, I exclaimed, \"COOL!\" because it looked like a big fat leek, with all the dough layers visible. I used homemade candied orange peel--with a recipe this fancy, why go halfway? I also don't think I stretched the dough enough after rolling it through the pasta machine. Oh: and rather than rolling the dough immediately after mixing it in the Kitchenaid, I wrapped it in plastic and let it sit on the counter while I made the filling. I did use the extra 2 teaspoons of water and the dough was still very tight; I wanted to give the flour time to absorb the moisture. When I did roll it out, it had a lovely, plastic texture. Like I said, my dough wasn't thin enough because the pastries were very, very crunchy--like the edge of the lasagna noodle that sticks up and gets dried out during baking. It wasn't unpleasant--but I wanted it to be thinner, more tender, like phyllo or strudel pastry. While I should probably just make the recipe again and see what happens, I also think I'd like to try adding just an ounce of fat to the dough to make it more extensible and tender. I didn't use all of the butter-lard mixture, and I some filling left over, which I froze and plan to use in breakfast pastries or for a yeasted coffeecake or something. Thanks for this great-tasting project!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Doughgirl8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doughgirl8/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-27T02:51:27.323Z",
                "reviewBody": "I followed the directions to a T and they came out perfect dough especially. If I had to be critical I might use less vanilla and cinnamon only because i am trying to replicate Libby's in new haven. Dough is easy to make and filling also. I used a blender for the filling and mine might have been too smooth. The rolling of the dough takes some getting used to cause mine kept ripping but it didn't seem to matter. Most important is trying to keep your roll nice and tight so when you cut it the layers won't separate. I watched many YouTube videos before attempting and I would suggest the same. Some are in Italian but all you need to see is the technique for rolling. Also the shaping of the cone takes some practice but once you get one right you'll have it down. Avoid flattening the disc like I saw some videos do you really need a cone shape to have the clam shell shape. Making the candied orange peel was time consuming. Do it the night or even weeks before to save time. Took all day but I've always wanted to make them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Arett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8477008/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-27T07:14:17.06Z",
                "reviewBody": "Definitely a complicated recipe but I consider this a home cooks web site. The directions are not very clear about the size of the dough. If in the end I am supposed to get 20 1/2inch peices then my dough should not be any longer than 10 inches? Mine was at least twice that length. I ended up using all the butter/lard. When I checked on them in the oven they were swimming in grease. I had trouble understanding the \"flatten into a cone\" direction. I had lots of filling left over and was unable to close them but it did not run all over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Ryno's mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15559425/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-22T06:44:38.96Z",
                "reviewBody": "Biggest problem with this recipe is the measurements for the dough. Needed to convert all dough measurements to metric then weigh them out. Dough recipe did produce a finished product as thin as commercial bakeries but used different recipe for balance of batch we made and enjoyed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dennis Cox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2041563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-03-09T00:45:52.09Z",
                "reviewBody": "Third time making sfogliatelle but first time using this recipe. Pretty much followed the recipe. Used my Atlas hand cranked pasta maker down the second thinnest setting. Dough was very easy to work with. Nice crispy crunch as they should have. I make these once a year and always worth the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/25275964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-11-06T02:25:28.137Z",
                "reviewBody": "Delicious. The filling was spectacular in particular and it is NOT necessary for the orange rind to be candied. Fine grating works fine;-) If I were to suggest two improvements indicate the salt measures (at least) in tsp. My salter doesn't measure well at low weights. Also I couldn't initially grasp how to roll the dough but your comment is VERY helpful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pigdog234",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8477753/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-23T08:15:06.357Z",
                "reviewBody": "I've made this many times and this is the best dough recipe I have used so far! Converting everything to metric to get proper weights was time consuming but totally worth it! Now onto the filling. It tastes absolutely amazing but I wish that was by weight as well. It didnt stand up as much as previous batches and I think that's because the ricotta is too much at the state after it's been food processed. I used the amount measured after processing when I should have used that amount prior.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina Van Houten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24765313/"
                }
            }
        ]
    }
]