[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/364/desserts/frozen-desserts/",
                    "name": "Frozen Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16184/desserts/frozen-desserts/sorbet/",
                    "name": "Sorbet Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/86396/mango-sorbet/",
        "name": "Mango Sorbet",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F849985.jpg",
            "width": 1621,
            "height": 1355
        },
        "datePublished": "2005-05-25T00:11:28.000Z",
        "description": "This a great summer sorbet. Hope you enjoy this as much as my family.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H15M",
        "recipeYield": "6 cups",
        "recipeIngredient": [
            "4 fruit, without refuses mangos - peeled, seeded, and cubed",
            "1 cup simple syrup",
            "3 tablespoons fresh lime juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place cubed mango in a food processor, and puree. Pour in simple syrup and lime juice, and puree until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place in an ice cream maker.  Freeze thoroughly.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frozen Dessert Recipes",
            "Sorbet Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindy Chaney"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.663636363636364,
            "ratingCount": 110,
            "itemReviewed": "Mango Sorbet",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "93.8 calories",
            "carbohydrateContent": "24.6 g",
            "cholesterolContent": null,
            "fatContent": "0.2 g",
            "fiberContent": "1.3 g",
            "proteinContent": "0.4 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "2 mg",
            "sugarContent": "10.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-02-23T16:42:07.013Z",
                "reviewBody": "This sorbet is so, so good.  To make simple syrup, I boiled a cup of water and then stirred in a cup of sugar until the sugar was dissolved.  To give it more fruit flavor, I added the lime zest from two limes to the water before I boiled it.  Once the simple syrup was made, I added the lime juice from both limes.  Once it cooled a bit, I put in in the fridge for a while.  I ended up with more than a cup of simple syrup, so I just used a cup of it and am saving the rest to make the recipe again.  Very yummy!  It tastes very fresh.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHIRLEDPEAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whirledpeas/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-08T17:38:19.313Z",
                "reviewBody": "I saw a comment on here about how to make ice cream without the ice cream maker and since I have the exact same problem, I found this on the internet:\n\nMake sure you have a bowl that’s quite wide to use for the churning/freezing process that comes next. \n\nTake your ice cream recipe mixture and carefully pour it into the bowl, then chill in the fridge for up to 2 hours, checking on it after 1 hour. The reason it can take longer than an hour is when a recipe mixture has had cooked ingredients added, therefore thorough chilling will take longer. \n\nTake the bowl out of the fridge and transfer to the freezer for about half an hour. Then check just how much the mixture has frozen - ideally, it should have started to freeze at the edges but not fully through to the centre. \n\nTake the bowl out of the freezer and  beat the ice cream mixture until it’s creamy once again (to dislodge and break up the ice crystals that have formed).\n\nPut it back in the freezer for another half hour, then remove and once again beat with a whisk.\n\nDo this again so that you have beaten the mixture a total of 3 times whilst freezing in between.\n\nPut the mixture back into the freezer for a final time until it’s ready to eat. This can take anything from 30 minutes upwards, depending upon the quantity and type of ice cream you’re making and also how you like the consistency of your ice cream (some people like it softer, some harder).\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Faeli H",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3010818/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-17T03:40:56.973Z",
                "reviewBody": "What a yummy treat! I do have a few comments that may be helpful to others. I used 4 VERY ripe mangos which I thought may be a problem, but it actually helped! Thanks to the extreme ripeness, there was no need for peeling much - just cut it in half and pull out the \"meat.\" I combined all of the ingredients in a blender for easier pouring. I have a 4-qt. ice cream maker, and this recipe filled less than one-fourth of its container. So, it actually required less time then the machine alotted for, so check yours every once and a while. Once the sorbet was done, it was almost like a \"soft serve\" consistency; which we all liked a lot, but if you like your pretty frozen and a bit harder, I suggest letting it freeze in the freezer for quite a while. Finally, I believe this recipe says that it can serve 12, well it definitely cannot. I only ended up with 4 servings, which is perfect for the 4 of us, but if you want more you will need to increase the ingredients. (I guess it is one mango per person :D ). Oh, and one more thing, I used bottled lime juice, not fresh and it was fine. Very tasty, you should definitely give it a shot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinginFL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2181101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-06T17:39:51.06Z",
                "reviewBody": "Mangoes and limes are a match made in heaven.  I've been making a recipe like this for years.  The texture of the sorbet is sublime!  If you can find the jarred mangoes in light syrup (in the refrigerated section of the product dept, usually), you can even skip the simple syrup.  I do usually add a bit of vanilla, too, but this sorbet is my absolute favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wisweetp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sogirl_2/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T21:51:00.03Z",
                "reviewBody": "Just delicious! Creamy and velvety smooth - no hint of graininess or iciness with a beautiful and vibrant color. Delightful and easily identifiable mango flavor simply enhanced with the lime juice - wouldn't have known it was in there had I not made this myself. And because I used a 16 oz. bag of frozen mango chunks (and a half recipe) this was unbelievably fast! I pureed the frozen mango then added the lime juice and syrup which I had chilled in the freezer and continued to puree until smooth. Because the mixture was pretty much frozen (and spoonable!) before it even hit the ice cream maker I don't think I even churned it ten minutes before it was done and nearly ready to eat. As for the lime juice and simple syrup I used the amounts called for in the recipe scaled down to half the recipe and found both to be perfect. Definitely a \"make again\" recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-19T01:20:55.807Z",
                "reviewBody": "This turned out perfect!  It was the first recipe I made with my new ice cream maker.  I viewed tons of recipes and choose this one because of the natural ingredients.  I am cutting back on sugar so I made the simple sugar syrup with 3/4 Cup instead of 1 Cup and 1 Cup water.  I used frozen Mango chunks because the store here was out of fresh.  I thawed them and they pureed perfectly.  I have a new favorite!!!  This is so light and delicious.  The lime really adds the perfect little kick to it.  Not too much, but just a hint.  Next time I am going to cut the sugar back to 1/2 Cup and shoot for using really ripe mangos for natural sweetness.  Definately a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Areesa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2573049/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-01T17:51:25.2Z",
                "reviewBody": "This was SOOOO GOOD!!\nIt took about 4 hours to freeze but once it was frozen it as gone. Didn't make any changes. Just be sure to use ripe to very ripe mangos so you get that sweet mango flavour. Will make again over any other recipe!\n\n#1 in my books",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laurie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/508461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-04T18:50:26.483Z",
                "reviewBody": "Outstanding! I used two large mangoes 3 Tbs symple syrup and 2 Tbsp honey. Juice of whole lime. Very easy to make. Excellent texture. Made just enough for a simple indulgence. Try it with a piece of dark chocolate candy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I Love to Eat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/974767/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-27T18:47:40.547Z",
                "reviewBody": "This is an outstanding recipe. I used about 3/4c simple syrup rather than the full cup due to personal preference. Thank you this is going to become a family favorite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Seattleskybox",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2121350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-03T22:59:24.36Z",
                "reviewBody": "Was a good start but WAY too much sugar for me. I will lessen the sugar next time but keep the rest of the recipe the same.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "PBJenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3205447/"
                }
            }
        ]
    }
]