[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/725/world-cuisine/european/scandinavian/",
                    "name": "Scandinavian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/75135/swedish-sticky-chocolate-cake-kladdkaka/",
        "name": "Swedish Sticky Chocolate Cake (Kladdkaka)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F346729.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2020-07-07T03:45:51.000Z",
        "description": "This is a Swedish recipe for Kladdkaka (Sticky Chocolate Cake), a rich, and gooey chocolate cake. It should serve 8 but at our house it often serves only 2...",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "1 cake",
        "recipeIngredient": [
            "½ cup all-purpose flour",
            "¼ cup unsweetened cocoa powder",
            "1 pinch salt",
            "2 eggs",
            "1 ⅓ cups white sugar",
            "1 tablespoon vanilla extract",
            "½ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 300 degrees F (150 degrees C).  Lightly grease an 8-inch pie plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together the flour, cocoa powder, and salt; set aside.  Stir the eggs into the sugar until smooth.  Add the flour mixture, and stir just until combined.  Pour in the vanilla extract and butter; stir until well combined.  Pour into prepared pie plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake on the lower rack of the preheated oven for 35 minutes, or until the center has slightly set.  Allow cake to cool for 1 hour in the pie plate.  Serve warm, or refrigerate overnight and serve cold.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Scandinavian"
        ],
        "recipeCuisine": [
            "European",
            "Scandinavian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BRUTALPOETESSAN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.590551181102362,
            "ratingCount": 127,
            "itemReviewed": "Swedish Sticky Chocolate Cake (Kladdkaka)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "287.9 calories",
            "carbohydrateContent": "41.1 g",
            "cholesterolContent": "77 mg",
            "fatContent": "13.2 g",
            "fiberContent": "1.1 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "119.5 mg",
            "sugarContent": "33.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-10T05:01:13.677Z",
                "reviewBody": "Absolutely terrific. I am Swedish and have been looking for a way to make Kladdkaka on my own. This is it. I only had a 9\" glass pie plate (rather than 8\" as the recipe calls for) and it worked perfectly. You get a crisp/gooey crust and a sticky, moist inside. Note that the top will sort of collapse and crack as the cake cools. This is normal and authentic! Also, you must let it cool completely or it will just seem runny. Most importantly, for those of you who felt the cake was too liquid: it is all about how you mix the batter. Beat the egg/sugar mixture for a good 5 mns with an electric beater. But stir just a little with a spoon when you mix in the flour mixture and the butter. A total of 30 strokes should do it and it should be by hand. This way, you'll get just the right consistency. Awesome with a bit of freshly whipped cream and a cup of coffee.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Northstar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-11T14:42:05.56Z",
                "reviewBody": "okay, I have to ask!  Did anyone manage to let this cool before getting into it?  I tried hard.  Thought I would just cut it into 8 pieces while still warm.  Then I thought I would just snag a small piece of the crust of 1/8th, and then the fork was in there, and now the bowl is out cause I need to make another one so there will be something when the kids get home!  I used a 9\" light coloured cake pan and sprayed with cooking spray.  No problem at all.  Also cut back on the sugar to 1 cup (to make it a diet cake of course)  :) and it is wonderful.  Thank you so much for this recipe!!! I'm thinking those that did have a problem have most likely over stirred.  Important to just gently rotate with a fork, no electric mixer!!  These are very much like making brownies, so just a little stir to mix will do ya!  Happy baking all!  Lorrie",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2703330/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-29T01:25:40.577Z",
                "reviewBody": "WOW. This is the best cake I've ever tasted! Great recipe! Oh and I also learned that if you cut the recipe in half the result is a delicious batch of brownies!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie Moore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2003058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-07T04:13:38.61Z",
                "reviewBody": "Maybe not the prettiest most perfect looking dessert but that is quite possibly part of its appeal. I made this on a whim needing something for a last minute dessert when time got away from me and I no longer had enough of it left to make what I originally planned. Thanks to AR and its reviews I came across this recipe and was instantly sold. And what a big pay-off for the little time and effort I put into it. It s REALLY gooey when it s warm and granted it does cut more neatly when it s cold but it s sooo much better warm! Reminiscent of a molten chocolate lava cake but in addition to the creamy gooey oozing middle you have a very delicious light crispy almost chocolate wafer-like crust. This was an enormous hit with the boys at the dinner table tonight. They couldn t have cared less I m sure but in addition to a good plotch of whipped cream I prettied it up with fresh red raspberries and the ubiquitous sprig of fresh mint.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-21T01:26:12.227Z",
                "reviewBody": "I exchanged the flour and chocolate in this recipe. So I used 1/2 cup chocolate and 1/4 cup flour. I did this because we are trying to cut white flour in our diets. Plus we are big choclate fans. I followed the rest of this recipe exactly. And it turned out beautifully. I did serve it slightly warm though and it had the texture of a starbucks cake with the gooey center. After it was completely cooled it had the texture of a cross between fudge and brownie. Brownie on the outer edges and fudge on the inside. Overall a definite keeper it is going into my recipe book!! We had this for Valentine's day and we decorated the top with a little whip cream and peppermint candy on top. Since it was warm the peppermints melted slightly and added a nice flavor to the cake.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2293244/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-16T16:59:01.543Z",
                "reviewBody": "I absoultly LOVED this and so did my husband. And your right its doesnt serve 8. We finished it in one night. And i'm tripling the recipe and taking it to work today. Thank you very much theres no reason to alter this at all!!!! I can't say enough good things about it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole Cavanaugh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1432992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-18T03:31:04.2Z",
                "reviewBody": "I followed the instructions exactly as written and it did not turn out. I cooked it until the top was way more than \"just set\" and it was still raw on the inside. It also stuck to the pie plate really bad even though I greased it. It might need to be buttered and floured or something. I tasted a little bit that got cooked and it was pretty good. I doubt I'll make this again though I would rather just make brownies. Thanks anyway.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LORLOR80",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/996353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-25T00:09:36.057Z",
                "reviewBody": "Great Recipe. I'm Swedish too and I can vouch for this recipe being the real traditional deal. Don't hold back on the pinch of salt as it complements the sweetness beautifully. You can also lightly coat the greased form with a mix of bread crumbs and a tiny pinch of salt before you pour the mix for added texture and flavor. 350 degrees at 30 minutes also works well for those that want to bake it at a higher internal temperature.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Børk, Børk!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3636238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-30T15:32:42.837Z",
                "reviewBody": "Wonderful and decadent!! This cake is a cross between a chocolate pudding cake and chewy moist brownies. Heavenly!! Although I am part Swedish I was not familiar with this recipe. I am glad that I came across it when I was researching Swedish recipes. Very quick and easy.I beat the eggs and sugar for 5 minutes as suggested by another reviewer. I used a buttered 7\" glass pie plate and baked it for 30-35 minutes. Be sure to bake on the bottom rack of oven to avoid it from becoming too overdone on top. Wonderful topped with cool whip and drizzled with melted chocolate chips. Best served warm. It has become a part of my favorite recipe collection. Yummy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELFROMHEAVEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1038997/"
                }
            }
        ]
    }
]