[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/57966/crispy-orange-beef/",
        "name": "Crispy Orange Beef",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1028228.jpg",
            "width": 2592,
            "height": 1936
        },
        "datePublished": "2020-06-19T03:09:47.000Z",
        "description": "A delicious crispy and sweet, yet mildly spiced beef stir-fry recipe. Great served with steamed rice and broccoli.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 ½ pounds beef top sirloin, thinly sliced",
            "⅓ cup white sugar",
            "⅓ cup rice wine vinegar",
            "2 tablespoons frozen orange juice concentrate",
            "1 teaspoon salt",
            "1 tablespoon soy sauce",
            "1 cup long grain rice",
            "2 cups water",
            "¼ cup cornstarch",
            "2 teaspoons orange zest",
            "3 tablespoons grated fresh ginger ",
            "1 ½ tablespoons minced garlic",
            "8 broccoli florets, lightly steamed or blanched",
            "2 cups oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Lay beef strips out in a single layer on a baking sheet lined with paper towels. Allow to dry in the refrigerator for 30 minutes. In a small bowl, mix together the sugar, rice vinegar, orange juice concentrate, salt and soy sauce. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, combine rice and water in a medium saucepan. Bring to a boil, then reduce heat to medium-low and simmer for 20 minutes, or until rice is tender. Add more water at the end if necessary.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a wok over medium-high heat. Toss dried beef in cornstarch to coat. Fry in the hot oil in small batches until crispy and golden brown; set aside. Drain all of the oil from the wok except about 1 tablespoon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add orange zest, ginger and garlic to the remaining oil, and cook briefly until fragrant. Add the soy sauce mixture to the wok, bring to a boil, and cook until thick and syrupy, about 5 minutes. Add beef, and heat through, stirring to coat. Serve immediately over steamed rice, and garnish with broccoli.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BEC"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.475095785440613,
            "ratingCount": 1044,
            "itemReviewed": "Crispy Orange Beef",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "507 calories",
            "carbohydrateContent": "59.2 g",
            "cholesterolContent": "60.5 mg",
            "fatContent": "18.7 g",
            "fiberContent": "5.9 g",
            "proteinContent": "27.4 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "651.3 mg",
            "sugarContent": "16.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-02-09T18:12:46.367Z",
                "reviewBody": "I thought this was very good.  but to the others out there criticizing recipes on this site, cant criticize accurately if you change the original recipe.  makes no sense to say its bad or wasnt very good, if you dont first try it the way its supposed to be, because it might have been your changes that made it worse.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsey Davis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1844956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-02T22:40:34.663Z",
                "reviewBody": "The sauce gets 10 stars! Double it! It is amazing, just like the local take out place, even better because I know the quality of the ingredients. I have made this recipe as is, BUT I always reduce  the ginger, that has to be a typo.  I've also added 2 T orange marmalade and cut the vinegar a bit, 1 t sesame oil, 1/2 a teaspoon of Siracha Hot Chili Sauce.  Doing so makes the sauce over the top!!   I've also just made the sauce alone to add to other stir fry's as substituting the beef for chicken breasts, even tofu nuggets. I have learned that to prevent to much  cornstarch from falling into the oil, let the cornstarch covered meat slices rest 10 minutes, then place meat in a pasta colander and shake over the sink, then fry the meat, QUICKLY.. comes out perfect every time.  Then serve topped with a sprinkle of green onion and sesame seeds.  In fact, I often just serve this with  garlic green beans an Jasmine rice, rather than the broccoli. When making your Jasmine rice, saute 1/4 cup of rice in 1 Tablespoon hot oil until golden brown, then add the remaining rice and water to boil, gives a great nutty flavor to boring white rice. Also, \"Fried Rice with Cilantro\" from this site is also great with this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/gia/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T09:07:18.717Z",
                "reviewBody": "Sauce is what makes it great.  Like others, we altered it by: using 1/3 cup orange juice instead of concentrate *and* stirfrying batches with only 1 Tbs of peanut oil each time.  Cuts down on calories and left the meat tender and glossy.  Pretty authentic tasting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RMRPBUTT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/269045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-30T16:03:21.067Z",
                "reviewBody": "I'd have to say that this was the closest you could get to 'authentic' Chinese restaurant food. I followed the suggestion of others and reduced the sugar by half doubled the sauce and left the beef strips sit with the corn starch on them for 10 min. The only thing missing was 'crispy' beef - I let the oil get hot I tried to not overcook the strips and sliced them as thin as possible.They just were not really crispy. Could it be the oil I used - canola? Nevertheless the flavour and tenderness were perfect. On sticky white rice - I was in heaven. Prep time took aprox 90 min. Highly recommended. March 10' tried it again - same result almost all of the starch came off the meat into the hot oil - doesn't stick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1983522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T01:15:17.593Z",
                "reviewBody": "I made this dish for my mom's birthday and it was a hit. I made a few changes that were simple and easy. In my wok I cooked a medley of frozen veggies fresh onion garlic ginger and bean spouts. When that was done I added olive oil to the hot wok and cooked the meat. I bought the already sliced \"stir fry\" beef which proved to be a time saver. After the beef was done I put all the soy sauce mixture in the pan and cooked it until it started to thicken then I added the beef back in. My family loved it and there were arguments over who got to keep the leftovers. Thanks so much for this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MINGMING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/945538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-24T14:32:32.577Z",
                "reviewBody": "Turned out fantastic. I did as others suggested and doubled the sauce while cutting the sugar in half. I also omitted the orange peel as it really didn't need it. Next time I will reduce the vinegar by 25% and use mixed OJ to replace the 25% vinegar omission. Really very good. I will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffin Mom N Garlic Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/domesticgoddess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-03T20:56:41.607Z",
                "reviewBody": "This is a very good recipe. The first time I felt the beef was very bland but once it was added to the orange sauce it was perfect. The second time I fried the beef with flour instead of corn starch and I thought the beef was even better. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JJCOLLUM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1425845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-25T13:23:57.937Z",
                "reviewBody": "I added only 1 TBS of ginger and this was delicous! My husband enjoyed it too. As other's have noted cutting back on the ginger keeps it from overpowering the meat. I can't wait to make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs_Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/copperskillet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-01T22:13:36.28Z",
                "reviewBody": "This recipe got mixed reviews in my household as well. My fiance loved it but I only thought it was pretty good. I didn't like the cornstarch-coated fried beef at ALL so instead I mixed 1 tablespoon of corn starch with 1 tablespoon of soy sauce (for 1lb of meat) tossed the beef in that and then seared the meat in some olive oil on medium-high to high heat. I seasoned it with just a little pepper and a dash of salt. (not too much since I used soy sauce on it). This really locked in the juices. I also added an onion chopped a green pepper chopped some chives coarsely chopped and a dash of red pepper flakes. Remember to double the sauce if you're making 1.5lbs of meat. If you're only making 1lb it's fine as is. Not a bad recipe at all and definitely one I'll make again (have made it three times so far) but it isn't the best I've found.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "calizen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/808386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T21:26:20.827Z",
                "reviewBody": "This was good. I used pre-cubed beef from the grocery to save time. Doubled the sauce to compensate for lots of veggies we were adding. Used 1/3 cup fresh OJ and a few TB of marmalade instead of the concentrate and zest. I needed to add cornstarch to the sauce at the end because it would not thicken and that worked but in the meantime caused the beef to overcook. Other than that a very tasty dish. Oh had a very hard time making the beef \"crispy.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2235098/"
                }
            }
        ]
    }
]