[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/83752/mushroom-stuffed-chicken-breasts-in-a-balsamic-pan-sauce/",
        "name": "Mushroom-Stuffed Chicken Breasts in a Balsamic Pan Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F793576.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "2019-04-04T03:33:37.000Z",
        "description": "When you're shopping, try to find the smaller, more attractive 10- to 12-ounce bone-in, skin-on chicken breasts. The 1-pound ones work fine, too: Just give them a good fist-pounding to flatten them a bit before stuffing (and you may want to split this size between two guests).",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ounce dried mushrooms (the variety of your choice)",
            "4 large garlic cloves",
            "1 pound portobello or white mushrooms, cleaned, stems trimmed, then coarsely chopped",
            "1 teaspoon dried thyme leaves",
            "2 tablespoons olive oil",
            "6 ounces mild goat cheese",
            "1 pinch Salt and pepper, to taste",
            "¼ cup honey",
            "¼ cup balsamic vinegar",
            "8 split skin-on chicken breasts (10 to 12 ounces each), rib bones and excess fat trimmed away with poultry scissors, rinsed and patted dry",
            "1 teaspoon cornstarch dissolved in ",
            "1 tablespoon water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring 1 cup water to a boil. Add dried mushrooms, cover and let stand about 20 minutes. Squeeze dry; strain liquid (a coffee filter is handy for this) and reserve.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a food processor, mince garlic and rehydrated mushrooms. Add fresh mushrooms and thyme; continue to process until all is minced.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a 12-inch skillet over medium-high heat. Add mushroom mixture; saute until nearly all moisture has evaporated, 5 to 7 minutes. Turn off heat, stir in cheese, and season with salt and pepper. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix honey and vinegar in a small bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Adjust oven rack to lowest position and heat oven to 425 degrees.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Set breasts, skin side down, on a large, heavy, lipped cookie sheet. Brush with half of the honey-vinegar; generously salt and pepper. Turn breasts over. Push fingers under skin to make a pocket; stuff with mushroom mixture. Again brush with honey-vinegar and season with salt and pepper. Being careful not to crowd, arrange breasts on cookie sheet so thickest ends point outward. (Can now be covered and refrigerated overnight; return to room temperature before roasting.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast until golden brown, adding water if necessary to keep pan drippings from burning, until a meat thermometer registers 160 degrees in the thickest portion of the largest piece, 30 to 45 minutes. Transfer chicken to a platter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scrape pan juices into a medium saucepan. Add reserved mushroom-soaking liquid and enough water to equal 1 1/2 cups of liquid. Bring to a simmer. Add cornstarch mixture; continue to simmer until it thickens a bit.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange a breast on each of 8 plates; drizzle with sauce, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ben S."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.387096774193548,
            "ratingCount": 31,
            "itemReviewed": "Mushroom-Stuffed Chicken Breasts in a Balsamic Pan Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "422.6 calories",
            "carbohydrateContent": "16.3 g",
            "cholesterolContent": "144.9 mg",
            "fatContent": "15.4 g",
            "fiberContent": "1.2 g",
            "proteinContent": "53.7 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "232.9 mg",
            "sugarContent": "11.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-11-24T17:23:55.423Z",
                "reviewBody": "Soooo good!  I used olives instead of dried mushrooms, rutabagas instead of the fresh mushrooms, 30W motor oil instead of olive oil, Venezuelan beaver cheese instead of goat cheese, and squirrel instead of chicken.      OK, I'm kidding, but really, why do people post how much they love a recipe, then proceed to tell you how they completely changed it?   It cracks me up!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kevin Andrews",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/602954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-08T19:50:07.967Z",
                "reviewBody": "The reason the previous reviewers chicken burned is probably because she altered the ingredients without altering the cooking. Chicken thighs are a lot smaller and need to be cooked on lower heat. (BTW-The recipe DOES state to remove the bone). I made this almost as is except for the addition of re-constituted chopped sun-dried tomatoes that I happened to have on hand to the stuffing mixture. I also did not use dried mushrooms and as a consequence substituted veggie stock for the reserved mushroom stock in the recipe. Perfect recipe. Even my 7 year old loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shelley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1794958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-24T07:06:28.123Z",
                "reviewBody": "I had to change this recipe a bit since I only had fresh mushrooms sherry vinegar instead of balsamic chicken thighs instead of breasts and I wanted more garlic. My hubby said the cheese wasn't too goaty and the mushrooms weren't too strong - it was a nice balance. I would also recommend removing the bone - it's so much easier to eat. The biggest problem I had with this recipe is that well before the chicken was done the skin burnt where it had been stuffed. I will definitely make this or a slight variation again but I think it has to be covered until the last 5-10 minutes to prevent the skin from burning. 4 stars as written 5 stars if the skin didn't burn",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Orgle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1735632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-17T17:06:44.72Z",
                "reviewBody": "This was one of the best meals I have ever eaten! My whole family LOVED it! I plan on making this meal very often. The only thing i did different was to use boneless chicken breasts and I just sliced them almost completely in half to stuff them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3654836/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-15T02:09:38.113Z",
                "reviewBody": "I changed this a lot!!! For the filling only used fresh mushrooms and replaced the goats cheese with Parmesan. I used a chicken breast with no skin which I battered out then put the mushroom stuffing in the middle and rolled up. I then wrapped the rolled chicken in streaky bacon which I basted with the balsamic/honey sauce. Didn't bother with the pan sauce just kept basting the chicken every 10mins or so. It ended up being a very lovely dish. Thanks for the inspiration!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Hot Chilli",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/678930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-24T23:46:03.65Z",
                "reviewBody": "My hubby and I have lost a bunch of weight and we're always looking for new tasty recipes that are within our caloric limits. This recipe totally exceeded my expectations! It was savory flavorful and very very good. I did six smallish chicken breasts. I never cook skin-on breasts so I cut pockets and stuffed the mixture inside the breasts. I didn't use the food processor; I cut the mushrooms by hand. I had some left over so I added it to the sauce I made from the pan drippings. This was AMAZINGLY good and I didn't tweak the recipe itself really at all. I like to try it the way it is written first before I tweak it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MsBee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/msbeecancook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-26T00:35:15.9Z",
                "reviewBody": "I added mozzarella cheese less than a hand full of fresh baby spinach leaves and sun dried tomatoes to the filling. I served the chicken over a bed of mashed potatoes. It was to die for! My boyfriend and I absolutely loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chigal26",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2559857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-23T15:04:59.213Z",
                "reviewBody": "Did this dish for my girlfriend's birthday as she loves goat cheese. Made no change to the recipe - used Lobster dehydrated shrooms. The taste was to die for. Only warning might be to have aluminum foil ready to place on breasts near end of 45 min cooking period. Meat was cooked to perfection but skin was a little more cooked than I'd like. HIGHLY recommended - P.S. Gravy was WONDERFUL!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ron",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1983522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-15T21:43:34.5Z",
                "reviewBody": "This was a fantastic dish and using boneless chicken breasts with the filling stuffed inside them makes for a nice change.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christopher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1612423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T21:23:42.887Z",
                "reviewBody": "This did not turn out well for me. Baking the chicken breast at 425 for that long was like boiling it in its own juices the chicken was hard and over done. The honey balsamic was just a bit off tasting. Will take it off my saved recipes. Maybe I didn't \"get this\" recipe there could be hope for it just not for me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "PeeplesHomes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5780775/"
                }
            }
        ]
    }
]