[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220593/vegan-portobello-stroganoff/",
        "name": "Vegan Portobello Stroganoff",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5414355.jpg",
            "width": 2503,
            "height": 2502
        },
        "datePublished": "2019-04-04T03:51:50.000Z",
        "description": "A vegan version of an old classic. Meaty marinated portobellos give this dish the taste and mouth-feel of the original.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "8 ounces vegan sour cream (such as Tofutti®)",
            "½ cup water",
            "3 tablespoons dried minced onion",
            "2 tablespoons all-purpose flour",
            "2 teaspoons vegan no-beef bouillon",
            "¼ teaspoon garlic powder",
            "¼ teaspoon dried basil",
            "¼ teaspoon ground black pepper",
            "½ cup dry red wine",
            "1 tablespoon olive oil",
            "2 tablespoons soy sauce",
            "1 tablespoon balsamic vinegar",
            "2 cloves garlic, minced",
            "2 large portobello mushroom caps, stems and gills removed",
            "cooking spray",
            "¼ cup water, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk vegan sour cream, 1/2 cup water, minced onion, flour, vegan bouillon, garlic powder, basil, and black pepper in a bowl. Cover and refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk red wine, olive oil, soy sauce, balsamic vinegar, and garlic in another bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange mushroom caps with gill sides up in a baking dish and pour red wine mixture on top. Marinate for 20 minutes, then cover baking dish with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake mushrooms in the preheated oven for 30 minutes. Remove foil, flip mushrooms, and continue baking until very tender, about 10 minutes more. Set aside to cool; dice mushrooms.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a saucepan sprayed with cooking spray over medium heat. Cook and stir mushrooms in sauce pan until lightly browned, about 5 minutes; reduce heat to low.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir sour cream sauce into mushrooms. Continue to cook and stir until thickened, 1 to 2 minutes more. If the sauce becomes too thick, stir in 1/4 cup water.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Percy Lee Owen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.616161616161616,
            "ratingCount": 99,
            "itemReviewed": "Vegan Portobello Stroganoff",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "258.8 calories",
            "carbohydrateContent": "25.9 g",
            "cholesterolContent": null,
            "fatContent": "13.5 g",
            "fiberContent": "0.5 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "778.2 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-05-29T04:48:30.66Z",
                "reviewBody": "I have made this dish a couple of times already. I use all the same ingredients, but I don't follow the directions exactly, because I thought it was a bit complicated with too many bowls, extra time for marinading and an oven. Instead I threw the mushrooms and onion (I use fresh onion) into a deep skillet with the marinade sauce. I sauteed that until it is soft, about 5 minutes, then I add the sour cream sauce and toss for 1-2 minutes like it says. Then I toss in pasta. So much easier like this and it tastes great. I can't say how it compares to the original recipe, but I like the way mine turned out and it is a lot easier for me. The only ingredient I omitted is the wine because I don't have it. My hubby also really likes this and compliments it everytime I make it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hw3023",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4545310/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-01T07:20:22.22Z",
                "reviewBody": "This was a pretty good recipe. If I make it again, I will omit the dried minced onion and use fresh instead. The texture and taste was off putting. Also, I would decrease the wine a bit. I think I would change the way I prepared the dish. Start out with the oil, fresh onion, and mushrooms. cook until softened and lightly browned. Then, add the garlic and wine. Reduce. Next add the rest of the ingredients, and cook until thickened. Much easier and takes less time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DonnaB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21470058/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-12T04:58:31.593Z",
                "reviewBody": "WOW - this was really very good! I made it for a meat-loving dad and brother and they went back not just for seconds but until it was all gone! I'll admit I did cheat a little and not make it vegan I added a little cream cheese to finish it off. I also sauteed some onions in butter. I know I know not the exact recipe but OH so GOOD! This is going to be a regular recipe for me and I will do it vegan. Btw - also did some Shitake mushrooms with it and as others suggested added the marinade into the cream sauce (yes all of it). Absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stirring up Trouble",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7111996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-15T21:33:16.837Z",
                "reviewBody": "My vegan son loved this! I added about 3 tablespoons of the liquid from the mushrooms into the sauce and it made a huge difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lshipley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4582901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-11T00:55:53.62Z",
                "reviewBody": "This is/was a delicious Sunday Dinner today. I used what ingredients were available at my home so substitutions were made. Instead of 8 ounces vegan sour cream I used 3/4 container of Daiya Plain Cream Cheese Style Spread. Instead of 2 teaspoons vegan no-beef bouillon I used 2 tablespoons of soy sauce. Instead of 1 tablespoon balsamic vinegar I used 1 tablespoon cider vinegar. I used the preparation method that hw3023 suggested in which that I threw the mushrooms and onion into a deep skillet with the marinade sauce. I sauteed that until it is soft about 5 minutes then I add the sour cream sauce and toss for 1-2 minutes like it says. Then I toss in pasta. This is an easy delicious comforting dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer N",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2635606/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-07T01:53:15.887Z",
                "reviewBody": "My husband suggested that we should have this recipe once a week---and he is not even a vegetarian much less a vegan. I loved it too. I have to confess that I used regular dairy sour cream because I had some on hand so our version was vegetarian but not vegan. I would like to see the recipe adjusted to actually serve four people. The two of us ate every bite and we are not big eaters. Honestly if I had tried to serve this to four people it would not have been enough. I suggest using four portobello mushrooms and increasing the sauce and the marinade by 50%. Whatever--it's great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy Bacon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8381385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-27T05:22:56.97Z",
                "reviewBody": "Very good! Definitely fulfilled the creamy meaty pasta craving! Next time I will perhaps not add \"all\" of the marinade to the cream sauce. And I will follow the other reviewer's recommendation to add the fresh minced onions to the marinade or saute first. Overall excellent!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris Frankovic Zaroor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4630712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-08T05:39:20.047Z",
                "reviewBody": "This recipe is absolutely fantastic! On a scale of 1-10 my husband gives it a 10. My husband and I both agreed we could eat this every day! I do some modifications because I am gluten sensitive and also need low sodium. I use gluten free fusilli pasta instead of flour I use 2 tablespoons of cornstarch instead of soy sauce I use coconut aminos. I also double the olive oil and balsamic vinegar when cooking the mushrooms because I don't add wine. I use 1/2 of a not-beef natural bouillon cube in the vegan sour cream again to keep sodium down. I also add 1/2 tablespoon of basil for flavor. I use white pepper instead of black pepper ( personal preference). Instead of store bought vegan sour cream I use the recipe online called \"the best vegan sour cream\" from glutenfreeveganpantry.com. I copied the recipe and pasted it below. It works fantastic in this recipe and no need to buy vegan sour cream. I omit the salt out of this recipe to keep the sodium down again personal preference. The best Vegan Sour Cream 1 cup cashews soaked over night cup 2 Tbsp fresh lemon juice tsp sea salt 1 tsp nutritional yeast cup water INSTRUCTIONS Place all ingredients into your blender (I used my Vitamix) Blend on high for 5-7 minutes scraping down the sides as needed until very smooth and creamy. Transfer to a mason jar or other airtight container. NOTES The best vegan sour cream can be stored in your fridge for 1-2 weeks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "my3chi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22025573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-24T02:33:30.783Z",
                "reviewBody": "I forgot the flour but it was still AMAZING. My meat loving family said it was hit! A definite repeat. I highly recommend this dish over tri-colored quinoa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie Murphy Vladimirsky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4634638/"
                }
            }
        ]
    }
]