[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15944/main-dish/curries/",
                    "name": "Curries",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15942/main-dish/curries/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/166485/coconut-curry-lentil-stew-served-over-quinoa/",
        "name": "Coconut-Curry Lentil Stew Served over Quinoa",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1589119.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2019-04-04T03:46:10.000Z",
        "description": "This hardy, flavorful lentil stew is very nutritious and filling. Even my kids love it, which is surprising because they are picky. It is both vegan and gluten-free, so just about everyone can enjoy it. I like to spice mine up with garlic-chile sauce on the side. If you don't grow your own tomatoes, ripe ones can be hard to find. Ask your local produce grocer to set aside their damaged and overripe tomatoes for you when they restock and you can get them for a bargain.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 cups quinoa",
            "3 ½ cups water",
            "1 tablespoon salt",
            "2 tablespoons coconut oil",
            "1 small onion, chopped",
            "6 cloves garlic, minced",
            "5 large tomatoes, chopped",
            "1 cup water",
            "1 (14 ounce) can coconut milk",
            "1 tablespoon molasses",
            "¼ cup coconut powder",
            "1 (4 inch) cinnamon stick",
            "3 tablespoons curry powder",
            "2 tablespoons ground coriander",
            "2 cups red lentils",
            "salt and pepper to taste",
            "1 bunch fresh cilantro, chopped"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Soak the quinoa in a bowl filled with cold water for 5 minutes, then drain using a fine mesh strainer, and rinse with running water. Set the strainer aside so the quinoa can drain, then bring 3 1/2 cups of water and 1 tablespoon of salt to a boil in a saucepan. Stir in the quinoa, cover, and reduce the heat to medium-low. Simmer until the quinoa has absorbed the liquid and is tender, about 15 minutes. Set aside, and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the coconut oil in a large saucepan over medium heat. Add the onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the tomatoes, and cook for 5 minutes more. Pour in the water and coconut milk, and add the molasses, coconut powder, cinnamon, curry powder, and ground coriander. Bring to a simmer over medium-high heat, then stir in the lentils, and cook until just tender, 10 to 15 minutes. Stir frequently as the lentils cook to keep them from sticking. Be careful not to overcook them, as they will quickly loose shape and become a paste.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once the lentils are done, season to taste with salt and pepper, and stir in the chopped cilantro. Serve the lentil stew over a bed of quinoa.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Curries",
            "Vegetarian"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lindsay L."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.360655737704918,
            "ratingCount": 183,
            "itemReviewed": "Coconut-Curry Lentil Stew Served over Quinoa",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "347.3 calories",
            "carbohydrateContent": "45.5 g",
            "cholesterolContent": null,
            "fatContent": "13.5 g",
            "fiberContent": "10.2 g",
            "proteinContent": "14.4 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "601.9 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-11-17T15:57:56.83Z",
                "reviewBody": "Oh my.  YUMMY!  I did make a couple of changes, but this is wonderful!  I added 1 yellow pepper, chopped, and used Garam Masala instead of the invididual spices..about a tsp and a half.  And I used a can of crushed tomatoes instead of fresh, since my garden is a bit slow this year.  I used chicken stock instead of water.  This one will be a regular for me.  \nUPDATE:  I have made this so many times since I first reviewed...at least twice a month.  It was the dish that convinced my carnivorous husband that going veg would be a possibility.  For those who mentioned coconut powder, it is available at Asian markets, but if you cannot find, processing shredded coconut (unsweetened!) for a few seconds will give you a good substitute.  It's best to me with french lentils as they have a really nice meaty texture, and I like over brown basmati rice, but my hubby likes the quinoa.  It's even better left over when the flavors really meld.  LOVE this one!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wisweetp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sogirl_2/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-08T15:12:42.53Z",
                "reviewBody": "I made this again recently and added a few tablespoons of fresh ginger. It really improved it. \nIs it lame that I gave my own recipe five stars? Ha ha ha. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lindsay L.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2702889/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-07T16:34:51.653Z",
                "reviewBody": "I love this recipe.  I can't stop making it.   I thought it needed a bit more crunch, so I tired a couple things and found that dry-roasted pistachios add the perfect texture to it.  I serve it with bowls of cilantro, pistachios, and shredded coconut on the table so people can sprinkle on however much they want of each.  It's a big hit. I also added the extra can of coconut milk, chopped fresh ginger, and a half teaspoon of ground cinnamon in addition to the stick.   To give it some heat, add a few dashes of hot chili sauce--my favorite is Sriracha Hot Chili Sauce, the kind with the rooster on it that you might find at a Chinese or Thai restaurant. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "esthercatherine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3601582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-24T21:17:22.433Z",
                "reviewBody": "This recipe turned out delicious!  I kept the seasonings pretty close to what the recipe called for, being inexperienced in flavor combinations such as this one.  I did have to make some changes though: omitting coconut powder altogether (didnt have any), using brown sugar for the molasses (can't even taste it in there) and using canola oil to saute the onion (didn't have coconut oil either).  The lentils needed more liquid during cooking, so I added an extra can of coconut milk slowly, as needed while cooking.  Oh and I've never used quinoa & couldnt find that either, so I served it over couscous.  It turned out to be an excellent vegan dish!  To the reviewer who said this turned out flavorless: you must be doing something wrong, because it would be hard for it to be more full of flavor.  Yum yum!\nP.S.  The coconut & curry combo reminded me of the \"Bang-Bang chicken & shrimp\" dish from the Cheesecake Factory... I sort of like this one better because it's not as spicy and I think the flavors come together better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "juliemay7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3095983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-28T03:49:02.75Z",
                "reviewBody": "This is a good recipe, but I'm taking off a star because a tablespoon is WAAAY too much salt in this recipe. I had to add another can of coconut milk just to balance out how salty it tasted. \n\nI made this with a few modifications as well. I didn't have any coconut oil or powder, but it tasted fine just using coconut milk and vegetable oil (I'm all about keeping the flavor, but I like to keep things thrifty since I'm a college student). I also added a bit of brown sugar into this and used a 15 oz. can of diced tomatoes (five tomatoes seemed like a bit too much, plus I like the flavor or canned tomatoes in curries..the flavor seems more concentrated and holds up well to all of the spices used in Indian cooking).\n\nI think next time I will add some cayenne pepper to spice this up. Also, if you don't have quinoa ( I couldn't find any) simple white rice works nicely and soaks up all the coconut liquid. It was quite good with these modifications and I didn't break the bank. Also, this is very filling...I could barely finish my first helping! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristy Parker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2415075/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-01T16:34:40.413Z",
                "reviewBody": "I use this site all the time and this is the first recipe that was so good I had to put in a review for the first time. My husband and I have been talking about it all week and we already want to make it again. I didn't use the coconut powder and it turned out perfect...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JRFRAHM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1402613/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-23T01:44:27.05Z",
                "reviewBody": "This was very easy to make.  Needs longer cooking time and about 3 times as much water if using regular brown lentils.  Because of the amounts of spices it tasted a little bitter and dry.  I tried to solve that problem first by adding brown sugar which helped a little.  Then lemon juice from half a lemon, better.  Finally added most of a jar of tomato paste.  That was the winning ingredient.  Made it bright and yummy.  After dinner we went for an hour long walk.  Took a bite of the leftovers and they were way better.  The flavors needed time to blend and the sauce thickened.  Would be worth making ahead of time.  Will definitely make again.  Used one can of tomatoes next time may use two!\n\nWho knew I had already made this before.  I guess I totally forgot.  This time I liked it better.  Here's what accounts for that: used the red lentils rather than brown, used really high quality curry powder.  Topped with toasted unsweetened coconut, cilantro and toasted cashews.  Still needed the tomato paste and would be better with lemon (I see I tried that last time).  Funny I totally forgot this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SYNEVA B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/269718/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-20T18:24:32.733Z",
                "reviewBody": "We love this! My husband and I are not vegitarians - and we LOVE this!  The soft curry flavor fills every recess of the mouth with yum!  We had no idea what coconut powder was, so we just used unsweetened shredded coconut.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "purple-girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2095219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-04T17:12:59.73Z",
                "reviewBody": "Delicious.  I just wanted to keep eating and eating!\nAnd definitely tastes even better the next day... yum!!!\nA note about cooking lentils: adding salt to your lentils before they have finished cooking causes them to harden and take much longer to cook.  This could be why some people have had trouble with their lentils taking so long...mine were done in about 25 minutes.\nSkimming the other reviews, I added bell peppers, chopped fresh ginger, double the molasses (I like sweet curry), and half the coriander.  Adding cashews while serving gave it a fantastic nutty, crunchy, occasional burst of salty goodness.    I think it's safe to say you'll need to double both the water/broth AND the coconut milk in the curry...at least I definitely had to...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Benda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6667256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-18T03:06:54.433Z",
                "reviewBody": "Unfortunately I think it was the quality of the curry powder I chose for this recipe. I'm not sure what makes a good curry powder exactly, only that I was hoping for something that tasted like my favourite Indian restaurant and instead got something spicy-bland. While I love quinoa, I think basmati is the way to go based on texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/letmegetawutwut/"
                }
            }
        ]
    }
]