[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
                    "name": "Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16212/appetizers-and-snacks/snacks/crackers/",
                    "name": "Cracker Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/153167/lavash-cracker-bread/",
        "name": "Lavash Cracker Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6844234.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2019-04-04T03:45:22.000Z",
        "description": "This is identical to the cracker bread sold at delis in large grocery stores that costs six dollars for three big rounds.  You can make it for pennies! I fell it love with it as an appetizer with Harvarti cheese melted on it but with the price of the cheese and lavash we didn't have it much.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H3M",
        "totalTime": "P0DT1H48M",
        "recipeYield": "30 crackers",
        "recipeIngredient": [
            "1 cup lukewarm water",
            "¼ cup whole wheat flour",
            "1 (.25 ounce) envelope active dry yeast",
            "1 teaspoon salt",
            "3 cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the water, whole wheat flour, and yeast until moistened. Mix in the salt and 1 cup of all-purpose flour. Gradually mix in the rest of the flour using a mixer with a dough hook attachment or wooden spoon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the dough comes together, knead in your mixer or on a floured surface for 8 to 10 minutes to make an elastic ball. Add more flour or water if needed to keep dough from getting sticky or too stiff. Pour a little bit of oil in the bowl and turn the dough to coat. Cover and let rise in a warm place until doubled in size, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough and divide into 30 pieces about the size of small walnuts. Rolling the dough into a long log helps to divide it evenly. Roll each piece into a ball and cover with a damp kitchen towel for 30 minutes to rest.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 500 degrees F (260 degrees C). Place a baking sheet on the center rack of the oven so it can preheat at the same time. Do not grease.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll each ball into a circle about 8 inches across. The dough should be paper thin, almost translucent. If they are too thick, they will bubble up like pita breads.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pull out the oven shelf and place as many crackers on your baking sheet as you can fit, 2 or 3. Close the oven and bake for about 3 minutes. The crackers should be lightly browned on the top with small bubbles. You may have to adjust your thickness for the next batch.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Snacks",
            "Cracker Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Betty McCommon"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.617647058823529,
            "ratingCount": 34,
            "itemReviewed": "Lavash Cracker Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "49.6 calories",
            "carbohydrateContent": "10.4 g",
            "cholesterolContent": null,
            "fatContent": "0.2 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "78.2 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-07-16T23:33:02.607Z",
                "reviewBody": "I made the lavash this afternoon and I'm eating some right now. I found the recipe to be clear easy to follow and accurate. I did use whole wheat flour; in fact I used all whole wheat flour as the lavash I typically buy and enjoy is whole grain. My lavash turned out very nutty and crunchy. Although I'm eating it plain right now I see it as an excellent partner for cheese. To Jellylava who had trouble with it sticking when stacked I would suggest using wax paper to separate the lavash pieces. This ought to stop the sticking problem. Although you're probably doing this make sure you flour your rolling pin and work space too. By the way I made a half recipe and it turned out fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2388338/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-24T21:33:22.217Z",
                "reviewBody": "Thank you. This is a wonderful recipe. Unfortunately I didn't have any wheat flour so I just used regular. I also used a pizza stone at 475 for about 5 minutes. They turned out wonderful. I also agree with using havarti cheese on top. Delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Theresa Jensen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2084601/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T18:56:30.933Z",
                "reviewBody": "Great recipe. I didn't have whole wheat flour and used AP - it worked fine. I put about 1T cracked black pepper and 1 T Poppy Seeds in. I was stunned at how thin these would roll out I dusted the top with Kosher salt and used a fork to dock them all over prior to baking. I tried baking on pizza stone and also in a heated ungreased half sheet pan. I preferred the half sheet pan my pizza stone has charred semolina/cornmeal on it and the bread rounds picked up these bits. The next day I put them in a low oven (250) for a couple of minutes to warm them - and they were even better than fresh out of the oven.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kmpublic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3552704/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-26T17:52:23.5Z",
                "reviewBody": "Yah! the recipe has been found! big fan at the deli and now its mine! I used a pasta roller to get perfectly thin! easy peezy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jangogh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3178988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T00:00:21.583Z",
                "reviewBody": "Cracker bread is the perfect name. This is thin and awesomely crunchy. The only change I made was brushing on some olive oil and sprinkling some rosemary before baking. It took me a few tries to get the dough thin enough and it seemed to help letting the dough sit uncovered on the counter for 20 minutes or so. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "becourageous1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4122055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-07T23:55:25.647Z",
                "reviewBody": "Very nice! The only thing I did different was brushing on some olive oil and sprinkling them with sea salt before putting them in the oven. I recommend doing exactly what the recipe says and rolling out ALL the dough paper thin before putting the first batch in the oven. I was scrambling to roll them out between batches; my mistake! Very light crunchy and strong enough to support my boyfriend's super bowl cheese dip!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6072574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-09T18:51:42.15Z",
                "reviewBody": "I made this for the first time today and I am wondering if I will get better at it. The results were delicious but it took me over 5 hours. I couldn't keep up with the rolling in order to get them into the oven and so I ended up rolling the rest of the dough and then turning the oven back on - only the last 10 or so were usable as they had stuck together. I don't know whether to oil them or flour them more to keep them separate and I don't have enough space to lay them all out while waiting so that is why I stacked them. If I try these again I will experiment with using my pasta machine to do the rolling and then cut off sections to bake. In any case it was fun trying and as I said they are delicious. I am eating one right now!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jellylava",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1703390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-12T23:40:12.603Z",
                "reviewBody": "Terrific recipe Betty. For a killer taste try brushing with olive oil and cook over direct heat on the grill. About a minute on each side. The taste is awesome! Lost about half the batch - stuck to the wax paper so might need to sprinkle some flour on the paper while waiting to cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Clang",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5047908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-26T22:51:40.577Z",
                "reviewBody": "These were great! A bit tough to roll out but that may have been due to my kitchen's temperature (it was rather warm when I made these). They tasted great fresh and worked well for the next two days in our lunch boxes. My advise: make sure you have a large amount of counter space for rolling out and make sure your counter is cool (not warm). Edited to add: I tried these again for Thanksgiving with only all-purpose flour... they never rose! I do not think the flour would have made that much of a difference. No clue as to what I did differently but I will try these again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sunsprout",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5664603/"
                }
            }
        ]
    }
]