[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220763/old-world-poppy-seed-roll/",
        "name": "Old World Poppy Seed Roll",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5930435.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-06-19T03:48:01.000Z",
        "description": "Tender, soft, sweet yeast bread swirled with a creamy homemade poppy seed filling. Growing up, my mother and aunts always made this Eastern European bread for Easter and Christmas. Looks complicated, but is easy enough to make for an Old-World treat. I like it best after the second day.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H50M",
        "recipeYield": "2 filled loaves",
        "recipeIngredient": [
            "½ pound poppy seeds",
            "¾ cup white sugar",
            "1 tablespoon butter, melted",
            "1 teaspoon lemon juice",
            "½ cup hot milk",
            "1 (.25 ounce) package active dry yeast",
            "½ cup warm water (100 degrees F/38 degrees C)",
            "2 tablespoons white sugar",
            "2 cups all-purpose flour, or more if needed",
            "½ teaspoon salt",
            "¼ cup butter",
            "1 egg, separated - white reserved"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place poppy seeds into a food processor and process until seeds are ground, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix poppy seeds with 3/4 cup sugar, 1 tablespoon melted butter, lemon juice, and hot milk in a bowl; stir to combine. Cover poppy seed filling and refrigerate while making bread (filling will set up and thicken as it chills).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix yeast with water and 2 tablespoons sugar in a small bowl. Allow to stand until the yeast forms a creamy layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk flour with salt in a bowl; use a pastry cutter to cut 1/4 cup butter into the flour mixture until the mixture resembles coarse crumbs.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour yeast mixture and egg yolk into flour mixture and stir to make a soft dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn dough out onto a floured work surface and knead until smooth and slightly springy, about 5 minutes. If dough is too sticky, knead in more flour, about 2 tablespoons at a time.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut dough into 2 equal pieces. Roll each piece out into a 12x16-inch rectangle.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread half the poppy seed filling over each rectangle, leaving a 1-inch border. Fold the 1-inch border back over the filling on all sides and press down.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pick up the shorter side of a dough rectangle and roll it like a jelly roll; repeat with second rectangle. Pinch ends together or tuck ends under to prevent filling from leaking out.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with parchment paper; place rolls seam sides down on the baking sheet and allow to rise in a warm place until doubled, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat egg white in a bowl until frothy; brush the rolls with beaten egg white.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until dark golden brown on top, 30 to 40 minutes. Remove from oven and cover rolls with a clean kitchen towel until cool to keep crust soft. Cool completely before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Linda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.344444444444444,
            "ratingCount": 90,
            "itemReviewed": "Old World Poppy Seed Roll",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "216.3 calories",
            "carbohydrateContent": "26.8 g",
            "cholesterolContent": "21.8 mg",
            "fatContent": "10.6 g",
            "fiberContent": "1.9 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "109.5 mg",
            "sugarContent": "13.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-11-14T18:22:08.747Z",
                "reviewBody": "I made this recipe at the request of a friend except I used a traditional walnut filling instead of poppyseed because I did not have poppyseeds on hand. The recipe measurements are dead-on accurate. The dough has a brioche type texture. I found it to be soft and sweet and easy to work with. I had no problems rolling it and found that extra flour was not needed (get it, kneaded). During the hour it rested I kept it uncovered in my oven on proof. I would like to make this again using the poppyseed filling and will try substituting half the water out that is called for to make the dough with milk for even richer dough. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "breadbakersam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10278769/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-15T21:56:17.887Z",
                "reviewBody": "This dough is awesome! So easy to work with and turned out great. I cheated on the poppy seed filling and used canned.. But this dough recipe is definitely a keeper",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookinbittie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9567636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-08T14:07:24.743Z",
                "reviewBody": "I used poppy seeds from GFS, and the filling was delicious.  I thought it odd that the recipe did not call for the dough to have a \"first rise\" before forming the loaves.  I don't know if the humid day was a factor, but the dough was so springy that I had a hard time rolling it out to the 12x16 rectangle, and while I stopped to re-read the directions, the dough rested a moment and was easier to roll.  I baked it as directed, and unfortunately, I have more of a poppy seed cracker roll with a delicious filling.  It is not bread-like at all.  If I were to make it again, I would let the dough rise for an hour before rolling out to form the rolls, then let it rise again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Favahome",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1926737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-06T21:03:59.513Z",
                "reviewBody": "Been making makos beigli for 30 years and my husband is Hungarian (among many other Magyar recipes).  This recipe is the best of any I have found  The dough is easy to work with and, yes, I use the canned poppy seed.  I add a table spoon of honey and some grated lemon rind and a teaspoon or so of lemon juice to \"doctor\" the canned poppyseed.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily O'Connor Karolyi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15099124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-03T03:33:03.053Z",
                "reviewBody": "Thank you thank your mother and your aunt! This is indeed the old world recipe. I never thought I would find one better than mine. Until now! Perfection! I love this sweetbread can you tell?;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen's Kitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7596090/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-08T06:56:50.25Z",
                "reviewBody": "I used to buy poppy seed rolls at a local farmer's market...and marvelled at their deliciousness and seeming difficulty to make. I am so glad I found this recipe! A Polish friend requested a poppy roll for Christmas and so I experimented. Found this recipe and (thanks to all the previous reviewers!) tried this one as it had the best ratings and looked easy and sensible as well. Since we have an eggless kitchen I omitted the egg (added a half tb of cornstarch into the dough and rubbed the loaf with butter and cornstarch prior to baking) also used 9oz of poppy seeds 2 tb extra of sugar in both the filling and the dough. It came out amazing! A Russian and a Pole at dinner both told me it was the best poppy seed roll they ever had. I loved it too and made more for presents...definitely a keeper! I'm now experimenting with whole wheat and sourdough versions. Awesome recipe! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "soohum",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10705924/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-01T01:03:39.04Z",
                "reviewBody": "Made this for my father who may not be here next Easter. We always had poppy seed bread on Easter Sunday growing up in NJ. Moving to Fl, changed that. This Recipe was great and the closest I have seen to what I remember as the kid. It hit a home run for me with dad he really loved it.\nI found the recipe very easy especially for someone who relies on her bread maker and has not kneaded dough since 8th grade home economics..... thanks so much for sharing it will be a staple in my holiday bake book!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4444801/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-29T13:53:10.513Z",
                "reviewBody": "This roll tasted delicious I made the recipe exactly how it is stated except cut everything in half because I only wanted one roll.... It also looked rather impressive and wasn't all that hard to make... all the steps in the instructions may look intimidating but it is actually rather easy...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefScharny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3837544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-13T22:10:08.867Z",
                "reviewBody": "This was just incredible!!!!!!!!!!!!! When I saw it was a yeast dough I had second thoughts but it was so easy to put together and the dough came out perfect and trust me I am not any kind of dough expert. I used canned poppy seed filling and used a butter knife to spread it all over the inside to just about 1\" from the edge and it came out so good baked just as the recipe said. This is definitely a KEEPER. THANK YOU for sharing it with the world!!!!! Right up there for holiday traditional sweetbread for us!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rosemarie Place",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2317449/"
                }
            }
        ]
    }
]