[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14521/asian-beef-skewers/",
        "name": "Asian Beef Skewers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F714824.jpg",
            "width": 4608,
            "height": 3456
        },
        "datePublished": "1999-08-24T20:59:02.000Z",
        "description": "Ginger flavored beef skewers are excellent as an appetizer as well as an entree.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H6M",
        "totalTime": "P0DT2H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 tablespoons hoisin sauce",
            "3 tablespoons sherry",
            "¼ cup soy sauce",
            "1 teaspoon barbeque sauce",
            "2 green onions, chopped",
            "2 cloves garlic, minced",
            "1 tablespoon minced fresh ginger root",
            "1 ½ pounds flank steak",
            "skewers"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix together hoisin sauce, sherry, soy sauce, barbeque sauce, green onions, garlic, and ginger.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut flank steak across grain on a diagonal into 1/4 inch slices. Place slices in a 1 gallon resealable plastic bag. Pour hoisin sauce mixture over slices, and mix well. Refrigerate 2 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an outdoor grill for high heat. Discard marinade, and thread steak on skewers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Oil the grill grate. Grill skewers 3 minutes per side, or to desired doneness.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Vivian Chu"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.655954631379962,
            "ratingCount": 529,
            "itemReviewed": "Asian Beef Skewers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "135.5 calories",
            "carbohydrateContent": "6.7 g",
            "cholesterolContent": "25.5 mg",
            "fatContent": "4.9 g",
            "fiberContent": "0.5 g",
            "proteinContent": "14.7 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "812.4 mg",
            "sugarContent": "2.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-03-10T19:20:43.557Z",
                "reviewBody": "OMG! This is Absolutely Amazing! The meat practically \"melts in your mouth\" it comes out so tender and juicy! The marinade and instructions are spot on except for the marinade timing of \"2 hours or overnight\". That leaves a lot of room for interpretation. I would highly recommend a minimum of at least 8 hours and overnight for maximum effect. I used low sodium soy sauce to avoid this being overly salty. I also used 1 Tbsp. of sherry and 2 Tbsp. of rice vinegar so if you don't have sherry you could easily sub that for the whole thing. I would also recommend using a sweet or mild bbq sauce, not anything spicy or smokey. I didn't have fresh ginger on hand so I used a 1/2 tsp. of dry ginger plus a bit of Chinese five spice powder. I poured everything into a ziploc bag and let it go! What could be simpler? The results were nothing less than fabulous and as the submitter states these are excellent as an appetizer or an entree. This recipe is a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-03T19:58:27.153Z",
                "reviewBody": "Wow! This was just like they serve in the restaurants! Loved it. Here are my alterations. Didn't have any sherry so substitued rice vinegar. Was wonderful! Used extra clove of garlic. Marinaded 4 hours and came out perfect- not too salty as some reviewers warned against. I also boiled the remaining marinade (boil at least 3-5 minutes) adding a little soy sauce. I used this sauce on jasmine rice with chopped green onions and it was the perfect match for the beef.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "azarbonne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/293166/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-22T02:21:42.89Z",
                "reviewBody": "THIS WAS DELICIOUS. I only gave four stars though because it was more ingredients and a more expensive cut of meat than a mixture I already use. I use: ROUND STEAK (cut against the grain approx. 1/8 in. thick) fresh minced garlic chopped green onion ground ginger(or oriental '5-spice' powder) chicken broth sherry and soy sauce. I don't think the flank steak fresh ginger Hoisin sauce and bbq sauce did anything MORE for it. Will definitely make again but with my changes; it's cheaper and I think just as good. Oh and I use this same sauce/marinade for the meat for stir-fry made on the stove also(not just for skewers on the grill). It's great cooked and then mixed with (stir-fried) veggies. For chicken it is outstanding also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-16T21:18:31.653Z",
                "reviewBody": "Wow! Outstanding!! I had to make some changes because I didn't have sherry. Used sweet onion and substituted 1/4 tsp. powdered ginger because I didn't have ginger root.I use a grapefruit sliceing knife when I want to slice my meat very thin it works great when meat is slightly frozen. Must slice this very thin. I doubled the marinade to make sure every piece was covered and marinated overnight(steak will thicken a bit from sitting in marinade)Cooked on grill and they were awesome!Don't over cook just need to be slightly browned they cook fast! So much better than restaurants.Thanks Vivian I will be making this alot!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "awesome in tummy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/716910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-07-27T19:18:26.387Z",
                "reviewBody": "I submitted this recipe 10(?) years ago.  I'm glad people are still enjoying it.  The original recipe calls for chinese barbecue sauce or sacha sauce.  It has dried shrimp, garlic and other things in it.  I can only find it at asian stores. I use a brand called Bull Head and you can get it in a 8.5 oz can  I think the editors omitted it because they didn't know what I was talking about.  Ten years ago asian markets weren't as common.  Please try this recipe with sacha sauce!! My kids love it and we can't have a successful BBQ without it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vivian Chu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5934985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-19T07:54:26.03Z",
                "reviewBody": "YUM YUM YUM!! I've tried this recipe several times now and I definitely agree w/using flank steak I've tried tri tip also but didn't hold the flavor as well as well. I felt it very important to use the right meat once i used a quite pricey flank steak then one from a lower end market no comparison! the cheaper flank steak was chewy and wasn't as enjoyable. Stick to a good flank steak! Thanks for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AHN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/413121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-22T02:21:42.747Z",
                "reviewBody": "Wow this is a great recipe. I only cook recipes that have a lots of 5 star reviews. I was excited to try this one. We like things spicy so I added between 1/4 and 1/2 tsp. of hot red chili paste. It gave it just the right spiciness. I also cooked these on our indoor electric grill. I skipped the skewers and just placed the meat directly on the grill. I buy my flank steaks at Costco in a package of three and automatically freeze them in seperate gallon size ziploc bags so I just defrost(mostly) the meat in the fridge overnight remove the meat to my plastic cutting sheet in the morning and make the marinade directly in that bag cut up the meat and throw it in the bag tossing to coat. Anyway it is a superb recipe Thanks Vivian: )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GENELLEB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/388358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-05T14:15:50.42Z",
                "reviewBody": "WOW! These were awesome! I made these twice. First time was for dinner; we loved them but my husband thought they were a little salty. I also forgot to add the green onions the first time. Well the second time I made them was for a barbeque yest. This time I added the green onions and I added half soy sauce and half Yoshida's marinade. They turned out perfect! All the guests were raving. Even the kids kept asking for more \"meat on a stick.\" I HIGHLY recommend this recipe for a bbq get together. They are quick to cook and delicious to eat!!! Thanks for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBACUB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T11:49:15.077Z",
                "reviewBody": "Excellent. Aside from the task of slicing the flank steak thinly (Hint: try slightly freezing it first) this was easy and won raves from my guests. Be sure to let it caramelize on the outside slightly when you grill them; gives them great texture and they taste just like the Chinese restaurant appetizers (BBQ Beef Stick). Recommended for summer cook outs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jw81",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/433659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-27T19:28:59.067Z",
                "reviewBody": "This is an ok recipe. Except I did not understand why the BBQ sauce is in there. I don't understand it. I replaced the BBQ sauce with 4 tablespoons brown sugar and it turned out much more authentic to Japanese and Korean.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "xxxxxxxxxxx",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7329524/"
                }
            }
        ]
    }
]