[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/673/main-dish/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16543/main-dish/pork/pulled-pork/",
                    "name": "Pulled Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25459/north-carolina-style-pulled-pork/",
        "name": "North Carolina-Style Pulled Pork",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2840724.jpg",
            "width": 4128,
            "height": 2322
        },
        "datePublished": "2020-03-05T04:56:37.000Z",
        "description": "This recipe is delicious, especially when smoked with hickory chips on a charcoal grill. A spicy rub and a zesty vinegar sauce turn pork into a North Carolina favorite.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT6H0M",
        "totalTime": "P0DT15H0M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 tablespoon mild paprika",
            "2 teaspoons light brown sugar",
            "1 ½ teaspoons hot paprika",
            "½ teaspoon celery salt",
            "½ teaspoon garlic salt",
            "½ teaspoon dry mustard",
            "½ teaspoon ground black pepper",
            "½ teaspoon onion powder",
            "¼ teaspoon salt",
            "8 pounds pork butt roast",
            "2 cups cider vinegar",
            "1 ⅓ cups water",
            "⅝ cup ketchup",
            "¼ cup firmly packed brown sugar",
            "5 teaspoons salt",
            "4 teaspoons crushed red pepper flakes",
            "1 teaspoon ground black pepper",
            "1 teaspoon ground white pepper",
            "2 pounds hickory wood chips, soaked"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, mix mild paprika, light brown sugar, hot paprika, celery salt, garlic salt, dry mustard, ground black pepper, onion powder, and salt. Rub spice mixture into the roast on all sides. Wrap in plastic wrap, and refrigerate 8 hours, or overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare a grill for indirect heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle a handful of soaked wood over coals, or place in the smoker box of a gas grill.  Place pork butt roast on the grate over a drip pan. Cover grill, and cook pork until pork is tender and shreds easily, about 6 hours. Check hourly, adding fresh coals and hickory chips as necessary to maintain heat and smoke.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pork from heat and place on a cutting board. Allow the meat to cool approximately 15 minutes, then shred into bite-sized pieces using two forks. This requires patience.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, whisk together cider vinegar, water, ketchup, brown sugar, salt, red pepper flakes, black pepper, and white pepper. Continue whisking until brown sugar and salt have dissolved. Place shredded pork and vinegar sauce in a large roasting pan, and stir to coat pork. Serve immediately, or cover and keep warm on the grill for up to one hour until serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pork",
            "Pulled Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Doug"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.533333333333333,
            "ratingCount": 270,
            "itemReviewed": "North Carolina-Style Pulled Pork",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "425.9 calories",
            "carbohydrateContent": "12.1 g",
            "cholesterolContent": "134.9 mg",
            "fatContent": "23.1 g",
            "fiberContent": "0.8 g",
            "proteinContent": "39.1 g",
            "saturatedFatContent": "8.3 g",
            "servingSize": null,
            "sodiumContent": "1698.4 mg",
            "sugarContent": "10.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-20T04:13:52.293Z",
                "reviewBody": "Okay, I'm a born and raised NC girl.  I've been away for 4 years and crave BBQ daily.  I decided to make this to see what I got.  I used 4 pounds of pork shoulder, boneless, so I halved the recipe.  I did the rub exactly as is and marinated it overnight.  The next morning, I made up the sauce exactly as written, halved for the amount of pork.  After tasting it, I decided it needed more brown sugar so I added 2 more tablespoons.  I put half of the sauce and the pork in my slow cooker and cooked it for 8 hours.  I then took the pork out, let it cool and then shredded it.  (It was already falling apart.)  I used a large spoon to take all of the fatty oil off of the good bits in the bottom of the slow cooker, and then I added the rest of the sauce, in addition with about 1/4 cup more brown sugar.  I then put the pork back in.  That is EXACTLY what I grew up eating, and my husband, a NC boy, completely agrees!  I am so happy, I can't begin to tell you!!!  Thank you SO much for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amber Powell Nawa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2539878/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:16:25.983Z",
                "reviewBody": "We love North Carolina barbeque and have been looking for a recipe for a long time.  This is a good one.  I did make some changes though, as I was cooking it in the oven.  Before I used the rub I stabbed the pork to make some slits in the meat.  Then I put a tablespoon of liquid smoke on top and bottom of the meat.  Then I used the rub.  I wrapped the pork in heavy foil and put it in the refrig all day.  Before I went to bed I preheated the oven to 350 degrees.  Then I put the foil-wrapped pork in a pan in the oven overnight.  By seven the next morning it was smelling wonderful and the meat was falling off the bone.  I let it sit for about an hour and then shredded the meat.  The fat just fell away leaving all that wonderful pork.  As for the sauce, I thought it had a very strong vinegar flavor, so I added more brown sugar (a 1/4 cup at a time) until it tasted as I thought it should.  Totally, I put in 1-1/4 cups of brown sugar.  I also heated the sauce on the stove top until the sugar disolved.  I also added 2 tablespoons of liquid smoke to the sauce.  Then I mixed the pork into the sauce and let the whole thing simmer for about a half hour.  Wonderful flavor.  Tasted just like what we remembered from Lexington.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ADLEVINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/19821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-29T23:02:16.327Z",
                "reviewBody": "This is the 3rd time I've made this and my family loves it. I decided to cook the pork in a crockpot. I added 2 T. of salt and 2 T. of Liquid Smoke and cooked it on High for 8 hours. I then made the existing sauce recipe. With a 5-1/2 lb. pork butt using a single recipe the meat soaked up all the sauce. Next time I will double the sauce. I omitted the salt since I put it on the meat before cooking. I also reduced the red pepper to 2 tsp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUKLIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1336064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-12T18:29:00.043Z",
                "reviewBody": "I cooked this in the crockpot on low overnight with the addition of some liquid smoke. It was so easy to make a just wonderful. I'll never use another recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1035264/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-15T05:06:21.187Z",
                "reviewBody": "PLEASE READ THIS AND CHECK OUT ADLEVINE's 2003 REVIEW...I've been making this for almost two years and thanks to ADLEVINE (a reviewer in 1/2003) it was a hit from the beginning! I omit the liquid smoke hot paprika and white pepper and cook all day (6-7 hours)in the oven at 325 COVERED WITH TIN FOIL. Simmer for about an hour in the sauce. Also I'm too lazy to \"rub the butt\" the night before so I just do it right before I put it in the oven. Believe me even with these lazy changes I can call my friends at work while the ham is in the oven (I'm a homemaker) and they'll come running to my house when they get out! They even pick up the rolls themselves! Reheats awesome; even brought a baggie full on a river trip and ate it cold - a great snack!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rachelguerrero1740",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/703774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-29T15:18:42.967Z",
                "reviewBody": "This recipe is identical to the one found in 'The Barbecue Bible' by Steven Raichlen (Workman Press). I smoke a 5.5lb Boston butt in a offset horizontal smoker (Chargriller with side fire box) an hour per pound at 300 degrees with a mix of hickory and cherry chips until internal temp of 195. Contrary to other comments it does NOT turn into jerky at this temp if done correctly using a smoker. In an oven it may dry out at this temp. Some tips- instead of 2 cups of vinegar start with one and adjust to taste; also Raichlen includes a recipe for Carolina Cole Slaw to use as a side. Finely shred a head of cabbage with a mandolin and coat with 1 cup of vinegar sauce. Mound the pork on a grilled hamburger bun top with slaw and enjoy. Simply delicious- but no amount of liquid smoke will replicate the results of a bona fide charcoal smoker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IHalliday76",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2184907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-03T03:18:37.25Z",
                "reviewBody": "This was good. I was really looking for an Eastern NC style barbeque and it is almost there. I did as others suggested by decreasing the vinegar and adding more brown sugar but I wish I had not. I found the meat more sweet than what I wanted and without the zing of the vingear.I also added liquid smoke to the roast before cooking since I was not smoking it. I cooked mine for 8hrs on low in the crock pot with 1/2 the sauce and then pulled the meat out to cool. I drained the sauce which has a good amount of oil from the fat. After shredding the meat- it most fell right off the bone I put the meat back in the crock pot and pour the remaining sauce over. I will definitely make again but will add more than 1 cup of vinegar as so many reviewers mentioned. I think it really depends on how sweet you like barbeque. I am giving the recipe 5 stars because I think if I had followed the recipe it would have been closer to what I wanted:) Thanks! It was so moist and flavorful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Durham Byrd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1836757/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-21T02:06:22.357Z",
                "reviewBody": "Unfortunately I didn't read the reviews before I made this and used the full 2 cups of vinegar which pretty much ruined a good thing. I love vinegar but this was way too much in my opinion. But the meat was very tender and very tasty right after it was done cooking in the spices. I will make this again but will try cutting the vinegar in half (at least) and adding more ketchup and brown sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DARLISS00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1319197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-13T11:45:10.797Z",
                "reviewBody": "We lived in Suffolk VA when my husband was in the Navy and pulled pork sandwiches with cole slaw were everywhere. Back here in Pa - they have no clue what BBQ pork is. Found this recipie and made it for our VFW (using 4 six pound rump roasts) and everyone raved. This is the only recipe you will ever need for pulled pork. Don't forget to top your sandwich with good coleslaw - you'll never want it any other way. UPDATE: just finished making this again using leftover pork roast and the sauce is amazing! Upset that some reviewers cut vinegar/pepper flakes and others added bottled sauce. This is true Southern pulled pork and it is perfect. If you want BBQ pork with a thick sauce (like BBQ ham sandwiches) like they serve up north this is not the recipe for you. Please don't rate it badly simply because you are not familiar with Southern pulled pork.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3117541/"
                }
            }
        ]
    }
]