[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/109/appetizers-and-snacks/vegetable/",
                    "name": "Vegetable",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1241/appetizers-and-snacks/vegetable/jalapeno-poppers/",
                    "name": "Jalapeno Popper Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/77625/deer-poppers/",
        "name": "Deer Poppers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3073162.jpg",
            "width": 1704,
            "height": 1703
        },
        "datePublished": "2019-04-02T06:46:53.000Z",
        "description": "I recently took these to a Halloween party and they did not make it to the barn where the party was at! I bet 15 people asked me for the recipe. If you don't like the gamey taste of deer meat this recipe is for you!! These make great appetizers. Even people who don't like deer meat liked these!",
        "prepTime": null,
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "20 appetizers",
        "recipeIngredient": [
            "1 pound venison steaks, cubed",
            "½ teaspoon Greek seasoning, or to taste",
            "¼ teaspoon steak seasoning, or to taste",
            "1 (16 ounce) bottle Italian salad dressing",
            "½ cup jalapeno pepper slices",
            "10 slices bacon, cut in half",
            "toothpicks, soaked in water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season the venison meat with Greek seasoning and steak seasoning. Place in a bowl, and pour in enough Italian dressing to cover. Refrigerate for at least 2 hours to marinate, but preferably overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the grill for medium heat.  Drain the marinade from the meat, and discard the marinade. Place a slice of jalapeno on top of a piece of meat, then wrap with a slice of bacon. Secure with a soaked toothpick. Repeat with remaining meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grill the deer poppers for 15 to 20 minutes, turning occasionally to brown the bacon. Serve and enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Vegetable",
            "Jalapeno Popper Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DJ8BUD"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.853146853146853,
            "ratingCount": 143,
            "itemReviewed": "Deer Poppers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "307.8 calories",
            "carbohydrateContent": "5.1 g",
            "cholesterolContent": "53.3 mg",
            "fatContent": "26.3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "12.7 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "1029 mg",
            "sugarContent": "3.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-09T14:56:44.353Z",
                "reviewBody": "I really enjoyed the process of making this dish. While you are preparing the meal you should put in a good CD ( I chose The Gipsy Kings ) and have a beer or a glass of wine. I have a wife who does not like \"gamey\" tasting deer meat and I promised that I would find a way that she would eat the meat. This was it without a doubt! The meat was tender and tasty. I modified the recipe a little because I added a slice of onion in the preparation and instead of tooth picks I just put the poppers on a kabob skewer. My wife doesn t like Bacon much either (too much fat) so instead of wrapping her pieces in Bacon I just laid it on top of her skewer while I grilled them then removed the bacon before serving. I complimented the poppers with a side dish comprised of heated Caned Corn Black Beans red onions and Avocado as well as a baked potato. Everything was perfect along with a beer for me and a glass of Shiraz for my wife. Hope you enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "texas wild hair",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2241689/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-27T20:52:20.447Z",
                "reviewBody": "Clearly for the \"don't like the taste of deer\" crowd.  I would suggest any more subtle marinade than italian dressing.  The venison and jalapenos work, the bacon and italian dressing smother the deer steak.  If you don't like the taste of venison, eat beef or pork! A great waste of good venison.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "cooknman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859905/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-25T00:47:35.217Z",
                "reviewBody": "I can not rave enough about this recipe. Most of our meals consist of deer meat and this was one of the best. I did reverse some steps and make a few alterations. I left out the Greek and steak seasonings marinated the jalapeno slices with the meat put the jalapeno slice on top of the bacon rolled venison( this makes it easier to be removed and looks good on the serving tray) Then I lightly sprinkled with Montreal seasoning and baked at 400 degrees for ten minutes and then crisped them up in the broiler. Thanks DJ8BUD",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melody Wells Casteel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1434579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-18T13:03:42.967Z",
                "reviewBody": "Oh my gosh! Absolutely wonderful! I used venison round steak. I cut it in chunks taking off all of that \"white stuff\". I used Wish-Bone Robusto Italian dressing with a couple squirts of A1 Chicago Steakhouse liquid marinade as I did not have \"steak seasoning\" on hand. I used thick sliced bacon and de-seeded the peppers then sliced them into thin slices to reduce the \"heat\". I used a Weber charcoal grill...make sure you lower the heat. You do not want the bacon to burn. Also one more tip: If you forget to soak your toothpicks just put them in a cup of water and micowave for a few minutes! Everyone loved them! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Geri Ann Hilaski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1711572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-28T00:22:31.227Z",
                "reviewBody": "I was looking for a new way to cook venison as an appetizer this was a winner! Have made it for 2 different gatherings and both times they were gobbled up in a matter of minutes. I also used with elk and made some with bell peppers for those who were worried about the heat of the jalepenos. Both were delicious - thank you so much for the great recipe I'll make these again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WILMAJEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/119952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-22T16:28:14.117Z",
                "reviewBody": "I made these and they were great! I even had \"a few\" leftover and they were just as good the next day. I did half according to the recipe and then the remaining I added Pepper Jack cheese to and left off the Jalepeno pepper. Everyone loved it and wanted the recipe... even people that do not like wild game. They couldn't tell the difference and said they would make it anyways because they were so good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUGGIE524",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1441760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-05T14:25:28.453Z",
                "reviewBody": "These were the hit of the superbowl party. Only one problem I did not make enough. Oops! Even my hunter fiancee who does not eat venison ate them every time he went into the kitchen. I did heat some grape jelly to dip in. Was very good. Will be making these often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2210674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-13T14:33:25.737Z",
                "reviewBody": "My brother is the hunter and gives me back-strap every year. I usually make a stew or just cut it up and stir fry it on the stove top for wraps. i Wanted to grill it and found this recipe and since my garden is overrun with jalapenos I gave it a try. I cut my meat into 2 by 3 inch chunks and marinated them for about ten hours. I used the exact marinade and spices except I also used a few dashes of Teriyaki sauce. I used a whole piece of bacon to wrap with and put a jalapeno slice on one side of the meat and on the other a slice of sweet onion and wrapped tightly pretty much covering the whole chunk of meat. We grilled on charcoal with a direct side and indirect heat side that way we could move the pieces that were done first to the indirect side while working on the ones that still needed to cook more. Turn these constantly while cooking and be careful because bacon drippings will send up some flames once in awhile. Once the bacon was pretty crispy and even getting a bit blackened we removed them from the heat. It took about 20 - 30 minutes for each over medium high coals to cook depending on their size. Oh wow... were these ever tender and tasty and even the bacon was cooked to perfection. The jalapeno gave just enough spice not too much. I will be telling my bro about this one. We served this with Coleslaw with a kick here on AR was a perfect match together.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-21T16:11:46.79Z",
                "reviewBody": "Wow! I served these at a party and everyone ate them(not knowing what they were) when I told them they were astounded and all wanted the recipe. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhonda Brock Fuller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/890457/"
                }
            }
        ]
    }
]