[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/702/world-cuisine/asian/thai/",
                    "name": "Thai",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/90294/thai-chicken-satay/",
        "name": "Thai Chicken Satay",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3638371.jpg",
            "width": 2272,
            "height": 2272
        },
        "datePublished": "2019-04-02T06:47:55.000Z",
        "description": "The closest to my favorite satay served at my Thai restaurant. Prep is quick- best if left to marinade for a few hours or more.  Skewer up for the grill or saute on the stove! I buy the chicken tenderloin strips which are already boned, skinned and a nice size piece without slicing to save time.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ cup canned coconut milk",
            "1 ½ teaspoons ground coriander",
            "1 teaspoon yellow curry powder",
            "1 teaspoon fish sauce",
            "½ teaspoon chili oil",
            "1 pound skinless, boneless chicken breast halves - cut into strips",
            "1 tablespoon chopped fresh cilantro",
            "1 tablespoon chopped unsalted peanuts",
            "12 wooden skewers, soaked in water for 15 minutes",
            "1 cup prepared Thai peanut sauce"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together the coconut milk, ground coriander, curry powder, fish sauce, and chili oil. Add the chicken breast strips, and stir to coat. Cover, and refrigerate for at least 30 minutes, and up to 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat an indoor or outdoor grill for high heat. Thread the chicken strips onto skewers. Discard marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grill chicken for 2 to 3 minutes per side, until no longer pink. Time will depend on how thick your strips are. Transfer to a serving plate, and garnish with cilantro and peanuts. Serve with peanut sauce for dipping.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Thai"
        ],
        "recipeCuisine": [
            "Asian",
            "Thai"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "STACEYLYNN0822"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.354838709677419,
            "ratingCount": 62,
            "itemReviewed": "Thai Chicken Satay",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "390.7 calories",
            "carbohydrateContent": "9.3 g",
            "cholesterolContent": "65.9 mg",
            "fatContent": "25 g",
            "fiberContent": "3 g",
            "proteinContent": "35.4 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "314.7 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-21T21:12:31.393Z",
                "reviewBody": "We were feeding 11 people with this recipe so used 4 pounds of chicken breasts and had enough marinade without doubling it. After making the marinade as stated in the recipe, I thought that it was a bit bland for our liking so I added some ingredients.  To the marinade I added 1 tablespoon sesame oil, 1 tablespoon soy sauce, 1 tablespoon light brown sugar, 1 tablespoon hot pepper sauce, 2 cloves chopped garlic and 2 teaspoons lime juice. I stirred it up, put in the chicken breasts (cut into strips), and let the marinating chicken sit in the refrigerator, in a covered bowl, for six hours. In the meantime I soaked the skewers in water so they wouldn't burn on our gas grill. After marinating for 6 hours, I put the meat on the skewers (ending up with 40 skewers), and grilled them in our gas grill, on medium high heat, on a piece of heavy duty foil (lightly sprayed with cooking spray). They came out golden brown as well as tender and juicy.  We served these with Thai curry rice, fresh string beans from the farmer's market and \"The Best Thai Peanut Sauce\" (also on this site - awesome 'as is'). The meal was a big hit...delicious! the reason I only gave it 4 stars instead of 5 is because of the changes made to the recipe. I will definitely be making this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah MJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sweetiesmj/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-28T23:23:23.52Z",
                "reviewBody": "I'm not a Thai expert but I think this recipe turned out great. I only made a couple of modifications...I used soy sauce in place of the fish sauce as it's not something I keep around. I also didn't have chili oil so I used a pinch of red pepper flakes. I used chicken tenders and didn't skewer them...mine marinated for about 2 days (I trim meat and put it in marinade when I get home from the store and then freeze or refrigerate). I cooked my under the broiler for about 4 minutes per side. Very moist and tender and full of flavor. I didn't use the garnishes but there is cilantro in the peanut sauce I made. \"The Best Thai Peanut Sauce\"...see my reviews for notes on modifications I used for that recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-06T00:43:52.52Z",
                "reviewBody": "I made this recently to entertain and the prep was very well suited for it. By marinading then skewering the chickend pieces I was able to tackle other dishes and throw these on the grill right when people were ready to eat. I don't keep fish sauce around muh, so substituted soy sauce - It worked out perfectly fine with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ERock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2282871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-29T20:25:04.017Z",
                "reviewBody": "This satisfied our craving for satay. I didnt have all the ingredients so I substituted but kept it as close as possible. I cooked it in a pan with the marinade instead of grilling because I didn't have skewers - It was really good but I think grilling or baking would be better. My children didn't like it which was fine because my husband and I ate it all. I served with homemade fried noodles and a peanut sauce from this site. Added: I have grilled the chicken on skewers and it is amazingly better really really good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "twistedsisterl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2207517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T19:28:25.82Z",
                "reviewBody": "I followed this recipe very closely but as it's the middle of the winter I cooked the chicken on the stove in a skillet. I imagine that it's tastier when grilled but I have to tell you this was absolutely to die for even with the change. When the chicken was almost done sauteing I threw in some frozen green beans so they'd pick up some of the sauce. I served it with \"Thai Peanut Butter Sauce\" over rice. My boyfriend said that he would have paid for a meal like this. Soooo good! Thank you for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ilkaisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ilkaisha/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T06:41:47.977Z",
                "reviewBody": "I added to this. I added Champanions(spelling) Corn Cuts & water chestnuts. I did add more curry paste & added garlic. I served this with Thin Noodles. Was Delish!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jae77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2194106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-26T04:44:51.247Z",
                "reviewBody": "YUM! I used the Peanut Sauce 1 recipe but cut it in half for my family of 5 and it was plenty. Also don't leave out the cilantro. It truly adds a delicious touch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TIANAYUM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1281930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-02T23:48:14.403Z",
                "reviewBody": "Super good and easy to make! It tastes like the chicken satay at Cheeseburger in Paradise. Can't tell the difference. I served with coconut rice which is super good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIDI402",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1163874/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-24T01:06:01.577Z",
                "reviewBody": "My boyfriend makes this twice a month at least. It's wonderful! I like it so much that I asked him to make it for my office where it quickly disappeared. The only difference between how he makes it and how the recipe is written is that he doesn't use the skewer (which helped it keep pretty well in the buffet setting on our slow cooker when I took it to work). Sometimes we add chopped up sweet peppers too. That adds a nice relief from the heat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danielle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2198798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-24T19:38:53.387Z",
                "reviewBody": "Marinated for almost 24 hrs. Came out flavorful and like satay I've had in restaurants. But I kinda wanted it to be even more packed with flavor since it marinated for so long. Very messy putting onto skewers so be prepared for that. Don't cut too thin or it won't thread onto the skewers. I broiled mine - actually first time ever using the broiler! it came out a bit dry - so I probably overcooked. But it was yummy and there were no leftovers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Melanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/925986/"
                }
            }
        ]
    }
]