[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/168941/sicilian-homemade-ricotta-cheese/",
        "name": "Sicilian Homemade Ricotta Cheese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3596869.jpg",
            "width": 1843,
            "height": 1843
        },
        "datePublished": "2014-07-10T06:00:29.000Z",
        "description": "This is a recipe for my Sicilian grandmother's creamy homemade ricotta cheese. Great as a spread on fresh bread or add as a topping to fresh Pasta.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "5 cups",
        "recipeIngredient": [
            "1 gallon whole milk",
            "1 quart buttermilk",
            "1 pint heavy cream",
            "1 tablespoon kosher salt",
            "18-inch squares cheesecloth"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a large colander or sieve with 4 layers of cheesecloth. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat milk, buttermilk, heavy cream, and salt in a large, heavy, nonreactive saucepan over medium-low heat, stirring occasionally for the first 10 minutes. Continue heating, without stirring, until the temperature reaches 190 degrees F. Remove from heat and let stand for 1 hour. The mixture will be separated into white curds and clear whey.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using a slotted spoon, ladle approximately 1/4 of the curds into the cheesecloth-lined colander.  Gather up the corners of the top cheesecloth and secure closed with a zip tie. Repeat with the rest of the curds, cheesecloth, and zip ties. Use the last zip tie to thread all of the cheeses together. Suspend the cheeses over a large wooden spoon over a large bowl, and let drain for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the four cheeses, still in cloth, in a bowl in the refrigerator overnight. In the morning, cut zip ties, and transfer cheese to an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Orcashottie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.75,
            "ratingCount": 68,
            "itemReviewed": "Sicilian Homemade Ricotta Cheese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "218.8 calories",
            "carbohydrateContent": "11.8 g",
            "cholesterolContent": "54.1 mg",
            "fatContent": "15.6 g",
            "fiberContent": null,
            "proteinContent": "8.4 g",
            "saturatedFatContent": "9.4 g",
            "servingSize": null,
            "sodiumContent": "426.6 mg",
            "sugarContent": "11.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-16T06:29:55.263Z",
                "reviewBody": "Here are some tips I found out:\n1. A nonreactive saucepan refers to using  any type of pot except aluminum and copper which would react with the acids in the milk; a heavy-bottomed pot is prefered to help prevent burning of the curds. 2. After the ricotta is made it can be stored up to 5-7 days, but may NOT be frozen; if it smells rancid then throw it out.\n3. When you drain the ricotta in the cheesecloth, the longer you drain it the drier it will be, and the less you drain it the creamier it will be.\n4. If you don't have a thermometer, then keep an eye on the cooking mixture until it separates into curds and whey (the milk has reached it's boiling point/scalding); remove from heat and either let the mixture cool/settle a bit, or scoop out the curds with a slotted spoon. UPDATE: The curds and whey separated nicely.  I let the cheese cool down first, then I ladled the whey into a large bowl, and then I used a small colander to scoop out the curds into a clean dish cloth (I didn't have the cheese cloth on hand). Now it's hanging over the sink to drain and then I will refrigerate it over night.  I tasted the ricotta and it tastes fresher than when you buy it at the store. This recipe is definitely a keeper.  Thanks for sharing a classic, Orcashottie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rosabela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2659423/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-27T00:04:38.657Z",
                "reviewBody": "I didn't have the cream, but made ricotta for the first time in my 70+ years. It's delicious and I'll make lasagna and use part of the ricotta tomorrow. \n\nThe whey looked so nutritious and I decided to make a pot of potato/corn/carrot soup with it. I sauteed onions, celery, garlic, added carrots, potatoes, frozen corn and seasonings. It's healthy and very good. \n\nNow I just have to find hungry people to help eat it. Thank you for this wonderful recipe. Next time, I'll be sure to use the cream. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3001648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-14T12:22:01.913Z",
                "reviewBody": "I'd say this will yeild about 2 lbs of cheese. You can freeze your whey in cup containers, use it in pancakes/waffles, muffins and bread. Anywhere a recipe calls for water. Be creative, it's worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy Fecko-Gallina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2020719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-14T15:20:21.887Z",
                "reviewBody": "I had some leftover whole milk (about 2 C), buttermilk (about 1 1/2 C) and heavy cream (about 1 C) so I impulsively made this throwing in 1 tsp kosher salt.  I accidentally let the mixture rise above 200 degrees.  Even so, it curdled just fine.  It was delicious!  We used it as a spread on homemade potato bread.  It seems I always have a little bit of these various milks waiting to spoil in the fridge.  Now I know what I can do with it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cremefilled",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1363503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-12T18:23:01.19Z",
                "reviewBody": "A VERY nice and creamy result.  I left the heavy cream out (since others mentioned it was OK and it wasn't readily available in my fridge) and used 2% milk.  Wasn't real sure what I was looking for to know things were moving along.  I did bring it up to 190 and let it sit, and there WERE some curds that formed, but overall it still looked like a pot of milk.  Reading a previous commentor's suggestion I reheated the pot again at medium low and let the mixture go until I saw separation of the whey and curds.  Worked perfect.  I didn't bother with 4 pieces of cheesecloth  - just used one.  I also did only half a batch my first time out.  Made just shy of 2 cups worth.  Will definitely do this again :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BIANKAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-03T20:50:51.117Z",
                "reviewBody": "Fantastic.  I will never buy ricotta again.  It is so easy and taste is very fresh.  I put it on top of penne with marinara, add sugar substitute and top with fresh berries and have even added high quality cocoa to make chocolate ricotta as a dessert.  I love it while it is warm!  I barely drain mine in the cheesecloth as it results in a more moist, creamy ricotta.  I have made homemade ravioli for my southern friends and they said they were to die for!  You must try this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4326263/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-26T20:03:48.337Z",
                "reviewBody": "I am beyond thrilled with this recipe.  It is incredibly easy and delivers a light, fresh, creamy tasting cheese.  I made 2 batches of cheese and my egg-less semolina pasta for ravioli. I got 12 dozen ravioli from it.  Everyone loved the fresh taste of the cheese and requested I try it in stuffed shells and lasagna next.    This was a fun thing to make with my kids as well!  Sayanora to another item I would normally buy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "What's for dinner, mom?",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/whats-4-dinner-mom/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T18:53:25.43Z",
                "reviewBody": "Wonderful! I am originally from Italy and find that the store bought ricotta often has a plastic container taste. I made this once and it was wonderful. Look forward to making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "anja",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2921102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-27T23:10:28.903Z",
                "reviewBody": "I have made great Riccota cheese using just the whole milk.  After heating one gallon of the milk very slowly to around 170 - 180 degrees, I then stirred 1/2 cup of apple cider vinegar into it.  It immediately began separating and I let it sit for 30 minutes to finish separating.  Then I placed a cheesecloth-lined colander inside of a large mixing bowl and gently poured the hot milk mixture into the colandar.  \n\nAt this point remove the bowl of whey for use in cooking, baking, etc.  After you remove the bowl of whey, gently rinse the vinegar out of the ricotta cheese with a gentle flow from your kitchen tap water. Some people don't rinse at all because they like the kick which vinegar gives to this cheese.  Others only rinse a little bit while others rinse it very thoroughly.  It's your choice.  If you rinse too much and decide you liked it better before you rinsed it, add a few tablespoons of vinegar back into it.  \n\nWhen you are finished rinsing it, place the ricotta cheese in a mixing bowl, add salt (to taste) and then you can add anywhere from 1/2 to 1 cup of milk, cream or even buttermilk if you want a more tangy flavor.  Use the whey for cooking corned beef and cabbage or a ham/cabbage/potato soup or a New England Boiled Dinner.  Ham with noodles is also very good cooked in this broth.  The slightly vinegary whey eliminates the need to add sauerkraut and it's really delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marilii",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12099668/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-30T21:05:27.257Z",
                "reviewBody": "This recipe was ok but it cost more for a gallon of milk than it is to buy ricotta cheese at the super market so I will probably not make again. Turned out ok with the fresh ricotta taste when I did make it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Terry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2075266/"
                }
            }
        ]
    }
]