[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/107/appetizers-and-snacks/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235095/easy-rumaki-with-pineapple/",
        "name": "Easy Rumaki with Pineapple",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1291543.jpg",
            "width": 6480,
            "height": 6480
        },
        "datePublished": "2013-08-05T14:43:27.000Z",
        "description": "This combines the crunchiness of bacon and water chestnuts with the wonderful flavors of pineapple. We make it right before watching football games, but it doesn't last long.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "24 rumaki",
        "recipeIngredient": [
            "cooking spray",
            "24 (1 inch) cubes fresh pineapple",
            "24 water chestnut slices",
            "8 thick-cut bacon slices, cut crosswise into 3 pieces",
            "24 toothpicks",
            "½ cup low-fat sesame-ginger salad dressing",
            "1 tablespoon chopped green onion, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Line the bottom section of a broiler pan with aluminum foil, top with the broiler rack, and spray rack with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a water chestnut slice atop each pineapple cube; wrap each with 1 bacon slice, securing with a toothpick. Arrange wrapped pineapple on the prepared broiler rack.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 7 minutes; turn and continue baking until bacon is almost crisp, about 8 more minutes. Brush rumaki with sesame-ginger dressing and continue baking until bacon is crisp, about 5 more minutes. Garnish rumaki with green onion.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Meat and Poultry"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Barbara"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.526315789473684,
            "ratingCount": 38,
            "itemReviewed": "Easy Rumaki with Pineapple",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "39.6 calories",
            "carbohydrateContent": "3.7 g",
            "cholesterolContent": "4.6 mg",
            "fatContent": "2 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "162 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-07-28T11:58:25.007Z",
                "reviewBody": "First, do yourself a favor and cook these at 425.  I baked an extra 15 minutes trying to crisp up the bacon at 375 and, finally, just turned up the temperature.  In the future, I will halve the bacon strip instead of cutting into thirds.  On some, the bacon barely wrapped around, and when cooked they came apart, so I think a larger piece of bacon will work better (at least for me).  As far as flavor, they were absolutely delicious.  The dressing I used was Ken’s Steak House Lite Asian Sesame with Ginger & Soy, and it worked well with the pineapple and bacon.  It worked so well that I ended up pouring some into small dishes, to use as a dipping sauce.  Don’t skip the water chestnuts, that little bit of crunch adds some texture and interest.  You can prep these early in the day, bake later, and serve a nice warm appetizer with minimal effort.  I served these to a group of six people, and each and every person gave it a thumbs up.  I’m giving it a 4-star rating only because I believe the oven temperature is off.  Barbara, thanks for sharing this easy appetizer which has nice presentation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-25T19:27:24.213Z",
                "reviewBody": "YUMMY! Big hit at guys ice fishin' weekend! I agree with the 1st reviewer that an oven at 425 worked well. I like my bacon crispy so it seemed the higher temp worked better. I baked these on a cookie cooling rack which allowed the grease to drain and make it easy to flip them over since there was very little surface area to stick on. I used the Sesame dressing because I had it on hand but it would have been fine without it too. The pineapple was a nice easy addition that got a lot of compliments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CrazCarChick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3358485/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-06-30T02:07:38.713Z",
                "reviewBody": "These are not just for appetizers and snacks. The 2 of us had them for dinner no left overs. I fixed some rice with teriyaki sauce and chicken broth to go with them. Like others I also cooked mine at 425 because that's the same temp I cook bacon in the oven. An important rick to choosing pineapple is make sure it's a nice orange color. Green pineapples are far from ripe and like a green tomato may turn color after being picked but the ripening and flavor development process stops at that point. If I made these for a gathering I would definitely double the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "slo_cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2767931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-06-10T11:46:10.45Z",
                "reviewBody": "These flavors together is magical. Agree that 425 is better. I think I'll use the grill next time for more even crispness. I took them to a party and people were freaking out how good they were. I added a light sprinkle of sesame seeds. I may have eaten 4 before I got there.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "msndal70",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10596012/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-01-02T23:24:33.977Z",
                "reviewBody": "Although this received a lot of compliments at the NYE party I'd be hesitant to make it again. This recipe claims to be quick but it isn't. The prep time was easily doubled between cutting the fresh pineapple and wrapping greasy bacon around slippery pineapple. The cook time increased from 20 to 35 minutes with the time it took to flip and baste them and 5 extra minutes in the oven. The bacon never browned which was a huge disappointment even after I increased the oven temp to 400 for the last 20 minutes. If I were to try this again I would increase the temp to 425.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-04-20T22:23:25.133Z",
                "reviewBody": "Definitely need to cook these at 425 and I had to cook them about 12 minutes after I added the sauce to make sure the bacon was cooked and crispy. I also cut the bacon in half not thirds. They are yummy and were a big hit! Will definitely make again.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kscott",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21832776/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-07T18:56:52.317Z",
                "reviewBody": "Wonderful! Made a batch of these for Sunday NFL day for hubby and they were a hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danielle Morrissey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14224085/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-01T17:50:50.733Z",
                "reviewBody": "Just yum! Def could bake hotter took forever to get bacon crisp (my bad for using thick cut bacon). I forgot the dressing and they were still yummy! Remembered the pour on dressing 2nd batch even better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BroMama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/997786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-08-16T07:08:39.96Z",
                "reviewBody": "These were excellent! Based on reviews I made half with an added slice of jalapeno and half as the recipe stated. I also cooked at 425 due to comments about the bacon not cooking quickly. I used 1/3 a slice of bacon for each piece but I had a problem with some of them coming apart. I think the bacon may have come apart where it was very fatty. At any rate this was a hit and they were all eaten quickly! I bought pre-cut pineapple (fresh but cut by the store) to save time. One suggestion I would make is to make sure the pineapple pieces are small enough to cover with the water chestnut and wrap in bacon. Some of my chunks were perhaps a little too large and I stretched the bacon. I think next time I will try with turkey bacon but I will definitely make them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Benny806",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7914960/"
                }
            }
        ]
    }
]