[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/200/meat-and-poultry/beef/",
                    "name": "Beef",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/475/meat-and-poultry/beef/steaks/",
                    "name": "Steaks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/246229/grilling-thick-steaks-the-reverse-sear/",
        "name": "Grilling Thick Steaks - The Reverse Sear",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3350569.jpg",
            "width": 2848,
            "height": 2848
        },
        "datePublished": "2019-04-02T07:06:20.000Z",
        "description": "Steaks 2 inches thick or more generally don't respond well to traditional grilling over high heat. The outside and layer below it tend to be heavily charred and dry by the time that the center reaches the desired temperature (unless you are a black and blue fan). The reverse sear brings the steak up to temperature slowly over low indirect heat, allowing the meat enzymes to work their magic. The steak is then grilled at high temperature to get the appropriate crust.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H31M",
        "totalTime": "P0DT0H46M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (2 1/2 pound) 2-inch thick porterhouse steak, at room temperature",
            "sea salt to taste",
            "freshly ground black pepper to taste",
            "1 cup hickory wood chips, soaked",
            "olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season steak generously with salt and black pepper on both sides.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place wood chips in the smoker box of your gas grill according to manufacturer's instructions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat one side of the grill to about 250 degrees F (121 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place steak on the cool side of the grill. Cook until an instant-read thermometer inserted into the center reads about 100 degrees F (37 degrees C), 25 to 30 minutes. Transfer steak to a plate. Brush with olive oil and cover with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Increase heat on the grill to 600 degrees F (315 degrees C) by turning both burners up to maximum.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook steak until crust forms and an instant-read thermometer inserted into the center reads 125 degrees F (52 degrees C), about 3 minutes per side. Transfer steak back to plate. Cover with aluminum foil and let rest before serving, about 5 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Beef",
            "Steaks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Eric Davis"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 6,
            "itemReviewed": "Grilling Thick Steaks - The Reverse Sear",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "401.2 calories",
            "carbohydrateContent": "0.2 g",
            "cholesterolContent": "91.8 mg",
            "fatContent": "30.8 g",
            "fiberContent": "0.1 g",
            "proteinContent": "28.9 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "159.5 mg",
            "sugarContent": null,
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2016-03-09T02:51:15.863Z",
                "reviewBody": "OK...here goes! We are rebels. We didn't follow this recipe EXACTLY. This is what we did or should we say DID NOT do: 1.) We did not use a gas grill 2.) We used ribeye and not a porterhouse steak 3.) Our steaks were about 1\" thick and not 2\". Anyway...Believe it or not after all the DID NOTS...We DID use the method in this recipe and the hubs enjoyed the smoke infused flavor. My hubby did the grilling with me as supervisor:) We started with the charcoal on one side of the grill. Got the coals nice and hot and added wood soaked chips in a makeshift pan formed out of foil tossed on top of the coals. Once the coals started smoking we put the steaks on the cool side of the grill. Grilled covered about 15 minutes (which was a little too long for 1\" steaks) until they reached 118 degrees. Oops too long! Removed the chips/foil pan from the coals and tossed the steaks on until seared on one side flipped to sear the other side. Approx. five minutes total searing time. Steaks were about 150 degrees when taken off. Since we only have a charcoal grill and I will use this method again I will reduce the original smoke time just a bit to make up for thinner steaks. Once done they were still pink in the center and had a great smoke flavor but feel they were slightly overdone for our tastes. We generally like medium doneness and this turned out more like medium well. Next time I will keep a closer eye on the temp. There will be a next time though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KGora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kgora/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-06-10T07:50:37.367Z",
                "reviewBody": "Best steak I have ever grilled. Lots of compliments.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kay nimmo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20910679/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-06-11T07:57:31.273Z",
                "reviewBody": "I love thick steaks. My uncle (a classically trained chef) taught me this very method years and years ago. He added one thing though...keep turning the steak during the indirect portion of the cooking.  Gets rid of that funky line that exists between the cooked meat and the uncooked. Then you do the high temp sear, let it rest a bit and dig in!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "George",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1965339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-05-27T09:36:34.477Z",
                "reviewBody": "I love this method of cooking thick steaks but usually use the oven to skillet method. I had two beautiful NY Strip Steaks that were prime and 2” thick. I decided to give this recipe a go. This method is a little unpredictable if yo do not know how your grill will heat. I started with two burners on low of a three burner grill...too hot. Turned off all but one burner and got it to 250 degrees. I also felt that taking the steaks off at the internal temp of 100 degrees was too low from my experience. I waited until they were 115 degrees, turned up two burners to high, rubbed the steaks in olive oil and seasoned them a bit more.  By the time I put them on the grill to sear they were pushing 125 which is what I like to see. Seared them for 3 min a side and turned them on their side to render the fatty part. Let them rest 10 min and they were perfect!!!  I used a remote temperature probe in one steak the whole time.  I would have definitely overcooked them if I didn’t watch it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Howard",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/howard/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-04-16T22:12:44.81Z",
                "reviewBody": "Followed  the instructions on a ceramic Kamado grill and it turned out excellent. Seared it at 400 + degrees but it was plenty hot and used a digital thermometer and probe to get to the correct temperatures in both stages of cooking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jim Calkins",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/27356634/"
                }
            }
        ]
    }
]