[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/854/desserts/cookies/refrigerator-cookies/",
                    "name": "Refrigerator Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11042/fun-cookie-suckers/",
        "name": "Fun Cookie Suckers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F353648.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "1998-08-28T20:55:48.000Z",
        "description": "Swirls of color, also known as Play Dough Cookies.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 dozen cookies",
        "recipeIngredient": [
            "¾ cup butter, softened",
            "3 ounces cream cheese",
            "1 cup white sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "2 ¾ cups all-purpose flour",
            "1 teaspoon baking powder",
            "¼ teaspoon salt",
            "assorted colors of paste food coloring",
            "24 lollipop sticks"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a bowl cream butter, cream cheese and sugar until fluffy.  Add egg and vanilla; beat until smooth\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl combine flour, baking powder and salt.  Add dry ingredients to the creamed mixture.  Stir till soft dough forms.  Divide dough into fourths.  Tint each with a different food color.  Wrap in plastic wrap and chill for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Working with each color, shape dough into 3/4 inch balls. For each cookie place 1 pink, 1 green, 1 blue and 1 orange ball together to make 1 large rainbow colored ball.  Shape into a 12 inch long roll (like a snake); starting at one end, coil roll to make a 2 3/4 inch round cookie.  Place cookies 3 inches apart on lightly greased baking sheet.  Carefully insert lollipop sticks into bottoms of cookie\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cookies for 8 minutes or until lightly browned.  Cool and store in an airtight container.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Refrigerator Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Terri"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.478260869565218,
            "ratingCount": 138,
            "itemReviewed": "Fun Cookie Suckers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "151.2 calories",
            "carbohydrateContent": "19.5 g",
            "cholesterolContent": "26.9 mg",
            "fatContent": "7.3 g",
            "fiberContent": "0.4 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "99.1 mg",
            "sugarContent": "8.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-02-05T15:56:18.263Z",
                "reviewBody": "Excellent Excellent Excellent! I made this for my daugher's class for her birthday and then turned around and made it for my sons class for his birthday the following week. Very easy and so cute! The second batch I made was for a preschool class so I added a broken pretzel rod in place of the popsicle sticks. (easier for them to hold plus it made the whole thing edible) So glad I found this recipe! It sure made my life easier with 2 birthdays back to back. It quickly went into my favorite recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SPAMULETTA00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/229928/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-20T17:16:49.777Z",
                "reviewBody": "These look really cool, but the work is not really worth it for me. I thought by reading the recipe it would not be that hard, but very time consuming....not meant for large quantities. These will expand a great deal during cooking, so don't place to close together on cookie sheet. Tasted good, but a pain.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CRYSTALKELSALL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1006516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-11T17:04:14.28Z",
                "reviewBody": "I have made these 3 years running for my sons birthday treat to take to his class. He always requests them. Because they are time consuming i find it helpful to shape all the balls of each color after the dough has chilled then put them back in the fridge. I have even done this a day ahead and baked the next day. It helps to use parchment paper with the cream cheese based dough. Also the thicker sucker sticks (wilton makes some specifically for cookie suckers) work better. If you make these be prepared to share the recipe and be ready for the kids to request them over and over.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELLEDALTON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/790201/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-09T05:45:31.607Z",
                "reviewBody": "Excellent recipe! I used an 8 oz. package of cream cheese and modified the amount of the rest of the ingredients to make the dough. Turned out great. Used regular food coloring (didn't have any paste) and we (my kids and my nephews) made cookies for Mother's Day. Lots of fun kids can get really creative w/ this dough. We didn't use sticks just rolled into dime size balls or multi colored ropes and made designs. Will make again and again! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsBrenda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/294572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-26T01:32:14.153Z",
                "reviewBody": "I made these cookies for my son to pass out to his teachers and bus driver along with thank you notes for his last day of kindergarten. They are so colorful and cute and a great tasting cookie also. I'm glad I did not read any reviews except the ones on the recipe page because if I had I probably would have added extra sugar as other reviewers did. I don't think these need any more sugar. They are sweet enough and buttery... yum. The only change I made to the recipe was a neccessary improvisation. I began making the dough before I realized we had used the last of the cream cheese (which I almost always have) so I subbed 1/4 C or so of sour cream and the texture of the cookie is wonderful! I will definitely make these again! (The kids haven't even seen these yet... they are in bed for the night... they're going to love them!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Muffinmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2457961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-12T13:41:10.243Z",
                "reviewBody": "5 stars for the concept alone. I wish I read prior reviews of adding a tad more sugar. Cookie itself tasted kinda bland-but not bad. Maybe a 1/4 cup more sugar or even conf sugar. Other than that it was fun and I think to make them look the prettiest its safe to roll the colors individually and gently attach them. They get more tie-dye looking by adding all colors into one ball and rolling out. Check out the pictures posted and you can tell the difference. Will keep in my recipe box.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-12T21:38:01.42Z",
                "reviewBody": "What a fun thing to make! I purchased wilton lollipop sticks and had my five year old paint a terracotta pot. We inserted floral foam stuck in the pops that we had wrapped in cellophane and tied with ribbons. Then we covered the floral foam with gum drops. My son calls it the 'CandyLand Suprise!\" It was time consuming and made a huge mess of my kitchen but it was worth it!!! Yummy Too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACYCOOK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-08T15:39:50.89Z",
                "reviewBody": "My kids and I had lots of fun making these cookies. We ended up making two batches and passing some out as Easter treats to friends & family. To make them more Easter-like we used pastel colors and wrapped the cookies up in cute Easter gift bags with ribbons. I followed the advise of others and added about 1/4 C more sugar so that they were sweet enough and cooked the cookies for almost 12 minutes long so that they were not too soft. I also added lemon extract instead of vanilla because I like the flavor better.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROOMMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1394968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-21T19:58:31.393Z",
                "reviewBody": "What a fun project with the kids on an unexpected snow day. It took a cookie or so to get the technique down (we were making the \"snake\" too thin) but even the mistakes have their own character. I added the additional 1/3 cup of sugar as others had suggested and we didn't have a problem with bland cookies. They are sugar cookies though not super sweet like choco chip etc. Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OneBiteRule",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2179121/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-31T15:13:05.43Z",
                "reviewBody": "Although time consuming I had a blast making these cookies. They turned out great though the taste is an acquired one. Reactions were mixed as the sugar flavor is very soft and in the Netherlands we are used to very strong sugar flavours. All in all a nice not too sweet cookie! will make again:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "I=Cookie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4634121/"
                }
            }
        ]
    }
]