[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/149679/mashed-potato-quesadilla/",
        "name": "Mashed Potato Quesadilla",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F190839.jpg",
            "width": 2772,
            "height": 1843
        },
        "datePublished": "2019-04-03T06:30:46.000Z",
        "description": "I had something like this at a restaurant last night and I had to try to duplicate it at home! It reminds me of a perogies! I think that this recipe can really be played up with just about anything you like with potatoes! This can be a super fast meal if you use the heat and serve bacon and premade mashed potatoes!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H16M",
        "totalTime": "P0DT0H31M",
        "recipeYield": "4 quesadillas",
        "recipeIngredient": [
            "2 cups mashed potatoes",
            "6 slices cooked bacon, crumbled",
            "¼ cup sliced green onions",
            "8 flour tortillas",
            "2 cups shredded Cheddar cheese",
            "2 tablespoons softened butter",
            "1 cup salsa",
            "¼ cup sour cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together the mashed potatoes, bacon, and green onions. Spread the mashed potato mixture onto one side of half of the tortillas, spreading to within 1/2 inch of the edges. Sprinkle the shredded cheese on top of the mashed potatoes and top with the remaining tortillas. Lightly butter each side of the quesadillas.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat a large skillet over medium heat. Place a quesadilla into the preheated pan, and cook until golden brown and crispy, then turn over, and continue cooking on the other side until browned, 2 to 3 minutes per side. Repeat with remaining quesadillas. Serve with salsa and sour cream.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MrsB"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2631578947368425,
            "ratingCount": 95,
            "itemReviewed": "Mashed Potato Quesadilla",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "766.1 calories",
            "carbohydrateContent": "78 g",
            "cholesterolContent": "92.5 mg",
            "fatContent": "39 g",
            "fiberContent": "6 g",
            "proteinContent": "26.2 g",
            "saturatedFatContent": "21.4 g",
            "servingSize": null,
            "sodiumContent": "1590.2 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-12T18:07:22.84Z",
                "reviewBody": "OMG - these are SO good! I am on Weight Watchers and it is not that hard to pare it down in calories and fat. I followed the recipe exact except for using the smaller lower fat tortillas and just sprinkling the cheese on each one. I used bacon pieces and they are only 35 calories per tbsp. I don't make my mashed potatoes that fattening so that helps also. I served with tomato soup so that you don't have to keep eating them to get satisfied (kind of like eating tomato soup and grilled cheese). To cook I used my Cusinart Griddler with the flat plates on 400 degrees so it only took 2 minutes to cook total (because I didn't have to flip). With my own tortilla I used butter flavored spray rather than real butter and I also didn't add any cheese to mine. It still tasted really good and definitely reminicent of perogies. Tips: you will be tempted to pile on the potatoes but use a little restraint - the potatoes will seep out if using a grill press like I did. It doesn't affect the taste just looks a little messy and may run over onto your griddle. Also heat up your mashed potatoes first for easier mixing. THANKS a million for this awesome recipe this has to be the BEST way to use up leftover mashed potatoes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "B_32",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1704712/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-22T23:49:02.01Z",
                "reviewBody": "I made these the other night for my husband and I for dinner. We were looking for something comforting and a little unhealthy...this fit the bill perfectly! It does indeed taste like perogies and even more so once they cool. The only change I made to the recipe was reduce the amount of cheese by about half. It could have used slightly more cheese but not 2 cups. Anyway we really liked this dish but probably won't make it very often because the the fat and calories in it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kelcampbell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kelcampbell/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-28T23:57:30.013Z",
                "reviewBody": "I just made these using leftover Thanksgiving mashed potatoes and they were great!  I make quesadillas often and never thought of putting mashed potatoes in them.  Great idea!  I left out the bacon and green onions because we're not bacon fans and didn't have any green onions on hand. I cooked quesadillas in a dry skillet over medium heat with no butter.  They came out perfectly toasted without adding the extra calories from butter.  I used a the Mexican style blend of four cheeses but think they would be even better with pepper jack, will try that next time!  For the dipping sauce I mixed 1/2 cup sour cream with 2-3 T. salsa.  Thanks for the great recipe MrsB!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sharonna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2710048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-28T19:37:44.467Z",
                "reviewBody": "great recipe i added 1/2 lb of spicy ground beef to the mashed potatoes...yummm!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Razia M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3148777/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-04T19:56:43.193Z",
                "reviewBody": "I made these. I want actually a 4.5 stars couldn't give it a total 5 star for sort of being messy. I did follow the recipe to a T. And all the steps were really really simple. The flavor was great from what my kids tell me. Son didn't like the onions but oh well. My other 3 children gobbled them up. The only part I found was it was hard to spread the potatoes on the tortillas. I think I would do what I do with refried beans for the next go around because I will make them again is put the potatoes in a ziploc baggie snip the corner and pipe them out on the tortilla for easy coverage. But all in all very simple recipe. Get way to use leftover mashed taters.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-30T21:54:39.993Z",
                "reviewBody": "Simple filling and delicious! Like other reviewers I tried cutting back on the calories. For the filling we used homemade mashed potatoes and scallions with just a sprinkle of cheddar cheese and dipped them in a little salsa. Rather than using store-bought tortillas I used the recipe for Mexican Whole Wheat Tortillas (using olive oil instead of shortening) to add a little more of a healthy twist on it. I will definitely be making these again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "silentexplorer13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2884906/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-06T00:21:38.65Z",
                "reviewBody": "We found some great ways to cut calories on these and make them a tad more healthy. About half the recipe makes enough for 5 people. Also we used turkey bacon instead of regular omitted the butter and very lightly sprinkled cheese on top. The mashed potatoes were mixed with 2% milk. Overall a lower fat recipe than before.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "readycooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2934629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-02T18:44:29.883Z",
                "reviewBody": "oooooooooo....very very good recipe! YUM! I loved it! great idea to use up leftover potatoes! My leftovers were the bulk of insides from baking red potatoes for tater'skins....so there was no milk or butter in them just the potato I mixed that with a tsp of ready made bacon crumbles and chopped chives...spread it out on a 6 inch LOW-FAT tortilla and quickly fried it without oil butter or cooking spray you get a nice crunchie texture on the tortilla and hardly any fat! I served with salsa....I am definitely going to be making these on a regular basis! Thanks MrsB for a great idea!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gitano",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2356139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-13T22:30:46.15Z",
                "reviewBody": "These were an interesting and pretty yummy way to use up some potato guts I had leftover from making potato skins. The only changes I made were to cut down on the bacon and cheese to save some fat and calories and I made them by folding the tortillas in half instead of topping with a second tortilla. They stay together better that way easier to flip. Thanks for the idea I'd make these again for sure!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3513546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-05T17:59:06.737Z",
                "reviewBody": "I am so sorry to say this (and it could just be the cooker me). I don't know what I did wrong as I followed the recipe to a tee. My Hubby said he'd never try it again and he'd eat fried cardboard if it was seasoned right. BUT I love the idea so I may try again just to see if it was me. Sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherrie Norman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sherrie4222/"
                }
            }
        ]
    }
]