[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/229964/buffalo-chicken-and-roasted-potato-casserole/",
        "name": "Buffalo Chicken and Roasted Potato Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1132179.jpg",
            "width": 1704,
            "height": 1705
        },
        "datePublished": "2019-04-03T06:31:08.000Z",
        "description": "This recipe was passed to me by a friend whose husband loved Buffalo wings and baked potatoes. I made it for the first time for my crew of boys and it was a big hit. Being a single working mom and short on time, I made some shortcuts to the recipe and to my surprise, it tasted even better.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "cooking spray",
            "6 tablespoons hot pepper sauce",
            "⅓ cup olive oil",
            "2 tablespoons garlic powder",
            "1 tablespoon freshly ground black pepper",
            "1 tablespoon paprika",
            "1 ½ teaspoons salt",
            "8 potatoes, cut into 1/2-inch cubes",
            "2 pounds skinless, boneless chicken breast halves, cut into 1/2-inch cubes",
            "2 cups shredded Mexican cheese blend (such as Great Value Fiesta Blend®)",
            "1 cup crumbled cooked bacon",
            "1 cup diced green onions"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 500 degrees F (260 degrees C). Spray a 9x13-inch baking dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat hot pepper sauce, olive oil, garlic powder, black pepper, paprika, and salt in a large skillet over low heat, stirring until thoroughly combined. Turn off heat. Toss potatoes in batches with the hot pepper sauce mixture to coat and use a slotted spoon to transfer potatoes to the prepared baking dish. Leave remaining sauce in skillet. Mix chicken into remaining sauce and allow to marinate while potatoes roast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake potatoes until tender inside and crisp and brown outside, 45 to 50 minutes, stirring every 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce oven heat to 400 degrees F (205 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread chicken cubes over roasted potatoes. Sprinkle Mexican cheese blend, cooked bacon, and green onions over chicken. Return to oven and bake until chicken is cooked through and the cheese topping is bubbling, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in oven until chicken is cooked through and the cheese topping is bubbling, about 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "mammak"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6455696202531644,
            "ratingCount": 316,
            "itemReviewed": "Buffalo Chicken and Roasted Potato Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "500.7 calories",
            "carbohydrateContent": "33.8 g",
            "cholesterolContent": "92.5 mg",
            "fatContent": "25.5 g",
            "fiberContent": "4.6 g",
            "proteinContent": "34.4 g",
            "saturatedFatContent": "10.1 g",
            "servingSize": null,
            "sodiumContent": "1244.8 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-11-13T17:54:52.807Z",
                "reviewBody": "This was my recipe and I made some shortcuts that weren't put in the original recipe. Instead of using the tobasco sauce, garlic powder, and paprika mix, I used a jar of HOOTERS hot wing sauce. I added some olive oil to it to keep it from burning and to coat the potatoes. Then baked them as the recipe states.  Also, not having time to thaw and cube chicken, I used a bag of Fajita chicken pieces, precooked and thawed.  It was perfect and took half the time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mammak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7495292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-07T23:20:54.65Z",
                "reviewBody": "Devoured by both myself and my husband!  I knew he would love it, but I was surprised at how much I did, too.  I followed the author's shortcut except that I used Frank's Buffalo Wing Sauce.  I used red potatoes and left the skin on.  Instead of putting raw chicken in with the roasted potatoes, I sprinkled it with the paprika, garlic powder, and seasoning salt, then sauteed the chicken in olive oil until cooked.  I added about a half cup of wing sauce and 3 tbsp unsalted butter to the cooked chicken (this was for a half-recipe) and simmered for about 10 minutes before adding to the roasted potatoes.  Chives are a no-no for my hubby, unfortunately, but this was DELICIOUS anyway!  I should have made the full amount!  I'll be making it again in 2 days when friends come over to watch a football game, and will keep it warm in the slow cooker.  Thank you so much for sharing this recipe, MammaK!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookTo$ave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10459484/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-05T03:18:56.877Z",
                "reviewBody": "Great recipie!!! Some what spicy when using Frank's Red Hot hot sauce.  Added a little Rootie's blue cheese on top and it was awesome!!!  Husband and son both loved!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nani22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8577103/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-28T20:06:30.333Z",
                "reviewBody": "I'm giving this five stars because the whole concept and final product was amazing and one of our new favorites! But I did do my own version of this recipe (as I usually do!) I roasted the potatoes at the time & temp suggested but with just a drizzle of olive oil and some garlic salt and pepper. Then I had some chicken that I had precooked and shredded, so I tossed that on top then poured the wing sauce over top of everything and mixed together, topped with cheese and put back in the oven until everything was heated thru. For the wing sauce I used some of Franks wing sauce but to tone it down a little I added butter and garlic. Thought I'd share my own twist on this delicious recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mam5016",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3102527/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-05T00:46:51.117Z",
                "reviewBody": "This is good with heat-control modifications.  I roasted the potatoes in garlic powder, olive oil, and pepper.  I, like other reviewers, didn't like the idea of putting raw chicken on cooked potatoes, so I cooked the chicken on its own in butter with about 10 drops of hot sauce, garlic powder, and pepper.  When the chicken was done, I took the roasted potatoes out of the oven and mixed in about 1/4 cup of cheese.  I then topped it with the rest of the cheese, the cooked chicken, the bacon, and the green onions and baked it for another 10 minutes.  I served Sweet Baby Ray's Buffalo Chicken Dipping Sauce on the side.  Everyone loved it, and my heat sensitive seven year old gobbled up the chicken.  I thought the hot sauce gave the chicken a bit of a delicious bit, but he didn't notice.  This is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bookworm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2496702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-23T21:25:58.423Z",
                "reviewBody": "This. Was. Fantastic. I followed the recipe almost exactly. Only change was I sauteed the chicken in the leftover sauce just to brown a bit before putting it over the potatoes...then cooked the rest of the way in the oven. Yes it's a little time consuming but SO worth it. My husband absolutely LOVED it. He also said it went perfect with a cold beer.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PSBIZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/921944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-20T02:03:40.45Z",
                "reviewBody": "I just tried this recipe. I made a few modifications.  First, made the sauce as directed for the potatoes, then roasted the potatoes at 450 for 40 minutes.  Made additional sauce for the chicken but added a few tbs of butter then added the chicken to soak up the flavors.  Started with a whole roasted chicken and cut it into bite size pieces after removing the skin.  This saved a step and I didn't like the idea of putting raw chicken on the potatoes.  After I took the completed dish out of the oven, added a fried egg to the top.  It added just the thing needed to take away any dryness.  Will definitely make this again.....but for brunch I think.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "heidihoho34@msn.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7085808/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-27T22:46:06.777Z",
                "reviewBody": "(UPDATE!!) MADE THIS AGAIN TONIGHT AND ADDED SOME CREAM CHEESE AMAZING!! THATS EXACTLY WHAT IT NEEDED!!! MIXED CREAM CHEESE WITH RANCH LIKE I WOULD IF I WAS MAKING CHICKEN DIP! THEN I CRUSHED SOME TORTILLA CHIPS ON TOP BEFORE BAKING... TO DIE FOR!!! i WILL MAKE THIS AGAIN WITH MY TWEAKS!! Ok hmmmm i thought this was just ok i felt like it was missing something.I did roast my potatoes first used a regular baking dish those were my only changes.I love the concept of this recipe so its worth trying again with some tweaking. For a little extra kick i drizzled some ranch dressing over the top im thinking incorporate either ranch or creamcheese in the potatoes or try using so m e Velveeta i will update my review next time around...lol",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "missrochester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6418859/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-05T22:51:25.233Z",
                "reviewBody": "This recipe seems VERY labor intensive to me but I simplified it by cooking the chicken first then shredding it when it cooled. We topped with sour cream and everyone was happy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie Weisman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5839595/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-05T22:05:39.113Z",
                "reviewBody": "I wanted to love this and it had high ratings but it just didn't work for me. We'll eat it this week but the taste was off. I won't be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Chicklet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6453662/"
                }
            }
        ]
    }
]