[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/916/side-dish/sauces-and-condiments/gravy/",
                    "name": "Gravy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16857/side-dish/sauces-and-condiments/gravy/turkey-gravy/",
                    "name": "Turkey Gravy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76604/make-ahead-turkey-gravy/",
        "name": "Make-Ahead Turkey Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F739240.jpg",
            "width": 2232,
            "height": 1920
        },
        "datePublished": "2019-04-04T03:32:53.000Z",
        "description": "I discovered this excellent Thanksgiving gravy recipe years ago! It is gravy that, unlike most, can be made AHEAD of time. The gravy will keep for 3 months when frozen in an airtight container.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "8 cups",
        "recipeIngredient": [
            "6 turkey wings",
            "2 medium onions, peeled and quartered",
            "1 cup water",
            "2 quarts chicken broth, divided",
            "¾ cup chopped carrot",
            "½ teaspoon dried thyme",
            "¾ cup all-purpose flour",
            "2 tablespoons butter",
            "¼ teaspoon ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).  Arrange a single layer of turkey wings in a large roasting pan.  Scatter the onions over the top of the wings.  Roast in the preheated oven for 1-1/4 hours or until wings are browned.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place browned wings and onions in a 5 quart stockpot.  Add water to roasting pan and stir, scraping up any brown bits on the bottom of the pan.  Pour the the water from the pan into the stockpot. Stir in 6 cups broth, carrot, and thyme.  Bring to a boil.  Reduce heat to medium-low and simmer uncovered for 1-1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove wings from the pot and place on a cutting board.  When the wings are cool, pull off the skin and meat.  Discard the skin and save the meat for another use.  Strain contents of stockpot through a large strainer into a 3 quart saucepan.  Press on the vegetables to extract any remaining liquid.  Discard the vegetables and skim the fat off the liquid.  Bring the contents of the pot to a gentle boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, whisk flour into the remaining 2 cups chicken broth until smooth. Gradually whisk the flour mixture into the simmering turkey broth; simmer 3-4 minutes or until the gravy has thickened.  Stir in the butter and pepper.  Serve immediately or pour into containers and refrigerate or freeze.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Gravy Recipes",
            "Turkey Gravy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUE1956"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.662946428571429,
            "ratingCount": 448,
            "itemReviewed": "Make-Ahead Turkey Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "58.9 calories",
            "carbohydrateContent": "3.2 g",
            "cholesterolContent": "15.2 mg",
            "fatContent": "2.8 g",
            "fiberContent": "0.3 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "17.7 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-21T23:22:51.093Z",
                "reviewBody": "I'm only giving this a 4 but I think it could be a 5 if the directions are changed slightly. I should have followed my gut feeling and reserved the separated fat to make a roux. If I would have done this there would not have been a floury taste. Do this by whisking the flour into the reserved fat over medium until golden, and then whisk back into the strained broth and drippings. I'll have to make my gravy tomorrow with my turkey drippings after all but maybe I can add this floury gravy to it. Hate to waste it but can't serve it the way it taste right now. Excellent concept with minor changes!!! Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Momma G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1215448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-28T01:42:48.923Z",
                "reviewBody": "If I could give this 500 STARS I WOULD 8 - )  I followed as directed almost exactly (scaled in half).  I used 2 turkey thighs, a back and roasted whole garlic cloves w/ turkey and added celery to pot- oh herbs de provence instead of thyme.  The only real change was as others said - I used some of the \"fatty\" stuff (the icky but good tasting stuff that floats to the top when it starts to cool) heated in a frying pan an added small abounts of flour at a time and a bit of chicken broth, then transfered to a jar with fitting lid with a more chicken broth and shook the heck out if it to make a thickening - then add that to pot.  I did this about 3 times and used the amount of flour the recipe called for and it was not floury tasting at all or lumpy.  This was suppose to be my back up gravy in case I had a holiday \"melt down\" or too much wine ha ha.  It was so good that's what I served with dinner! Just pop it in the microwave and pour in the ol' gravy boat! Thank you for saving me the burden of gravy after cooking all day!!  I've all ready given this recipe to all my freinds!!!!  Cheers!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "secretsmile",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1750244/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-24T18:14:17.45Z",
                "reviewBody": "I was seriously skeptical of any gravy that could hold up for a couple of days and not turn into an icky paste, but this one was awesone and took such a load off of my mind.  Gravy at Thanksgiving is always such a stressful, last minute hit or miss and this one takes the worry away and delivers the great taste.  The only thing I changed was using turkey legs instead of wings because I think they impart a richer flavor.  Thank so much for this recipe!! A definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clearisfullheart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/clearisfullheart/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-16T17:04:54.63Z",
                "reviewBody": "This recipe is a life save on Thanksgiving day. The gravy is DELICIOUS and it takes all the guesswork out of making gravy on the big day. You can make it long ahead of time and heat it in a crock pot all day or stovetop. No one will ever guess it isn't pan roasted that day. Add some of the drippings to it before serving & you have the best turkey gravy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KXR173",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443267/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-14T20:34:35.04Z",
                "reviewBody": "Excellent recipe! One less stressful item to have to worry about on Thanksgiving! I made a few changes...  I poured the pan drippings into a gravy separator; The non-fat portion of the drippings went in with the simmering wings and broth, and I reserved the separated fat to make a roux. I did this by whisking the flour into the reserved fat over medium until golden, and then whisked in all the strained broth and drippings. No floury taste this way! Very excellent, and freezes well... To defrost, refrigerate for 2 days. Reheat in saucepan, whisking often. Yumm.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLISONWUNDRLAND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/allisonwundrland/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-24T19:28:52.45Z",
                "reviewBody": "This is my 3rd year making this recipe and its great.  I don't stress making the gravy after the turkey is taken out of the oven, the problem is, there is never enough turkey gravy for left overs.  We all love hot turkey sandwiches the next day, so this solves that problem.  I prepare this \"ahead gravy\" 2 days before and on turkey day I boil the giblets while the turkey is in the oven.  When the turkey is cooked and resting I use the roasting pan with the drippings and make a roux, etc, when the gravy is done, I then add half of the make ahead gravy to the pan and heat it up.  We now have plenty of turkey gravy for Thanksgiving.  The other half of the Make Ahead gravy I freeze for the Christmas turkey dinner, so I get 2 for the work of 1, and never again worry about having enough gravy left over for the day after hot turkey sandwich smothered in gravy.  I don't know if anyone feels the way I do but after cooking all this food for a holiday dinner, I don't feel like eating it, so the day after the big dinner everything sounds and tastes great to me, since I am not touching, slicing, chopping, stirring, mixing or smelling the food all day long, not to mention being tired and stressed getting all the food cooked and served hot at the same time  for everyone to sit and eat.  Nope, the day after is MY DAY and I'm loving that hot turkey sandwich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "carolc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1640762/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-16T01:49:07.223Z",
                "reviewBody": "Yes this gravy tasted pretty good. However I only gave it 3 stars because I just don't think the taste was worth all the extra effort. It was nice to have the gravy done ahead of time but next time I'll just spend the 5-10 minutes after the turkey is done making the gravy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SUNNY681",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/161769/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-30T19:56:14.99Z",
                "reviewBody": "Lots of great elements here, but in New Orlean's we'd change a few thins. 1st, we always start with a roux instead of belnding in uncooked flour. Try for the color of peanut butter or darker, and if possible use rendered turkey fat as the oil. After the roux is ready, add minced onion, garlic and celery along with spices such as puoltry seasoning, sage, thyme, or savory. When veggies are wilted, add the stock, bring to a rolling boil and reduce until thick. After you cook the turker, add the pan juices and bring to desired consistency by reducing on stove or adding more stock to your taste. I use a stock, rather than a broth, using the turkey necks, old veggie and poultry trimmings I've saved in the freezer as well as any combination of carrots, turnips, rutabegas, or yams. I simmer it (one bubble every 2 or 3 seconds) at least overnight (I have electric--wouldn't do this on gas) and strain as directed in recipe. This yields a strong, dark, flavorful stock. Another option is to add the neck meat and chopped giblets if you like a giblet gravy. It's really not as much work as it seems, and the flavor intensification is incredible. Kudos aplenty for roasting your stock ingredients and \"Bon chance\" (good luck)! Laissez les bon temps roulle (Let the good times roll)!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Madame Roux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4180994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-29T04:53:59.2Z",
                "reviewBody": "I have used this recipe (but add celery and carrots) and it seems like extra work but you can make it several days ahead of time and it is the most flavorful wonderful gravy. You don't have to rush around waiting to get pan drippings from your turkey so it really saves a lot of time at the last minute! You'll love it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Judy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2710072/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Make Ahead Turkey Gravy",
            "description": "This turkey gravy recipe is perfect for Thanksgiving or any time of year. You can make it fresh to have with your holiday meal or ahead of time ands store it for later for up to 3 months in the freezer. ",
            "uploadDate": "2020-11-06T20:11:06.673Z",
            "duration": "PT3M17.845S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F272985dd-f77d-4207-a300-7449e8003c76%2Fc28ce055-76ef-4624-983c-f5b950249aaf%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6207835697001"
        }
    }
]