[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/85/holidays-and-events/",
                    "name": "Holidays and Events Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/198/holidays-and-events/thanksgiving/",
                    "name": "Thanksgiving",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/282373/gravy-stuffed-stuffing-muffins/",
        "name": "Gravy-Stuffed Stuffing Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8738821.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-11-17T23:46:37.000Z",
        "description": "Switch things up this Thanksgiving! Instead of serving a basket of dinner rolls, let your family feast on these gravy-stuffed stuffing muffins. Each muffin bakes up with a crispy exterior, a moist interior, and a nugget of thick, sausage-filled country gravy in the center. They might sound sort of crazy, but they're a must-try for any stuffing fanatic at your table.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT0H55M",
        "totalTime": "P0DT3H55M",
        "recipeYield": "12 muffins",
        "recipeIngredient": [
            "3 tablespoons unsalted butter",
            "6 ounces sweet Italian turkey sausage, casings removed",
            "¼ cup all-purpose flour",
            "4 tablespoons chopped green onions",
            "1 ½ cups cold milk",
            "salt to taste",
            "1 pinch cayenne pepper, or to taste",
            "freshly ground black pepper to taste",
            "5 tablespoons unsalted butter, divided",
            "½ cup diced celery",
            "1 cup diced onion",
            "salt to taste",
            "1 teaspoon poultry seasoning",
            "freshly ground black pepper to taste",
            "5 cups chicken broth",
            "12 cups dry bread cubes",
            "1 tablespoon chopped fresh Italian parsley",
            "1 tablespoon minced fresh sage",
            "2 teaspoons minced fresh thyme",
            "3 large eggs, beaten",
            "2 tablespoons unsalted butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt butter for country gravy in a saucepan over medium-high heat. Add sausage; cook and crumble into very small pieces until browned, 5 to 7 minutes. Add flour and whisk until it combines with butter and sausage fat to create a roux. Cook and stir for 2 minutes. Add green onions. Cook and stir for 1 minute; don't overcook.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in milk and cook, stirring constantly, until mixture comes to a boil. Continue to cook and stir until nice and thick. Stir in salt, cayenne, and black pepper. Cook for 1 more minute, then remove from the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer gravy into a bowl and let cool to room temperature, 15 to 20 minutes. Wrap and refrigerate until cold and thick, about 2 hours, or until needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Butter a 12-cup muffin tin with a 1 tablespoon butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt remaining 4 tablespoons butter in a saucepan over medium-high heat. Add celery, onion, and salt; cook and stir until onion just starts to turn translucent, 4 to 5 minutes. Add poultry seasoning and pepper; cook and stir for 1 minute. Add chicken broth and bring to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, combine bread cubes, parsley, sage, and thyme in a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour boiling broth mixture over bread-herb mixture and stir until combined. Mix in eggs. Fill the prepared muffin cups to the top with stuffing mixture, then go around and evenly divide remaining stuffing on top of each muffing, piling it up nice and high.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wet your finger and make a big hole in the center of each muffin, poking down pretty far but stopping about 1 inch from the bottom of the pan. Place about 2 tablespoons chilled gravy into each hole, centering it in the hole the best you can. Reserve remaining gravy for another use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dampen your hands and mold the stuffing for each muffin over the top to cover the gravy center. Generously brush the tops with melted butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place in the center of the preheated oven with a baking pan on a lower rack to catch any drippings. Bake until muffins have firmed up and are golden brown, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let cool in the pan for 5 to 10 minutes, then carefully remove and serve.\n"
            }
        ],
        "recipeCategory": [
            "Holidays and Events Recipes",
            "Thanksgiving"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 5,
            "ratingCount": 11,
            "itemReviewed": "Gravy-Stuffed Stuffing Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "258.9 calories",
            "carbohydrateContent": "23.4 g",
            "cholesterolContent": "87.6 mg",
            "fatContent": "14.3 g",
            "fiberContent": "1.3 g",
            "proteinContent": "9 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "877.1 mg",
            "sugarContent": "4.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2020-11-27T09:51:23.183Z",
                "reviewBody": "Followed the recipe as written and they were a hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Millie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28474189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-01-08T02:14:07.43Z",
                "reviewBody": "This was a HUGE hit at my family thanksgiving! I think it messed up a bit and the stuffing ended up being too soggy, so make sure your cubes are dry and maybe have a little extra on standby. Still, the final result tasted great and everyone loved them! Chef John is my hero.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "real life millionaire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28793953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-11-30T01:15:30.887Z",
                "reviewBody": "AWESOME!! I love Chef John and almost everyone of his recipes that I have made have turned out great...and this one is no exception. I made these for Thanksgiving this year and my only regret is that I didn't double the recipe. I have several other recipes that are requested that I make every year, but this year, this recipe was the most talked about. As I was doing most of the cooking for Thanksgiving, I made several things ahead of time and either froze or refrigerated them. In this case, I made the gravy exactly as written two days ahead of time and kept it in the refrigerator. I made the stuffing as written except I didn't have enough home made chicken stock so I also added some from a packet. I used a mix of french bread and multigrain bread that I dried out. I would only give two suggestions or precautions. 1: add the heated stock a spoonful at a time until you get the consistency you want and let it sit a few minutes before proceeding so that the bread fully soaks up the stock goodness. 2: If you put your gravy in the fridge as I did (which really aides in the stuffing process) the baking time should be extended a little to make sure to get it heated up enough...5 minutes more should do it but just watch that they don't get overly browned in the process. As suggested, be sure to spoon the turkey gravy over the top. Yum yum. I think what really sets this off is using  the fresh sage. If you can get the fresh spices, I highly recommend using those. This is definitely goi",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "crjonz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10261810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-12-08T22:34:06.853Z",
                "reviewBody": "I used a box of Stovetop Stuffing mix for the stuffing part.  That made enough stuffing for half the recipe, so I only used about 1.5 eggs to bind it together.  Instead of filling the cupcake tin all the way up with stuffing, I filled the bottoms, spooned in some gravy - making sure to keep it as centered as possible with some room around the edges, then filled the rest of the way with more stuffing.  That worked out good for me.  They were super tasty.  The sausage gravy middle went surprising well with the stuffing.  I also topped mine with some turkey gravy and that just put it over the top.  Definitely a keeper and a fun way to make stuffing a little more \"special\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pippercat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3874053/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-11-29T00:39:14.92Z",
                "reviewBody": "These were awesome! Great concept, especially since this year we could not celebrate for the holiday, and were making parts of the meal and delivering them to family. These muffins were so easy to transport. \n\nI did have to make a few substitutions based on what I had. I used oat milk instead of regular milk, dried parsley for fresh, and added more sausage to the country gravy than called for. Boy was that tasty!\n\nAlso, I used a mixture of 80% raisin bread and 20% sourdough (from a local bakery). I always use raisins in my stuffing so this made the stuffing mix taste more like my own. \n\nNext year, I will most likely use my own stuffing mix (with apples, nuts, raisin and sourdough bread, etc.) and may not even do the gravy in the center. As long as you have gravy or cranberry sauce to spoon over top, you really don't need it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jaybu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9857501/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Gravy-Stuffed Stuffing Muffins",
            "uploadDate": "2020-11-17T20:41:54.351Z",
            "duration": "PT10M21.269S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F48ee4a01-0dd5-481d-9795-1df156088867%2F88688d6d-28fe-4284-b4db-49e53744e8ad%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6210459462001"
        }
    }
]