[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/233/world-cuisine/asian/indian/",
                    "name": "Indian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/45957/chicken-makhani-indian-butter-chicken/",
        "name": "Chicken Makhani (Indian Butter Chicken)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F04%2F02%2Fimage-1-1.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2020-02-01T07:50:26.000Z",
        "description": "Chicken Makhani is one of my favorite Indian dishes. It is a full flavored dish that complements the chicken well. It can be made as mild or spicy as you wish by adjusting the cayenne. Serve with basmati rice and naan bread.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon peanut oil",
            "1 shallot, finely chopped",
            "¼ white onion, chopped",
            "2 tablespoons butter",
            "2 teaspoons lemon juice",
            "1 tablespoon ginger garlic paste",
            "1 teaspoon garam masala",
            "1 teaspoon chili powder",
            "1 teaspoon ground cumin",
            "1 bay leaf",
            "¼ cup plain yogurt",
            "1 cup half-and-half",
            "1 cup tomato puree",
            "¼ teaspoon cayenne pepper, or to taste",
            "1 pinch salt",
            "1 pinch black pepper",
            "1 tablespoon peanut oil",
            "1 pound boneless, skinless chicken thighs, cut into bite-size pieces",
            "1 teaspoon garam masala",
            "1 pinch cayenne pepper",
            "1 tablespoon cornstarch",
            "¼ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon oil in a large saucepan over medium high heat. Saute shallot and onion until soft and translucent. Stir in butter, lemon juice, ginger-garlic paste, 1 teaspoon garam masala, chili powder, cumin and bay leaf. Cook, stirring, for 1 minute. Add tomato sauce, and cook for 2 minutes, stirring frequently.  Stir in half-and-half and yogurt. Reduce heat to low, and simmer for 10 minutes, stirring frequently. Season with salt pepper. Remove from heat and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 1 tablespoon oil in a large heavy skillet over medium heat. Cook chicken until lightly browned, about 10 minutes. Reduce heat, and season with 1 teaspoon garam masala and cayenne. Stir in a few spoonfuls of sauce, and simmer until liquid has reduced, and chicken is no longer pink. Stir cooked chicken into sauce.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together cornstarch and water, then stir into the sauce. Cook for 5 to 10 minutes, or until thickened.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Indian"
        ],
        "recipeCuisine": [
            "Asian",
            "Indian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "MITCHMAN21"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4985207100591715,
            "ratingCount": 1352,
            "itemReviewed": "Chicken Makhani (Indian Butter Chicken)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "407.8 calories",
            "carbohydrateContent": "15.6 g",
            "cholesterolContent": "107 mg",
            "fatContent": "27.8 g",
            "fiberContent": "2.2 g",
            "proteinContent": "23.4 g",
            "saturatedFatContent": "11.4 g",
            "servingSize": null,
            "sodiumContent": "523.4 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-26T17:36:53.89Z",
                "reviewBody": "I wanted to comment on this recipe and some tips to make it authentic and give it that restaurant touch.  The recipe itself is fairly good .  The only thing I would add to make it a bit more authentic are as follows:\r\n\r\n1/4 cup of finely ground cashews (unsalted).  These should be used as a thickner and not corn starch.  Indian recipes or sauces never use corn starch.  For richer gravies we use ground almond or cashews and heavy cream or yogurt.  \r\n1/4 cup of heavy cream (substitute it in place of half and half)\r\nFinally if you are a true Indian curry lover and love Chicken Makhani you should buy some fenugreek(called methi - pronounced \"Mei\" \"thi\") seeds.  \r\nYou only use 1/4 tsp of these (they are very bitter) and grind them.  Then add them to the curry when you add your other dry spices.  \r\nThe cashew and fenugreek is what gives Chicken makhani it's authentic flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "YAKUTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/45066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-01T23:32:41.247Z",
                "reviewBody": "I am an Indian native looking for an Americanized version of this dish for a friend who is  a little intimidated by Indian food.  I gave this recipe a try, and it is almost there.  First, I used fresh minced ginger and garlic, but had to triple the amount. That made a huge difference.  I noticed that many reviewers said the recipe is missing something.  I think that something is coriander.  Most Makhani dishes have a cumin/coriander combination which is missing from this recipe.  I added a little ground coriander and the dish was great.  Perfect for a new Indian cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AMIBOULD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/905915/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-23T11:54:33.437Z",
                "reviewBody": "This dish is SO good, my hubby requests it often. Even though I modified the recipe to make it healthier, I still gave 5 stars because the original tastes good too.  My changes: I followed others' advice and added ground cashews instead of cornstarch.  The nuts make ALL the difference.  To make it healthier, I used smartbalance light spread instead of butter. *HUGE TIME SAVER: Instead of cooking the sauce first and then the chicken, have them both going at the same time.  By the time the sauce is finished, the chicken is browned and ready to be combined with the sauce. ** UPDATE** I substituted fat free buttermilk for the half&half, yogurt, and lemon (cuts way down on the fat and ingredients).  While the sauce was simmering, I ground the cashews in a blender and then added the sauce (minus the bay leaf) to the blender to puree all the onion pieces and cashews into a smooth and creamy sauce.  Otherwise, you'll end up with small bits of onion and nuts - not bad, but better smooth.  I then poured the sauce onto the chicken and simmered with the bay leaf until cooked.  Other lower fat options for half&half are light cream and nonfat evaporated milk, but I liked the nonfat buttermilk the best because it did not separate when heated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-14T19:28:18.717Z",
                "reviewBody": "This was absolutely delicious! My Pakistani in-laws are quite picky when it comes to traditional food, but this one is a new favorite! I made the following adjustments: Added 1 tbsp butter to the peanut oil, used 4 tbsp butter rather than 2, substituted 1/2 tsp ground ginger powder & 3 cloves crushed garlic for ginger/garlic paste, omitted salt & pepper, added breast meat pieces, substituted whole milk for half & half, used 1 full tsp cayenne pepper for chicken, doubled cornstarch (but not water) to thicken sauce, and garnished with fresh, chopped corriander. The 5-minute prep time is unreasonable. It took me about 30 minutes to prep and 1 hour to cook (including 20 mins of simmering to let sauce thicken and white rice, which is best served with this dish). Also, this only served 3 adults in my family, so I highly recommend doubling it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MariyaC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1352964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-01T18:03:07.687Z",
                "reviewBody": "This is an excellent recipe however the first time we tried it we decided the chicken needed to be marinated first. The sauce was good but the chicken (we used chicken breast) was a bit chewy. I use the marinade in the other Butter Chicken recipe by Vijar Bhaardwaj (15 minutes in the lemon juice chili powder and salt and 3-4 hrs in the drained yogurt and spices marinade). The result is phenomenal! In place of the full-fat half and half I use Land of Lakes Non-fat Half and Half. It does not affect the taste. I've also used stewed tomatoes in place of the tomato puree. A good side dish is Gobi Aloo (Indian-stype Cauliflower with Potatoes) by Shahzadi also found on this website. Note: Use chopped tomato and coconut milk to make this recipe less dry. I served both at a dinner party for 14 and they were a hit with many requests for the recipes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VICTORIA4784",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1039871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T18:45:47.31Z",
                "reviewBody": "Tastes just like the dish I love at our favorite Indian restaurant. I make it low carb by using 1/2 cup tomato paste in place of the tomato puree so it thickens without the cornstarch. I also eliminate the water. I add thinly sliced almonds or chopped pistachios also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jani  Whitsett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/janiwhit/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T17:37:13.467Z",
                "reviewBody": "Wow! Finally a delicious Indian dish that doesn't take overnight marinating and tons of obscure ingredients. I didn't have any fresh ginger so I used half crushed garlic and a pinch of ground ginger and this was dynamite! Have all the prep work done (chopping measuring etc) before you heat the oil and you will be able to finish this dish in no time. My hubbie even loved it and he is not big on Indian food. This is definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Victoria Seley Lethbridge",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/640402/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-01T00:41:13.107Z",
                "reviewBody": "Took a lot longer than the stated 5 minutes but definitely worth it. Instead of the ginger-garlic paste I used 4 mammoth-sized garlic cloves and almost a Tbsp of ground ginger. I used cream instead of half and half and didn't have to put in any cornstarch as a result. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alexis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1579095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-27T04:25:06.967Z",
                "reviewBody": "Love this recipe. It has changed quite a bit since 2004, thanks to my SIL who's from Surat: In in a bowl, grate 1/2\" piece of fresh ginger and two cloves of garlic, add 1/4 ts salt, 1/4 ts dried fenugreek leaves [crushed], pinch of pepper and 1lb chicken pieces. Mix and set aside to marinate while you prepare/measure other ingredients.  \r\nHeat 2 tb of EVO in a large skillet, add the marinated chicken, cook half way through, [some pieces may be golden brown]- remove to a plate and reserve. \r\nMelt 2-3 tablespoons of butter in same skillet, stir in 1/2 onion roughly chopped, 1/2 jalapeno [seeded], 1/2\" fresh ginger and a pinch of salt; once onions have softened, add 2 ts chopped garlic, 1 bay leaf, 1 ts dry fenugreek leaves, 1 ts cumin powder, 1ts coriander powder, 1 ts garam masala, 1/4-1/2 ts cayenne pepper and a pinch of ground cardamom, after 30 seconds, add 2 C of crushed tomatoes [she uses Hunt's Natural] and 1 C of low sodium chicken stock. Bring to a boil; reduce heat to low and simmer until tomatoes are tender. Cool slightly, remove the bay leaf and CAREFULLY transfer the sauce to a blender/food processor. Process to a smooth sauce [1 minute]. Pour the silky sauce into same saucepan, return the bay leaf, add 1/2 C of half and half and the reserved chicken, add a bit more stock if it seems too thick, simmer for 5 minutes, gently stirring to avoid sticking, adjust seasonings [salt, masala, fenugreek, cayenne]. She often  adds 1 ts of Ketchup as her 'secret' ingredient.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2552928/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chicken Makhani (Indian Butter Chicken)",
            "description": "See how to make a simple, flavorful Indian recipe in just minutes.",
            "uploadDate": "2012-08-18T00:14:10.810Z",
            "duration": "PT5M9.017S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fcb05e417-9d70-436d-85cb-2825eea2e90a%2F25699eec-ec49-47cf-953f-029bcbbae53c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1791478505001"
        }
    }
]