[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/661/meat-and-poultry/chicken/chicken-thighs/",
                    "name": "Chicken Thigh Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/79521/slow-cooker-honey-garlic-chicken/",
        "name": "Slow Cooker Honey Garlic Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F86439.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-04T03:33:11.000Z",
        "description": "Easy to prepare and very tasty. Can also be baked with the same results if you don't have a slow cooker. Serve over rice.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT4H20M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 tablespoon vegetable oil",
            "10 boneless, skinless chicken thighs",
            "¾ cup honey",
            "¾ cup lite soy sauce",
            "3 tablespoons ketchup",
            "2 cloves garlic, crushed",
            "1 tablespoon minced fresh ginger root",
            "1 (20 ounce) can pineapple tidbits, drained with juice reserved",
            "2 tablespoons cornstarch",
            "¼ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in a skillet over medium heat, and cook chicken thighs just until evenly browned on all sides. Place thighs in a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, mix honey, soy sauce, ketchup, garlic, ginger, and reserved pineapple juice. Pour into the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover, and cook 4 hours on High. Stir in pineapple tidbits just before serving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the cornstarch and water in a small bowl. Remove thighs from slow cooker. Blend the cornstarch mixture into remaining sauce in the slow cooker to thicken. Serve sauce over the chicken.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Chicken Thigh Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "TORA.V"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.938730853391685,
            "ratingCount": 457,
            "itemReviewed": "Slow Cooker Honey Garlic Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "235.4 calories",
            "carbohydrateContent": "34.4 g",
            "cholesterolContent": "41.6 mg",
            "fatContent": "6 g",
            "fiberContent": "0.7 g",
            "proteinContent": "13 g",
            "saturatedFatContent": "1.5 g",
            "servingSize": null,
            "sodiumContent": "724.3 mg",
            "sugarContent": "30.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-05T17:59:29.217Z",
                "reviewBody": "Using the suggestions of some of the other reviewers, I didn't bother to brown the chicken first. [I'm of the same mindset, I want to have a one-pot meal and not bother dirtying other pots/pans] I put a cup of uncooked rice in the bottom of the crockpot first. I used scant powdered ginger instead of fresh, about 6 lightly smashed big cloves of garlic, and a couple of shots of teriyaki marinade & a splash or 2 of dry sherry.  I skipped the last thickening step with cornstarch; my \"secret\" to thickening many slow cooked soups and sauces is to add some instant mashed potatoes.  It came out great, the mashed potato wasn't noticable at all.  Everyone Loved It!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Stuart Dobson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1253597/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-20T00:39:54.837Z",
                "reviewBody": "Easy recipe to make. I agree with most of the reviewers. I substituted four skinless, boneless chicken breasts for the recipe, and did not brown. Just put all of the marinade right into the crock pot, mixed it (careful of splashing), added the breasts, and cooked on high for 2 hours. THen lowered it to \"low\" for one hour, added the pineapple, 15 minutes, and done. Added cornstarch - thickened right up. Don't be deceived - the recipe smells WAY too \"ginger-y\" but does not taste that way. IF I was going to go strictly on scent, I would have said \"this is going to be disgusting.\" When I tasted it, though, I was reminded that ginger is WAY more aromatic than it is gustatory, so it tastes very balanced. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason S. Spiegelman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2679923/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-14T13:12:59.607Z",
                "reviewBody": "Wow this dish is fabulous. It reminds me of terriaki chicken but with a heavier garlic taste to it. I made it with just 3 chicken breasts because we didn't need any more than that. I made the full amount of sauce. I did brown my chicken in a frying pan sprayed with pam however I believe that next time I will skip this part as it seems unnecessary. The chicken turns a nice brown color from the sauce so it seems odd to try to brown it first as well. I also did not have fresh ginger so I substituted 1 tsp of ground ginger. I also did not have a can of pineapple tidbits. So I just put in one small can of pineapple juice I think it was about 6 oz. I also scooped out the little pieces of garlic before I put in my cornstarch mixture. I think that next time I will leave the garlic whole and that will make it easier to take out later. Of course this is just a personal preference not to have chunks of garlic in my sauce. That is all that I changed and it turned out great! I served it with white rice and put some of the sauce on the rice. My kids did not want to eat it at first but after they tasted it they said it was good. Thank you!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie A.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1537856/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-22T01:35:27.233Z",
                "reviewBody": "Okay so the thing that attracted me to this recipe was the honey and garlic and slow cooker parts. I stuck to the recipe to the letter and mine did NOT look anything like the picture. I should have taken the advice of other reviewers to reduce cooking time. My chicken was dark dark brown. The sauce didn't thicken at all and so I had to pour it into a saucepan and boil it up - which sort of defeats my theory of using only the slow cooker for a meal. Anyways it was alright but as far as soy - ginger - garlic pineapple sauces go I have had better. Sorry won't make this again. Couple suggestions which might make this better: reduce soy sauce amounts substitute some chicken broth like another cook suggested use more ginger and honey...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "megs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1895806/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-02T00:09:27.03Z",
                "reviewBody": "This recipe was UNBELIEVABLE! I'm not a chicken person but my husband is and we BOTH loved this recipe. I didn't use the 10 chicken thighs that the recipe called for. Instead I used a 1lb. package of chicken breasts and cut the recipe for the sauce in half (approx.) I only had to cook the chicken for about 2 hours since there was so little compared to the original recipe - which was nice becuase I could still make it after work and eat at a decent hour. I didn't even bother to thicken the sauce and I served it over white rice. SO flavorful - I'll be making this one on a regular basis.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NMR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1186252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-15T00:54:20.3Z",
                "reviewBody": "So good! My son loved it. I served it with Jasmine Rice and broccoli. It tasted like Chinese takeout tastes close to General Tso sauce! I did take the advice to not cook for the full recommended time so it turned out perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2346602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-01T16:21:30.377Z",
                "reviewBody": "I have made this a bunch of times and it is always great. Make sure you check on it periodically I ve had the majority of the sauce evaporate on me. This recipe is so easy and the flavor is terrific.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs. Jeanotte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2136084/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-25T04:20:15.233Z",
                "reviewBody": "My family loved this and I liked it too. I used chicken breasts (on bone with skin removed) and after 4 hours they were perfect. I substituted a healthy amount of chopped candied ginger for the fresh with good results. i didn't have other reviewers issue of one flavor overpowering the rest. Flavors are strong but well balanced. Thank you for a great crock pot recipe that doesn't require cream soups from a can!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MBETHCOOKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1351636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-31T12:44:22.363Z",
                "reviewBody": "This was delicious my husbad loved it!!! Although I did change it a bit based on other reviewers' comments and the ingredients I had on hand. I only had chicken tenderloins and after cutting out that darn white tendon decided to cut the chiken into cubes. I put the unbrowned chicken in the crockpot on top of a few inces of sliced carrots. I added a bunch or green onions sliced (inlcuding all the green part) on top of the chicken. The marinade/sauce consisted 1/3 c soy sauce 1/3 c teriyaki marinade 1/2 c honey 3 tbsp ketchup 2 tbsp grated (not minced) fresh ginger root 3 heaping tsps of minced garlic. Just before serving I added a can of sliced water chestnus (personal preference). My husband thought the meal smelled so good he didn't want to wait for me to thicken the sauce. This will become a regualr in our household.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1833062/"
                }
            }
        ]
    }
]