[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/695/world-cuisine/asian/chinese/",
                    "name": "Chinese",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/91499/general-tsaos-chicken-ii/",
        "name": "General Tsao's Chicken II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8927463.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-06-19T03:12:49.000Z",
        "description": "A genuinely mouthwatering dish with an Asian kick that will knock your chopsticks off! Don't be fooled by other General Tsao impostors: this is simply the best Chinese chicken you will ever have. With a flair of peanut oil, a streak of sesame, a dash of orange, and a sweet spot for hot, this is sure to be a favorite. Just don't forget to deep-fry twice! Serve with steamed broccoli and white rice.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "4 cups vegetable oil for frying",
            "1 egg",
            "1 ½ pounds boneless, skinless chicken thighs, cut into 1/2 inch cubes",
            "1 teaspoon salt",
            "1 teaspoon white sugar",
            "1 pinch white pepper",
            "1 cup cornstarch",
            "2 tablespoons vegetable oil",
            "3 tablespoons chopped green onion",
            "1 clove garlic, minced",
            "6 dried whole red chilies",
            "1 strip orange zest",
            "½ cup white sugar",
            "¼ teaspoon ground ginger",
            "3 tablespoons chicken broth",
            "1 tablespoon rice vinegar",
            "¼ cup soy sauce",
            "2 teaspoons sesame oil",
            "2 tablespoons peanut oil",
            "2 teaspoons cornstarch",
            "¼ cup water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat 4 cups vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the egg in a mixing bowl. Add the chicken cubes; sprinkle with salt, 1 teaspoon sugar, and white pepper; mix well. Mix in 1 cup of cornstarch a little bit at a time until the chicken cubes are well coated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In batches, carefully drop the chicken cubes into the hot oil one by one, cooking until they turns golden brown and begin to float, about 3 minutes. Remove the chicken and allow to cool as you fry the next batch. Once all of the chicken has been fried, refry the chicken, starting with the batch that was cooked first. Cook until the chicken turns deep golden brown, about 2 minutes more. Drain on a paper towel-lined plate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat 2 tablespoons vegetable oil in a wok or large skillet over high heat. Stir in the green onion, garlic, whole chiles, and orange zest. Cook and stir a minute or two until the garlic has turned golden and the chiles brighten. Add 1/2 cup sugar, the ginger, chicken broth, vinegar, soy sauce, sesame oil, and peanut oil; bring to a boil and cook for 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve 2 teaspoons of cornstarch into the water, and stir into the boiling sauce. Return to a boil and cook until the sauce thickens and is no longer cloudy from the cornstarch, about 1 minute. Stir the chicken into the boiling sauce. Reduce heat to low and cook for a few minutes until the chicken absorbs some of the sauce.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian",
            "Chinese"
        ],
        "recipeCuisine": [
            "Asian",
            "Chinese"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ChefDaddy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.767053701015965,
            "ratingCount": 1378,
            "itemReviewed": "General Tsao's Chicken II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "633.5 calories",
            "carbohydrateContent": "54.9 g",
            "cholesterolContent": "101.1 mg",
            "fatContent": "36.5 g",
            "fiberContent": "0.8 g",
            "proteinContent": "24.3 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "1191.6 mg",
            "sugarContent": "17.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-23T02:51:54.69Z",
                "reviewBody": "I have done this several times, perfectly following the recipe the first time, then throwing rules out and following only the second HALF of the recipe after. I have subbed, omitted, or added as I found differences in my pantry from what the recipe calls for. I give this a 5 star rating based not only on the recipe but also on the friendliness with which it accepts adaptation. We now use plain sauteed chicken breast chunks, no frying required, remove them from the skillet, start the sauce, toss them back in at the end. After doing it the \"right\" way I can honestly say this recipe is also perfect the way we do it now, and has gone from a time-consuming Sunday dinner to a quick weeknight prep that my family requests frequently. We have even had it two nights in a row by demand! And there have NEVER been leftovers. *^_^* I double sauce too, it's what I eat over rice now, since after dishing up for two boys, a teenage girl, a very hungry man, and a baby girl who likes EVERYTHING, there's not much LEFT but sauce! We love it. I hope it might save some time for others who are put off by the double fry, to know it's perfectly delicious done this way. It saves time, fat (!), and the individual ingredients each still shine. Thanks for sharing this with us ChefDaddy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "opheliarising",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6738202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-05-17T23:49:49.44Z",
                "reviewBody": "Okay, so in my humble opinion, when ordering General Tso Chicken, Sesame Chicken or Orange Chicken from a Chinese restaurant, the base sauce reicpe is the same, they simply add spice to the General Tso, sesame seeds to the Sesame Chicken, and orange peel (with a little spice) to the Orange Chicken. So, that being said, you can do the same with this recipe. I omitted the red chili's because I don't like the spice and added a little extra orange peel because I like it citrusy. I also used fresh ginger (chopped) instead of ground and again, it's just a personal preference. The soy sauce I used was called Ponzi sauce which is a soy sauce with a citrusy flavor to it....are you starting to see the pattern with me =) All in all this is a great recipe and I will definitely be making again and again. Thank you ChefDaddy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katie O'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2118653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-07T23:01:17.437Z",
                "reviewBody": "This was almost exactly the flavor we were looking for. We did use chicken breasts instead of thighs but literally was the best General's we've ever tasted. The sauce was wonderful, could really taste the hint of orange, sesame, peanut, chili pepper.  Not sure I understand the double fry method but I followed it exactly and was rewarded with the best homemade or restaurant chinese we've ever tasted.  Give this one a try, it was fantastic.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PrairieCookinBarb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2592358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-04T18:04:55.987Z",
                "reviewBody": "Wow! This was really terrific- tastes exactly like Chinese restaurant General Tsao's. \nI did not have peanut oil, so I winged it with a T. of peanut butter and that worked well, and it also thickened the sauce so I got to skip the last step with the cornstarch, even though I also added 1/3 cup of orange juice to it earlier.\nI use fresh ginger juice for everything, and it was a little brighter in flavor than the powder. \nOur guests really went wild over this- they simply couldn't believe that this recipe could be made so easily at home. My only complaint...no leftovers for lunch today :(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bonappetit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4057463/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-10T00:23:18.707Z",
                "reviewBody": "This recipe is incredable!!!  We did \"tweek \" it a bit.  First, prepare your seasonings!!!  It makes the cooking and mess so much better (I learned the hard way the first time.)  Also, double the sauce.  I also added a pinch of 5 spice (found at your Asian market) and it made the sauce come to life.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOOREMONROE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1265985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-25T02:54:16.493Z",
                "reviewBody": "Delicious! This was so good, I will definitely make again and again.  I was stretched for time, so I pan fried the chicken with a little vegetable and sesame oil.  I wanted to add some vegetables so I added bell pepper and snow peas.  When I was sauteeing the garlic, I added one chopped sweet onion.  I also took the advice of other reviewers and substituted orange juice (about 1/3 cup) for the orange zest and substituted peanut butter (about 1 tablespoon) for the peanut oil and eliminated the green onion.  I also didn't have whole red chilies, so I added some crushed red pepper (about 1/8 teaspoon).  Put everything over some brown rice and it was wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thekearns2004",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3858771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T17:28:42.867Z",
                "reviewBody": "This is just like you get in a chinese restaurant.  My family likes it saucy, so I made it with double the sauce.  Also I couldn't find the dry red peppers so I used a chinese red pepper paste which allowed me to adjust the hot spicy temperature up a bit (my family likes it hot) wish there was a way to deep fry the chicken with less mess, but it is worth it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "altron305",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4033691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-10T18:46:46.363Z",
                "reviewBody": "Yum! Definatly will make again. I pan fried the chicken in just enough oil to cover the bottom of the pan well as to make is a touch more healthy and only did the frying once. Otherwise stuck to the recipe and yum yum yum. Normally I give 5 stars to restaurant quality and although not quite that really good and satisfied my chinese need.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STACEYERINCOOKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1181953/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-18T17:53:35.58Z",
                "reviewBody": "Delicious. I followed the recipes with only a few differences. Couldn't find a good price on thighs so I used breasts. Didn't want to buy peanut and sesame oil for one recipe I didn't miss it. I loved it and so did the family but next time I will cut open some of the chilis and add more it just wasn't spicy enough for our hot mouths. I want more orange flavor but my husband doesn't. So until he makes this himself I will add more orange peel. I will use less soy sauce also I think it hide some of the other flavors. Good recipe thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "nillazilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3162944/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-22T00:34:21.337Z",
                "reviewBody": "I didn't care for this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Patti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8152899/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "General Tsao's Chicken II",
            "description": "Mouthwatering  chicken in a slightly sweet and spicy sauce.",
            "uploadDate": "2014-01-01T23:10:42.653Z",
            "duration": "PT3M28.667S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F36d63c0c-58ff-456b-aa44-9dfc8379f381%2F5a8bd794-26f7-4471-b290-766852281746%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2999204310001"
        }
    }
]