[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1246/soups-stews-and-chili/soup/chicken-soup/",
                    "name": "Chicken Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219936/spicy-chicken-thai-soup/",
        "name": "Spicy Chicken Thai Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2449461.jpg",
            "width": 1024,
            "height": 1024
        },
        "datePublished": "2012-01-27T19:16:14.000Z",
        "description": "Most of the ingredients for this Thai-inspired soup can be found in the supermarket. The red curry paste is spicy, but by controlling the amount of paste you add, you can tailor this to your own threshold of pain.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "3 lemongrass stalks, bottom two-thirds of tender inner bulbs only, thinly sliced",
            "4 cloves garlic, chopped",
            "1 (4 inch) piece fresh ginger root, chopped",
            "4 cups chicken broth",
            "1 tablespoon vegetable oil",
            "2 ½ pounds skinless, boneless chicken thighs, cut into chunks",
            "12 ounces fresh white mushrooms, quartered",
            "2 teaspoons red curry paste",
            "3 tablespoons fish sauce",
            "1 lime, juiced",
            "2 (14 ounce) cans coconut milk",
            "1 red onion, sliced",
            "½ bunch cilantro, roughly chopped",
            "1 lime, cut into wedges, for serving",
            "1 fresh jalapeno pepper, sliced into rings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir lemon grass, garlic, and ginger together in a large stock pot over medium-high heat. Stir in chicken broth and bring to a boil. Reduce heat to low and simmer for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain chicken broth and set aside. Discard lemon grass, garlic, and ginger.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat vegetable oil in a large soup pot over medium heat; Stir in chicken; cook and stir for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in mushrooms and cook for 5 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir in red curry paste, fish sauce, and lime juice until combined. Stir in chicken broth and coconut milk; return to a simmer and cook on low for 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Skim off any excess oil and fat that rises to the top and discard.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir red onion into the chicken mixture; cook and stir until onion softens, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat and add about 1/2 the cilantro.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Serve with plates of cilantro, lime wedges, and fresh sliced jalapenos.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Chicken Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6911764705882355,
            "ratingCount": 408,
            "itemReviewed": "Spicy Chicken Thai Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "596 calories",
            "carbohydrateContent": "14.3 g",
            "cholesterolContent": "114 mg",
            "fatContent": "44.8 g",
            "fiberContent": "3 g",
            "proteinContent": "41 g",
            "saturatedFatContent": "28.9 g",
            "servingSize": null,
            "sodiumContent": "1207.4 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2015-02-10T03:33:58.717Z",
                "reviewBody": "This soup is amazing! I made it about 5 times in 4 weeks and everyone was raving about it. I tweaked the recipe each time and this is my recommendations:\n1. use 1 can of coconut milk, not 2. Using 2 totally dilutes the flavors. \n2. I add 2 kafir lime leaves, for an authentic Thai flavor. \n3. Instead of straining the broth, I use a large infuser ball and keep the garlic, ginger, lime leaves and lemon grass inside,and keep it in the finished soup product so the soup gets as much kick as possible. \n4. For a one pot cooking method, I sautee mushrooms in the oil, add fish sauce, and then add the broth/infuser ball (with garlic, ginger, lemon grass and lime leaves). After adding the broth, I added an entire boneless chicken leg/thigh and let it cook in the broth. After chicken is cooked, I removed it, shredded it and added it back to the pot. Then I added 1 can of coconut milk, curry paste, lime juice. Finish by garnishing with red onions, cilantro, jalapeno slices and lime wedge garnish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maryam Dadabhoy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10717169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-12T02:00:52.637Z",
                "reviewBody": "This recipe was delicious.  There is something missing from the recipe, in step #5 it says to add the lime juice, but nowhere in the ingredients is lime juice listed other then the limes for garnishment.  I used 2 tablespoons because I found another thai recipe similiar to this one and that's what it called for.  Other then that, I followed this recipe to a T, and it was wonderful.  Although, next time I would like a little more heat and will use serrano peppers instead of jalapenos.  Also, this is a light soup recipe, and if your looking to make it more hearty try using basmati rice or glass noodle with it.  They are both great.  Thanks for sharing, will be using this often.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sherbear1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sher_bear1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-25T23:28:36.883Z",
                "reviewBody": "Seriously delicious and very filling. Two minor changes: (i) 1 1/2 lbs. of skinless, boneless chicken thighs & 1 lb. chicken tenderloins rather than all thighs, and (ii) 4 tsp. red curry paste rather than 2 tsp. Chef John’s video for making this soup is worth watching, and apparently reflects the original way he made it versus this version seemingly altered by AR slightly. Great recipe, great soup . . . grand slam homer, Chef John.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ConkyJoe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6974221/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-24T23:29:34.847Z",
                "reviewBody": "Really good! I poached this chicken in the broth but did everything else as written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Em",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3871116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-26T22:09:00.437Z",
                "reviewBody": "Make it easy on yourself and use Gourmet Garden. 1/2 tube minced ginger 1/2 tube minced lemon grass 4 tsp minced garlic you will still need to strain it. I went to 3 stores before finding the red curry paste and it really didn't add much spice. I would substitute ground red pepper and use a lot of it as the coconut milk neutralizes spice. I used 3 chicken breasts and added 2 fresh tomatoes sliced at the end of the cooking. The fresh limes and fresh cilantro are an absolute must. Oh yeah the fish sauce is disgusting so just use a little salt. Serve with jasmine rice or rice noodles. This soup is every bit as good as what I have had in restaurants in Hawaii Key West and Miami. The first time I tried it I reported to my mom that I just had the most awakening soup that tasted of chicken lime and milk. Bizarre but it totally works.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Candace N David Bonham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10143148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-09T23:44:10.27Z",
                "reviewBody": "Just tried written directions left out a couple steps so watch the video (when to add prepared stock and how much lime juice (you squeeze two limes and stock goes in just before coconut milk)). I loved it and I only like mild spice. I agree with another reviewer the Thai Kitchen red curry paste is good but I actually had to add more and I only used 1 can of coconut milk! But this was very good with brown rice. Next time I will try the light coconut milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "preed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-15T15:20:22.71Z",
                "reviewBody": "I made this last night for my in-laws who are \"foodies\" and members of gourmet clubs. They absolutely raved about this recipe and wanted to know where I got it. They both said it tasted \"restaurant worthy\". I am not an experienced chef so I like recipes that aren't too complicated. This recipe is not complicated but I do recommend watching the video as I found it very helpful to watch the steps being performed. The grocery store I went to didn't have fresh lemon grass so I bought the minced lemon grass that is sold in a tube. One tube equals 6 lemon grass stalks so I squeezed half of the tube into the chicken broth. It was perfect and I doubt I'll use fresh lemon stalk in the future. Also I used 3/4 teaspoon red curry paste and the soup was not spicy at all. When I cook it just for me and my husband I will kick it up a notch. Thank you for sharing such an awesome recipe! Love it and will be making this from here on out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "klech",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5077237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-05T23:36:33.08Z",
                "reviewBody": "I started making soup every Sunday for football season so I am standing in front of a TV watching the Red Zone instead of sitting in front of a TV. I made this soup last Sunday and will make it many times again in the future. The only thing I changed was adding twice the red chili paste like other reviewers sliced shiitake mushrooms more broth and cooked longer because I wanted the red onions softer. It was a challenge trimming the fat off the chicken thighs but worth the flavor and moistness breasts do not give. I appreciated Chef John's tip straining out the ginger lemon grass garlic cooking in chunks and using the lite and regular coconut milk. I served it with 1/4 cup basmati rice. This was so tasty it was gone in two days. I am making Chef John's gumbo today. Go Colts!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1385233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-12T00:46:55.23Z",
                "reviewBody": "This is very close to the Authentic Tom Yum soup we made in a cooking class in Thailand. Fabulous! We added 4x the amount of red curry paste and it wasn't very hot but very flavorful. Love this recipe! A great alternative to boring chicken noodle soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maureen Berkan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8374231/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-13T23:15:57.453Z",
                "reviewBody": "I had some problems with the recipe. First despite using less chicken than recommended I ended up needing to add extra broth as there wasn't enough liquid. Second even with the extra broth it was almost impossible to skim the top of fat as my spoon kept running into chicken pieces and vegetables. Third I really think the chicken should be more seasoned on its own either with some kind of marinade or rub or at least in the skillet with salt and pepper. Finally I wonder if maybe the garlic lemongrass and ginger should stay in the soup rather than being discarded. The soup I ended up with was very bland other than the jalapeno slices and they were just random heat since they were put in at the end as garnish. I will admit I did not use the cilantro as I strongly dislike it. This is the second \"spicy\" \"Thai\" soup I've made from Allrecipes that has been bland. I have a few others to try but I'm thinking I might have to make up my own recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth Heffernan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ravencorbie/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spicy Chicken Thai Soup",
            "description": "Spicy Chicken Thai Soup",
            "uploadDate": "2011-10-06T18:01:31.239Z",
            "duration": "PT7M9.883S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F67ef6d34-27bc-4747-92ea-61171055fd97%2F6f9b7edb-e9cd-49cd-a01f-c605c4a380a2%2F120x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1204554691001"
        }
    }
]