[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/691/meat-and-poultry/turkey/whole/",
                    "name": "Whole Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13521/maple-roast-turkey-and-gravy/",
        "name": "Maple Roast Turkey and Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6525.jpg",
            "width": 1504,
            "height": 1000
        },
        "datePublished": "1998-11-08T01:30:11.000Z",
        "description": "A New England style turkey with maple syrup. It makes for a mellow Thanksgiving dinner. Try stuffing it with Cranberry, Sausage and Apple Stuffing.  If fresh marjoram is unavailable, 2 teaspoons of dried marjoram may be substituted.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT4H30M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "2 cups apple cider",
            "⅓ cup real maple syrup",
            "2 tablespoons chopped fresh thyme",
            "2 tablespoons chopped fresh marjoram",
            "2 ½ teaspoons grated lemon zest",
            "¾ cup butter",
            "salt and ground black pepper to taste",
            "14 pounds whole turkey, neck and giblets reserved",
            "2 cups chopped onion",
            "1 cup chopped celery",
            "1 cup coarsely chopped carrots",
            "2 cups chicken stock",
            "3 tablespoons all-purpose flour",
            "1 teaspoon chopped fresh thyme",
            "1 bay leaf",
            "2 tablespoons apple brandy"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Boil apple cider and maple syrup in a heavy saucepan over medium-high heat until reduced to 1/2 cup (about 20 minutes). Remove from heat and mix in 1/2 of the thyme and marjoram and all of the lemon zest. Add the butter, and whisk until melted. Add salt and ground pepper to taste. Cover and refrigerate until cold (syrup can be made up to 2 days ahead).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Place oven rack in the lowest third of oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wash and dry turkey, and place in a large roasting pan. Slide hand under skin of the breast to loosen. Rub 1/2 cup of the maple butter mix under the breast skin. If planning on stuffing turkey, do so now. Rub 1/4 cup of the maple butter mixture over the outside of the turkey. With kitchen string, tie legs of turkey together loosely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the chopped onion, chopped celery, and chopped carrot around the turkey in the roasting pan. If desired, the neck and giblets may be added to the vegetables. Sprinkle the remaining thyme and marjoram over the vegetables, and pour the chicken stock into the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast turkey 30 minutes in the preheated oven. Reduce oven temperature to 350 degrees F (175 degrees C), and cover turkey loosely with foil. Continue to roast, about 3 to 4 hours unstuffed or 4 to 5 hours stuffed, until the internal temperature of the thigh reaches 180 degrees F (80 degrees C) and stuffing reaches 165 degrees F (75 degrees C). Transfer turkey to a platter, and cover with foil. Reserve pan mixture for gravy. Allow turkey to sit about 25 minutes before removing stuffing and carving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Gravy: Strain pan juices into a measuring cup. Spoon fat from juices. Add enough chicken stock to make 3 cups. Transfer liquid to a heavy saucepan and bring to a boil. In a small bowl, mix reserved maple butter mixture with flour to form a paste, and whisk into the broth. Stir in thyme, bay leaf, and apple brandy. Boil until reduced and slightly thickened. Season with salt and pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Whole Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ibby"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.655948553054662,
            "ratingCount": 311,
            "itemReviewed": "Maple Roast Turkey and Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "584 calories",
            "carbohydrateContent": "10.5 g",
            "cholesterolContent": "206.4 mg",
            "fatContent": "29.3 g",
            "fiberContent": "0.6 g",
            "proteinContent": "65 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "313.6 mg",
            "sugarContent": "7.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-22T01:04:50.717Z",
                "reviewBody": "I took a chance and tried this for Thanksgiving a gigantic leap for somebody like me who grew up with butter-only glaze. But I was so wonderfully rewarded with the most perfect turkey I ve ever made. It s sweet but not too sweet and it really melts in your mouth. And it beautifully roasts your turkey to a Hollywood Thanksgiving Turkey golden color that almost makes you feel guilty eating it. The gravy Oh so tasty. It goes great on the turkey great on mashed potatoes great sopped up with biscuits pretty much a wonderful compliment to all of your Thanksgiving sides. And this makes the most unbelievable stock. Team this turkey with mixed bread sage sausage stuffing (find the sage sausage by Jimmy Dean) a shot of white wine and you ll amaze your family with the fantastic meal you ve put together. Here are some basic tips for Thanksgiving turkey though It seems that not everybody on this board has been introduced to the wonder that is Oven Bags. I promise you this recipe in an Oven Roaster Bag and you ll think you ve died and gone to heaven. It browns your turkey perfectly and is much easier than foil. Cut up 2 onions and throw them in the bag sprinkle about a tablespoon of flour in the bag and shake until the onions are well coated Put in the turkey and this sauce. Cut some slits in the bag throw it in the oven and every 30 40 minutes stick a baster in one of the slits and coat the turkey. Voila!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JERUSHAGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1315857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-14T15:16:33.06Z",
                "reviewBody": "I agree with an earlier review... I've made this the past 4 years to rave reviews.  It was the first turkey recipe I tried as a newlywed, and now my mother and grandmother request little old me to make the turkey at the holidays.  What an honor, and all thanks to this amazing recipe!  I, too, serve with the Sausage, Apple & Cranberry stuffing and it's a perfect match.  I also serve with smashed yams with orange juice, Cranberry Sauce Extrordinaire (also from this site) and creamy mashed potatoes... it's a perfect meal!  We love Roasted Butternut Squash soup with rolls and salad the night before.  It's filling, but leaves plenty of room for the Big Day's Menu!  Thanks Ibby!!  (if you're a new cook I highly recommend trying this, it's simple to follow and always turns out)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PUTIGER00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/623573/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-16T18:03:53.323Z",
                "reviewBody": "I've made this recipe the past two Thanksgivings and plan to use it again this year. The turkey always comes out moist, and the gravy has amazing flavor! The only thing I do differently is add a lot more chicken stock at the bottom of the roasting pan (a lot of it evaporates during cooking).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-01T21:15:31.58Z",
                "reviewBody": "Great recipe! However I like to play around with things and found that a couple minor changes resulted in the best turkey I have ever eaten (my family agrees). The sweetness was a welcome change and especially great since my son and my husband both have a huge sweet tooth. I did add some brown sugar to the maple-butter glaze. Also I had a large turkey injector left from thanksgiving and made my own injector butter mixture. I melted two sticks of butter added 1/2C apple cider 1/4C maple syrup and 1/4C brown sugar. heated over low-med heat until butter was melted and sugar was dissolved then injected all of the mixture into the turkey. Oh man it was good! Oh and for easy suffing just buy the boxed stuff and chop up a sweet apple (i use gala) and thaw some frozen cranberries. Add the fruit to the stuffing when you prepare it then stuff it all into the bird. So good and very easy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Whitney Hempsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2785755/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-18T22:00:19.057Z",
                "reviewBody": "I'm updating my review after several years because I could not have Thanksgiving without this recipe. The turkey comes out wonderfully every time and the gravy it makes has become the stuff of legend in my family. The flavor of the turkey is such a hit with friends and family that I have been asked to bring the turkey to a Thanksgiving celebration at someone else's house! ------------ This didn't make for the juciest turkey but the bird came out looking like it was right out of a magazine and smelling fabulous. The gravy I made from the pan juices was literally the best I have ever had EVER! And everyone else said so too. Next time I would brine my bird before hand to make it juicy because that's all it's lacking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JackieO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T01:07:36.407Z",
                "reviewBody": "The turkey did come out wonderful. Very moist.I am changing this review to give it 4 stars for the turkey ONLY. The gravy was not a favorite for us. The gravy was very very sweet. I had 2 pkgs of McCormick turkey gravy on hand that I made and added to it and still very sweet. So I added some white wine to it. That did take some of the sweetness away but still left it very sweet. If I do make this turkey recipe again which I probably will. I would not use the drippings for the gravy. I would use store bought or make some ahead of time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "TEESA2YOU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1418704/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-28T21:10:55.03Z",
                "reviewBody": "This was a delicious turkey. A nice change from the traditional flavor. I stuffed this with the \"Awesome Sausage Apple and Cranberry Stuffing\" from this site and this made the best Turkey and stuffing I've ever eaten. I'll be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BATCAVES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/batcaves/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-01T23:53:06.777Z",
                "reviewBody": "This recipe is going to be standard from now on for Turkey with me. I cooked a Turkey last week (August -- I know but it was good practice and I had an extra bird in my freezer). Had to substitute cider with Simply Apple juice and added a fresh sliced Granny smith for the fruit essence and fished it out of reduction later; lime zest for lemon. It is truly the Maple Syrup that makes this. My butter was a bit wet as I increased the ingredients but no matter. I did not incorporate the veggies but melded the drippings with some stock and the gravy was out of this world. I separated the butter from the drippings and used it to crisp up potatoes. Dried marjoram worked fine. I had fresh Thyme from garden. I cooked bird in dome-covered roasting pan (Oneida)-- basted ONCE! and it came out perfectly tender. Great recipe. Only took 2.5 - 3 hours with 20 pounder.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Martin Sparks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/martinsparks/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-13T23:23:42.173Z",
                "reviewBody": "This recipe was tremendous. The turkey turned out juicy and succulent. The only thing I did differently was to stuff a bulb of garlic and some sprigs of rosemary in the turkey cavity before roasting. The gravy was some of the best I've ever tasted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CELTIC CHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1525530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-30T21:14:00.82Z",
                "reviewBody": "The turkey tasted good though the maple flavor didn't really come through except for in the gravy made later. That was quite sweet so my mom added salt and spices to make the gravy more traditional. I made the maple/butter mixture the night before as well and the next day it was all separated. The butter floated to the top and became hard again in the refridgerator while the maple apple juice and spices remained liquids underneath the butter. I had to break it apart mix it as well as I could and stuff the hard maple butter brickle under the skin. I rubbed the liquid part all around the outside of the turkey. Decent flavor at the end just hard to follow through on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3077203/"
                }
            }
        ]
    }
]