[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/691/meat-and-poultry/turkey/whole/",
                    "name": "Whole Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/56348/a-simply-perfect-roast-turkey/",
        "name": "A Simply Perfect Roast Turkey",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F17%2F56348-a-simply-perfect-roast-turkey-tout-AR.jpg",
            "width": 2000,
            "height": 1000
        },
        "datePublished": "2019-04-02T06:45:29.000Z",
        "description": "Simple, perfect roast turkey just like grandma used to make. Seasoned with salt and pepper, and basted with turkey stock, the flavors of the turkey really stand out. Stuff with your favorite dressing.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT4H0M",
        "totalTime": "P0DT4H30M",
        "recipeYield": "24 servings",
        "recipeIngredient": [
            "1 (18 pound) whole turkey",
            "½ cup unsalted butter, softened",
            "salt and freshly ground black pepper to taste",
            "1 ½ quarts turkey stock",
            "8 cups prepared stuffing"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Place rack in the lowest position of the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the turkey neck and giblets, rinse the turkey, and pat dry with paper towels. Place the turkey, breast side up, on a rack in the roasting pan. Loosely fill the body cavity with stuffing. Rub the skin with the softened butter, and season with salt and pepper. Position an aluminum foil tent over the turkey.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place turkey in the oven, and pour 2 cups turkey stock into the bottom of the roasting pan. Baste all over every 30 minutes with the juices on the bottom of the pan. Whenever the drippings evaporate, add stock to moisten them, about 1 to 2 cups at a time. Remove aluminum foil after 2 1/2 hours. Roast until a meat thermometer inserted in the meaty part of the thigh reads 165 degrees F (75 degrees C), about 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the turkey to a large serving platter, and let it stand for at least 20 to 30 minutes before carving.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Whole Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Syd"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.824399260628466,
            "ratingCount": 541,
            "itemReviewed": "A Simply Perfect Roast Turkey",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "662.6 calories",
            "carbohydrateContent": "13.7 g",
            "cholesterolContent": "211.4 mg",
            "fatContent": "33.8 g",
            "fiberContent": "0.9 g",
            "proteinContent": "72.2 g",
            "saturatedFatContent": "10.4 g",
            "servingSize": null,
            "sodiumContent": "709.5 mg",
            "sugarContent": "2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-14T23:59:41.377Z",
                "reviewBody": "This is the turkey recipe I used when I roasted my first-ever 19lb bird three years ago.  It turned out perfectly then and has every year since.\n\nMy version calls for placing the turkey on a v-shaped rack in the roasting pan.  This allows air to circulate under the bird and should address any issues related to the bottom not cooking as thoroughly as the top or being soggy.  I have never had to turn the bird over.   \n\nOther hints:  truss the wings under the bird with baking string or wrap in aluminum foil to keep from over-browning. For the rest of the turkey, I place the aluminum foil tightly over the breast-portion only.  Then, I remove the foil on the breast 1 hour before the bird is done (my 19lb birds, stuffed, tend to roast in about 5 hours, so I remove at the 4 hour mark).  The breast is always beautifully brown and not overdone; very juicy!  Baste as directed (every 30 minutes) with turkey or chicken stock.  When you check the temperature, be sure you're not hitting the bone; keep it in the fleshy part of the thigh meat.  I also check the internal temperature of the stuffing to ensure it's at 160.  \n\nStanding time is *important.*  I rest mine at least 30 minutes, up to 45. It won't get cold--keeps it juicy!\n\nI use good quality boxed or homemade chicken stock instead of turkey stock.\n\nThis is such an easy recipe.  You don't need to over-think it or second-guess it.  It's worked for me every single time.  And...the drippings make delicious pan gravy!  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/219722/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-22T04:24:22.35Z",
                "reviewBody": "OH MY GOSH... what a shock to see *my* secret recipe on the internet... lol.  I've always done my turkey mostly this way.  I also put butter under the skin as some reviewers do...  and use chicken broth.  Oh!!  and big ol chunks of onions and celery around, under and in the bird.  But (I don't recommend this method) I put my bird in on 250 degrees late late Wednesday night... don't baste at all, get up early and remove foil, baste REALLY well, turn up the heat to 375 until brown, basting often.  Always excellent!!  Frees up my oven, we wake up to the smell of *Thanksgiving* and it really sets a great mood for the day.  Have done this for years!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Danna Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/flybananas/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-22T14:27:39.34Z",
                "reviewBody": "I used this recipe for our Thanksgiving turkey and my family loved it! I put 1/4 cup of butter between the breast meat and the skin, then after each basting I brushed the entire turkey with melted butter. Not the greatest method for calorie counting, but I've never had a turkey so moist. It was incredible!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Nicol",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/740329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-26T15:28:42.92Z",
                "reviewBody": "This is a great recipe to follow for a traditional turkey for the holidays.  I never used stock in the bottom of the pan before and it added great flavor to the gravy.  I have been making turkey for T-day for 27 years now.  I suggest the following additions: choose a fresh turkey, rub softened butter under the skin of the turkey breast too, and put the turkey in the oven @ 425 for the first 1/2 to 1 hour (especially if it is right out of the fridge, or plan on adding cooking time).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1598622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-21T03:50:17.947Z",
                "reviewBody": "I made this turkey last year for my first ever attempt at Thanksgiving.  It was so juicy that we barely recognized it as turkey!  One tip for those who don't have a roasting rack and want to avoid the sogginess that is mentioned, place the turkey on top of whole carrots.  The carrots will keep the turkey above the broth, and this way you can use a disposable aluminum roaster.  I followed the recipie to a T last year, but this year I'm going to add some citrus in the cavity and some lemon zest and parsely to the butter.  This is a great recipie as is, but it is so simple that its easy to add your own flair.  The broth in the bottom is really what gets the amazing results!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rochelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2171663/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T22:43:30.197Z",
                "reviewBody": "This is a great method. As stated in other reviews, definitely cover only the breast portion of the Turkey, and remove an hour before cooking time is finished. One helpful tip is to be sure loosen the skin from the breast, and actually place mayonnaise inside. I found that adding your seasonings and herbs, like sage, paprika, and garlic to mayo helps them to \"stick\" to the bird better while cooking - it creates such beautiful, brown skin, also.     I don't like to have to keep opening my oven and basting a turkey. Every time you open your oven, you can lose up to 20 degrees of heat! To get around this, I peel, core, and slice 1 apple (any variety that I have lying around) and slide the slices under the skin as well. The sweetness of the apple, as it roasts under the skin, handsomely offsets the saltiness, keeps the breast moist, and basting at a minimum. I still baste once or twice, with the drippings that accumulate in the roasting pan, but not nearly as often as I did in previous years. My turkey was excellent, and the gravy was wonderful.     Also, If you don't want to stuff the turkey with stuffing, place it in a separate pan to cook, and use turkey stock to moisten. That way, you can fill your cavity with quartered onions, more sliced apples, and celery, adding additional moisture inside, and enhancing the drippings and flavor outside. Hope this helps!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Steve",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mreatright/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-08T13:58:10.997Z",
                "reviewBody": "Made this last night. Make sure that you put a bit of butter between the skin and the meat...like another reviewer suggested and don't forget to baste the turkey. It turned out wonderful and so moist. This is definatly a great basic and easy turkey recipe. Thanks for the post.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-18T14:13:33.327Z",
                "reviewBody": "If you want a moist bird this is the recipe you've been looking for. EASY & JUICY. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BE-O-BE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/be-o-be/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-17T23:28:51.997Z",
                "reviewBody": "I love turkey. Most of the time turkey is dry not this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FLORIDADAVE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2012222/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-27T18:06:35.7Z",
                "reviewBody": "This was my first attempt at a turkey and I'm sure I must have done something wrong but I can't figure it out. I had a 16 lb turkey and followed this recipe exactly. I even set a timer to baste every 30 minutes as instructed. The turkey \"looked\" perfect like out of a movie or something. However after 5 1/2 hours of cooking this turkey was still not totally cooked.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "nataliesmom2002",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2140612/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "A Simply Perfect Roast Turkey",
            "description": "See how to make a perfect roast turkey.",
            "uploadDate": "2012-05-09T00:12:32.691Z",
            "duration": "PT3M32.045S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fdd1cb159-f6dd-48ff-89d3-1382cfd8c7de%2F098120b5-1a08-42ca-bd83-0fb689a1adca%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1628807462001"
        }
    }
]