[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/691/meat-and-poultry/turkey/whole/",
                    "name": "Whole Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/76953/roast-turkeys-with-rich-pan-gravy/",
        "name": "Roast Turkeys With Rich Pan Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1619.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "2020-06-19T03:11:25.000Z",
        "description": "Over the years, I've developed a first-rate, do-ahead menu. Here's how: I roast two small turkeys instead of one big one. We all like the idea of someone carving the turkey at the table, but here's the reality: Most people don't know how. You're gonna get turkey juices all over that nice white tablecloth, while the side dishes turn tepid. So carve one in the kitchen and use the second one for display. The second turkey is strictly for show, seconds and leftovers.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 turkeys",
        "recipeIngredient": [
            "2 turkeys (10 to 12 pounds each), neck and giblets discarded",
            "3 cups kosher salt (do not use regular table salt)",
            "2 cups granulated sugar",
            "2 unpeeled medium onions, coarsely chopped",
            "2 unpeeled medium carrots, coarsely chopped",
            "2 stalks celery stalks, coarsely chopped",
            "2 tablespoons melted butter",
            "1 cup dry white wine or vermouth",
            "4 cups low-sodium chicken broth",
            "¼ cup cornstarch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "The night before roasting, dissolve salt and sugar in 3 gallons of cold water in a large, clean ice chest or similar container in a cold spot, such as an unheated basement or garage. For those in warm climates, add ice packs to keep turkeys cool. Add turkeys, breast-side down; cover and let stand about 12 hours. (This brining keeps the turkey from drying out and seasons it right down to the bone.) Drain. Rinse turkeys and pat dry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "About five hours before serving, set oven to 425 degrees and adjust oven rack to lower-middle position. Place turkey No. 1 breast-side down and cut out the back with kitchen shears. Open up turkey and turn it breast-side up, pressing on it with your palms so it lies flat. Place turkey, skin-side up, on a lipped cookie sheet over a bed of half the chopped vegetables. Brush turkey with butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast until a meat thermometer inserted into the thigh registers 175 degrees, 1 to 1 1/2 hours. Watch vegetables and pan drippings throughout - they should be kept dry enough to brown and produce the rich brown goo with which to brush Turkey No. 2 and make a rich gravy, but moist enough to keep from burning. So add water as needed throughout the cooking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pan from oven and transfer turkey to a cutting board; reserve vegetables and pan juices for Turkey No. 2. Let the bird rest 30 minutes to 1 hour before carving, to allow the meat to firm up. Carve, transferring slices to an ovenproof serving platter or baking pan. Cover with aluminum foil. Refrigerate or set in a cool spot (below 40 degrees) until mealtime. Gently rewarm, covered, on platter or baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Immediately after removing the first turkey, lower the oven temperature to 400 degrees and adjust oven rack to lowest position. Scrape vegetables and pan drippings from Turkey No. 1 into a roasting pan. Set a V-rack in the pan. Place remaining raw vegetables in the cavity of Turkey No. 2, then tie legs together with kitchen string for a nicer presentation. Set turkey, breast-side down, on rack. Brush with pan drippings from Turkey No. 1.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast 1 hour. Remove from oven; baste back and sides with pan drippings. Using two wads of paper towels, carefully turn breast-side up and baste. Keep roasting until a thermometer inserted into the leg registers 175 degrees, 1 to 1 1/2 hours longer. Again, watch vegetables and drippings throughout and add water as needed. Transfer turkey to a platter for display (and then for seconds and leftovers).\n"
            },
            {
                "@type": "HowToStep",
                "text": "For gravy: Set roasting pan over 2 burners on medium-high heat. Add wine and, using a wooden spoon, stir to loosen brown bits. Strain contents of pan through a large strainer into a saucepan. Add broth and bring to a boil. Whisk cornstarch with 1/2 cup water (or 1/2 cup flour with 1 cup water), then gradually whisk into pan juices. Bring to a boil, reduce heat to low and simmer until thickened. Serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Whole Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "USA WEEKEND columnist Pam Anderson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.714285714285714,
            "ratingCount": 7,
            "itemReviewed": "Roast Turkeys With Rich Pan Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "845 calories",
            "carbohydrateContent": "19.7 g",
            "cholesterolContent": "298.4 mg",
            "fatContent": "36.1 g",
            "fiberContent": "0.4 g",
            "proteinContent": "101.9 g",
            "saturatedFatContent": "10.9 g",
            "servingSize": null,
            "sodiumContent": "11663.9 mg",
            "sugarContent": "17.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-08T19:06:42.53Z",
                "reviewBody": "I \"blended\" this recipe with one for a dry-brined turkey from Fine Cooking -- so that I did not have to wet brine two turkeys. Splitting the bird and roasting it flat was a FANTASTIC time-saver!!! I made Thanksgiving dinner for 20 with only one oven -- and am so grateful for this recipe. The gravy is fantastic!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1614293/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-28T01:32:19.783Z",
                "reviewBody": "I'm rating the gravy only... it was yummy!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JENELLEBELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1289266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-30T19:28:27.447Z",
                "reviewBody": "Easiest and best turkeys I ever cooked. The brine keeps the breast moist even after being kept warm (over 140) for over an hour. And the smaller birds cook so quickly. I loved having one carved on its platter and warmed even before my guests arrived.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "3boyzplusdog",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3340610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-30T20:27:10.613Z",
                "reviewBody": "My dad taught me how to make pan gravy the same way...BUT we use flour and milk instead of cornstarch and water. Comes out super rich and delicious. Every Thanksgiving I always get a ton of compliments:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shelley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3222845/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-01T01:50:29.11Z",
                "reviewBody": "My mother in law announced she was done hosting thanksgiving and passed the torch on to me. I'd never made a turkey before and was nervous about it. The directions were clear and easy to follow. The turkeys came out perfect (though I found out the hard way you are not supposed to leave the meat thermometer in the bird while its cooking) the gravy was good and half of the vegetables were good. My only complaint was that the veggies from bird 1 were charred into bricks by the time bird 2 was done roasting. Next time I will simply set the veggies from bird 1 aside with the bird.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mrs. kosmos",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3825395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-11-04T23:45:40.53Z",
                "reviewBody": "I made this the year it came out in the newspaper (not telling anyone in the family).  I bought a clean bucket from Home Depot for the brine and everything.  My daughter told me it was the best turkey i ever made!  She was so right!  Years later, when I had lost the recipe, my brother-in-law found it online for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kattlyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7043304/"
                }
            }
        ]
    }
]