[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/691/meat-and-poultry/turkey/whole/",
                    "name": "Whole Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/130351/cajun-deep-fried-turkey/",
        "name": "Cajun Deep-Fried Turkey",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1747412.jpg",
            "width": 1704,
            "height": 1704
        },
        "datePublished": "2014-02-25T23:02:40.000Z",
        "description": "Delicious, juicy and tender, this recipe was given to me by a true Cajun sixteen years ago and has been on our Thanksgiving table ever since. The injector and instructions for frying came with our fryer which was a good thing because this original recipe didn't explain all the nuances of frying a turkey. It is well worth the learning process, though. We strain the peanut oil after it cools and pour it back into the containers (I bought it in gallon jugs). It will keep nicely in a cool place, under 40 degrees, or in the refrigerator until needed again.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 cups butter",
            "¼ cup onion juice",
            "¼ cup garlic juice",
            "¼ cup Louisiana-style hot sauce",
            "¼ cup Worcestershire sauce",
            "2 tablespoons ground black pepper",
            "1 teaspoon cayenne pepper",
            "7 fluid ounces beer",
            "3 gallons peanut oil for frying, or as needed",
            "1 (12 pound) whole turkey, neck and giblets removed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt the butter in a large saucepan over medium heat. Add the onion juice, garlic juice, hot sauce, Worcestershire sauce, black pepper, cayenne pepper and beer. Mix until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Use a marinade injecting syringe or turkey baster with an injector tip to inject the marinade all over the turkey including the legs, back, wings, thighs and breasts. Place in a large plastic bag and marinate overnight in the refrigerator. Do not use a kitchen trash bag. If your turkey is large, you can use an oven bag.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When it's time to fry, measure the amount of oil needed by lowering the turkey into the fryer and filling with enough oil to cover it. Remove the turkey and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat the oil to 365 degrees F (185 degrees C). When the oil has come to temperature, lower the turkey into the hot oil slowly using the hanging device that comes with turkey deep-fryers. The turkey should be completely submerged in the oil. Cook for 36 minutes, or 3 minutes per pound of turkey. The turkey is done when the temperature in the thickest part of the thigh reaches 180 degrees F (80 degrees C). Turn off the flame and slowly remove from the oil, making sure all of the oil drains out of the cavity. Allow to rest on a serving platter for about 20 minutes before carving.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Whole Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Peg in East Tennessee"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7555555555555555,
            "ratingCount": 45,
            "itemReviewed": "Cajun Deep-Fried Turkey",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "1035.9 calories",
            "carbohydrateContent": "2.8 g",
            "cholesterolContent": "345.8 mg",
            "fatContent": "70.9 g",
            "fiberContent": "0.4 g",
            "proteinContent": "91.2 g",
            "saturatedFatContent": "30.1 g",
            "servingSize": null,
            "sodiumContent": "682.2 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-11-22T14:50:09.647Z",
                "reviewBody": "Didn't try the recipe yet just thought I'd add a note. To measure for the oil place the turkey in the cooking basket and lower into the pot. Add enough water until it is one inch above the turkey. Remove the turkey and basket from the pot. Measure the water level from the top of the pot. This is the amount of oil you will need to use to fry your turkey. If your water level is above the recommended oil level marked on the pot the turkey is too big and shouldn't be fryed. 12 lb or smaller turkey is recommended. This is less messy than measuring the turkey in the oil. Remember to thoroughly dry your turkey inside and out and dry the pot too. Never leave your pot unattended. Happy eating!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Goodchild",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1860862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-31T00:39:44.687Z",
                "reviewBody": "This was my first attempt at deep frying a turkey and I don't see how it can get any better. I just bought a 28qt. electric deep fryer and it recommended cooking at 400 though. Everything still came out perfect. I also added a little chipolte pepper and put on a cajun seasoning (mccoormick) rub on the skin and under the skin. I was asked to show up at my brothers house next week for a party he's throwing and do another one. Pretty cool for my first time. Thank you so much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dave Minski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3109887/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-01T18:35:35.13Z",
                "reviewBody": "My first Fried turkey. The flavor was great but I didn't expect the wings and most of the legs to be inedible. I'm a dark meat guy and so I had a thigh and it was amazing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2687002/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-29T14:51:50.1Z",
                "reviewBody": "Want to try this but...where the heck do you find onion juice these days? I don't think I've seen that since the 70's...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Equusz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7957524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-21T19:08:55.703Z",
                "reviewBody": "Warning! If this is your first time frying a turkey you might want to avoid a Cajun rub. I used it on my first fried turkey. After the appropriate time had elapsed I pulled the bird out of the oil and it was BLACK! Not dark brown but the color of your car tires. My first thought was \"I hope KFC is open today.\" I took it inside and put it on the table. Everyone looked at it with their mouth hanging open. Dinner was ruined. Finally my teenage nephew cut off a piece and tried it and said \"This is really good.\" He was right. It was the best turkey I had ever had. I realized I had made 'blackened turkey'. A few years ago the price of peanut oil went through the roof and the size of the container went from 5 gal to 3 gal. It would have cost me nearly 70 just for the oil and I said no more. My wife bought me an oil-less turkey fryer made by CharBroil. Instead of using 5 gal. of oil I now use about a handful to rub on the skin. It cooks just as fast and tastes almost the same with no danger of spilling hot oil or trying to figure out what to do with it after it cools down. I love it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Frank Barnett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1977016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-09T00:38:08.54Z",
                "reviewBody": "Didnt get to deep fry it because no one brought me a fryer so I marinated for like 3 days then baked it in the oven it was so good it all feel off the bone it was excellent best turkey I ever had a lil spicy to some people but it was great even my kids ate it...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NatePuppysWifey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3367106/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-22T08:33:47.773Z",
                "reviewBody": "I have fried well over one thousand turkeys since the eighties. It is a wonderful way to enjoy the bird but it doesn't need to be so complicated. Oil heated to 350 F. 3 1/2 minutes per pound (the bird will float when it is nearly done). Peanut oil isn't necessary unless you plan on cooking a whole bunch of them. Nor is injecting anything. Take a THAWED turkey (remove neck/giblets - pat dry - water is NOT your friend) trim off any excessive skin or fat shake salt and cayenne pepper all over the bird (for extra heat cover the insides with cayenne as well. Drop slowly into the heated oil (upright)and keep everyone away while it cooks (you would be surprised how normally intelligent people would reach in to touch the bird while it is in HOT oil). I always like to cook 10 - 12 # birds. I used a gaff to lift the bird when it was done let it cool before slicing it up. Always delicious. I used to have six cooking at once as many as thirty birds a night.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gateswork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8314208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-20T21:06:13.58Z",
                "reviewBody": "I usually purchase ready made injector but we have eliminated black pepper from our diet and reduced our salt so I will be using this recipe from now on and just substitute white pepper. For those looking for garlic juice and onion juice it can be found at most larger grocery stores just ask where to find it. In addition to following another reviewers advice I made only half which was enough for a 12 pound turkey. But I thought it would be too spicy with both hot sauce and cayenne so I skipped the cayenne and it was perfect for adults and children alike. I found it needed some extras so I added a few shakes of nutmeg 1 Tbsp of granulated onion and granulated garlic 1 Tbsp of prepared mustard and 1 tsp of ground mustard 1 tsp chili powder and 1/2 tsp chipotle sauce. We got rave reviews from the family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Car Lady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3402206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-10T04:32:29.083Z",
                "reviewBody": "We tried this on the turkey we fried for Christmas - it was the best flavor yet!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Carissa R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1784676/"
                }
            }
        ]
    }
]