[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/691/meat-and-poultry/turkey/whole/",
                    "name": "Whole Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141276/evil-turkey/",
        "name": "Evil Turkey",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F144819.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2019-04-02T06:49:04.000Z",
        "description": "This recipe makes the best turkey ever. It's great for Thanksgiving, potlucks, or dinner parties. Its can be made a day in advance to save time.  It's a wonderful dish with just the right amount of spice that will fill your whole neighborhood with an enchanting aroma.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H30M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "1 - 22 pound turkey",
        "recipeIngredient": [
            "1 onion, chopped",
            "1 (12 ounce) jar roasted red peppers, drained and chopped",
            "1 cup whiskey",
            "½ cup minced garlic",
            "1 (22 pound) whole turkey, neck and giblets removed",
            "1 (7 ounce) can chipotle chilies in adobo sauce",
            "roasting bag for a large turkey"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat an oven to 325 degrees F (165 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together the onion, roasted red peppers, whiskey, and garlic and place this mixture inside the cavity of the bird. Mince chipotle peppers in a food processor until about the consistency of spaghetti sauce. Rub half of the chipotles on the outside of the turkey, and place the rest inside the bird cavity. Place turkey in a roasting bag; close the bag according to the bag directions, and place onto a roasting pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the turkey in the preheated oven until no longer pink at the bone and the juices run clear, about 3 1/2 hours.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the turkey from the oven, and allow to rest in a warm area  10 to 15 minutes before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Whole Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dreamthief"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6,
            "ratingCount": 25,
            "itemReviewed": "Evil Turkey",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "528.7 calories",
            "carbohydrateContent": "2.1 g",
            "cholesterolContent": "196.4 mg",
            "fatContent": "23.5 g",
            "fiberContent": "0.4 g",
            "proteinContent": "67.6 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "233.7 mg",
            "sugarContent": "0.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-17T19:17:38.017Z",
                "reviewBody": "I used this recipe for the stuffing but with an addition. I first fried together the chopped onion the garlic and a fresh red bell pepper then added the can of roasted peppers the can of chipotle peppers in adobo sauce (which I found in a Mexican grocery) and the cup of whiskey. This was the best tasting turkey I ever had and everybody around the table was delighted. I do not eat hot or spicy food and I was afraid that the chipotle pepper sauce would be too hot but actually it is not and it adds a very special flavor to the whole turkey.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "namaste",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4255243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-22T19:11:51.9Z",
                "reviewBody": "This is terrific. I made it a day in advance of a large family gathering. The flavors were subtle; not hot or too spicy. The meat was very moist and tasty. I used the leftovers to make the Tex Mex Soup from this website.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4621632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-01T17:26:58.67Z",
                "reviewBody": "This recipe is the bomb! I was scared to death whole time it was roasting but was completely surprised when it came out great! I followed the instructions as is and you guys it's really not spicy at all and the flavors really do come through! I completely recommend this if you're like me and looking for something with some intrigue to it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "southern_rn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5217116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T23:35:35.207Z",
                "reviewBody": "Made this last night for a group of friends and got amazing reviews! I didn't use a roasting bag because I forgot to pick one up...so I basted with the pan juices about every 30 minutes. The chiles on the top looked a little brown so I covered with foil for the remaining hour. Total cooking time was 4 1/2 hrs. Spices not overwhelming but you could still taste them! I have the remains simmering right now for soup...yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lora Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2327010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-30T03:40:12.107Z",
                "reviewBody": "Best turkey I've ever roasted or eaten. I changed the recipe a bit by brining the turkey for 12 hours (in mixture of water salt chili powder & peppercorns) before I prepped and roasted it. I also used butter in addition to the seasoning the recipe calls for because I was roasting without a bag and needed to baste every 30 min. The turkey rocked everyone loved it and the only issue was that it was a bit spicy on the outside but that was ok with me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kcbswift",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8171862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-24T18:07:06.86Z",
                "reviewBody": "I just wanted dinner for two so I used two turkey thighs trimmed of fat and most of the skin. I scaled the recipe for 5 servings but upped the amount of chipotles in adobo sauce to 1.5 oz because I wanted some heat. Just minced the chipotles by hand along with the roasted red peppers added the other ingredients then marinated the turkey thighs in the mixture for an hour before roasting at 350 deg F for 40 min. I didn't like the smell or taste of the marinade before cooking but loved it once it was cooked. I took the meat out of the oven when it reached 162 deg F knowing it would rise in temp to 165 while resting. My DH thought that the spiciness didn't penetrate the meat well enough and though I disagree I will try this with chicken next because he might like it better with a thinner piece of meat (he likes things really spicy.) Served with roasted veggies that I cooked in the oven along with the turkey... I used potatoes onion Brussels sprouts and carrots and the subtle natural sweetness of the carrots was especially good with the Evil Turkey so next time I will add more of those and maybe some sweet potatoes. Now I need to find recipes to use up the rest of my now opened jars of roasted red peppers and chipotle chilies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Weezie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1469285/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T18:10:53.997Z",
                "reviewBody": "Delicious Unique and very outgoing recipe for a very outgoing Thanksgiving Dinner",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Selii",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5864087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T22:09:08.207Z",
                "reviewBody": "Every Thanksgiving I try to make a different and crazy turkey recipe. I had a lot of weird looks when I mentioned that I was using this recipe. But the turkey turned out really good the meat was moist and flavorful. I got lots of compliments and kudos on the flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kazey099",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5383048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-01T17:59:45.277Z",
                "reviewBody": "I used this recipe for one of my turkeys on thanksgiving it was a huge hit with the family. all though I did t tweak the recipe I added 1/3 of a cup of honey and instead of just a cup of whiskey I used 2 cups of crown royal maple and it gave it an amazing smoky sweet flavor with a small amount of bite at the end. I used it on a 15lbs turkey and baked at 325 for 3hours and 45 mins to ensure supreme juiciness after cooking let rest for 5 mins then carve and put all meat back in the juices and keep warm until severing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vanilla gorilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12523125/"
                }
            }
        ]
    }
]