[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15901/meat-and-poultry/turkey/brine/",
                    "name": "Brine",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219474/fruity-tutti-turkey-brine/",
        "name": "Fruity Tutti Turkey Brine",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1739518.jpg",
            "width": 2767,
            "height": 2075
        },
        "datePublished": "2020-03-10T02:51:39.000Z",
        "description": "Best combination of ingredients to have a phenomenal moist 'n' tasty turkey. The aroma of these ingredients is absolutely the best holiday smell that will fill your entire house. You can't buy this scent in a candle!",
        "prepTime": null,
        "cookTime": "P0DT5H0M",
        "totalTime": "P3DT5H0M",
        "recipeYield": "1 whole roasted turkey",
        "recipeIngredient": [
            "9 (14 ounce) cans vegetable broth",
            "1 ½ cups chopped candied ginger",
            "1 ½ cups  dried cherries",
            "4 ounces dried pears",
            "4 ounces dried apples",
            "2 ½ cups brown sugar",
            "1 cup kosher salt",
            "2 tablespoons whole peppercorns",
            "1 teaspoon whole allspice berries",
            "3 cinnamon sticks",
            "5 leaves fresh sage",
            "1 gallon ice water",
            "1 (15 pound) frozen whole turkey, unthawed",
            "1 white onion, quartered",
            "1 red apple, cored and quartered",
            "1 sprig fresh rosemary, or to taste",
            "2 cinnamon sticks",
            "1 leaf fresh sage, or to taste",
            "3 cups water, or amount to cover",
            "1 tablespoon vegetable oil, or as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir the vegetable broth, candied ginger, dried cherries, dried pears, dried apples, brown sugar, kosher salt, black peppercorns, allspice berries, 3 cinnamon sticks, and 5 sage leaves together in a large stockpot until the brown sugar and salt dissolve completely; bring to a boil, reduce heat to medium-low, and cook for 1 hour, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the brine from heat, add the ice water, and stir to melt ice and chill the brine; refrigerate until cold, at least 2 hours. Place the still-frozen turkey into the brine and refrigerate for 3 days. On the second day of brining, turn the turkey over in the brine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On serving day (the third day of brining), preheat oven to 350 degrees F (175 degrees C). Remove the turkey from the brine and place into a roasting pan. Discard the brine.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the onion, red apple, 1 sprig of rosemary, 2 more cinnamon sticks, and 1 sage leaf into a 5-cup microwave-safe measuring cup and fill the cup with enough water to cover. Place into microwave oven and cook on high power until hot, about 5 minutes. Pour the contents of the cup into the cavity of the turkey. Rub the skin of the turkey with the vegetable oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast in the preheated oven until the turkey is golden brown and the juices run clear, 4 to 4 1/2 hours. An instant-read meat thermometer inserted into the thickest part of a thigh should read 165 degrees F (75 degrees C).\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Brine"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stacie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8,
            "ratingCount": 5,
            "itemReviewed": "Fruity Tutti Turkey Brine",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "984.9 calories",
            "carbohydrateContent": "60.4 g",
            "cholesterolContent": "308.3 mg",
            "fatContent": "38 g",
            "fiberContent": "4.4 g",
            "proteinContent": "94.9 g",
            "saturatedFatContent": "10.4 g",
            "servingSize": null,
            "sodiumContent": "6881.4 mg",
            "sugarContent": "42.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-11-16T18:11:02.557Z",
                "reviewBody": "This brine is AMAZING!!!I tried it last year and meant to rate it but never did. It deserves a try. Not only does it make the house smell good but the turkey was so moist and delicious and tasty!! It is worth all the ingredients. All you need to do is sit back and let the turkey cook.I did do one thing different I used an oven bag! It is so easy and you do not have to tend to the turkey. It will be the PERFECT turkey. Hope this helps. Also one more note: If you are not able to find dried apples which was hard for me to find I just used natural cinnamon apple chips out of the produce section at my local market. Worked awesome!!! Enjoy:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "yumyum23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7422248/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-11-20T02:39:30.687Z",
                "reviewBody": "i have made variations on this brine for the past few years. This is actually a variation of Alton Brown's brine ( from the food net work). Just want to remind everyone to rinse this turkey thoroughly before baking it!!!! Or you will have a super salty turkey! Also be careful when making gravy from the turkey drippings- yes you can-- but monitor the salt! commercial gravy mixes already have salt in them. The candied ginger and dried fruit are easily substituted by boiling ginger root and canned fruit or fresh fruit that you have on hand. dry spices work fine too. If money is no object than follow recipe as directed but we are on a budget. I also made my own veggie broth with a recipe from this website for budget reasons too. Lastly- a frozen turkey will thaw out in the fridge at 24 hours per every 4-5 pounds of turkey and having it in brine will speed that up some. So a 30 pound turkey will take anywhere from 4-6 days in your fridge you just have to keep checking so i don't expect it to thaw out in 3 days. I usually remove it from the brine after 3 days though if i got an early start on thawing. A thawed turkey is still fine in your fridge 2-3 days in your fridge before thanksgiving but i dont keep brining it for a whole week! This is the most outstanding brine in this universe. Check out Alton's video for more advice. You can also use ginger ale in the brine. The possibilities are endless and you will get rave reviews I swear!!! dont be",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mariegg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/yummymommy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-23T09:38:20.87Z",
                "reviewBody": "I made this recipe after the holidays on a whim. The gravy my mom made from the turkey drippings was like crack to me it was a PHENOMENAL hit at my house (and we feed enough to be a small army here). Only thing is at least with a 22lb turkey best to thaw it before use",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Moogie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10459774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-11-23T04:16:41.043Z",
                "reviewBody": "Please for the love of god put foil on the turkey! This recipe while great does not specify the use of foil and the skin burned to a crisp! Use foil to cover the breaat and legs so that they don t immediately run. I started my turkey at 425 and dropped to 350 after the first hour using causation to schedule the rest of my oven-necessary sides around the turkey so that the iven wasn t opening and closing releasing the heat and thus drying it out. Turned out great except for the burned skin! Luckily I was watching and put foil",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amie Hulme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20731401/"
                }
            }
        ]
    }
]