[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/282825/cannoli-cheesecake/",
        "name": "Cannoli Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8924623.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-12-31T23:37:13.000Z",
        "description": "Cannoli are Italian pastries consisting of tube-shaped shells of fried pastry dough, filled with a sweet, creamy filling usually containing ricotta--a staple of Sicilian cuisine. This is a cheesecake inspired by the flavors of a traditional cannoli. Serve with a big glass of cold milk! This would last several days, covered, in the refrigerator.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H55M",
        "totalTime": "P0DT7H55M",
        "recipeYield": "1 9-inch cheesecake",
        "recipeIngredient": [
            "cooking spray",
            "2 ¼ cups graham cracker crumbs",
            "½ cup salted butter, melted",
            "3 tablespoons white sugar",
            "1 ¼ teaspoons ground cinnamon, divided",
            "2 cups whole-milk ricotta cheese",
            "1 ½ cups mascarpone cheese",
            "1 cup white sugar",
            "3 tablespoons all-purpose flour",
            "1 tablespoon vanilla extract",
            "½ teaspoon lemon zest",
            "4 large eggs, at room temperature",
            "½ cup cold heavy whipping cream",
            "¼ cup powdered sugar",
            "½ teaspoon vanilla extract",
            "¼ cup miniature chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Line a 9-inch springform pan with parchment paper and lightly grease paper and sides of the pan with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir graham cracker crumbs, melted butter, 3 tablespoons sugar, and 1/4 teaspoon cinnamon together in a medium bowl until well combined. Pour graham cracker crumb mixture into the prepared pan and press firmly into the bottom and sides to create a crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until lightly toasted and firm, about 10 minutes. Remove pan from the oven and set aside to cool completely at room temperature, about 30 minutes. Wrap the outsides of the pan tightly with aluminum foil; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Reduce oven temperature to 300 degrees F (150 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat ricotta, mascarpone, 1 cup sugar, and flour together in a stand mixer fitted with a paddle attachment on low speed until smooth, scraping down the sides with a spatula as needed. Add 1 tablespoon vanilla extract, lemon zest, and remaining 1 teaspoon cinnamon and continue beating on low speed until combined, about 30 seconds. Add eggs, one at a time, beating on low speed until well combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into the prepared crust. Place the springform pan in a large baking dish and carefully fill baking dish halfway with water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until edges are set and center jiggles slightly, 1 hour 45 minutes to 2 hours. Turn the oven off and crack the oven door open slightly to allow cheesecake to cool slowly, about 1 hour. Remove the baking pan from the oven and remove the springform pan from the baking pan; remove aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer cheesecake to a refrigerator and chill, uncovered, until completely firm, at least 4 hours, or up to 8 hours. When cheesecake is completely chilled, remove from the refrigerator and carefully remove springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat cream, powdered sugar, and 1/2 teaspoon vanilla extract together in a stand mixer fitted with a whisk attachment on medium-low speed until well combined, about 1 minute. Increase speed to high and continue beating until stiff peaks develop, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread whipped cream mixture on top of cheesecake using a spatula; sprinkle chocolate chips evenly on top of whipped cream. Slice cheesecake into 12 slices; serve immediately.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Somerall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Cannoli Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "576.4 calories",
            "carbohydrateContent": "49.2 g",
            "cholesterolContent": "171.2 mg",
            "fatContent": "38 g",
            "fiberContent": "1 g",
            "proteinContent": "12.2 g",
            "saturatedFatContent": "20.9 g",
            "servingSize": null,
            "sodiumContent": "288 mg",
            "sugarContent": "35.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2021-08-23T03:11:46.653Z",
                "reviewBody": "I made this for my husband (I'm not a cannoli fan) without any changes to the recipe. He absolutely loves it-I think it might be his new favorite cheesecake. My sons love it too, definitely will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAF63",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/427173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-02-07T07:58:54.867Z",
                "reviewBody": "Bellissimo!   My Sicilian Grandmothers would have loved this cheesecake!  This will be at the top of my cheesecake list from now on!  The only change that I made was to make almond cookie crumbs in my blender.  I sprayed my spring-form pan with cooking spray, sprinkled the cookie crumbs in the bottom of the pan, then tipped the pan to distribute the crumbs onto the sides.  It eliminated a heavier crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookin' With Lukie >^..^<   ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17405219/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-02-03T00:23:23.677Z",
                "reviewBody": "I really enjoyed the cannoli flavors of this cheesecake. A heads up: Italian style cheesecakes use ricotta cheese for the filling, rather than all cream cheese. The result is a cheesecake that is not as dense and smooth as a regular cheesecake. A delicious difference. I did make changes: I cut the amount of crust in half and it was just enough. I added 1/2 cup of mini Chocolate chips to the filling. And instead of whipped cream on top, I made a topping of 1-1/2 cups sour cream , 3 Tblsp sugar & 1 tsp vanilla. I spread it on the cake 15 minutes before it was done baking. Then I garnished the cake with chopped pistachios and mini Chocolate chips. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shelleybear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4152624/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-06-12T21:22:26.037Z",
                "reviewBody": "This is an excellent recipe. I've made it twice and served it to different groups of people, receiving excellent responses. I don't have a spring pan, so I used (2) 9\" pie crusts. Split the batter evenly between them and cook for 90min. Follow the same cool down procedure mentioned in the recipe. 90min cook time will give you more of a creamy result. I have not tried longer bake times yet to see if you get that classic cake/ creamy cheesecake texture. Don't buy cheap Walmart pie crust. Use better crust from King Soopers or your local grocers, or of course you can make your own.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/29025643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-02-16T03:32:51.17Z",
                "reviewBody": "Made this cheesecake and it took well over 2 hours to bake and the top was very dark.   Even at that baking time, the sides were set but the center giggle may still be too much.  I followed the instructions as written..  The batter was VERY loose/runny when I poured it in the pan.  I have been baking/creating cheesecake flavors for many years but this is the first one with ricotta. Only gave it a 3 rating because I haven’t tasted it yet but the unbaked batter showed good flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mammabakes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4108959/"
                }
            }
        ]
    }
]