[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/282828/instant-pot-rustic-country-bread/",
        "name": "Instant Pot&reg; Rustic Country Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8924836.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2020-12-31T23:37:14.000Z",
        "description": "Simple country bread recipe that utilizes an Instant Pot&reg; to achieve a well-risen and well-baked loaf of bread. Serve with softened salted butter and jam, or olive oil and freshly cracked black pepper.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT1H5M",
        "totalTime": "P0DT5H35M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "2 ⅓ cups bread flour",
            "1 cup whole wheat flour",
            "2 teaspoons kosher salt",
            "2 ¼ cups warm water (105 to 115 degrees F (41 to 46 degrees C)), divided",
            "1 (.25 ounce) package active dry yeast",
            "cooking spray"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir bread flour, whole wheat flour, and salt together in a large bowl until well combined; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently whisk 1 1/4 cups warm water and yeast together in a small bowl. Allow to rest at room temperature until foamy and fragrant, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make a shallow well in the center of the flour mixture, and pour in the yeast mixture. Stir together using a spatula until a coarse dough begins to form. Transfer dough to a lightly floured work surface and begin kneading, dusting with more flour as needed to prevent dough from sticking, until smooth and elastic, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape dough into a ball and place in a large bowl lightly greased with cooking spray. Cover the bowl with a towel lightly dampened with warm water and set aside in a warm spot to rise until doubled in size, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly grease a 7- to 8-inch round cake pan with cooking spray and line the bottom with parchment paper; lightly grease parchment paper with cooking spray; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using your fingers, gently press down on dough to deflate slightly and transfer to a work surface that has been very lightly dusted with flour. Gently knead dough 2 or 3 times, preserving as many air bubbles as possible. Using the sides of your hands, shape dough into a ball by pulling the sides under until a smooth and slightly shiny surface develops. Gently transfer dough to the prepared cake pan and lightly dust with flour; cover tightly with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add remaining 1 cup water and a steam rack to a multi-functional pressure cooker (such as an Instant Pot&reg;); place cake pan on the rack. Close and lock the lid. Turn vent to Sealing position. Select Manual/Yogurt setting; set timer for 1 hour. Dough will rise in cooker and double in size. Press Cancel.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, preheat the oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Select Manual/Pressure Cook setting on the Instant Pot&reg;. Select high pressure according to manufacturer's instructions; set timer for 40 minutes. Allow 3 to 5 minutes for pressure to build.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Release pressure using the natural-release method according to manufacturer's instructions, 8 to 10 minutes. Unlock and remove lid. Carefully remove the cake pan as it will be hot; remove aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer cake pan to the preheated oven and bake until bread is golden brown, about 20 minutes. Remove bread from the cake pan and transfer to a wire rack to cool completely before slicing, about 30 minutes. Using a bread knife, slice loaf crosswise into 3/4-inch thick slices.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Somerall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Instant Pot&reg; Rustic Country Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "239.7 calories",
            "carbohydrateContent": "48.8 g",
            "cholesterolContent": null,
            "fatContent": "1.2 g",
            "fiberContent": "3.8 g",
            "proteinContent": "8.8 g",
            "saturatedFatContent": "0.2 g",
            "servingSize": null,
            "sodiumContent": "645.2 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]