[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16416/desserts/cookies/sandwich-cookies/",
                    "name": "Sandwich Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/283212/copycat-moon-pies/",
        "name": "Copycat Moon Pies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F04%2F02%2F283212_CopyCat-MoonPies_MFS_0032.jpg",
            "width": 1008,
            "height": 1008
        },
        "datePublished": "2021-01-29T21:20:11.000Z",
        "description": "Inspired by the original MoonPie&reg; cookies, this copycat version boasts tender, but slightly crisp graham cracker cookies flavored with the faintest bit of cinnamon, sandwiched around a sweet, chewy marshmallow filling, and dipped in a sweet chocolate glaze. Serve with ice cream or a glass of milk for dipping. Cookies can be stored covered at room temperature or in an airtight container in a refrigerator for up to a week, or frozen in an airtight container for up to 1 month.",
        "prepTime": "P0DT0H50M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT5H10M",
        "recipeYield": "12 cookie sandwiches",
        "recipeIngredient": [
            "2 cups whole wheat flour",
            "2 cups all-purpose flour",
            "½ cup white sugar",
            "2 teaspoons baking powder",
            "1 teaspoon kosher salt",
            "1 teaspoon ground cinnamon",
            "½ cup honey",
            "½ cup vegetable oil",
            "2 large eggs",
            "2 tablespoons whole milk",
            "3 (.25 ounce) packages unflavored gelatin powder",
            "1 cup cold water, divided",
            "1 ½ cups white sugar",
            "1 ¼ cups light corn syrup",
            "¼ teaspoon kosher salt",
            "2 teaspoons vanilla extract",
            "8 (4 ounce) bars semisweet chocolate, chopped, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare the graham cracker cookies: whisk together whole wheat and all-purpose flours, sugar, baking powder, salt, and cinnamon in a large bowl until well combined. Whisk together honey, oil, eggs, and milk in a medium bowl until well combined. Add egg mixture to flour mixture, and gently stir together until a coarse dough begins to develop.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour dough out onto a work surface lightly dusted with all-purpose flour and knead until dough becomes smooth, shiny, and slightly tacky, about 2 minutes. Divide dough into 2 even balls and shape into disks. Wrap each disk tightly in plastic wrap and chill in the refrigerator for at least 1 hour or up to 3 days.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 300 degrees F (150 degrees C). Position racks in the top and bottom thirds of the oven. Line 2 rimmed sheet pans with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working with one dough disk at a time on a surface lightly dusted with all-purpose flour, roll each disk into a 16x12-inch rectangle, about 1/8-inch thick. Cut twelve 3 1/2-inch circles out of each dough rectangle. Transfer circles to the prepared sheet pans spaced 1 inch apart from each other.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cookies in the preheated oven until fragrant and slightly firm, 12 to 14 minutes, rotating pans halfway through baking. Let cookies cool on sheet pans for 5 minutes before transferring to wire racks to cool completely, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the marshmallow: Combine gelatin and 1/2 cup water in the bowl of a stand mixer fitted with a whisk attachment. Allow gelatin to bloom, undisturbed, until thickened, about 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the gelatin is blooming, combine remaining 1/2 cup water with sugar, corn syrup, and salt in a medium saucepan. Bring to a boil, without stirring, over medium heat. Boil sugar mixture, without stirring, until a candy thermometer reads 240 degrees F (116 degrees C), about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add vanilla to bloomed gelatin; beat on medium speed until completely incorporated, about 1 minute. Leave mixer on medium and carefully add hot sugar mixture until combined, about 2 minutes. Increase speed to high and beat until mixture is thick, sticky, and quadrupled in volume, about 10 minutes. Immediately transfer 1/2 of marshmallow mixture to a piping bag; reserve remaining marshmallow for another use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange 12 cooled cookies upside down on a clean work surface. Cut a tip off the piping bag, leaving a 1/2-inch hole, and quickly and carefully pipe a 2 tablespoon circular mound of marshmallow in the center of each cookie. Top with remaining cookies and gently press down until marshmallow is spread about 1/4 inch from the edges. Allow cookie sandwiches to sit out at room temperature, uncovered, until marshmallow filling is set and slightly firm, at least 1 hour or up to (but not exceeding) 4 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the glaze: fill a medium pot with 1 inch water and bring to a boil over high heat. Reduce heat to low. Place 28 ounces chocolate in a large heat-proof bowl and place on top of the pot with steaming water. Stir chocolate slowly until completely melted and smooth, about 5 minutes. Continue stirring until a thermometer registers 115 degrees F (46 degrees C), about 5 minutes. Remove bowl from the pot and set on a lightly damp kitchen towel to prevent the bowl from sliding. Allow chocolate to cool, stirring constantly, until a thermometer registers 90 degrees F (32 degrees C), about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add remaining chocolate to the melted chocolate. Stir until completely melted and smooth, placing it back over steaming water briefly, if necessary, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a sheet pan with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working quickly, cleanly, and with one at a time, dip each cookie sandwich into the melted chocolate until completely coated, allowing excess chocolate to drain back into the bowl. Scrape the bottom of each along rim of bowl to remove any excess glaze. Place on the prepared sheet pan and smooth the top with a small offset spatula. Repeat to coat remaining cookies. Transfer to the refrigerator to cool until chocolate is set and firm, about 10 minutes. Allow cookies to rest at room temperature, covered with plastic wrap, until completely set, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Sandwich Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Somerall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Copycat Moon Pies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "893.6 calories",
            "carbohydrateContent": "145.5 g",
            "cholesterolContent": "31.3 mg",
            "fatContent": "35 g",
            "fiberContent": "8.5 g",
            "proteinContent": "13 g",
            "saturatedFatContent": "15.1 g",
            "servingSize": null,
            "sodiumContent": "321.2 mg",
            "sugarContent": "92.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]