[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
                    "name": "Apple Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/283215/salted-caramel-apple-pie/",
        "name": "Salted Caramel Apple Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F04%2F02%2F283215_Salted-caramel-apple-pie_MFS_0039.jpg",
            "width": 1008,
            "height": 1008
        },
        "datePublished": "2021-01-29T21:20:11.000Z",
        "description": "This pie has everything you'd want out of an apple pie. The buttery, flaky crust, spiced apple filling, and sweet, salty caramel sauce are a perfect combination of flavors and textures in every bite. Serve a la mode with a side of vanilla bean ice cream.",
        "prepTime": "P0DT1H5M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT5H25M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "2 ⅓ cups all-purpose flour",
            "2 ¼ teaspoons kosher salt",
            "1 ½ cups cold unsalted butter, cut into 1/2-inch cubes",
            "½ cup ice cold water, divided",
            "1 cup white sugar",
            "6 tablespoons salted butter, cut into 1/2-inch pieces, at room temperature",
            "½ cup heavy cream, at room temperature",
            "1 ½ teaspoons sea salt",
            "10 medium Granny Smith apples - peeled, cored, and sliced",
            "½ cup white sugar",
            "¼ cup all-purpose flour",
            "2 tablespoons fresh lemon juice",
            "1 tablespoon cornstarch",
            "1 ½ teaspoons ground cinnamon",
            "¼ teaspoon kosher salt",
            "¼ teaspoon ground cloves",
            "¼ teaspoon ground nutmeg",
            "1 large egg, beaten",
            "1 tablespoon turbinado sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare the pie crust: Whisk flour and salt together in a large bowl. Add butter and toss until butter pieces are completely separated and coated with flour mixture. Using your hands, work butter into flour mixture until well combined and butter pieces are no larger than a pea. Add 1/4 cup cold water and gently stir with a spatula until completely absorbed. Add remaining 1/4 cup water, 1 tablespoon at a time, gently stirring between each addition, until dough begins to form into a ball. Depending on how humid it is in your kitchen or how hydrated your flour is, you might not need to use all of the water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer dough to a clean work surface and gently knead, being careful not to overwork it, until  smooth and slightly tacky. Divide dough evenly into 2 pieces. Form each piece into a flat disk and wrap individually in plastic wrap. Chill dough in a refrigerator for at least 1 hour or up to 3 days. If chilled longer than 1 hour, let sit at room temperature at least 15 minutes before rolling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the dough is chilling, prepare the caramel sauce. Heat sugar in a small saucepan over medium heat, stirring occasionally, until sugar is completely melted and amber in color, 10 to 15 minutes. Add butter to melted sugar and cook, stirring constantly, until butter is melted and completely combined, about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Carefully add heavy cream to sugar mixture, stirring constantly, until bubbly, 15 to 30 seconds. Remove saucepan from heat and stir in sea salt. Set caramel sauce aside to cool slightly at room temperature until ready to use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare the filling: stir apples, sugar, flour, lemon juice, cornstarch, cinnamon, salt, cloves, and nutmeg together in a large bowl until well combined. Set apple mixture aside at room temperature, uncovered, for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour apple mixture through a strainer into a large bowl. Set apple mixture aside, and transfer the liquid to a small saucepan. Bring liquid to a boil over medium heat, stirring occasionally, until thickened. Remove saucepan from heat and set aside at room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 400 degrees F (200 degrees C). Position oven rack in bottom third of oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Working with one dough disk at a time on a surface lightly dusted with flour, roll each disk into a 1/8-inch thick circle that measures 12 inches in diameter. Place one dough circle in a 9-inch pie pan and gently press dough into the corners and sides of the pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir together apples and reduced apple liquid in large bowl; arrange apple mixture in the pie crust, and drizzle with 1/2 cup of the caramel sauce. Place remaining dough circle over apple mixture and press into apple mixture and into edges of pan. Using your fingers, fold edges under and crimp to seal. Brush top and edges of dough with egg and sprinkle with turbinado sugar. Cut eight 1-inch slits in dough with a sharp paring knife to allow steam to escape. Place pie on a rimmed sheet pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until top is light golden in color, about 20 minutes. Without removing the pie, reduce oven temperature to 375 degrees F (190 degrees C), and continue baking until dough is deep golden brown and the filling is starting to bubble, about 25 minutes. Gently cover pie with aluminum foil, and continue baking until a knife inserted removes mostly clean, about 25 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pie from oven and transfer to a wire rack to cool completely, about 2 hours. Serve pie with remaining caramel sauce, if desired.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Apple Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Somerall"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Salted Caramel Apple Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "555.7 calories",
            "carbohydrateContent": "64.4 g",
            "cholesterolContent": "105.4 mg",
            "fatContent": "33.2 g",
            "fiberContent": "3.4 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "20.7 g",
            "servingSize": null,
            "sodiumContent": "676.4 mg",
            "sugarContent": "39.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]