[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17504/world-cuisine/latin-american/mexican/main-dishes/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 7,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16080/world-cuisine/latin-american/mexican/main-dishes/tamales/",
                    "name": "Tamale Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/284436/instant-pot-tamales/",
        "name": "Instant Pot® Tamales",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F12%2F284436-InstantPotTamales_MFS_235-2.jpg",
            "width": 2000,
            "height": 1334
        },
        "datePublished": "2021-05-17T23:54:05.000Z",
        "description": "These Instant Pot® tamales are delicious with soft, pillowy masa and flavorful, slightly spiced pork filling. The sauce is smoky with just a hit of rounded spicy heat. There are so many things this would be good on-tacos, enchiladas, eggs, etc. I also think it would be good as a base for a pizza.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H40M",
        "totalTime": "P0DT6H15M",
        "recipeYield": "20 tamales",
        "recipeIngredient": [
            "1 (8 ounce) package dried corn husks",
            "2 cups water, or more as needed",
            "2 cups coarsely chopped onion",
            "3 cloves garlic, smashed",
            "1 tablespoon chili powder",
            "2 teaspoons kosher salt",
            "1 teaspoon chipotle chile powder",
            "1 teaspoon ground cumin",
            "1 (3 pound) boneless pork shoulder",
            "8 peppers Anaheim chile peppers",
            "2 peppers de arbol chile peppers",
            "3 cups chicken stock, divided",
            "2 medium Roma tomatoes, quartered",
            "4 cloves garlic",
            "1 ½ teaspoons ground cumin",
            "1 ½ teaspoons kosher salt",
            "½ teaspoon onion powder",
            "4 cups instant corn masa",
            "2 ½ teaspoons kosher salt, divided",
            "1 teaspoon baking powder",
            "1 cup Lard",
            "2 cups warm water, or more as needed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place 20 dried husks in a large Dutch oven and cover with water. Place a plate or bowl filled with water on top of husks to keep submerged. Let soak for at least 3 hours (or up to 24 hours), flipping occasionally until husks are softened.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, prepare the filling: Combine 2 cups water, onion, garlic, chili powder, salt, chipotle powder, and cumin in a multi-functional pressure cooker (such as Instant Pot&reg;). Cut pork shoulder into 4 equal pieces and add to the pot. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 60 minutes. Allow 10 to 15 minutes for pressure to build.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the filling is cooking, prepare the sauce: Split chile peppers and remove seeds and membranes. Cut into 1- to 2-inch pieces (there is no need to cut the de arbol chiles.) Place chiles, 2 cups chicken stock, tomatoes, and garlic cloves in a medium saucepan over medium-high heat; bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until tomatoes are fully softened, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Carefully pour the sauce mixture into a blender. Secure the lid and remove the center piece to allow steam to escape. Place a clean towel over the opening and process on high speed until completely smooth, 2 to 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Carefully transfer blended hot mixture back to the saucepan. Stir in remaining 1 cup chicken stock, cumin, salt, and onion powder. Return mixture to a simmer over medium-high heat. Reduce heat to low and simmer, stirring occasionally, until sauce has thickened and color is a deeper red, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the filling has finished cooking, release pressure using the natural-release method according to manufacturer's instructions for 10 minutes, then use the quick-release method to release remaining pressure, 1 to 2 minutes. Unlock and remove the lid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pork to a shallow baking dish. Discard any fat and shred meat using 2 forks. Place shredded meat in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain cooking liquid through a fine mesh strainer and discard solids. Skim as much grease as possible from the liquid. Reserve 1 cup strained cooking liquid for cooking the masa and discard any remaining.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine masa, 2 teaspoons salt, and baking powder for masa mixture in a stand mixer fitted with the paddle attachment; mix on low speed until completely combined, 1 to 2 minutes. Increase speed to medium and gradually add melted, warm lard alternately with 1 cup reserved, warm cooking liquid and 2 cups warm water; beat until dough is completely combined. Increase speed to medium-high and beat until dough is light and fluffy, 4 to 5 minutes. The dough should resemble a loose cookie dough; adjust by adding 1 tablespoon warm water at a time, if needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir 1 cup sauce and remaining 1/2 teaspoon salt into the shredded meat; set filling aside. Set remaining sauce aside for serving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain husks and cover with a damp paper towel. As you prepare the tamales, make sure they are not longer than 4 to 5 inches in order to fit in the pressure cooker with the lid closed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place one damp husk on a work surface with the pointed end facing you (it will make a capital \"V\" shape.) Spoon 1/4 cup masa mixture onto the husk. Using damp fingers and starting near the top of the husk, press mixture into a 4-inch square; leave 1 inch clear at the top of the husk, and 3 to 4 inches clear at the bottom. Place 1 heaping tablespoon of filling in a vertical line down the center of the masa. Grab both sides of the husk and bring them together until they meet and are touching. Pull the left side of the husk away, and wrap the right side over the masa mixture. Take the left side and wrap it tightly over the right side, completely enclosing the filling. Fold the bottom of the husk over the seam and tie with a strip of corn husk, if desired. Repeat to make remaining tamales.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stand tamales up vertically with the open side up in the steamer basket of the Instant Pot&reg;. Place the trivet in the cooker and add 2 cups tap water. Place steamer basket on the trivet, and close and lock the lid. Select high pressure and set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Release pressure using the natural-release method according to manufacturer's instructions for 10 minutes, then use the quick-release method to release remaining pressure, 1 to 2 minutes. Unlock and remove the lid.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let tamales rest in the cooker for 10 minutes before serving.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, warm the remaining sauce to serve with tamales.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican",
            "Main Dishes",
            "Tamale Recipes"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican",
            "Main Dishes",
            "Tamale Recipes"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Pam Lolley"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "itemReviewed": "Instant Pot® Tamales",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "683 calories",
            "carbohydrateContent": "44.5 g",
            "cholesterolContent": "97.6 mg",
            "fatContent": "46.9 g",
            "fiberContent": "7.9 g",
            "proteinContent": "23.6 g",
            "saturatedFatContent": "16.8 g",
            "servingSize": null,
            "sodiumContent": "3007.1 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": []
    }
]