[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18093/seafood-enchiladas/",
        "name": "Seafood Enchiladas",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6808002.jpg",
            "width": 2340,
            "height": 2925
        },
        "datePublished": "2000-03-03T16:40:16.000Z",
        "description": "These crab and shrimp stuffed enchiladas taste like the ones served at a popular Mexican restaurant in my area. My husband just loves them. After sprinkling the cheese over the enchiladas before baking, you can also garnish with tomatoes, cilantro, olive slices, or whatever other garnish you enjoy.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 onion, chopped",
            "1 tablespoon butter",
            "½ pound fresh crabmeat",
            "¼ pound shrimp - peeled, deveined and coarsely chopped",
            "8 ounces Colby cheese",
            "6 (10 inch) flour tortillas",
            "1 cup half-and-half cream",
            "½ cup sour cream",
            "¼ cup butter, melted",
            "1 ½ teaspoons dried parsley",
            "½ teaspoon garlic salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, saute onions in 1 tablespoon butter until transparent. Remove the skillet from heat and stir in crabmeat and shrimp. Shred the cheese and mix half of it into the seafood. Place a large spoonful of the mixture into each tortilla. Roll the tortillas up around the mixture and arrange the rolled tortillas in a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium-low heat, combine half-and-half, sour cream, 1/4 cup butter, parsley and garlic salt. Stir until the mixture is lukewarm and blended. Pour sauce over the enchiladas, and sprinkle with remaining cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Cathy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.355475763016158,
            "ratingCount": 557,
            "itemReviewed": "Seafood Enchiladas",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "606.8 calories",
            "carbohydrateContent": "42.6 g",
            "cholesterolContent": "135.8 mg",
            "fatContent": "36.5 g",
            "fiberContent": "2.6 g",
            "proteinContent": "26.8 g",
            "saturatedFatContent": "20.6 g",
            "servingSize": null,
            "sodiumContent": "1078 mg",
            "sugarContent": "2.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-10T13:59:51.86Z",
                "reviewBody": "OK, the only time I rate a recipe is when it absolutely knocks our socks off.  This one DID!  I read all the reviews and made the following modifications:  I doubled the batch of sauce, making a roux of the melted butter by stirring in 5 tbs of flour to make a paste and cooking it for about 1 minute (to get rid of the \"raw\" flavor of the flour).  Then added the cream (oh btw, I used heavy cream instead of 1/2 & 1/2).  I also added 1 can diced mild green chiles, 1 tsp of chili powder, 1 tsp of cumin and 1/4 tsp cayenne pepper & substited regular salt for the garlic salt.  I heated this all to a simmer then poured it slowly into the sour cream whisking constantly to avoid the curdling that others experienced.  The sauce came out creamy & perfect.  Other mods:  I added 2 cloves of minced garlic to the onion before sauteeing.  I used imitation crab meat.  (This would probably be 10 stars with the real thing).  And also I added 1/4 of the sauce to the crab/shrimp onion mixture before rolling up the enchiladas to keep the insides creamy & moist.  The 9 X 13 pan was perfect but it made 8 not 6 burrito sized enchiladas, tightly tucked in the pan.  Good idea to garnish with either olives or green onions or cilantro.  I didn't and it lacked eye appeal.  The taste however, totally made up for any presentation issue!!!  \nThank you Cathy!  And thank you all reviewers who helped take a wonderful base recipe and make it sublime!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caren",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1734251/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-23T03:58:01.53Z",
                "reviewBody": "This recipe required several alterations!  \n\nIf you like \"saucy\" enchiladas then you will definitely need to double the sauce recipe.  \n\nI recommend adding minced garlic.  Use Pepper Jack cheese instead for some extra flavor and a little zip.  Use fresh cilantro in place of the dried parsley - and to give the sauce some added flavor - use a small can of diced green chilies, add extra garlic powder, and some cumin.  I use heavy cream in place of half/half and add a little whole milk - makes the sauce creamier.  You can thicken the sauce with a little cornstarch if desired - however the sauce typically thickens in the oven.  \nFor those who complained about the sauce curdling - you CANNOT let the sauce boil once the sour cream has been added!  Remove the sauce from the heat and add the sour cream at the end.  \n\nUse corn tortillas if you want a more authentic flavor - especially the thick homemade style corn tortillas.\n\nAlso, be sure to add a little of the sauce to the shrimp (I used only shrimp) mixture.\n\nOverall with the alterations it was a great meal - but not worth 5 stars.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-09T20:34:06.17Z",
                "reviewBody": "With a little doctoring, this was great. The 9x13 in dish called for seemed way too roomy for just 6 enchiladas, so instead they went into a 7x11 in dish, and that was more snug--the sauce stayed where it was intended to. No problem with it being too thin, as some other reviewers had trouble with. I added 2 cloves of garlic to the onion, and 1/2 cup sour cream into the seafood. I used all (one lb) imitation crabmeat (don't laugh) and it came out really nicely. The sauce needed something...so it got 1/2 tsp cumin, 1/4 tsp coriander, and a dash or two of cayenne. And before sticking it in the oven, I garnished it with a handful of sliced black olives. Very happy with this one. Yup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DARLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/919751/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-03T14:39:40.293Z",
                "reviewBody": "After reading the other reviews I incorporated several changes. First I added two cloves of garlic with the onion and used only shrimp (an entire lb. because it's what I had on hand). For the sauce I made a double batch and added a little flour to the butter then added the half&half and sour cream - whisking constantly until it thickened (had no problem with curdling). Upon tasting it I substituted cilantro for the parsley and added chili powder cumin red pepper flakes and regular kosher salt instead of garlic salt. Mixed some of the sauce into the shrimp filling and filled tortillas as directed (could only fill 5 tortillas). Reserved some sauce and poured the rest over the filled tortillas and topped with additional cheese. Husband thought it was great kids were so-so but ate it nonetheless! Original recipe definitely needs to be kick up-but was a good base to start with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "2many2count",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/822324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-31T22:21:41.64Z",
                "reviewBody": "This was a great recipe. My husband loved these. I did however make some slight variations: used two packages of the imitation crab meat no shrimp a mix of shredded colby and monterey jack cheese and the smaller flour tortillas. Next time I will leave out the sour cream and use just a cream and butter sauce thickened with flour sour cream causes the sauce to curdle and it is a little thin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURENNJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/726514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:23:49.17Z",
                "reviewBody": "I've made this recipe for a year or so now and everyone loves it. I do almost double the sauce portion I like them moist. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KDAMON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/64565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-10T00:42:13.687Z",
                "reviewBody": "These were delicious with some changes for personal taste. I used 6 green onions instead of white or yellow 8 ounces white cheddar cheese instead of Colby 1/2 cup half/half 2T butter 1t garlic powder and 1/2 cup green enchilada sauce. Topped each enchilada with 2T parmesan cheese. They came out great. I wanted to cut the butter for obvious reasons but others had commented that the sauce was a bit bland. Since I agreed I made these changes. Perfect with modifications.Thanks for the opportunity to use our creativity with this wonderful recipe Cathy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-25T20:54:44.39Z",
                "reviewBody": "I made this for my family and added 1/2can of chopped olives 1/2 can of green chiles. This added so much more flavor and if you really want to jazz it up add the green enchilada sauce either over the top or on the side.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LISA FIELDS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/287925/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:23:38.5Z",
                "reviewBody": "Very good...I did add some garlic and red pepper and a few other seasonings to give it more flavor.  Also added some sour cream to the seafood mixture to moisten it a bit. thank you",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIE ANNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/200635/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-22T06:14:37.5Z",
                "reviewBody": "I liked it but it was very rich. I followed the directions exactly - and I think it could have been less rich and more shrimp added to the recipe because it was not enough! I would double to filling recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cierra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2397378/"
                }
            }
        ]
    }
]