[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/16416/candied-chicken-breasts/",
        "name": "Candied Chicken Breasts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F129786.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-03-03T16:44:20.000Z",
        "description": "Breaded chicken breasts baked with a sweet, sticky sauce with a bite. Very easy to prepare. This is a family favorite, and if you want to impress someone, this is just the thing!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "10 skinless, boneless chicken breast halves",
            "2 cups dry bread crumbs",
            "2 tablespoons all-purpose flour",
            "1 tablespoon dried oregano",
            "2 teaspoons salt",
            "2 teaspoons ground black pepper",
            "1 tablespoon vegetable oil",
            "1 ½ cups packed brown sugar",
            "¼ cup prepared mustard",
            "½ cup ketchup",
            "1 tablespoon Worcestershire sauce",
            "1 tablespoon soy sauce",
            "¼ cup grated onion",
            "½ teaspoon salt",
            "¾ cup water",
            "10 pineapple rings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Rinse chicken breasts and pat dry. In a shallow dish or bowl, mix together the bread crumbs, flour, oregano, 2 teaspoons salt and pepper. Heat oil in a large skillet over medium high heat; dredge chicken in bread crumb mixture and brown in skillet, about 3 to 4 minutes each side. Layer chicken in 2 lightly greased 9x13 inch baking dishes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over low heat, combine the brown sugar, mustard, ketchup, Worcestershire sauce, soy sauce, onion, 1/2 teaspoon salt and water. Bring to a boil, and pour over chicken. Cover baking dishes with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 hour, or until chicken is no longer pink and juices run clear. Top each piece with a pineapple ring, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JUDI ANN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.555325749741469,
            "ratingCount": 967,
            "itemReviewed": "Candied Chicken Breasts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "425.4 calories",
            "carbohydrateContent": "65.3 g",
            "cholesterolContent": "68.4 mg",
            "fatContent": "4.4 g",
            "fiberContent": "2.1 g",
            "proteinContent": "31.1 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "1142.3 mg",
            "sugarContent": "47 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-07T19:10:11.123Z",
                "reviewBody": "This is the most amazing recipe on this site.  I make it ALL the time and have never failed to get compliments.  Here are my successfully tried changes (makes it a little easier):  Use dried minced onion instead of fresh grated. Like many other reviewers, I replace half (or more) of the water with pineapple juice -- yum -- and I use pineapple chunks instead of rings, added to the pan in the last ten minutes of baking.  One time, I was making this for company, and already had all the chicken in the pan with the sauce, ready to go in the oven, when I decided I didn't have enough chicken, so I took some raw pieces and breaded them, and threw them in, hoping for the best.  In the end, we liked those pieces better (they're softer), so since then, I always skip the frying step -- it's a lot easier, and one less dish to wash.  Another tip I read in the reviews was the cut the cutlets up into smaller pieces -- this really makes it good.  Make a lot of extra sauce and serve over rice.  You won't regret making this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "twkitchen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1444578/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-19T15:41:49.123Z",
                "reviewBody": "Where do I start?  I have some issues with this recipe...First, when it came out of the oven, it looked and smelled great - couldn't wait to try it.  But, the chicken just didn't taste very seasoned.  I think it needs to be seasoned enough on its own because it just tasted like plain chicken smothered with the sweet sauce.  Second, the cooking time :  there is no way in HE-double hockey sticks this chicken could stay in the oven for a full hour, especially after already being in the pan for 7 minutes!  I left mine in for no more than 25mins (granted I halved the recipe) and it was overdone.  I'd say check it to make sure the juices are clear, but even my super slow oven would've completely ruined the chicken after an hour.  I will consider making this recipe again because it is so asthetically pleasing, but I will make big seasoning changes and obviously alter the cooking time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MOELASSES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/706461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-22T22:22:34.577Z",
                "reviewBody": "I was really not into making this.  It just didnt appeal to me really.  But, I was looking for something the kids would like and I had all the ingredients on hand.  This was a huge hit at my house!  After a week of nearly having to force my 8 year old to eat dinner.. I was thrilled to see him eat every single bite on his plate.  I served it with white rice.  The breading was soggy, and I dont know how to get around that.  I thought about leaving it off the next time, but it really does have nice flavor.  Even if it was soggy, it tasted good.  It is a bit on the sweet side, but in a good way.  Will be keeping this one.  I would be giving it five stars, if it wasnt for the soggy breading.  Which didnt bother anyone but me.***after making this for several months as a regular around here, I can highly recommend not covering the dish.  It comes out much less soggy, and the sauce thickens up***",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RACHAEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/594649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:27:29.623Z",
                "reviewBody": "I skipped the dredging and browning on stove top, pounded the chicken breasts to about 1/2 inch thick and seasoned with the oregano, salt, ground black pepper, then followed the recipe for the sauce.  I baked it for 25 minutes and it turned out very tender and tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LIA173",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/782122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:30:01.077Z",
                "reviewBody": "The sauce really reminded me of your typical American General Tso's chicken sauce.  If you added in some dry chilli peppers or just a few pinches of cayenne, I bet the sauce would be just perfect.\r\n\r\nIf you want to make chicken that has the consistency of Chinese chicken, do the following.\r\n\r\n1. Cut your chicken (breasts or thighs work) into cubes.\r\n2. Put them in a bowl with egg, s&p for 15-30 min.\r\n3. Put a ton of Cornstarch on a baking tray and spread it out.\r\n4. Batter each piece of chicken and deep fry them at about 375 till golden brown.\r\n\r\nFrom there you can just add the sauce any old way... throw it in a sautee pan with the chicken and bring the sauce to a boil... it'll latch right on to the chicken.\r\n\r\nServe with yummy eggrolls and Mike's Hard Lemonade.  (if you want a good eggroll recipe, just ask).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STICKYII",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648272/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-19T15:40:02.56Z",
                "reviewBody": "My husband and I absolutely loved this recipe!  I halved the ingredients for just the two of us and baked the chicken for 1/2 hour and it was perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:27:33.593Z",
                "reviewBody": "I thought this was good.  After reading the reviews, I skipped on breading the chicken and just floured it.  I also halved the sugar and I'm glad I did because it was still a little sweet in the end.  I didn't have any pineapple on hand and I think it would've been an excellent compliment to the dish. I served this over rice with spinach on the side and it was a nice change. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Flaquita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/512742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-21T21:40:23.807Z",
                "reviewBody": "I need to update my review of this recipe.  I have made this a couple times now and we just love it!  I only use 3-4 chicken breasts since its just two of us and I keep the full amount of the sauce.  After sauteing the chicken, I make the sauce in the same pan and scrape up all the yummy bits left in the bottom from the chicken.  I then let the sauce simmer for about 5-6 min to let it reduce slightly.  I bake everything in the oven without covering, for aprox. 25-30 min.  When it comes out the sauce will have reduced and thickened more and the chicken is coated nicely.  I slice the chicken and serve over white rice with more of that yummy sauce poured over top.  It makes a great dish!  Nice and sweet and flavorful!  This is a favorite for us!  Add some cayenne for a little spice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DanielleLyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2150775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T05:25:26.233Z",
                "reviewBody": "After seeing all of the rave reviews on this one I decided to try this dish. It took quite some time to prepare and I followed to directions to the letter. The end result was not what I was expecting. It had an odd taste. It was horribly sweet with the pinapple and the glaze on the top and just didn't go well with chicken at all. And the oregano that was put in the breading definately did not go with the sweetness of the glaze either. Maybe it's just me but I didn't like this dish at all. I ate one piece and threw the rest in the trash.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "BETKAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/808778/"
                }
            }
        ]
    }
]