[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17351/blooming-onion-and-dipping-sauce/",
        "name": "Blooming Onion and Dipping Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5450287.jpg",
            "width": 2463,
            "height": 2647
        },
        "datePublished": "2000-03-05T01:19:12.000Z",
        "description": "This batter-fried onion and a spicy dipping sauce will get your party going any day!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "½ cup mayonnaise",
            "1 tablespoon ketchup",
            "2 tablespoons cream-style horseradish sauce",
            "⅓ teaspoon paprika",
            "¼ teaspoon salt",
            "⅛ teaspoon dried oregano",
            "1 pinch ground black pepper",
            "⅓ teaspoon cayenne pepper",
            "1 egg",
            "1 cup milk",
            "1 cup all-purpose flour",
            "1 ½ teaspoons salt",
            "1 ½ teaspoons cayenne pepper",
            "1 teaspoon paprika",
            "½ teaspoon ground black pepper",
            "⅓ teaspoon dried oregano",
            "⅛ teaspoon dried thyme",
            "⅛ teaspoon ground cumin",
            "1 large sweet onion",
            "¾ cup vegetable oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make sauce: In a medium bowl, combine mayonnaise, ketchup, horseradish, 1/3 teaspoon paprika, 1/4 teaspoon salt, 1/8 teaspoon oregano, a dash ground black pepper and cayenne pepper; mix well. Keep sauce covered in refrigerator until needed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the batter: In a medium bowl, beat egg and add milk. In a separate bowl, combine flour, salt, cayenne pepper, paprika, ground black pepper, oregano, thyme and cumin; mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To slice onion: slice 1 inch off of the top and bottom of the onion and remove the papery skin. Use a thin knife to cut a 1 inch diameter core out of the middle of the onion. Now use a very sharp, large knife to slice the onion several times down the center to create 'petals':  First slice through the center of the onion to about three-fourths of the way down. Turn the onion 90 degrees and slice it again in an X across the first slice. Keep slicing the sections in half, very carefully until the onion has been cut 16 times. Do not cut down to the bottom of the onion. (The last 8 slices will be difficult, be careful).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the 'petals' of the onion apart. To help keep them separate you could plunge the onion into boiling water for 1 minute and then into cold water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip the onion into the milk mixture and then coat it liberally with the flour mixture. Again separate the petals and sprinkle the dry coating between them.  Once you're sure the onion is well-coated, dip it back into the wet mixture and into the dry coating again.  This double-dipping ensures you have a well-coated onion because some of the coating will wash off when you fry the onion.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep fryer or deep pot to 350 degrees F (175 degrees C).  Make sure you use enough oil to completely cover the onion when it fries.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry the onion right side up in the oil for 10 minutes or until it turns brown. When the onion has browned, remove it from the oil and let it drain on a rack or paper towels. Open the onion wider from the center so that you can put a small dish of the dipping sauce in the center.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jackie Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.551246537396122,
            "ratingCount": 361,
            "itemReviewed": "Blooming Onion and Dipping Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "290.2 calories",
            "carbohydrateContent": "22.5 g",
            "cholesterolContent": "43.2 mg",
            "fatContent": "20.2 g",
            "fiberContent": "1.5 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "843.8 mg",
            "sugarContent": "4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-01T19:31:50.937Z",
                "reviewBody": "EXCELLENT!  I recommend going on ebay and buying the \"Great American Steakhouse Onion Machine\".  Its really cheap and makes it soooo easy to make the blooms.  It works great!  Otherwise if doing by hand, here is some major tips.  First, a big \"no-no\" is to cut both ends of the onion off.  DO NOT cut the root end.  Just cut the top.  The root holds it all together, so when you cut your petals they will not fall apart.  Also when coring it, just core it about 90% of the way down, leaving the root intact.  This is easiest with a corer utensil.  When you are done, put it bloom-side down into a bowl of ice water for an hour.  This really helps it to hold up and easier to work with.  Now you are ready to bread and fry your bloom.  When frying I recommend to put it in root side down first.  Then half way thru cooking time flip it over, so that the bloom is on the bottom, and push down on the root.  The pushing down on it will help to open the petals up. When it is done you can go and cut the rest of the core and the root out of the middle.  You will have a perfect blooming onion everytime!  Sorry so long, but I really wanted to help some people that are scared of making them.  My first blooming onion just didnt work and I never wanted to make one again, until I did these steps and it turned out perfect.  This recipe is great.  The sauce is soo yummy!  I slightly warm the sauce before serving, bc it just tastes so much better than serving it cold.  It tastes just like the restaurants",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DanielleLyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2150775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-03T05:36:04.06Z",
                "reviewBody": "great recipe! for everyone having problems with the batter not sticking i recomend after dredging in batter allow it to sit for a while 10min. Also beautiful presentation!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chpnac",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1755066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-30T17:09:49.36Z",
                "reviewBody": "I've combined a lot of the wisdom from other reviewers and added some of my own.  Firstly, I think it's important to do this in a LARGE fryer.  I use the turkey fryer at 375 F. The onion is large so it will drop the oil temp immediately upon dipping it into a small fryer, and if the oil temp drops too much, you will have a soggy, greasy onion instead of a crispy one. I cut the onion and dump it in upside down into ice water for 30 min. to spread the petals.  I also double the dry ingredients to ensure  full coating of the onion.  The first time the dry ingredient amount didn't suffice.  I leave the core intact to keep the onion from falling apart, and then I cut it out after I fry it. At 375 F, it takes about 6 minutes (with core intact) to fry properly.  Keep watching it!  It will overcook pretty quickly and there is a danger of undercooking it.  The middle takes longer to cook than the outside petals, so when you remove it, check the inner petals for doneness.  Towards the latter end of frying, I flip it upside down and push down on it to let the buoyancy of the oil spread out the petals. Of course, the sauce can be adjusted to taste.  I increase the horseradish sauce to 3-4 T, quadruple the oregano, increase the salt to taste, and of course the cayenne pepper, because I like it spicy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sailshonan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:17:20.937Z",
                "reviewBody": "I cut the onion into petals to make it easier on myself after seeing some of the other reviews. The sauce was amazing. I have been looking for something like this for a while. That alone is worth the 5 star rating. Thanks....I can't wait to try this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Momof2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/821228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T16:54:48.81Z",
                "reviewBody": "No one at my GNO party could believe I actually made this - it turned out beautifully! I took a previous reviewer's suggestion and put the cut onion in simmering water for one minute then in a ice-water bath for an additional 3 minutes. It was hard to get the batter inbetween the layers but even the ones at the restaurant aren't always that perfect:) The sauce was terrific. I have a Fry Daddy Jr. so could only use a medium-large onion which was perfect after about 7 minutes in the fryer. Anyone can make this no kidding.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly Wells",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1624097/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:17:20.233Z",
                "reviewBody": "I don't get the craving for these often but when I do...look out! This recipe is amazing! It rivals that of Outback or any other steakhouse company that have this on their menus! Since I realized that the \"bloom\" part is just for show I took so many other's advice and just made these into onion rings. Hmmmmm good! They were the first to dissapear from our dinner table tonight and I will make these again very soon! Highly recommend! Thanks Jackie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:17:19.717Z",
                "reviewBody": "We loved this!  I used the batter mixture to make onion rings instead of the blooming onion and then we dipped the rings in the sauce.  It was a hit!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ARANDYGAIL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/604158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-03T17:24:25.25Z",
                "reviewBody": "If you like the taste of this dipping sauce, try this; Thousand Island dressing and creamy horseradish sauce! I used to work in a popular restaraunt and this is how we made ours. People loved it! They requested it for their onion rings, onion petals, and even a dip for their shrimp, and as a salad dressing. Last night I tried the dipping sauce in this recipe. Making it exactly as written, it was way too much mayo for my familys taste. I threw that batch out and started over cutting the mayo in half and we all enjoyed it. In the past I have made a dip very similar to this using sour cream instead of mayo and it was very good also.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Janine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2146181/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T21:17:23.013Z",
                "reviewBody": "This is awesome.  So much fun to serve.  The sauce is perfect.  It's definitely not an appetizer because once you start eating them, you can't stop!  Then, there's no room left for a meal!  Great for football season. Go Pats!  I bought this little device from one of those magazines of wierd home things that come in the mail.  I think that's the reason mine come out so well.  It's idiot proof.  It has slots that tell you where to slice, a corer, and it stops the knife before you get to the bottom of the onion.  If you like the bloom, look into it.  Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "claudygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/494115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T00:14:55.727Z",
                "reviewBody": "Pretty good in the end. But difficult and tricky to complete. Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SOCCERKAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/358752/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Blooming Onion and Dipping Sauce",
            "description": "This batter-fried onion with dipping sauce gets the party going.",
            "uploadDate": "2014-01-14T02:15:38.703Z",
            "duration": "PT4M34.149S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3e973c75-09ce-4d85-af19-9bf12bff836e%2F544f72a3-e349-43c4-9961-3afbcc675825%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3050770266001"
        }
    }
]