[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/750/desserts/candy/fudge/",
                    "name": "Fudge Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1279/desserts/candy/fudge/peanut-butter/",
                    "name": "Peanut Butter",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19160/worlds-best-peanut-butter-fudge/",
        "name": "World's Best Peanut Butter Fudge",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F176984.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-03-05T15:29:11.000Z",
        "description": "A friend shared this recipe with me, and it is by far the best fudge recipe I've ever tried. This fudge is too good to only make at Christmas!",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "3 3/4 pounds",
        "recipeIngredient": [
            "4 cups white sugar",
            "1 cup milk",
            "½ cup butter",
            "1 (7 ounce) jar marshmallow creme",
            "12 ounces peanut butter",
            "⅔ cup all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease a 9x13 inch baking dish, set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan, combine sugar, milk, and butter. Bring to a boil, and cook 5 minutes. Remove from the heat. Stir in the marshmallow creme and peanut butter. Gradually stir in the flour. Spread into the prepared pan, and let cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Fudge Recipes",
            "Peanut Butter"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Debby"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.60370994940978,
            "ratingCount": 593,
            "itemReviewed": "World's Best Peanut Butter Fudge",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "115.7 calories",
            "carbohydrateContent": "18.3 g",
            "cholesterolContent": "4.4 mg",
            "fatContent": "4.5 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.7 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "40.9 mg",
            "sugarContent": "15.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-07-06T15:34:16.303Z",
                "reviewBody": "Ok - for those of you that had trouble with this recipe - try these things:  1) Like many others did, I mixed the flour, peanut butter, and m.creme ahead of time (with a mixer).  2) I used evaporated milk instead of regular milk.  3) I used Swansdown Cake flour instead of regular flour.  4)I used an even cup of marshmallow creme (8 oz).\r\n\r\n I found out the temperature to cook fudge to is 238 degrees F. - so I did that, using my candy thermometer and didn't go by time.  The moment it reached that temp - took more than 5 minutes on medium/medium high heat - I took it off the burner and mixed the rest of the pre-mixed ingredients in.  After a LOT of elbow grease with a REALLY sturdy whisk (a square pot whisk) - when everything was blended - I let the mixture cool to about 160 degrees F and whisked with vigor again - before spreading in a glass pan that had been lightly sprayed with butter-flavored Pam.\r\n\r\n Once in the pan - I used one of those sharp gadgets that you use to hold a tomato with while slicing it (mine's Pampered Chef) - and made a nice grid pattern before it started to harden.\r\n\r\nCame out perfectly!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Menwith Hill'er Back Home !!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/938152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-13T17:21:04.06Z",
                "reviewBody": "the best pb fudge recipe I've found.  It was so mallow and creamy; not at all dry and crumbly.  I took the advice of others and pre-blended the flour, pb, and marshmallow creme.  I also added a tsp. of vanilla extract and 1/4 tsp. butter extract to this mixture.  I always use a candy thermometer when making fudge.  I used the thermometer and set the kitchen timer to 5 minutes and can tell you that the temp only got up to 225 degrees, well below the soft ball stage.  One does not want to rely on a soft-ball stage to make this.  I realized that this was a different fudge recipe than most with the addition of flour and decided I better only boil for the 5 minutes instead of going for soft ball stage.  glad I did, as it turned out perfect.  I didn't even refrigerate it; set it on the table for about 1 hour.  I always use foil-lined pan sprayed with pam when making fudge; easier to lift out.  I just lifted it out of the pan and cut a sliver to try; MALLOW, MALLOW, MALLOW!  I did add extra pb, as I had an off-brand and didn't think it tasted very peanuty when I opened the jar.*about 14 oz. of pb used*  Thanks for this recipe.  can't wait to take it to work tonight for co-workers to try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-19T19:28:57.86Z",
                "reviewBody": "I have never been a peanut butter fudge fan, but this recipe changed that! I have made this recipe a dozen times over the past few years. I get multiple requests from family and friends for batches or recipes! It tastes like peanut butter cookie dough, or the inside of a peanut butter cup - but smoother! I have never had this not set up for me. First, I bring the butter & sugar mixture to a boil using medium heat, stirring frequently. Then I reduce the heat so it won't boil over, and set the timer for a full 5 minutes.  I pre-mix the peanut butter & marshmallow creme in my kitchenaid. I use creamy peanut butter and just eyeball it from the jar. I pour the sugar mixture into the mixer bowl and let it sit for 30 seconds or so to help melt the peanut butter/marmallow mix. Then I mix just until combined. Add the flour, and mix just until combined. I tap the mixer bowl on the counter to help release some of the air bubbles. I pour the mixture into a large baking sheet. I let it sit for a minute, then sometimes add a few handfuls of chocolate chips (I prefer milk chocolate with this recipe)on top to melt and spread. Other times I let it cool so I can handle it, take a pinch and roll it and dip it in chocolate for peanut butter balls that taste just like store bought peanut butter cups! Or just eat it plain and it is heavenly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Iowa Kate",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2168224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-24T01:15:11.41Z",
                "reviewBody": "Follow the instructions and measure carefully and you will have great fudge!  Be sure to start the 5 minute timing AFTER the mixture comes to a full rolling boil.  I also use evaporated milk and unsalted real butter.  I have been using this same recipe for many years and my teenage son loves it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hollys Taylor Made Treats",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1260958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-28T01:21:17.077Z",
                "reviewBody": "This is my first time making fudge and it turned out really well. I accidentally poured it into a 8x8 pan but moved fast enough to scrape it into a 9x13 with no problems with it setting too fast (the top just isn't pretty and smooth). I've tried some already and it's a great consistency - rich creamy firm but not too crumbly. It cuts well too. Cooking notes: I followed others' advice and preblended the pb flour (only used 1/3 cup) and marshmallow. I also used evaproated milk instead of regular. I don't have a candy thermometer but I let the mix boil for 6 min before adding the pb mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MMMFOOD13",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1296586/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T17:04:07.447Z",
                "reviewBody": "this is the most awesome pb fudge recipe! i did mix the marshmallow creme peanut butter and flour ahead of time in a bowl so when the other was finished cooking i could just mix them together and be done... People RAVE over the taste and smoothness of this fudge. i will never use any other recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "seashells",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2621424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-28T05:37:12.127Z",
                "reviewBody": "Fantastic! I haven't made fudge before and this turned out awesome! I changed the preparation though: (1) line 13x9\" pan with foil and spray with pam(2) Mix together well in mixer peanut butter and marshmallow cream and set aside (3) Bring to boil over medium heat sugar butter and milk (I used whole milk) When at a rolling boil set timer (I set it for 5 minutes 30 seconds) and boil stirring frequently. Add 1 cup salted roasted peanuts stir and remove from heat (4) Add hot mixture to mixer containing PB and Marsh creem. Let sit for 30 seconds add vinilla (1/4 tsp) and flour. Mix just until blended. Pour into prepared pan after leveling perfectly sprinkle with milk chocolate (I found choc. chips didn't give good texture but cut-up milk chocolate candy bar or hurshey kisses were great) Spread softly to create a nice top layer (or bottom layer whichever you prefer). Fridgerate for 1 hour. Viola!!! I'd like to thanks many reviewers for these ideas I combined many of them into this review and it had awesome results!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allrecipes Community",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/allrecipescommunity/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-08T13:18:57.577Z",
                "reviewBody": "We loved this fudge.  I added a tsp. of peanut butter extract for even more flavor, then while the sugar, milk and butter were cooking I blended the peanut butter, marshmallow cream and flour together with an electric mixer. (I love shortcuts) When I added the hot syrup, I beat it hard for about a minute.  This way there was no chance of any residual flour taste.  This is a keeper, and not just for the holidays.  Thanks for a great recipe!  OH!!  And this is great with a little chocolate melted or drizzled on top too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARB MAXWELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/492841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T16:33:23.357Z",
                "reviewBody": "I am giving this five stars but I would have liked more peanut butter taste (I'm kind of a peanut butter nut). I might try adding more next time and hope that doesn't throw off the whole recipe. I have never made candy before--so here are a few hints for other novices: 1) use a big pot. I started off with a 2 1/2 quart saucepan and it was much too small. I had to dump the boiling mess into a 5 quart pot to prevent it from spilling over. 2) It doesn't seem to need to be stirred when it's boiling. I worried that it would scald but it didn't. 3) You may want to refrigerate the final product before you cut it into squares; it's pretty soft and wasn't holding its shape as I cut it. 4) I used nonfat (skim) milk and it came out just fine. (I thought it might really need whole milk). Thanks for the great recipe. Even thought I have never made candy before at all it came out really well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "losangeles71",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/438176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T18:37:56.743Z",
                "reviewBody": "I was not happy with this fudge. I followed the directions exactly and the fudge is not firm you can't even cut a piece and take it out of the pan you need a spoon to eat it. If there was something else that needed to be done that should have been stated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "MsJss12",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2212313/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "World's Best Peanut Butter Fudge",
            "description": "See how to make amazing peanut butter fudge.",
            "uploadDate": "2012-11-07T17:57:24.101Z",
            "duration": "PT2M47.459S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc040db58-a028-4626-9b23-3ee63ff494de%2Fd2e20ff2-fd5f-4a85-a524-edaca2635f3a%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1954096265001"
        }
    }
]