[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/380/desserts/cakes/lemon-cake/",
                    "name": "Lemon Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17980/no-bake-lemon-cheesecake/",
        "name": "No Bake Lemon Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1068267.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "2000-03-12T23:37:23.000Z",
        "description": "Light and fluffy no bake cheesecake with a tart lemon taste.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT3H20M",
        "recipeYield": "1 - 10 inch round pan or 9x13 inch pan",
        "recipeIngredient": [
            "3 cups graham cracker crumbs",
            "½ cup butter, melted",
            "1 tablespoon confectioners' sugar",
            "1 (3 ounce) package lemon flavored Jell-O® mix",
            "1 cup boiling water",
            "1 (8 ounce) package cream cheese, softened",
            "1 cup white sugar",
            "1 teaspoon vanilla extract",
            "1 (5 ounce) can evaporated milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, butter and confectioners' sugar. Mix well and press into the bottom of a 10 inch springform pan. Bake in preheated oven for 10 minutes. Remove from oven and allow to cool. Turn off oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve lemon gelatin in boiling water. Let cool until thick, but not set. In a large bowl, beat cream cheese, white sugar and vanilla until smooth. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl, whip evaporated milk until thick and stiff peaks form. Pour in lemon gelatin and keep mixing until well blended. Fold in cream cheese mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour filling into crust. Chill in refrigerator for at least 3 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Lemon Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jan Wood"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.163043478260869,
            "ratingCount": 92,
            "itemReviewed": "No Bake Lemon Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "165.5 calories",
            "carbohydrateContent": "20.6 g",
            "cholesterolContent": "22.1 mg",
            "fatContent": "8.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "144 mg",
            "sugarContent": "15.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-26T20:49:17.81Z",
                "reviewBody": "I grew up on a recipe very similar to this, and when I tried it - what memories! \r\nI did add 2 T. fresh squeezed lemon juice to the gelatin mix before it thickened.  \r\nThis is a recipe that I used to make as a kid.  It's easy with a few tricks. To get \r\nthe canned milk to whip up beautifully, put in the freezer until it's as cold as it \r\ncan get before freezing.  When it's cold you can shake the can and the milk inside \r\nwill quickly froth up enough to stop sloshing.  Use high speed with a good mixer, \r\nmetal bowl that is previously chilled and a whisk attachment.  I cheat and use a \r\nchilled plastic bowl and get soft foam that works well.  But I used to get stiff peaks \r\nwhen I had a metal bowl.  Be sure your canned milk isn't low fat.  After beating \r\nthe cream cheese mixture, throughly mix in the luke-warm to tepid gelatin mixture.  \r\nTHEN fold that into the whipped milk.  I'm glad to find this recipe again.  It's as \r\ngood as I remember.  My husband and son now love it, too.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TREADE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/454387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-26T20:43:05.873Z",
                "reviewBody": "I have been making this recipe for 30 years. I also add 2 TBSP of fresh lemon juice to the gelatin and hot water. I use a 13oz can of evaporated milk insread of 5oz. I put the evaporated milk into the refrigerator for a couple of hours before making the recipe. I also chill my bowl and beaters in the freezer. I always have stiff peaks. I gently fold the lemon and cream cheese mixture into the stiff evaporated milk. I put mine in a 9 x13 pan. I leave it in the frig overnight. I serve it in squares topped with extra grahmn cracker crumbs and topped with whip cream and a cherry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MCBASKETS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/198368/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-06T16:39:45.997Z",
                "reviewBody": "This was fabulous!   After reading others' comments, I chilled the milk in the fridge for several hours, and the bowl and beaters for about 20 minutes, and used (accidentally) a 12 oz. can of evap. milk.   My milk beat up to stiff peaks in a minute or two. I also used strawberry instead of lemon, and served with a few mashed strawberries on top.  YUM, and so easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rexmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1759567/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-05T05:30:01.723Z",
                "reviewBody": "This recipe is very good, and unbelievably easy to make! I used 5 ounces of fresh whipping cream (35% MF) instead of the evaporated milk, because I couldn't imagine that it would be easy to get firm peaks with the evaporated milk and because of the other reviewer's warnings (Thank you!)\r\nI also added the juice from half a lemon for extra flavour, and used light cream cheese. It turned out great (especially for the small amount of effort needed!) Thanks Jan!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mcatherwood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/446416/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-18T13:06:39.857Z",
                "reviewBody": "I never bake but I tried this for my co-workers and they all loved it. No the evaporated milk never got stiff but it still set well and tasted like it said it would tart and light.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/370834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-10-04T01:25:14.623Z",
                "reviewBody": "This one sounded soooo good. What a disappointment! First how long does it take to beat evaporated milk until stiff peaks form. I chilled it I whipped it I chilled it some more. It did get sort of frothy. This was a crumby recipe. It jiggled like jello tasted ok but don't waste your time! I had to quick make another dessert for my guests. The crust was great though and I will use the powdered sugar again when making graham cracker crusts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "S2BR1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/74361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-02T11:48:00.437Z",
                "reviewBody": "i made this for my dad and his girlfriend for looking after my daughter for a few days. he said it was fantastic and said i can make it any time for him. my dads quite picky with sweet things! i read the reviews and made a couple of changes based on others' suggestions though. i used heavy cream rather than evaporated milk as i was worried about it not peaking you cant buy lemon gelatine in the uk so i used leaf gelatine and jif lemon (fresh squeezed bottled lemon). also you cant buy graham crackers here so i used swetmeal digestive biscuits which are pretty much the same thing. it set straight away and impressed greatly. my dad said it tasted better than the one in the shops!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PaulaM11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1390120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-20T01:07:49.763Z",
                "reviewBody": "I had been looking for this recipe for a very long time it reminds me of my mothers from about 40 years ago... Fantastic and a hit with my wife and our guests!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gord Lemire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1662866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T03:41:35.84Z",
                "reviewBody": "I HAVE THE ANSWER!!! For those of you who couldn't get the chilled regular (not low fat or fat free milk)evaporated milk to form stiff peaks. Mix the milk with your cold beaters. Do not whip up the cream cheese mix first. The cream cheese leaves a residue on the beaters that prevents the milk from forming stiff peaks. Besides the cream cheese mix works just fine with a spoon or wire whisk. Peaks should take no longer than 2 or 3 min on high speed beaters at the most. If you touch the surface with your finger or a spoon and when you pull away it forms a peak...voila you are done. It's not rocket science people and the finished product is ab fab. For those of you looking for an easy way to soften your cream cheese....while it is still in the foil package...place it on the burner on the stove top that your oven vents through. While your crust is baking the cream cheese is now soft and creamy enough to not need beaters.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "liesh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2534167/"
                }
            }
        ]
    }
]