[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/149/breakfast-and-brunch/french-toast/",
                    "name": "French Toast Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17063/overnight-apple-cinnamon-french-toast/",
        "name": "Overnight Apple Cinnamon French Toast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7148009.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-03-17T17:40:23.000Z",
        "description": "This is a great brunch recipe, it's perfect for large gatherings. A yummy bread casserole baked with sweet apple filling.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT15H0M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "¾ cup butter, melted",
            "1 cup brown sugar",
            "1 teaspoon ground cinnamon",
            "2 (21 ounce) cans apple pie filling",
            "20 slices white bread",
            "6 eggs",
            "1 ½ cups milk",
            "1 teaspoon vanilla extract",
            "½ cup maple syrup"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease a 9x13 inch baking pan. In a small bowl, stir together the  melted butter, brown sugar and cinnamon.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the sugar mixture into the bottom of the prepared pan. Spread the apple pie filling evenly over the sugar mixture. Layer the bread slices on top of the filling, pressing down as you go.  In a medium bowl, beat the eggs with the milk and vanilla. Slowly pour this mixture over the bread, making sure that it is completely absorbed. Cover the pan with aluminum foil and refrigerate overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the morning, preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place covered pan into the oven and bake at 350 degrees F (175 degrees C) for 60 to 75 minutes. When done remove from oven and turn on broiler.  Remove foil and drizzle maple syrup on top of the egg topping; broil for 2 minutes, or until the syrup begins to caramelize. Remove from the oven and let stand for 10 minutes, then cut into squares. Invert the pan onto a serving tray or baking sheet so the apple filling is on top. Serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "French Toast Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CALJAKE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.496062992125984,
            "ratingCount": 381,
            "itemReviewed": "Overnight Apple Cinnamon French Toast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "375.3 calories",
            "carbohydrateContent": "60.5 g",
            "cholesterolContent": "100.8 mg",
            "fatContent": "12.9 g",
            "fiberContent": "1.7 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": "7 g",
            "servingSize": null,
            "sodiumContent": "370.4 mg",
            "sugarContent": "23.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-05-15T17:38:05.013Z",
                "reviewBody": "I have made this recipe a couple of times and everyone has loved it!!! A couple of things I noticed is that I could only fit about 9 slices of bread in the pan before it started overflowing and it took 1 1/2 hours for mine to cook. I think next time I make it I will only use one can of apple pie filling and then I will be able to add more bread. Also make sure you spray the foil or it will stick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CUZIMTHEMOMLW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/599561/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-29T23:55:12.407Z",
                "reviewBody": "This recipe was amazing.  I chose it because, unlike many of the other \"make ahead\" french toast recipes, it truly was 100% ready to go in the morning.  Just pop it in the oven.  When I made it I used one can of apples, and made sure it was apples and water only--no high fructose corn syrup--to keep the recipe from being over-the-top sweet.  The apples turned out so delicious, next time I probably will use two cans.  I used Pepperidge Farm cinnamon raisin bread, and baked for 90 minutes.  Everything else I kept exactly the same.  I used a cake pan and had no problems with it boiling over.  I didn't turn it upside down, and I thought it made a very nice presentation \"as is\" with the cinnamon swirl bread.  The bread wasn't incredibly crispy, as pan fried French toast can be, but it certainly wasn't gooey either.  I think using a slightly more substantial bread, like Italian or the cinnamon swirl, instead of white or French, makes a big difference.  I made it for a brunch for 11 people, and everyone absolutely raved about it. It was so incredibly simple--15 minutes the night before and you're done.  This will definitely become a staple in my house.  Thanks for a real keeper!  Note:  I made this again and didn't bake it as long.  Yuck!  Make sure you bake it long enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SB2323",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/447798/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-25T17:32:57.167Z",
                "reviewBody": "I have made this a fewtimes and everyone just loves it! Instead of the canned pie filling, I used fresh apples (3-6), peeled and thinly sliced. I tossed those with 1/2 cup melted butter (3/4 cup leaves a soppy, greasy mess at the bottom), 3/4 cup brown sugar, and 2-3 teaspoons cinnamon. I have always been able to fit eighteen slices of bread in my 9x13 pans (three layers of six). This bakes up perfectly in 70-75 minutes. Spraying the tin foil is an absolute MUST or it will stick. This recipe will be around our house for a long, long time. It's absolutely perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jodi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T21:17:51.17Z",
                "reviewBody": "The flavor of this french toast is really great, but you really need to make sure this is cooked completely through!  At 60 minutes, mine looked done, but was still very wet at the bottom of the bread layer.  We had to do a little improvising under the broiler, but all reviews were still very positive!  This is a keeper for sure... longer cook time and maybe a little less milk.  Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-16T03:39:36.2Z",
                "reviewBody": "This was very easy to make and very good!  My husband loved it. I cut the recipe in half and baked it in a 8x8 pan.  Based on advise from others, I replaced 1/2 the milk with cream and cooked it for the full 75 minutes - it came out perfect and wasn't soggy at all.  To perfect this recipe, all I'd do is use just a little less brown sugar and syrup, so it's not quite as sweet.  Other than that, this recipe couldn't be any better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "READY2COOK05",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1352996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-02T21:24:31.327Z",
                "reviewBody": "HUGE hit with my husband and everyone at the office.  Instead of usung canned apple pie filling, I sauteed my own in a little butter and maple syrup. This made it *perfect*!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KTWhite",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641860/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-18T23:29:27.6Z",
                "reviewBody": "Super easy, turns out great! A couple of suggestions... I've made this twice now, and it's been a hit both times!!! First time I made a 9x13 and could only fit 18 slices of bread, 2nd time I cut the recipe in half and used an 8x8 and fit about 10 pieces of bread. When it says to \"press down\", press down with some force, not  patting the bread. The first time I made it, I used the canned apple pie filling and it was good, but too sweet (and i LOVE sweet stuff). The 2nd time I peeled and sliced apples, put them in raw, and it turned out awesome! Both times I baked mine no less than an 1hr and20min.  I put a cookie sheet lined with tin foil under it to avoid bubbling over. I made sure to spread the egg mixture evenly over the bread w/ spatula, almost rubbing it in.  Spraying the tinfoil so it doesn't stick to the bread is helpful.  Also, I didn't invert it either time and it presented great and didn't seem to make a difference. People will be asking for the recipe guaranteed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "liz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6331521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-20T19:48:20.263Z",
                "reviewBody": "Mmmm great recipe! The only reason it did not receive 5 stars is because we did find it a little sweet for breakfast. I will definitely make this dish again for brunch but I think next time I will use McIntosh apples instead of apple pie filling I think the brown sugar gives it enough sweetness. I also want to mention that I cut this recipe in half and it turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "kelcampbell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kelcampbell/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:50:40.403Z",
                "reviewBody": "I just made this for Christmas brunch this morning and it was a hit! I kept it in the oven a little longer to make sure the bread was cooked all the way through! I already passed it along to my family members. Nothing but yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STACYNOLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/119318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-29T16:20:06.42Z",
                "reviewBody": "This was good but the bread was quite soggy. It was more like bread pudding than French toast. I probably won't make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Maine_diner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939799/"
                }
            }
        ]
    }
]