[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17287/cranberry-sunflower-bread/",
        "name": "Cranberry Sunflower Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F948927.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-03-20T23:55:58.000Z",
        "description": "Delicious light brown bread loaded with fresh, natural ingredients.  You can serve this bread to your vegetarian or naturalist friends with no guilt at all! Great toasted for breakfast, with a luncheon salad, or just to snack!",
        "prepTime": "P0DT1H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H10M",
        "recipeYield": "2 - 9x5 inch loaves",
        "recipeIngredient": [
            "⅔ cup dried cranberries",
            "2 cups hot water",
            "2 (.25 ounce) packages active dry yeast",
            "¼ cup honey",
            "¼ cup molasses",
            "1 cup warm water (110 degrees F)",
            "1 cup rolled oats",
            "2 eggs, beaten",
            "2 teaspoons salt",
            "⅓ cup shortening",
            "6 cups bread flour",
            "⅓ cup roasted sunflower seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, soak cranberries in hot water. In a separate bowl, dissolve the yeast, honey and molasses in 1 cup warm water. Let stand until creamy, about ten minutes. Drain and chop the cranberries, reserving the liquid; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the reserved water, oats, eggs, salt , shortening and 2 cups of flour. Mix until  well blended. Then stir in the yeast mixture. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has started to pull together, add the cranberries and the sunflower seeds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about  45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grease two 9x5 inch loaf pans. Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into the prepared pans. (The dough can also be formed into longer loaves and placed on lightly greased baking sheets.) Cover with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 minutes in the preheated oven, then decrease heat to 325 degrees F (165 degrees C) and continue to bake for another 30 minutes. Turn out of pans a few minutes after removing from oven. You can brush all sides with a little butter or margarine, if desired. Don't cut this bread too quickly, it tastes best slightly warm or at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Donna S Linder"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.5,
            "ratingCount": 6,
            "itemReviewed": "Cranberry Sunflower Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "61 calories",
            "carbohydrateContent": "8.6 g",
            "cholesterolContent": "12.4 mg",
            "fatContent": "2.8 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1 g",
            "saturatedFatContent": "0.7 g",
            "servingSize": null,
            "sodiumContent": "161.2 mg",
            "sugarContent": "5.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-07-06T17:28:45.013Z",
                "reviewBody": "I thought this was a pretty tasty moist bread but is was sort of bland. If I make this again I will definitely double or possibly triple the cranberries. I would probably also use a slightly larger pan because my dough was literally hanging over the sides. Also very important: Cover the loaf with foil after the first ten minutes! Mine was really browned after ten minutes and would probably have burnt to a crisp if I hadn't covered it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SALLYCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/118036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-05T23:44:10.413Z",
                "reviewBody": "This was really good but you have to make sure that you really let it rise - everytime I make this it takes a lot longer to rise than the recipe says. I've also made it replacing the sunflower seeds and cranberries with pecans and raisins or with cherries and walnuts. They've all been wonderful. Another really fun and easy thing to do is turn the dough into a large greased coffee can and allow it to rise almost flush with the brim; begin preheating the oven and by the time you pop it in the oven it will have risen a little over the top. Bake at 350-degrees until it sounds hollow when tapped (about 45 minutes). Turn out of the coffee can immediately and let cool before you cut into it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LORIKAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1433571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-06T17:51:51.847Z",
                "reviewBody": "This recipe is good. The flavor and texture of the bread is really light and soft. I halved the recipe and prepared it in my breadmaker and it rose way too high. I had to cut a piece off of the top or else it would have overflowed it. Next time I will make one third of the recipe instead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mishimee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2708781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-03T18:27:58.21Z",
                "reviewBody": "This bread has a very nice texture and couple be easily adapted for many dried fruit/nuts combinations such as raisin/walnut apricot/pecan date/walnut pine nut/golden raisin cherry/pecan etc etc. One note however is that I managed to get 3 two pound loaves of bread out of this recipe. With the 3 cups of water honey molasses shortening and eggs the 6 cups of flour was just not quite enough for all the liquid. I ended up adding an extra cup of rolled oats and about a cup and a half of extra flour. I also added about 4 tablespoons of vital wheat gluten in response to several reviewers indicating that they had trouble with the loaves rising. I had not trouble at all but I never really time my rise so I'm sure it too longer than the 40 minutes indicated. I also baked at 325 for 32 minutes for perfectly browned loaves. I'm sure that the intial heat at 450 is to provide the loaves some oven spring when they first go in. If you let the dough rise long enough to fully double you can bake at 325/350 with no need for playing with the oven temps. Even needing those adjustments I loved the bread and will be making it again. A great recipe to keep in your collection (with those slight mods of course)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookin Up A Storm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jansrecipes/"
                }
            }
        ]
    }
]