[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/389/desserts/cakes/coffee-cake/",
                    "name": "Coffee Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19093/quick-coffee-cake/",
        "name": "Quick Coffee Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F37716.jpg",
            "width": 1600,
            "height": 1200
        },
        "datePublished": "2000-03-20T23:36:33.000Z",
        "description": "This coffee cake is wonderful, the cake itself it moist and delicious while the topping is slightly crunchy and sweeter. Together, they make a delightful combination that you will surely enjoy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "1 - 9 inch square pan",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "6 tablespoons white sugar",
            "½ teaspoon salt",
            "⅓ cup shortening",
            "½ cup milk",
            "1 egg",
            "½ teaspoon vanilla extract",
            "2 tablespoons butter, melted",
            "½ cup brown sugar",
            "2 tablespoons all-purpose flour",
            "½ teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C). Grease and flour a 9 inch square pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl mix together the flour, baking powder, sugar and salt. Cut in the shortening with a pastry blender to the size of small peas.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate small bowl, beat the egg well, then stir in the milk and vanilla. Add the egg-milk mixture to the flour mixture all at once. Stir carefully until just blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into prepared pan and spread evenly. Drizzle top with melted butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl mix together brown sugar, 2 tablespoons flour and 1/2 teaspoon cinnamon. Sprinkle on top of cake. Bake in the preheated oven for 15 to 20 minutes, or until a toothpick inserted into the center of the cake comes out clean.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Coffee Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stephanie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.251724137931035,
            "ratingCount": 290,
            "itemReviewed": "Quick Coffee Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "268.1 calories",
            "carbohydrateContent": "38.5 g",
            "cholesterolContent": "28.8 mg",
            "fatContent": "11.4 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "225 mg",
            "sugarContent": "20.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-23T04:13:17.423Z",
                "reviewBody": "I'm glad I read all these reviews first! This is a great, quick coffee cake if you make a few adjustments to the recipe recommended here in the reviews.   I doubled the sugar and added about 1/4th cup more milk.  I also mixed the melted butter in with the topping mixture and sprinkled it all on top and then took a knife and dragged it through the batter (already in the pan) so that some of the topping would sink below.  I really liked how it came out, I'm posting a picture in the photo section, so you can see.  The cake came out nice and crisp on top but very moist below.  It didn't last very long around my house and i'm already wanting to make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "B Spradley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1798897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-07T23:55:00.7Z",
                "reviewBody": "WOW I had a hard time deciding if I should make this or not because some people seemed to realy like it and others seemed to really dislike it. I took the advice of another and added 2/3 cups sugar to the batter and a little extra brown sugar to the topping (about 3 tbls) and WOW was it delicious, so quick, easy YUMMY! Whatsmakes this recipe even better is that it requires so little ingredients and all are common place around my kitchen. I will try to double it next time and see how it works. This is certainly a keeper and the first recipe to motivate me to rate and review. Give it a shot!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mel's Diner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/893339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-17T16:26:55.86Z",
                "reviewBody": "This is a good basic coffee cake. I read through the reviews before making it and I doubled the sugar and added an extra 1/4 cup of milk. It reminds me of Drake's coffee cakes for some reason. Next time I would definitely double the topping. This is something if you're having people over at the last minute and you need something in a hurry to serve with tea or coffee.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-30T17:17:22.937Z",
                "reviewBody": "I just now whipped this up and have decided to throw out my old coffee cake recipe; this will be my new staple. Lovely light and delicate. I didn't alter a thing with the batter except I ended up accidently dumping in more vanilla. Whoops! With the topping however I used half brown sugar and half white sugar cut the flour down to one heaping tablespoon doubled the cinnamon and used an old trick for a crunchy topping: sprinkle the batter with the cinnamon mixture first then drizzle the melted butter over it. YUM!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kym Salow",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1887206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-02T14:11:38.653Z",
                "reviewBody": "This was the BEST Coffee cake I've ever made. I did, however, make a few changes as suggested by others. I added 2/3 c sugar to the dry and a 6 oz container of Fat Free Vanilla yogurt to the wet ingredients. I topped half of the cake with the suggested topping and the other half I added shredded coconut and pecans to the topping, YUMMMMM!! My family LOVED IT!! The pecans and coconut were absolutely delightful! Very moist, PERFECT! A keeper for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gina Moore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2054200/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-10T15:30:30.28Z",
                "reviewBody": "I tried this recipe after reading all the reviews and decided to add 2/3 cup sugar. The cake turned out delicious(not dry at all) and very tasty--my kids and hubby loved it. It did taste more like a pound cake not like a coffee cake--very yummy though! I put apples under the crumble topping and made another one and omitted the crumble topping and put about 1/2 cup raspberry jam(about 10 minutes before it came out of oven) and drizzled a little icing on top of both cakes after they were baked. Thanks for the recipe--I will definately be using this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENGILL1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1317424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-25T15:21:42.017Z",
                "reviewBody": "I'm giving this recipe 5 stars because i think that it would have tasted just fine if I hadn't made the changes as other reviewers did. I added more milk and mixed the melted butter w/ the topping and this came out too moist and the topping wasn't crumbly enough 4 me. If I just followed the original recipe it would have been great! W/ the changes this deserves 3 stars. I say: keep the recipe the way it is. It was a tad too heavy and sweet w/ changes. I have a sweet tooth and didn't care fot it. Next time I will make it the right way and I'm sure it will be scrumptious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PrwdMthr",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2277834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:59:12.82Z",
                "reviewBody": "I found this to be a little on the dry side. The topping was really floury so I couldn't see if the top of the cake to test for doneness. I would also suggest adding more spices..mine didn't seem to have a lot of flavor. On a positive note I was able to whip this up in time for an unexpected guest to have a peice. He did comment on how light it was and so it was enjoyed by some. I probably won't be making this again but I'm glad I tried it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-02T17:46:11.56Z",
                "reviewBody": "We're having a blizzard in MA. The kids have yet another school day. Husband is off today and and I work from home. This put me in the mood to nest and give my family something freshed baked sweet and warm. This recipe was perfect! I made a few small changes based on what other reviewers said - increased the white sugar to 1/2 cup used 6 tbsp unsalted butter instead of shortening added 1/2 cup buttermilk to the batter increased vanilla to 1 tsp. To the topping I added chopped pecans 1/4 tsp of nutmeg and increased the cinnamon to 3/4 tsp. I baked at 425 for about 25 minutes. The cake was fluffy moist rich without being greasy and not too sweet but not bland either. Next time I will mix the melted butter into the topping as others have done and perhaps run a knife through the topping to swirl it into the batter a little.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vpecchia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5251500/"
                }
            }
        ]
    }
]