[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17318/cashew-cookies/",
        "name": "Cashew Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4776622.jpg",
            "width": 4032,
            "height": 1382
        },
        "datePublished": "2000-03-24T23:18:29.000Z",
        "description": "Soft sour cream cookies with cashews and burned butter frosting. This is the world's best cookie!  They immediately disappear after making.  Try them, you'll fall in love!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "½ cup butter, softened",
            "1 cup brown sugar",
            "1 egg",
            "⅓ cup sour cream",
            "1 teaspoon vanilla extract",
            "2 cups all-purpose flour",
            "¾ teaspoon baking powder",
            "¾ teaspoon baking soda",
            "¼ teaspoon salt",
            "1 ¾ cups chopped cashews",
            "½ cup butter",
            "3 tablespoons heavy whipping cream",
            "2 cups confectioners' sugar",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the 1/2 cup butter and sugar until light and fluffy. Add the egg, beating well, then stir in the sour cream and 1 teaspoon vanilla. Combine the flour, baking powder, baking soda and salt; gradually stir into the creamed mixture. Fold in cashew pieces. Drop by rounded spoonfuls onto the prepared cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 12 to 15 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frosting, melt 1/2 cup butter in a saucepan over medium heat. Cook until butter turns a light brown color, be careful not to burn it. Remove from heat and stir in the cream. Gradually beat in the confectioners' sugar and 1 teaspoon vanilla until smooth. Spread onto cooled cookies.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Amy Gjerdingen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.612244897959184,
            "ratingCount": 49,
            "itemReviewed": "Cashew Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "161.5 calories",
            "carbohydrateContent": "18.3 g",
            "cholesterolContent": "21.4 mg",
            "fatContent": "9.3 g",
            "fiberContent": "0.4 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "4.5 g",
            "servingSize": null,
            "sodiumContent": "136.4 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-03-10T19:18:18.247Z",
                "reviewBody": "The original recipe is bland.  I found it improved with these alterations:  increase vanilla to 1 1/2 tsp, increase salt to 1/2 tsp &  roast the raw cashews before adding to recipe.  Canned roasted cashews would work, too, but do not increase salt if using canned, salted roasted cashews.  Baking time is more like 11 -12 minutes than 15 minutes and the flavor intensifies if cookies are allowed to sit 2-3 days.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "texanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3117659/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-31T18:24:26.173Z",
                "reviewBody": "I was unable to go visit my husband's family with him for the holidays, so I sent him with bags of cookies for all his relatives.  I was initally afraid to include these cashew cookies because I did overcook them a little (BEWARE..I started off with 12 min. and they were def. overdone.  Next time I will start checking them after about 9 1/2 min.  They were dry the first night but seemed to soften up over the next couple days.  But I was glad I did include them...they were my dad's and both his parents' favorites in the whole bag!! (I had Award Winning Choc Chip, Big Soft Ginger Cookies and Peanut Butter Cup cookies, so that's saying a lot!!!)  Also, next time I will put the frosting in a ziploc bag and cut the corner so I can squeeze/drizzle the frosting on...I had a really hard time spreading the frosting on and I had to make it really thick (a little too thick) for it to stick to the cookie and look nice.  ALSO...the frosting doesn't look anything like the cookies in the \"main photo\"...i guess i didn't look at the other photos before i started and freaked out when my frosting was thick and white, more like cake frosting...not yellow-buttery looking glaze like the picture.  But the frosting was still good and better than without it.  I'd be interested in knowing what kind of glaze is on those cookies in the main picture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jcmeade79",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2938687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-22T02:31:30Z",
                "reviewBody": "Very good cookie...has a buttery/nutty taste. Be sure to use UNSALTED cashews! I chopped the cashews up with my food processor, being careful not to chop them too fine. From the previous reviews, I expected them to be on the \"not-so-sweet\" side, but I thought they were plenty sweet. And, actually a quite \"rich\" cookie. These would make a good cookie for holiday baking, as I considered them to be a \"special\" treat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHERBH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cherbh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-14T19:02:16.757Z",
                "reviewBody": "With a few changes these make the cutest little Christmas cookies and I have used them for years for holiday baking. First use only 1 c. of cashews for a softer cookie. Make them a level teaspoon so their size is a little smaller. Immediately upon taking them out of the oven use your thumb to make a nice deep indentation right in the center of the cookie. Make sure it is well formed so it will nicely hold the frosting. I add green or red food coloring or divide the frosting into two bowls and use both and put a dollop in each center once the cookie has cooled a little. Then I quickly add a little silver candy ball decoration to the middle of each before the frosting hardens. They are so cute and festive and of course delicious too and make a great addition to a cookie plate. Always the first to go!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jammin judy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3949135/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-23T18:03:52.977Z",
                "reviewBody": "Great cookies. Unique. Won't find like them anywhere else. 30 minutes after baking is not the right time to taste them. The frosting and the cookie combine for great flavor the next morning or later. Delicious delicious frosting. I did a double batch of the cookies and frosting. Batch 1: As the recipe said. Seemed too cakeish right away but turned out wonderfully in the morning. Very good combined with frosting. Batch 2: I folded in some chunky Peanut butter (all natural no extra sugar about 1/3 cup) and some JIF (1/3 cup some extra sugar). These are more crumbly than the first but still delicious. GENERAL: Use double vanilla. Much better. Half sugar on the frosting. Let cool till next morning. Then try for best effect. If you want perfection that evening try another recipe; these are best if they sit for a while. Very addictive once complete. FROSTING: Browning the butter on high is possible and faster. Just don't assume it's not browning cause you can't immediately see the color. The trick is let it boil but stir fast (2 minutes). Then let cool. I only used half the sugar. I can't imagine using more. It was plenty sweet and a perfect blend with the cookie. I am going to try the frosting with a bit of orange zest-I suspect this would be a good addition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VCRUISER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1441764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-06T06:02:27.873Z",
                "reviewBody": "This is a delicious recipe. The cookie is soft and moist and turns out almost like a mini cake. The cookie by itself is not-so-sweet but tastes excellent with the frosting. The slightly nutty flavor of the 'burned' butter was delicious. I brought them to work today and they were devoured.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BANSREEPARIKH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/400771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T15:08:43.177Z",
                "reviewBody": "Excellent cookie! I think the term \"burned butter\" kind of scares people off though. From the way the butter frosting turns out I think it should be referred to as \"carmel butter\". Very NUMMY!!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sweetiepeaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/80424/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-06T06:02:31.09Z",
                "reviewBody": "Burned butter frosting on these cookies is DELICIOUS! Cookies are great too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SANDYSLOOP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/439998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-08T17:56:31.497Z",
                "reviewBody": "I am a novice baker and have always relied on the recipes that have hundreds of reviews...and am consistently disappointed. They are always too blah for my liking. I thought I'd take a risk and try a recipe that had only 24 reviews because it sounded SO yummy and there aren't very many cashew cookie recipes out there. Cashews are my favorite favorite favorite so I bit the bullet and made these tonight. Originally I was going to take them to work but they are too good to leave this house. My boyfriend and I will make it a priority to eat all of these ourselves and give away a few to some VERY lucky friends. Because there isn't a ton of sugar in the cookie it's not extremely sweet and the rich sweet icing is the perfect companion to the cookie. I was a little worried about \"browning butter\" because there is a fine line between browning and burning but it was super easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "eerriiccaa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3914199/"
                }
            }
        ]
    }
]