[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17513/no-commercial-yeast-starter/",
        "name": "No Commercial Yeast Starter",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4469947.jpg",
            "width": 3072,
            "height": 4096
        },
        "datePublished": "2000-03-27T01:52:52.000Z",
        "description": "It may take a little time, but making a good starter is easy! It is best to use organically grown flour and non-chlorinated water because they contain no chemicals which might kill the wild yeast.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P2DT23H10M",
        "recipeYield": "4 cups starter",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "2 cups bottled (non-chlorinated) water"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine flour and spring water in a medium bowl; stir well. Cover loosely with a cloth and let sit on a kitchen counter for 2 to 3 days, or until bubbly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To use and feed your starter; take out the amount needed for your recipe and then replace that amount with equal parts flour and spring water. If you keep your starter at room temperature it should be fed every other day, and if refrigerated, fed weekly. If you accumulate more starter than you need, simply pour a few cups down the drain before feeding it.\n"
            }
        ],
        "recipeCategory": [
            "Bread"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUZQ"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.15625,
            "ratingCount": 32,
            "itemReviewed": "No Commercial Yeast Starter",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "227.5 calories",
            "carbohydrateContent": "47.7 g",
            "cholesterolContent": null,
            "fatContent": "0.6 g",
            "fiberContent": "1.7 g",
            "proteinContent": "6.5 g",
            "saturatedFatContent": "0.1 g",
            "servingSize": null,
            "sodiumContent": "2.4 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-28T15:01:08.73Z",
                "reviewBody": "Actually the directions given are in this recipe are complete. I have a wild starter that I started this exact way (filtered water instead of bottled) over thirty years ago. I use it to make bread in a bread machine and to make sourdough waffles. I've almost lost it a couple of times, but after adding a little more unbleached flour and filtered water it bounces right back. Again, I've kept this strain going for over thirty years.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pathfinder Joe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1500826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-05T00:03:27.15Z",
                "reviewBody": "I have this exact starter. I love it. I gave you 3 stars due to you saying throw a cup or two down the drain. #1 throwing it down the drain will eventualy clog your drain. #2 instead of throwing it away make a banana bread of Pancakes waffels or english muffins with it.  TIP. Instead of using 2 cups of water and 2 cups of water to start your starter. Use 1/4 cup of water and 1/4 cuo of flour. I keep approximately 1 cup of starter in the fridge at all times and when I feed I take out 1/2 cup and save it till I have enough to use or I will use it as a sponge starter for a recepie. I do not throw it away. If you must throw it away put it in a paper towel and place it in your compost pile.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ScottyJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3895505/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-27T18:05:08.647Z",
                "reviewBody": "I'm two weeks into starting and I've yielded 2 loves of wonderful tangy bread using the \"Sourdough Bread III\" recipe from this site. I will admit, I wondered how this was all going after week 1. There didn't seem to be much activity, but after doing a search online, I found a sourdough forum. I was comforted knowing I wasn't the only clueless newbie to sourdough bread. The fact that my second loaf turned out well was also confirmation that things are okay. Make sure to use bottled or filtered water. Chlorine from tap water could stop the chemistry. I started with 1/2 cup each flour and water. 2 cups seemed too much when I would only have time to make bread on the weekend. Now I keep in the fridge and 'feed' once a week. Approximately 12 hours before making bread, I take it out of the fridge, feed, and allow it to reach room temp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BROZZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/764454/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-26T01:40:47.043Z",
                "reviewBody": "Perfect directions for capturing/cultivating wild yeast. The person who said the directions were not complete needs to just do a little research. It is really this simple. If your pot bubbles, you have wild yeast colonizing your pot. Thats it. From there you just need to feed it once in awhile and find a few good recipes. To the person who said it separated. It is supposed to do that. If it separated that quickly it means you probably missed the bubbling process because you have extremely active yeast. That's a good thing. LOL The liquid on top is the stuff that ferments to make sourdough sour. Stir it together when you are ready to use it.  One more thing.... I too am sad to think of pouring it down the drain. Just make something with it. Sourdough french bread only takes flour, water, sugar, and salt. Easy peasy. Though I have never heard of sourdough starter clogging your drain. As long as you wash it through with water, you shouldn't have a problem.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5369208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-01T23:59:09.923Z",
                "reviewBody": "This is my first time trying to start a starter, and it was frothing and bubbling after only 24 hours. I'm very pleased. I'll update when I bake with it after it ages a little. Update: smelled atrocious and I had to throw it out after only 1 feeding. The smell was driving us out of the kitchen. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyousfreee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2714803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-23T02:41:56.64Z",
                "reviewBody": "There are thousands of strains of wild yeast floating around in the air. There are some starters that date back hundreds of years! There are sourdough starter clubs that can be found on the internet where they will send you a bit of their starter so that you can have your own supply. This recipe does not explain in detail how to start your starter (so only 3 stars) but flour and water is really all it takes. I had some starter started but my husband thought it was something I accidentally left out and he threw it away. GRR! I'll be trying again real soon though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Miztiki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/396681/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T00:04:35.993Z",
                "reviewBody": "My husband has went into a craze of eating sourdough and this recipe seemed so easy. I used both bread flour and all purpose flour to feed my starter and filtered water. It was growing nicely and made some great pancakes so I made some biscuits and then some loaf bread. it is still doing great. Perhaps those who failed used tap water with chlorine?  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "gummibear112",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3553634/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-21T20:29:51.307Z",
                "reviewBody": "Love your ideas!!! just starting on my sourdough conquest but makes me sad to read \"pour some of the starter down the drain\" upon feeding this hard to master artform...why not try sharing with neighbors, family, friends first before pouring down the drain literally. Thank you for your tips...can't wait to try.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3699453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-31T18:17:55.56Z",
                "reviewBody": "It was hard for me to wait 2 days to use this starter. It did start bubbleing right away. It started to smell sour after about 2 days. After following the sourdough bread lll recipe on this site I put it on the rise. I could see it rise before my eyes! I am dead serious. I was so excited. I decided to feed my starter and put it in the refrigerator. I showed it to my husband so he would not throw it out. I can't wait until tomorrow to see how much more this dough has risen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katydid68",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/katherine1/"
                }
            }
        ]
    }
]