[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21530/mini-cheesecakes-iii/",
        "name": "Mini Cheesecakes III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1277450.jpg",
            "width": 2045,
            "height": 2045
        },
        "datePublished": "2000-04-01T00:33:10.000Z",
        "description": "This is a delicious recipe that is perfect for an on-the-go snack. Plus it is a great treat for kids.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "6 mini cheesecakes",
        "recipeIngredient": [
            "⅓ cup graham cracker crumbs",
            "1 tablespoon white sugar",
            "1 tablespoon margarine, melted",
            "1 (8 ounce) package cream cheese, softened",
            "¼ cup white sugar",
            "1 ½ teaspoons lemon juice",
            "½ teaspoon grated lemon zest",
            "¼ teaspoon vanilla extract",
            "1 egg"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease a 6-cup muffin pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together the graham cracker crumbs, sugar, and margarine with a fork until combined.  Measure a rounded tablespoon of the mixture into the bottom of each muffin cup, pressing firmly. Bake in the pre-heated oven for 5 minutes, then remove to cool. Keep the oven on.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat together the cream cheese, sugar, lemon juice, lemon zest and vanilla until fluffy. Mix in the egg.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the cream cheese mixture into the muffin cups, filling each until 3/4 full.  Bake at 325 degrees F (165 degrees C) for 25 minutes. Cool completely in pan before removing. Refrigerate until ready to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "BRAT87"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.661367249602543,
            "ratingCount": 629,
            "itemReviewed": "Mini Cheesecakes III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "219 calories",
            "carbohydrateContent": "15.2 g",
            "cholesterolContent": "72.1 mg",
            "fatContent": "16.1 g",
            "fiberContent": "0.2 g",
            "proteinContent": "4.2 g",
            "saturatedFatContent": "8.8 g",
            "servingSize": null,
            "sodiumContent": "171.1 mg",
            "sugarContent": "12.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-05-30T06:58:57.403Z",
                "reviewBody": "I made a single batch of these to test the recipe, before making 2 dozen to take to an event.  The first ones came out perfectly - at 25 minutes I wasn't sure they were done, but took them out anyway, figuring if they didn't set up I could bake the next ones longer.  They tasted great after cooling and chilling, so I made the bigger batch the next day exactly the same - only difference was I used foil cupcake liners instead of paper - and they were full of cracks after 25 min!  The next pan I checked at 15 min, and some of them were already starting to crack so I took them out.  So beware, if you try the foil liners, they cook MUCH faster - but they do look a little nicer (the ones that didn't crack!) since the liner doesn't get all soggy looking.  Oh, and I left out the lemon zest because I didn't have fresh lemons on hand, and didn't want too strong a lemon flavor.  Yummy, thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JEN4EVANS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1385862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T18:05:40.833Z",
                "reviewBody": "All I can say is WOW this was good! I wanted to make my husband a cheesecake for Father's Day but I didnt want to make a whole one. We are on a diet and we would eat a whole cheesecake if I made one. lol This was definitely the right recipie though! I tried this one because it has a graham cracker crust instead of the vanila wafer crust used in other similar recipies. They tasted just wonderful. It was easy to control portion size so we didnt go too crazy on the calories but we still got to eat some very tasty cheesecake. It was a very elegant presentation too. After they were cooled in the pan, I ran a thin knife around the edge and they came out easy. I served them graham cracker crust side up and drizzled on some sugar free strawberry glaze. My husband got his favorite desert to make him happy and we didnt have to completely wreck our diet to do it. I cant recomend this recipie enough if you want a delicious and  authentic cheesecake taste in managable portion size.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHIEWALKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-29T23:53:42.457Z",
                "reviewBody": "AWESOME!!  I doubled the recipe to get 12 jumbo sized cheesecakes.   I did up the graham cracker bottoms for a thicker crust.  I used some gold foil lined cup cake holders and some in paper liners.  The foil lined was easier to peel away from the cheesecakes.  Several of mine cracked on the top but covered with the delicious Strawberry Supreme Topping and crushed graham crackers.  Will definitely put this in my dessert rotation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GodivaGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2567051/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-27T14:02:00.88Z",
                "reviewBody": "Really good! Made these for our baby's first birthday. He loved smooshing up his cake and we enjoyed our individual portions. I made a sour cream topping for these - Mixed 4 ounces sour cream with 3T sugar and 1 t vanilla extract. Once the cakes were baked through, I spread this topping over the cakes and returned them to the oven for an additional 10 minutes. This adds a creamy layer on top that puts this cheesecake into the DIVINE category.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kat G",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1821605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-24T22:29:20.05Z",
                "reviewBody": "These did not taste like cheesecake at all! More like a lemon bar! I realized my mistake as soon as I put the zest in! Why would cheesecake have lemon zest in it? I should have picked the zest out - that would have saved these. Had I wanted a lemon dessert I would have made one. If you do not want a STRONG lemon flavor I recommend you stop right here and find another recipe. I will not make again as written. UPDATE: I had to try these again without the lemon. I eliminated the lemon juice and the zest and increased the vanilla extract to 1/2tsp and these were wonderful! With these adjustments they were actually 'mini cheesecakes'!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "RebeccaD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3848034/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-12T20:15:21.08Z",
                "reviewBody": "Definitely a 5 star recipe for taste and simplicity! SO much easier and faster then making an entire cheesecake!! I don't like using Nilla Wafers as a crust since they get soggy so this is so much better. Watch them as they cook as every oven is different. They will be puffy and slightly jiggly when ready. As they cool they sink down in the middle and allow for toppings! A wonderful base for a million creative options. some i've tried... 1) mix in a cup of mini chocolate chips into batter. when cooled drizzle chocolate or caramel on top. 2) after cooled microwave 1/2 C of seedless raspberry jam for 25 seconds stir and top. melt white chocolate and drizzle on top of that. 3) use canned cherry OR blueberry pie filling. 4) use Oreo crumbs instead of graham. The ideas are endless!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KC192",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1442579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-18T18:59:26.517Z",
                "reviewBody": "I made this being skeptical because I have another recipe for a large cheesecake that I love. However these turned out great. I read a few reviews before hand but I didn't change anything on the recipe besides I didn't put the lemon zest in. I didn't read all the reviews so someone may have already mentioned this but when I cook a cheesecake I put a pan of water on the bottom rack. I did that with these. I also learned that you NEVER want to open the oven door because for whatever reason that is what causes the cracks. So I used the pan of water on the bottom and didn't open the door for 25 minutes and they turned out gorgeous. No cracks and beautiful appearance. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bonnie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1620532/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-18T02:58:15.153Z",
                "reviewBody": "This recipes was delicious and super easy to make. I bought the mini graham cracker tart shells and this recipes makes exactly 6 mini cheesecakes. I used bottled RealLemon lemon juice and didn't use any zest and the cheesecakes were fabulous. Make extra cheesecakes because they will go very fast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dannie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1142458/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-20T02:52:17.467Z",
                "reviewBody": "This recipe has been around for a looong time -nearly as long as I have!  The reason?  They're easy, they're simple, they're reliable and they're \"D\" good. I used foil cupcake liners to eliminate the sticking problem. The lemon zest and juice amounts are right on perfect.  I made a raspberry coulis of fresh raspberries and Splenda, and accented with a few extra fresh berries and mint. Impressive and elegant  if I must say so myself, especially for something so doggone simple.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Mini Cheesecakes III ",
            "description": "Tasty, personal cheesecakes that are a breeze to whip up.",
            "uploadDate": "2015-10-29T19:35:42.434Z",
            "duration": "PT1M15.775S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=http%3A%2F%2Fbrightcove.vo.llnwd.net%2Fv1%2Funsecured%2Fmedia%2F1033249144001%2F201510%2F178%2F1033249144001_4586282511001_th-4486613658001.jpg%3FpubId%3D1033249144001%26videoId%3D4486613658001",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4486613658001"
        }
    }
]