[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/222/side-dish/casseroles/",
                    "name": "Casseroles",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14355/side-dish/casseroles/broccoli-casserole/",
                    "name": "Broccoli Casserole Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18220/awesome-broccoli-casserole/",
        "name": "Awesome Broccoli Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F968381.jpg",
            "width": 2013,
            "height": 2016
        },
        "datePublished": "2000-04-07T01:57:47.000Z",
        "description": "This is a recipe that my grandmother gave me and I improved it (no offense, Grandma).",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "10 to 12 servings",
        "recipeIngredient": [
            "2 (10 ounce) packages chopped frozen broccoli, thawed",
            "1 (15.25 ounce) can whole kernel corn, drained",
            "1 large onion, diced",
            "1 (16 ounce) container sour cream",
            "1 (10.75 ounce) can  condensed cream of broccoli soup",
            "2 cups shredded Cheddar cheese, divided",
            "1 (6 ounce) package herb-seasoned dry bread stuffing mix",
            "¼ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together broccoli, corn, and onions. Stir in sour cream, soup, and 1/4 cup shredded cheese. In a separate bowl, toss together stuffing mix and melted butter. Spread broccoli mixture into a 2 quart casserole dish and cover with stuffing mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 minutes, or until heated through and browned on top. Sprinkle remaining 1 3/4 cups cheese on top and bake an additional 5 minutes, until cheese is melted and bubbly.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Casseroles",
            "Broccoli Casserole Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "COBRA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.1752136752136755,
            "ratingCount": 234,
            "itemReviewed": "Awesome Broccoli Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "371.7 calories",
            "carbohydrateContent": "30.1 g",
            "cholesterolContent": "57.3 mg",
            "fatContent": "23.6 g",
            "fiberContent": "3.6 g",
            "proteinContent": "12.4 g",
            "saturatedFatContent": "14.1 g",
            "servingSize": null,
            "sodiumContent": "790.9 mg",
            "sugarContent": "5.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-09T15:54:45.123Z",
                "reviewBody": "Awesome Broccoli Casserole was totally awesome.  I only wished I had read some of the previous comments prior to cooking this dish because then it would have been even better.  I agree with others: the broccoli needs to be precooked first, cut down on the amount of onion (I say this even though I'm an onion lover), and put more of the cheese in the casserole instead of on top.  I also agree that this dish needs to be cooked a little longer - about 10 more minutes. Even though there was a little room for improvement, this dish was AWESOME!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GAIL JOHNSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/659322/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-21T16:32:56.56Z",
                "reviewBody": "This is a very good casserole although I made several changes that improved the flavor. I added lots more cheese. I got a pound of American cheese and shredded it adding it into the broccoli mixture rather than putting it on top. I also used 1/2 cup of Italian breadcrumbs and 1/2 cup of crushed Ritz crackers mixed with 6 tbls of melted butter for a yummy topping. Rather than 16 ounces of sour cream I used 8 ounces to cut back on the fat a little. Lastly I added extra broccoli which I cooked a bit before putting the mixture together. It is DEFINITELY a keeper of a recipe! I can't believe there are reviewers who do not like this recipe! It's one of the best Broccoli casseroles I've ever had!!:-) Thanks Cobra!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T15:53:29.17Z",
                "reviewBody": "Thank you Cobra! I made this for guests tonight, one of whom doesn't have \"broccoli\" in his vocabulary and I was shocked to see him take seconds and say \"this stuff is awesome\" (why...that's part of its name!).  I didn't cook the broccoli as others have stated...the recipe states to drain and thaw the broccoli, which did the trick for me.  I also reduced the onion (alot) and added extra cheese...none on top.  I also cooked covered and then the last 10 minutes cooked uncovered, which prevented any burning! Great sidesish and would definately make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T21:46:52.403Z",
                "reviewBody": "Ok, this was one of the MOST delicious things I have ever made! I made a few alterations, after reading some of the other posts and it came out awesome! Do not use all of the 16oz container of sour cream. I used 2/3 of the container and it was just perfect. Also, I did not use the whole large white onioin, I used about 3/4 of a large white oninon. I used Pepperidge Farm herb stuffing mix that comes in an 8oz bag (not box) but only used 6 oz. It was the crumbliest brand I could find and worked really well. I was in a hurry so I baked it at 400 for about 25 mins covered, so as not to burn the bread crumbs. Then uncovered it, I added the cheese on top and turned down the heat, baking for another 10 minutes. This was totally delicious, I brought it for a work Thanksgiving luncheon, and everyone loved it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STARFISH111",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/469087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-29T14:04:21.183Z",
                "reviewBody": "This casserole is AWESOME! I made it for a potluck with a few changes. I used 2 16 oz bags of broccoli, 16 oz. low fat sour cream, 1/4 cup regular sour cream, 3 cups of cheese(I used a 4 cheese mexican blend because thats what I had on hand)The majority of this was mixed in with a small amount sprinkled on top. I had a large bag of Pepperidge farm stuffing that I used 8-9 oz of and threw in a little extra butter.I am not a huge fan of onion so I followed other reviewers advice and only used 1/2 an onion and chopped it real fine with my electrical chopper and it was the perfect amount. I also cooked the onion, corn and broccoli for 5 min.in the microwave before combining. I put it in a 9x13 pan, covered with aluminum foil and baked for 30 min. I then took off the foil and baked an additional 10-15 min. to make the top crispy. I bet this would be good as a meal with some chopped chicken or turkey mixed in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rosalinde Nargi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/584590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T18:11:32.873Z",
                "reviewBody": "I've made this dish six times now. Why so many? My sorority sisters now believe I know how to cook, and ask for it at every dinner party. ;-) Thank-you, Cobra!\r\n\r\nSome advice:\r\n\r\nI use about half the sour cream and less onion (diced very small). The last four times I made this, I precooked the veggies and had much better results. Definitely add more cheese to the mix if you're a cheese lover like me! I put very little cheese on top, as it tends to burn, and skimp on the stuffing topping as well. Also, consider cooking the dish 10-15 minutes more than listed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MELLILAH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/895406/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-10T01:21:28.53Z",
                "reviewBody": "This is a great recipe if you follow the other reviewer's advice: halve the onion and sour cream put all the cheese into the broccoli mixture make sure the broccoli is fully defrosted and bake covered for at least one hour until the whole casserole is bubbly removing cover for last ten minutes. Depending on what I have in my pantry I improvise the topping. I like half Ritz crackers and half bread crumbs. I also agree with other reviewer's recommendation to bake this a day ahead. I give it four stars because of the tweaking required.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BATTLINGENTROPY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1358553/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-09T15:54:14.997Z",
                "reviewBody": "I think this could be a good recipe but needs a lot of \"tweaking\". The onions definitely need to be sauteed before adding to this dish - they overpowered it. Also for a recipe like this I would like optional instructions for fresh broccoli instead of frozen. And I also felt that the dressing/stuffing would've been better had it been mixed in the casserole instead of browned on top - it was dry. The recipe tells you to put cheese on top of the stuffing but so many reviews said not to - so I just did it on one side. That side was still dry with rubbery cheese on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZABETHJANE2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/681326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-24T17:03:32.717Z",
                "reviewBody": "I have made this recepie several times and have altered it a bit. Pre-cook the broccoli and add the cheese to the rest of the ingredients. Cover the casserole then remove it the last 5 minutes or so. This way it will not dry out on top. This is an excellent casserole!! This one is a keeper!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOLSONGO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/389947/"
                }
            }
        ]
    }
]