[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/847/desserts/cookies/fruit-cookies/",
                    "name": "Fruit Cookie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17523/desserts/cookies/fruit-cookies/raisin/",
                    "name": "Raisin",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10760/prune-and-raisin-filled-cookies/",
        "name": "Prune and Raisin Filled Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F12763.jpg",
            "width": 1148,
            "height": 861
        },
        "datePublished": "1998-04-05T23:41:44.000Z",
        "description": "This is a prune and raisin filled cookie with chopped walnuts added if desired.  The cookies are made into loaves approx. 3 1/2 to 4 inches wide and 8 to 10 inches long.  After baking the loaves are cut into slices crosswise approx. 1 inch wide.  Cookies are glazed on top and decorated with colored sprinkles.  Prepare the fruit filling the night before baking.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "2 ¼ cups pitted prunes",
            "3 cups raisins",
            "½ cup white sugar",
            "6 cups all-purpose flour",
            "3 teaspoons baking soda",
            "1 cup white sugar",
            "1 teaspoon salt",
            "1 tablespoon lemon zest",
            "3 eggs",
            "1 cup milk",
            "1 cup vegetable oil",
            "1 lemon",
            "⅓ cup confectioners' sugar for decoration"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To Make Filling:  Boil prunes until plump.  Put raisins in pan, cover with water and heat until water steams.  Strain and add 1/2 cup of sugar to raisins, mix well and heat again until almost dry. Remove from heat and set aside.  Pit the cooked prunes, if not already pitted, chop and add to raisins.  Add chopped nuts, if desired.  Set fruit mix aside overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "The next day make the dough.  In large bowl, mix together the flour, baking soda, sugar and salt.  Make a well in the center.  Add the eggs, milk, grated lemon rind and oil and mix to form dough.  Knead the dough to the consistency for rolling.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide the dough into 6 parts.  Roll each part into a rectangle of 1/8 inch thickness.  Put 1/6 of the fruit mix onto the dough rectangle and spread evenly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fold the dough lengthwise into the center.  Fold the other side in slightly past center, and press seam lightly.  Pinch ends to close.  Lift the loaf with a spatula and place on lightly greased cookie sheet with seam under.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in 400 degree F (205 degrees C) oven for 18 - 20 minutes (top should be lightly brown).  Allow to cool then cut crosswise slices about 1 inch thick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Glaze:  Use juice of 1 lemon and enough confectioners' sugar to obtain consistency for brushing top of cookie. Drop sprinkles onto glaze and allow glaze to set.   Enjoy!\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Fruit Cookie Recipes",
            "Raisin"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lucy Hurlbut"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.666666666666667,
            "ratingCount": 30,
            "itemReviewed": "Prune and Raisin Filled Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357 calories",
            "carbohydrateContent": "63.4 g",
            "cholesterolContent": "24.1 mg",
            "fatContent": "10.5 g",
            "fiberContent": "2.9 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "270.6 mg",
            "sugarContent": "32.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-12-12T15:27:38.7Z",
                "reviewBody": "I have been looking for a prune slice recipe for years, without any luck....I cannot believe how delicious these are, add chopped maraschino cherries, maybe 10-12 and definitely walnuts...I live in RI and Italian cookie trays always have these in them, but no one ever has the recipe....try them, they are soooo good, and they go in my Christmas trays every year now....thanks so sharing...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maria Microulis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/222876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-07T20:13:46.263Z",
                "reviewBody": "I made these cookies for our family gathering this weekend and everybody loved them so much that each individual family took some home for later! I only wish a quantity could have been suggested for the chopped walnuts; I used 1/2 cup and we all enjoyed them but more might have been nice too. Additionally the recipe could have mentioned whether the dough needed to rest in the fridge a while before rolling out and filling or whether you were supposed to proceed immediately to rolling out the cookies after initially mixing it; I decided to proceed immediately to kneading and rolling it out but maybe I'll try resting the dough after mixing next time to see if it could imrpove the recipe. The bottom line is that the cookies are not too sweet but perfect for enjoying with coffee either after dinner or first thing in the morning! =o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patrick Wright",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2524158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-28T03:29:31.873Z",
                "reviewBody": "Delicious! This is very similar to my grandmother's recipe. The only difference for my family is we add a shot of brandy and 10 oz. chopped marachino cherries to the prune mixture. This must be a strictly Rhode Island cookie. I wonder if our families are from the same town in Italy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Feeding Frenzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1427083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-19T23:26:46.287Z",
                "reviewBody": "Unlike the other reviewers I had never heard of these cookies before and did not have a sentimental/nostalgic reason for making them so I was approaching these without any expectations. However after having made these cookies I fell absolutely in love with them! The recipe is perfect (the dough is absolutely beautiful and is easy to work with) the crust is flavorful crumbly but soft the filling is just sweet enough and the nuts add another texture dimension. The recipe makes a bunch and after 5 days I only have a couple of cookies left (keep in mind this is just 4 people eating) they are that good! I would definitely recommend this recipe to everyone even those who have never heard of these before. They are absolutely amazing with milk! These keep better out in the air instead of in an airtight container since in a container they get a little soggy because of the filling.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jezebelina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2842549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T19:14:50.623Z",
                "reviewBody": "Here's a good way roll out the dough and form the logs: Wet your counter top then put down a large piece of saran wrap. Flour the wrap and roll out the dough. After you have spread the filling on the dough use the saran wrap to fold the dough over. Just lift by two corners fold and then peel off the wrap. Do the same for the second fold. To get the log on the cookie sheet put the cookie sheet on the counter next to the log bunch the saran wrap under the log on the side next to the cookie sheet ease the saran wrap and the log over onto the cookie sheet and roll it off the saran wrap. This works beautifully. I got a decent-tasting cookie but I had never had these before and didn't know what to expect. The directions bewildered me in a few places. I may try these again now that I have done a trial run.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ma's Diner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5165691/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-11T20:15:19.17Z",
                "reviewBody": "I just made thhis recipe. Been looking for one for a long time. My husband is from RI and his mother used to make them. They called them Prune Biscuits. I made these changes based his input. 2 Tblsp Orange Zest added to prunes none in dough. Used all prunes and no raisens. My husband said they are as good as his mother's. Found them pretty easy to make. Just do the prunes the day before and used a mixer for the dough then hand knead.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4431888/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T20:57:58.763Z",
                "reviewBody": "Thanks you so much!!! I've been trying to find this recipe that an elderly Italian friend of mine had...it is not in any cookbooks. Thank you. Similar to the other reviewer I am from Rhode Island.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRISTA1220",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/968828/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-25T15:33:29.423Z",
                "reviewBody": "I was also looking for a recipe like this for years. My Italian grandmother made them at Easter. After tasting them I think she must have used all prunes but I used a mixture of prunes raisins and dried cherries. I did a white icing and then drizzled Easter pastels and then cut them. This is a good recipe to start with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jannydio",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4720298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-16T17:51:05.48Z",
                "reviewBody": "I made these cookies today and they came out great! My mother had requested this recipe but wasn't quite sure how they would come out because the cookie she typically had was filled with prunes and cherries. She actually likes these cookies better because they are not as sweet! We are from Rhode Island also so maybe that is why my mother requested the recipe! (We now live in FL) Came out great and will definitely be on my cookie trays this holiday! One thing I would like to add the dough tends to be very sticky! It was a lot easier once I dusted my hands with flour! I was a bit unsure of how it would come out at first but very pleased!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "robynna.z",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4084093/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-06T23:00:35.19Z",
                "reviewBody": "It was just okay. Not that I didn't like it but nothing too spectacular. But maybe that's because I put less sugar. I made orange glaze instead of regular icing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kns215",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8870610/"
                }
            }
        ]
    }
]