[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18854/bubble-n-squeak/",
        "name": "Bubble 'n' Squeak",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F688333.jpg",
            "width": 1500,
            "height": 1125
        },
        "datePublished": "2000-04-11T15:58:19.000Z",
        "description": "Cabbage, bacon, ham, onion and leftover potatoes make up this tasty, easy dish. This is a great way to get the kids to eat cabbage. Using leftovers makes this main dish especially quick to make. I recommend using a good nonstick pan. Serve with ketchup, if desired.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "½ medium head cabbage, sliced",
            "3 slices bacon, diced",
            "1 onion, thinly sliced",
            "1 cup cubed cooked ham",
            "1 tablespoon butter",
            "3 cups potatoes - baked, cooled and thinly sliced",
            "½ teaspoon paprika",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan, cook cabbage in a small amount of water for about 5 minutes, or until tender. Drain, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a well-seasoned cast iron skillet, cook bacon and onion until onion is soft and bacon is cooked. Add ham, and cook until heated through. Add butter, then mix in the cooked cabbage and potatoes. Season with paprika, salt, and pepper. Cook until browned on bottom, turn, and brown again.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "DOREENF"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.450236966824645,
            "ratingCount": 211,
            "itemReviewed": "Bubble 'n' Squeak",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "158.5 calories",
            "carbohydrateContent": "19.5 g",
            "cholesterolContent": "23 mg",
            "fatContent": "5.9 g",
            "fiberContent": "2.9 g",
            "proteinContent": "7.8 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "422.9 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-02-12T04:43:50.423Z",
                "reviewBody": "Bubble and Squeak is a traditional English dish that is usually served on Boxing Day (December 26). Obviously, you can have it any time of the year, but the idea is that you smoosh up and skillet-fry together the veggies left over from the Christmas Day main meal, ie. peas, roast potatoes, carrots, cabbage and brussel sprouts. I know this because I have eaten it every December 26 for the last 30 years! It takes its name from the noise it makes while cooking. It doesn't smell especially wonderful while cooking, but the end result is absolutely delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827351/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T21:11:17.497Z",
                "reviewBody": "We loved it! However, as someone who has recently been diagnosed with high cholesteral, I knew I had to figure out a way to cut the fat considerably. This is what I did. I used pre-packaged cabbage w/carrot shreds(wish I would have used the whole bag)and followed the directions of the recipe. I then used olive oil to saute the onion with a clove of garlic. After the onion was soft I added about 3/4 c. of diced boiled ham pieces and then I added about 2 TBLS of REAL Bacon bits.(I just could not used bacon drippings...even though I really wanted to!) I sauted a bit longer for the flavors to blend well and then proceeeded to finish the recipe as directed. I used margarine instead of butter. I added a dash of red pepper for zing. This truely is \"comfort food\" at it's finest. I feel like we kept the essence of the dish and got rid of a whole bunch of fat. Thank you for sharing your recipe Doreen!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnandRoyce Gore",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/106037/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-08T18:28:01.56Z",
                "reviewBody": "We loved this recipe! I used a little more cabbage (1 bag of pre-shredded coleslaw cabbage) and a little more potatoes (cubed and cooked in the microwave).  After cooking the bacon, I removed them from the pan and added the onions, potatoes, and ham to the bacon grease and fried them until the potatoes were lightly browned and the ham was cooked through. Meanwhile, I used 1/2c chicken broth to saute the cabbage. When the potatoes were done, I added the remaining ingrediants (including the bacon - and more of it) and mixed until heated through. Very tasty and my family wished I had made more. Very pleased with the result of this easy recipe and would make again. Thanks Doreen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-26T22:05:25.797Z",
                "reviewBody": "I enjoyed reading all the reviews.  In my experience, Bubble and Squeak is a tried and true British recipe that utilizes any elements of a leftover roast dinner - what my English granny called  'fry up'.  A fry up consisted of leftover meat from the Sunday roast, combined with leftover mashed potatoes or sliced boiled ones and any leftover veg.  A generous pat of butter was melted in a black cast iron frying pan and all was heated through.  Bubble and Squeak always has potatoes and cabbage added to the remnants of Sunday's roast.  Lashings of Worcestershire sauce were added for flavour along with salt and pepper.  Some fry ups were successful depending on the combination of ingredients available but, for me,  Bubble and Squeak always seemed tasty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LESLEYPRINCE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1119673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-10T12:43:26.95Z",
                "reviewBody": "A good old-fashioned \"comfort food\".  I cooked the cabbage longer than stated.  What makes the dish taste so good (and seasons the cabbage and potatoes) is the bacon grease, but while it adds a nice flavor, it doesn't make this the healthiest of recipes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-25T01:05:50.827Z",
                "reviewBody": "Excellent! This is the only way I could trick my hubby into eating cabbage (a favorite of mine). My only suggestions would be - 1.) Cook the bacon a few minutes BEFORE adding the onions (not together as the recipe states). Otherwise the onions get soft much too quickly and will either be too browned or too mushy! and 2.) Don't \"bake\" your potatoes too thoroughly. Not as if you were going to eat it then. Leave it a little crisp so that additional cooking in the skillet doesn't cause them to get too mushy. Also - I hate cutting cabbage so I used a bag of slaw mix that worked wonderfully! (I use that for all my cabbage recipes!) YUMMY!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JenM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/984109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-06T18:15:30.99Z",
                "reviewBody": "A GREAT COMBINATION OF SIMPLE, COMMON AND ECONOMICAL INGREDIENTS WHOSE RESULTING FLAVOR IS COMPLEX AND DYNAMIC. A SKILLET MEAL THAT CAN BE DESIGNED TO FEED ONE TO SEVERAL.  ACCENT WITH MUSTARD, HORSERADISH, OR BUTTER.  AJUSTABLE PROPORTIONS THAT WILL ACCOMODATE ANY FAMILY.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GAYE LYNN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/587188/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-09T03:13:52.373Z",
                "reviewBody": "This was excellent. I microwaved the potatoes to save time. Also I waited until the bacon was almost fully cooked before adding the onion. I recommend this or your onions will be burnt. I did use a half head of cabbage but I think next time i will take others advice and use a bag of preshredded cabbage. All in all a fast super tasty dinner. Thanks for the recipe Doreen.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VALERIE7430",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1439657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-17T15:30:06.937Z",
                "reviewBody": "I love cabbage and bacon and potatoes and even ham!  This dish just couldn't get any better for me.  There is alot of chopping involved so to cut time, I bought the bag of shredded cabbage and a package of cubed ham.  Please don't do what I did and think 'more has got to be better'.  Just use 3 slices of bacon for 6 servings.  As good as it is, more can simply overpower the dish.  I did what some of the other reviewers did and served this with fried eggs.  This really is comfort food at its best...especially on a cold, cold day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal Akins Krumnaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/815549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:45:42.513Z",
                "reviewBody": "Well it looks like I'm going to be the black sheep here. My hubby thought it was pretty good but also didn't ask for a repeat performance. The kids and I didn't really care for it. Maybe just too bland for our tastes. Sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            }
        ]
    }
]