[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17681/belgian-waffles/",
        "name": "Belgian Waffles",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2777.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2000-04-15T16:39:53.000Z",
        "description": "Belgian waffles are tender and flavorful waffles made with yeast. They're great topped with butter, whipped cream and fresh fruit.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "8 waffles",
        "recipeIngredient": [
            "1 (.25 ounce) package active dry yeast",
            "¼ cup warm milk (110 degrees F/45 degrees C)",
            "3 egg yolks",
            "2 ¾ cups warm milk  (110 degrees F/45 degrees C)",
            "¾ cup butter, melted and cooled to lukewarm",
            "½ cup white sugar",
            "1 ½ teaspoons salt",
            "2 teaspoons vanilla extract",
            "4 cups all-purpose flour",
            "3 egg whites"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve yeast in 1/4 cup warm milk. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whisk together the egg yolks, 1/4 cup of the warm  milk and the melted butter. Stir in the yeast mixture, sugar, salt and vanilla. Stir in the remaining 2 1/2 cups milk alternately with the flour, ending with the flour. Beat the egg whites until they form soft peaks; fold into the batter. Cover the bowl tightly with plastic wrap.  Let rise in a warm place until doubled in volume, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the waffle iron.  Brush with oil and spoon about 1/2 cup (or as recommended by manufacturer) onto center of iron.  Close the lid and bake until it stops steaming and the waffle is golden brown. Serve immediately or keep warm in 200 degree oven.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Bobbi Jo"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.535593220338983,
            "ratingCount": 590,
            "itemReviewed": "Belgian Waffles",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "505.7 calories",
            "carbohydrateContent": "65.3 g",
            "cholesterolContent": "129.9 mg",
            "fatContent": "21.4 g",
            "fiberContent": "1.9 g",
            "proteinContent": "12.3 g",
            "saturatedFatContent": "12.8 g",
            "servingSize": null,
            "sodiumContent": "621.7 mg",
            "sugarContent": "17.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-24T00:56:51.53Z",
                "reviewBody": "I loved this recipe!  True belgian waffles are a yeast batter, and this one is very genuine.  My only gripe is that it makes a lot of dishes (yeast, butter, milk, mixing bowl, egg whites).  I subbed one cup of whole wheat flour with no noticeable effect on texture; next time I'll do two cups each whole wheat and white.  I'm not sure why the egg whites are whipped and folded in separately.  The loft comes from yeast, and by the time the dough is risen surely the egg whites will have deflated.  I did it anyway.  This batter does not actually double in volume as the recipe states; it's risen when it is bubbly and there is a yeast smell.  As an experiment, immediately when I finished the batter I put one waffle's worth in the fridge, to see if I could do a slow cold rise that would allow the batter to be made ahead.  I made the waffle the next day, almost 24 hours later, and it was sensational.  I think it was even better than the waffles made the first day, yeastier and more complex in flavor.  So I am happy to report the batter can be made ahead; no need to wait an hour in the morning to have your waffles.  To make an easy, delicious, and healthy fruit sauce, dump a bag of frozen berries into a saucepan and keep over medium heat while you cook the waffles.  Let boil until they \"dissolve\" into sauce.  Adjust taste with sugar (usu only a tbsp is needed for 1 lb berries) and lemon juice (usu 1.5 tsp).  The yield for my 7\" round belgian waffle maker was about 10 waffles.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NICEGIRL512",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/651907/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-01T22:18:34.093Z",
                "reviewBody": "FINALLY a recipe worthy of a five star rating!  I have made these waffles several times.  For time purposes, I prefer preparing the batter the night before versus the morning of.  However, I haven't noticed a distinct difference in the taste either way - the waffles are amazingly delicious!  I whip the egg whites first, since I use my KitchenAid stand mixer and don't have an extra mixing bowl; then set the egg whites aside.  Proofed the yeast in the mixing bowl (add a tsp of sugar with the yeast to proof it properly - the yeast mixture should be frothy after 10 minutes).  Then I add the egg yolks, etc.. directly to the yeast.  Be sure the milk and butter aren't too hot, otherwise it will kill the yeast - should be no more than 115°F.  The batter should relatively double in size.  I used a 7\" Belgian Waffle iron and ended up with 9 waffles (about 1 scant cup of batter per waffle).  A regular waffle iron will produce many more waffles due to difference of size/shape.  These  waffles are crispy outside and soft inside.  If you are accustomed to \"Belgian Waffle\" mix from a box, these will taste much different, because they are made from a yeast batter - but true Belgian Waffles are made with yeast.  We top ours with butter, maple syrup, strawberries and whipped cream, YUM!  The waffles freeze well - just be sure to reheat them in the oven for about 10 minutes at 350-375°F to keep the crispness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1196366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-25T13:27:17.867Z",
                "reviewBody": "Make the night before.....they turn out\nperfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula Kreft",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/774176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-24T16:47:28.077Z",
                "reviewBody": "THESE are Belgian waffles! Make these when what you want is BELGIAN WAFFLES!  You must have the ability to gently fold in the whites and the patience to let the yeast do its thing and the waffle iron to heat up between waffles. If you can follow this recipe to the letter, you WILL have the best Belgian waffles.  Regular waffles are great in a hurry and usually rely on baking powder, as does Bisquick which gets its distinctive flavor from lots of baking powder.  I much prefer the softer, old-fashioned flavor of yeast, which was most definitely NOT overpowering in this recipe.  The aroma wafting from the waffle iron about drove my husband, me, and our dog crazy!  These waffles are incredible and a treat I have personally only had in restaurants before now.  I make waffles all the time, but these Belgian waffles are so delicious, a perfect melding of crisp and soft and the flavor is out of this world. So special I think we've found our new Christmas brunch tradition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALIEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/151618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-20T15:58:57.947Z",
                "reviewBody": "So worth the extra effort!!! After months of trying to imitate the best waffle I ever had from a street vendor in Holland, I've settled on this recipe as my base. They freeze very well. Set them on a wire rack for a few minutes after cooking so they dry out a bit. Freeze them in zip lock bags, but remember to remove as much of the air from the bag as you can. For best results, defrost them in the microwave for a few seconds, then toast them to remove the moisture and crisp up the outside. Then sprinkle with a little powdered sugar. You'll never buy those pathetic little tasteless imitations from the grocery store again! UPDATE...I replaced about 1/2 cup of milk with buttermilk and that gives it a nice tang.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RussellC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/872623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T23:49:24.827Z",
                "reviewBody": "I was so looking forward to this being a great recipe.... it was very very disappointing... i had fresh yeast and all the exact ingredients...they were not crisp and light...maybe it was my waffle iron, as it is brand new... but... i won't waste all this ingredients and the time it took to prepare on this recipe again... sorry",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "PATTIMAC2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/619579/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-16T17:24:00.187Z",
                "reviewBody": "Great and tasty recipe. I loved that these stayed crispy even after sitting for a while since I'm usually the last person to eat! The prep wasn't as bad as others made it sound. I used three bowls total and two cups. I used a deep but regular waffle iron and this recipe made 22 waffles. I loaded them into the freezer but it might be worth noting that \"makes 8 waffles\" is a bit of an understatment. My family of 5 ate all they could eat and we still had 15 of them left.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sjbrc12",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1101585/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-28T01:18:46.297Z",
                "reviewBody": "These are best used with a medium to deep waffle iron.  If made properly, they will be light and fluffy inside and crisp on the outside.  The aroma, flavor and texture can't be matched by baking powder based recipes.  Be certain to prepare the yeast mixture properly.  use a thermometer if you are unsure of proper temperature for the milk.  Also, crefully fold the egg whites in, don't beat them.  After you have made this once or twice, try experimenting a bit.  I let the dough sit for about three hours and puch it down occasionally.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rollo the Cat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1746180/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T23:50:00.64Z",
                "reviewBody": "I had a hankering for fresh home made waffles so I tried this one out. Considering I have never made waffles or used a waffle iron this was super simple to make. They turned out very moist and delicious and the kids also enjoyed them. Can't wait to make them again and top them with fruit and whipped cream!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ETOEWS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153499/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Belgian Waffles",
            "description": "See how to make deep, fluffy yeast waffles.",
            "uploadDate": "2013-12-20T19:47:09.270Z",
            "duration": "PT3M33.463S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2470eb89-c10d-49c7-bb39-2f836079db90%2Fb51a82e8-ab4f-4be4-bc79-4fd08d49e950%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2955908995001"
        }
    }
]