[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16394/desserts/cookies/drop-cookies/",
                    "name": "Drop Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9900/polka-dots/",
        "name": "Polka Dots",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F88617.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1997-08-18T20:19:44.000Z",
        "description": "I also use cake mixes with chocolate chips or M and M's. My personal favorite is to use Spice Cake mix (sans chips), then sprinkle cinnamon-sugar on cookies prior to baking.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 (19.8 ounce) package brownie mix",
            "⅓ cup vegetable oil",
            "2 eggs",
            "1 cup white chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large bowl, combine brownie mix, oil and eggs.   By hand, stir until well-blended. Stir in chips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop dough by rounded teaspoonfuls about 2 inches apart on ungreased baking sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in heated oven for 8-12 minutes or until set. Cool 1 minute; remove from baking sheets.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Drop Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ShanaLee"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.444444444444445,
            "ratingCount": 45,
            "itemReviewed": "Polka Dots",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "234 calories",
            "carbohydrateContent": "29.3 g",
            "cholesterolContent": "22.8 mg",
            "fatContent": "12.7 g",
            "fiberContent": "1 g",
            "proteinContent": "2.6 g",
            "saturatedFatContent": "3.6 g",
            "servingSize": null,
            "sodiumContent": "111.7 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-01-07T16:36:41.617Z",
                "reviewBody": "I love to make these cookies. I have made them umpteen times. I make them with brownie mix and not cake mix. The ones with the cake mix are too well...cakey. These turn out yummy chewy and they are the easiest cookies in the world to make. I have found the trick to make them perfect non-spreading and non-sticking. Instead of adding the eggs and oil separately; beat the eggs and oil together in a small bowl first then add it to the mix and combine. Now you can do your additions. Butterscotch semi-sweet milk chocolate heath bits coconut nuts or whatever your fancy. I use a small cookie scoop and cooke for 12 minutes. Crunchy on the outside chewy on the inside. They turn out perfect",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DarlingDash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/701266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-31T16:44:48.293Z",
                "reviewBody": "This is the best quick dessert recipe I have found yet. I usually use a cake mx when I make this. I tried the spice cake mix idea and it was great. Plus these cookies have a great shape and thickness for ice cream sandwich cookies. Just soften some ice cream shovel some out with a spoon and place it on a cookie. put another cookie on top stick the whole thing in a zip-loc bag then immediately in the freezer. Take out and serve whenever you want. This is a great treat for a party (nothing fancy cuz it can be a bit messy while eating) or for any hot summer day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RACHAELG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/856139/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-13T18:07:06.03Z",
                "reviewBody": "I really wanted these to be amazing. I read all of the reviews and decided I was going to go with the exact recipe with one exception. I refrigerated the dough for about an hour. There is nothing wrong with the taste of these cookies but the are very difficult to work with. All the time you save with prep you waste after baking. You have to watch like a hawk in the oven because they go from under to over very quickly. You also have to time your removal from cookie sheet precisely...too short cookie literally falls apart in your hand making a yummy mess. Too long and you need a crow bar to get them off of tray again yummy mess. I ended up only getting about 10 servable cookies. the rest were a yummy crumble.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RaisinKane aka Patti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/842730/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-20T03:56:40.67Z",
                "reviewBody": "I followed the recipe exactly as written. I did not use a Cake Mix like alot of others did because it called for a Brownie Mix. Based on actual recipe posted these did not turn out well at all! I only baked them for 7 minutes second sheet 6 minutes. Looked fine when they came out but when I tried to remove them from the sheet they were stuck like glue! I ended up with a crumbled mess. Even had to break out a knife to scrape them off. Rated 2 stars ONLY because submitter did suggest a cake mix as well and everyone who did it that way had no problems. Otherwise it's a zero.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Dakotaz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2663057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-26T17:52:11.623Z",
                "reviewBody": "1st batch made as stated and the taste was fine but the cookies really spread out -way too much IMHO 2nd batch -substituted melted butter for oil and added 3/4 cup of quick oats. MUCH BETTER!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Rebecca Mielke",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1502059/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-16T22:58:09.5Z",
                "reviewBody": "This is a good quick recipe when you're in the mood for cookies but don't want to make it from scratch. I used a brownie mix and followed the directions. I made sure though to line my baking sheet with parchment paper---easier clean-up and makes sure the cookies won't stick! I also baked this for ONLY 8 MINUTES. It will look a little undone but will continue to bake when you take it out of the oven. Leave the cookies on the sheet for a minute and transfer to a wire rack. My cookies came out looking crackled and flat (not a bad thing) crispy on the edges and chewy in the middle. Really good! (Store leftovers in an airtight container.) TIP: Everyone's oven is different. Try baking one small batch at 8 minutes another at 9 or 10. See what works best for you. 8 minutes worked best for me!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "strawberryletter23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/403197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-02T12:54:00.607Z",
                "reviewBody": "I couldn't rate these a five because I don't like white chocolate and therefore didn't make this recipe as written but I chopped up York Peppermint Patties instead and got rave reviews on these. I would definitely use parchment paper for these and err on the side of caution with the time. I also noticed that these spread differently depending on which brand of brownie mix you use. When I used Duncan Hines mix they spread really flat and crispy and only needed 8 minutes to bake. Pillsbury brownie mix resulted in a puffier cookie that needed about 9 minutes to bake and came off the cookie sheet easier....another reason I couldn't quite rate these a 5 the recipe is not consistent. Not a fault of the poster just a matter of fact based on my making them two times with different brands of product.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Heather",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1589250/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:52:07.577Z",
                "reviewBody": "I didn't have brownie mix in the house but plenty of cake mixes so I used a devils food cake mix... soooo easy and soooo good!! thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MELINDA ANNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/199932/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-24T17:02:40.35Z",
                "reviewBody": "Yumm-o! These were super easy and dare I say better than making them from scratch. I mixed the dough with peanut butter chips and refrigerated for a couple hours. I used a small cookie scoop baked 12 minutes and cooled 5 minutes on the pan (which was lined with parchment paper.) It needed the full 12 minutes because the dough was cold and the scoop made a thick cookie. Perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAILORTIFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/979810/"
                }
            }
        ]
    }
]