[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/226/world-cuisine/african/",
                    "name": "African",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17582/world-cuisine/african/north-african/",
                    "name": "North African",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1827/world-cuisine/african/north-african/moroccan/",
                    "name": "Moroccan",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18182/moroccan-chicken/",
        "name": "Moroccan Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F242569.jpg",
            "width": 3056,
            "height": 2292
        },
        "datePublished": "2000-04-21T03:59:34.000Z",
        "description": "Spices, spices, spices! This recipe is thick with 'em, and your taste buds will be thick with pleasure from Moroccan Chicken. This exotic tasting dish is a definite crowd pleaser!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound skinless, boneless chicken breast meat - cubed",
            "2 teaspoons salt",
            "1 onion, chopped",
            "2 cloves garlic, chopped",
            "2 carrots, sliced",
            "2 stalks celery, sliced",
            "1 tablespoon minced fresh ginger root",
            "½ teaspoon paprika",
            "¾ teaspoon ground cumin",
            "½ teaspoon dried oregano",
            "¼ teaspoon ground cayenne pepper",
            "¼ teaspoon ground turmeric",
            "1 ½ cups chicken broth",
            "1 cup crushed tomatoes",
            "1 cup canned chickpeas, drained",
            "1 zucchini, sliced",
            "1 tablespoon lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Season chicken with salt and brown in a large saucepan over medium heat until almost cooked through. Remove chicken from pan and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Saute onion, garlic, carrots and celery in same pan. When tender, stir in ginger, paprika, cumin, oregano, cayenne pepper and turmeric; stir fry for about 1 minute, then mix in broth and tomatoes. Return chicken to pan, reduce heat to low and simmer for about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add chickpeas and zucchini to pan and bring to simmering once again; cover pan and cook for about 15 minutes, or until zucchini is cooked through and tender. Stir in lemon juice and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "African",
            "North African",
            "Moroccan"
        ],
        "recipeCuisine": [
            "African",
            "North African",
            "Moroccan"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Sarah and Annette"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.319444444444445,
            "ratingCount": 360,
            "itemReviewed": "Moroccan Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "286.4 calories",
            "carbohydrateContent": "27.9 g",
            "cholesterolContent": "66.8 mg",
            "fatContent": "3.7 g",
            "fiberContent": "6.3 g",
            "proteinContent": "36 g",
            "saturatedFatContent": "0.8 g",
            "servingSize": null,
            "sodiumContent": "2127.8 mg",
            "sugarContent": "4.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-24T01:51:00.75Z",
                "reviewBody": "I gave this 5 stars, but only after making drastic changes. Just looking at the recipe it is apparent that the recommended amount of spices wouldn't be enough. I either doubled or tripled all the spices (I didn't have paprika or turmeric so I omitted those, but I added white pepper, coriander, chili powder, and cinnamon    to taste. I also used cumin powder as well as black cumin seeds). I also put in about 6 small-medium cloves of garlic and 2 tbsp fresh ginger. I didn't have sun-dried tomatoes so I omitted those, but I did add in a whole (large) can of diced tomatoes (rather than crushed). I also used the liquid from the chick peas. I threw everything except chicken in a dutch oven and simmered it til veggies & chick peas were tender - maybe 20-30 min. Meanwhile, I sauteed the chicken in olive oil, garlic and salt & pepper and when it was almost cooked I added it to the stewing veggies and spices and cooked it about 10 min longer. I cooked up some couscous with cinnamon & raisins and served the chicken and veg over the couscous. The sweetness of the cinnamon-raisin couscous was delicious with the spicy and flavorful chicken dish. It was so yummy!! I recommend using this recipe as a guideline but not following it literally - make it your own and you will probably like it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILLYSARAHC123",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/843317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-01T14:14:11.747Z",
                "reviewBody": "This is an interesting version of this recipe. I don't add zucchini garlic or lemon juice. I may experiment with those to add to my version. I do love the Morrocan Chicken I make. I have a few variations. Usually I am fine with just 2-3 chicken breast filets sauteed in 3 Tbsp olive oil. I also add one bell pepper to the dish with more carrots and celery. I think the more vegetables the better. I also use less salt; like 1 tsp. As far as the spices I just use about 3 Tbsp curry powder from Spice Island; they do the work for you. It has cumin coriander fenugreek ginger turmeric dill seed black pepper red pepper mace cardamon and cloves. I add the addt'l 1/4 tsp cayenne pepper to the curry powder. I don't use chicken broth but would like to next time. I use 1 can tomato sauce and 1/2 cup red wine. And finally I add 1/2 cup or more walnuts and 1/2 cup raisins. These ingredients really enhance the flavor and texture of this dish. Overall this has become one of my favorite dishes to make because it is really easy and delicious. Serve with couscous simmered in chicken broth and little olive oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSEP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T14:16:22.327Z",
                "reviewBody": "I've made this dish at least 15 times now. It's amazing! Anyone who's ever tried it asks for the recipe. Recently I hosted a dinner party and served this dish. Everyone at the party now has the recipe! You won't be disappointed! Beware the sodium content though. Try using no sodium garbanzo beans and chicken broth. Serve over plain couscous to complete.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AHARTREY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675828/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T14:15:23.887Z",
                "reviewBody": "I didn't exactly follow the recipe to a T. I used a whole bunch more vegetables than amounts given. Also I used instead one can chicken broth the liquid from the can of chickpeas and a can of diced tomatoes undrained. This is probably why it was so soupy but luckily I just drained it and labeled the excess liquid Moroccan Tomato Soup. (That was yummy too.) I didn't have zucchini available so I just omitted it. I also am in the habit of marinating the chicken ahead of time like my mom taught me with salt cayenne pepper and cooking sherry (just enough to wet it) and letting it sit for an hour in the fridge. I think next time I will marinate with white vinegar instead to give it a sour twist. Also used the juice of a whole lemon. It was a little spicier than I had expected because I used cayenne to marinate on top of the 1/4 tsp cayenne in the recipe but we like it hot here. It got a great review from my family and I am sure to make it again. I had some of my special Cornbread with Anise Seed leftover and served it with dinner. The sweet licorice flavor offset the spicyness beautifully and it sopped up the sauce too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KAFFIR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/796238/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-14T17:24:51.64Z",
                "reviewBody": "So good that I've been asked by a few people for the recipe! I had to omit the onions and garlic as I had guests who couldn't eat either and in spite of that everyone really enjoyed it! I served it with basmati rice...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3973854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T05:57:22.907Z",
                "reviewBody": "I try recipes from this website all the time has got to be one of my favorites. The spices were wonderful and adding the tomato flavor and chick peas was a nice twist. I marinated the chicken overnight in the spices and ginger and garlic for extra flavor. We served this with couscous for a complete meal. Fabulous!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAILBUZZY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/114024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T14:38:56.25Z",
                "reviewBody": "This was so tasty! We used red kidney beans once and liked that combination even better than the chickpeas. Will definitely be making this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STEPHMIT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/707024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-03T17:34:26.733Z",
                "reviewBody": "I honestly didn't think I was going to like this because I'm not a huge fan of zucchini and chickpeas but it was delicious. Needed some salt and pepper when done but otherwise was very good. I served it over a blend of wild rices but next time I would include some light bread to sop up the remaining juices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HEIPLEJOHN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/486647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-10T14:36:13.967Z",
                "reviewBody": "This was 3 thumbs up!!! I made it even a tad spicier by adding Tabasco sauce.I would recommend reducing the chicken broth by 1/2. I doubled the recipie and used the same amount of broth and it was still a tad runny. All of us loved it and it will be a regular on our menu.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOPJIMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/774392/"
                }
            }
        ]
    }
]