[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17646/chicken-tetrazzini-iv/",
        "name": "Chicken Tetrazzini IV",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2205694.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2000-04-24T19:19:44.000Z",
        "description": "Chicken, mushrooms and spaghetti baked in a rich, creamy white sauce flavored with Parmesan cheese and sherry.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (8 ounce) package spaghetti, broken into pieces",
            "¼ cup butter",
            "¼ cup all-purpose flour",
            "¾ teaspoon salt",
            "¼ teaspoon ground black pepper",
            "1 cup chicken broth",
            "1 cup heavy cream",
            "2 tablespoons sherry",
            "1 (4.5 ounce) can sliced mushrooms, drained",
            "2 cups chopped cooked chicken ",
            "½ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add spaghetti, and cook for 8 to 10 minutes, or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a large saucepan, melt butter over low heat. Stir in flour, salt, and pepper. Cook, stirring, until smooth. Remove from heat, and gradually stir in chicken broth and cream.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Return to heat, and bring to a low boil for 1 minute, stirring constantly. Add sherry, then stir in cooked spaghetti, mushrooms, and chicken. Pour mixture into the prepared baking dish, and top with Parmesan cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 30 minutes in the preheated oven, until bubbly and lightly browned.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Mary"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.398559423769508,
            "ratingCount": 833,
            "itemReviewed": "Chicken Tetrazzini IV",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "730.4 calories",
            "carbohydrateContent": "52.7 g",
            "cholesterolContent": "173.3 mg",
            "fatContent": "42.6 g",
            "fiberContent": "2.8 g",
            "proteinContent": "33.1 g",
            "saturatedFatContent": "24.4 g",
            "servingSize": null,
            "sodiumContent": "919 mg",
            "sugarContent": "2.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-01-21T15:11:52.843Z",
                "reviewBody": "3 stars using this recipe ~ definitely lacked flavor.  Please note:  This recipe is not for the faint hearted or calorie conscious.  There are ways to lighten it up as other reviewers have suggested but it's 5 stars with the following modifications.  1.)  Use linguini noodles vs spaghetti cooked al dente as the noodles still have to bake.  2.)  Use turkey in this timeless dish, plus it's a good way to use up Thanksgiving leftovers.  3.)  Never use canned mushrooms - Ugh!  Baby brown bellas and white  buttons work beautifully.  Saute 3 cloves of minced garlic, 1 small minced onion, and 1 tsp of fresh thyme leaves in butter.  Add 1/2 cup of a GOOD white wine and let simmer.  Once the liquid from the mushrooms/wine evaporate, set mushroom mixture aside.  4.)  When making the sauce, add 1 tsp of salt, 1 tsp of white pepper, and 1 tsp of nutmeg, plus 2 cups milk to the cream and chicken broth for a more sophistacted sauce.  Let simmer for 10 + minutes until sauce thickens.  5.)  Add the sauce, mushrooms, Parmesan cheese, 3/4 cup frozen peas and 1/4 cup of Italian parsley (flat leaf parsley) to the noodles and stir until the noodles are evenly coated.  6.)  Transfer to a baking dish.  Mix 1/4 cup of Parmesan cheese and 1/4 cup Italian bread crumbs and spread over the top of the noodles.  Dot with butter and bake as directed.  FYI - this dish freezes well...  With the modifications, this is a flavorful dish more true to the original that will have guests begging for more....  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-24T00:16:46.883Z",
                "reviewBody": "This was a big hit in my house.  It is a great make ahead dish you can pop in the oven when you get home.  I highly recommend substituting lowfat evaporated milk for the heavy cream.  It is still plenty rich and satisfying.  I got away with only using 3 Tbsp. butter to make my roux and omitted the salt altogether.  I cooked the mushrooms with some chopped onion and garlic in a little olive oil before adding into the mixture.  I increased the chicken broth to 1-1/2 cups based on other reviews and this amount was perfect.  I also increased the sherry to 3 Tbsp.  Once the mixture was in the casserole dish I sprinkled some italian herb seasoning and fresh ground pepper over the top.  Another variation that is good is to add some grated cheese to the roux after adding in the chicken broth and milk.  It works really well with about 1/2 cup of any type of cheese you have on hand (cheese blends work really well).  Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Brunmeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/valerieskitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-04T00:20:46.257Z",
                "reviewBody": "This was so creamy and flavorful! I cooked the chicken in about 1 TBS of olive oil, and then made the roux in the same pan to catch all of the yummy drippings. I also added about 4 cloves of minced garlic, as well as a small chopped onion to the sauce (it was still bubbling so cooked the onion nicely.) I used low-fat evaporated milk (in place of cream) and I also used fresh mushrooms. The evaporated milk tastes great, by the way, and normally I prefer to use real cream! At first, it is essentially a really rich gravy. I put the spaghetti in a casserole pan, poured the sauce over it (and chicken,) and mixed it together. After putting it in the oven for 25 minutes, the \"gravy\" had thickened and it was more casserole-like. Will definitely make over and over! I disagree with other reviewers who said it lacked flavor, or the sherry was overpowering, etc. etc. The flavors were great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah W",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1879389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-08T14:20:22.09Z",
                "reviewBody": "I have made this recipe many times over the years and my family loves it with a few changes. I prefer to use kluski noodles rather than spaghetti it really does make a huge difference. I also add additional seasonings....garlic and onion esp. I also make extra sauce to keep it moist and yummy. This dish freezes wonderfully and I think is even better after frozen. When I make it I usually double or even triple the recipe and then have several containers in my freezer for a quick meal or to give away to friends. Everyone loves it. But honestly try the kluski noodles you won't be disappointed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hunter StClaire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/459256/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-01T20:19:49.527Z",
                "reviewBody": "This was wonderful!  I broke the spaghetti in thirds, and as a time saver, used 3 pre-cooked seasoned chicken breasts.  I added some more flavor to my recipe:  I sauteed 1 cup chopped onion, 1 chopped bell pepper, 1 cup sliced *fresh* mushrooms, and 1 clove garlic in 1/2 Tbl. butter first, then added all that to the already thickened sauce.  For the sauce, I used 1 1/2 cups chicken broth + 1 cup skim milk + 1/2 cup fat-free half-and-half, which are the measurements I got from a similar recipe (other reviewers mentioned that you need to double the sauce, but I didn't want to double the flour and butter part).  Also, I think 1/4 cup parmesan was plenty.  Turned out great!  Thanks so much for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-17T20:36:52.76Z",
                "reviewBody": "This came out really good but I did modify it a lot. I used fresh sliced mushrooms (instead of canned) and sauteed with olive oil and garlic. I then added the cooked chicken and sauteed a few minutes to give it some extra flavor. Also I love tetrazzini with ham so I added about a cup of diced ham to the mushroom/chicken mixture. I promise the ham makes the recipe SO much more tasty! After mixing all of the ingredients and pouring into the baking dish I sprinked shredded cheddar (almost a full bag) on top of the parm. cheese. My mom always uses cheddar and I couldn't imagine tetrazzini without it. It's definitely NOT a low fat recipe (I'm sure it could be modified with something other than heavy cream) but if you're not trying to count calories it's delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lauren102682",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2008873/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T14:00:15.943Z",
                "reviewBody": "thanks to previous reviews, i increased the amount of sauce by half the first time i made it. i think that next time though i am going to double it. the flavor though was EXCELLENT! i added some garlic powder with herbs and some shredded mozzarella and parmeson to the sauce. then for the topping i mixed shredded mozzarella and seasoned bread crumbs with the parmeson for the topping. it was great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMASHAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795854/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-02T22:06:48.827Z",
                "reviewBody": "Very good. I used skim milk to make a lower fat version. Fresh mushrooms are also a nice touch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GOBLUEINGA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/879880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-04T04:25:25.17Z",
                "reviewBody": "This was really good. Tatsed like alfredo but with a nice mushroom flavor. I used fresh mushrooms and sauted them beforehand instead of canned mushrooms and it turned out nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "currenrocks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1252766/"
                }
            }
        ]
    }
]