[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/108/appetizers-and-snacks/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1237/appetizers-and-snacks/seafood/shrimp/",
                    "name": "Shrimp",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/17753/coconut-shrimp-i/",
        "name": "Coconut Shrimp I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3494547.jpg",
            "width": 2661,
            "height": 1999
        },
        "datePublished": "2000-04-26T00:02:24.000Z",
        "description": "These crispy shrimp are rolled in a coconut beer batter before frying. For dipping sauce, I use orange marmalade, mustard and horseradish mixed to taste.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 egg",
            "½ cup all-purpose flour",
            "⅔ cup beer",
            "1 ½ teaspoons baking powder",
            "¼ cup all-purpose flour",
            "2 cups flaked coconut",
            "24 shrimp",
            "3 cups oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In medium bowl, combine egg, 1/2 cup flour, beer and baking powder. Place 1/4 cup flour and coconut in two separate bowls.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Hold shrimp by tail, and dredge in flour, shaking off excess flour. Dip in egg/beer batter; allow excess to drip off. Roll shrimp in coconut, and place on a baking sheet lined with wax paper. Refrigerate for 30 minutes. Meanwhile, heat oil to 350 degrees F (175 degrees C) in a deep-fryer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry shrimp in batches: cook, turning once, for 2 to 3 minutes, or until golden brown. Using tongs, remove shrimp to paper towels to drain. Serve warm with your favorite dipping sauce.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Seafood",
            "Shrimp"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LINDAV10"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.792168674698795,
            "ratingCount": 1992,
            "itemReviewed": "Coconut Shrimp I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "316.6 calories",
            "carbohydrateContent": "26.3 g",
            "cholesterolContent": "67.5 mg",
            "fatContent": "19.3 g",
            "fiberContent": "2.9 g",
            "proteinContent": "8.4 g",
            "saturatedFatContent": "8.3 g",
            "servingSize": null,
            "sodiumContent": "240.8 mg",
            "sugarContent": "9.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-28T13:59:51.983Z",
                "reviewBody": "Very delicious!  I chilled the batter and marmalade overnight and prepared the shrimp the next day.  Even though I lost coconut in the oil, a lot was still on the shrimp.  Chilling is the secret.  For the reviewer who said it wasn't sweet enough, try adding 1/2c of the coconut to the batter, plus 2 T sugar and 1/2 t salt.  The dipping sauce I used was 1/2 c orange marmalade, 2 t mustard, 1 t prepared horseradish, dash salt, and honey to taste.  Yes, it's laborious, but worth the effort for a great recipe like this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1Husband_1Hound",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/650474/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-26T21:47:47.723Z",
                "reviewBody": "Yes indeed, this recipe really does taste like the Outback's.  I followed the orange marmalade/horseradish sauce/mustard (I used Grey Poupon) recommendation for the dipping sauce and it was excellent.  To speed solidification, I placed shrimp in the freezer for fifteen minutes instead of the refrigerator for thirty minutes.  As many others have indicated, I pan fried the shrimp with exceptional results.  The browing only took maybe two minutes per side.  They looked beautifully golden brown and I lost very little coconut in the frying process.  My wife rarely compliments my cooking - and she said these were GREAT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Curt McLey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-17T17:48:18.507Z",
                "reviewBody": "GREAT! However, I did pulse the coconut lightly in a food processor (previously mentioned) and it did adhere to the battered shrimp better (good tip).  Also, since I like things a tad more seasoned, I put some cayenne pepper,paprika,garlic&onion powder, dried thyme&oregano into the 3/4 C flour (before dividing) and tossed seasoning directly on shrimp prior to coating. Plus, the larger the shrimp, the less time this takes..but it's worth the trouble even if you use medium shrimp. I wouldn't go smaller than that. After dredging/coating shrimp, chill until set, or freeze for 10 to 15 minutes. I've made these, froze and stored for another day and they fried up just as good that way too. If you use large/jumbo shrimp you can hold these in oven at 300 to finish cooking so coconut doesn't burn (or to keep warm until all are done). I also used the marmalade dipping sauce recommended which was really good! The batter itself w/out coconut works for fried onion rings or mushrooms as well, although I rolled those in Panko crumbs vs coconut flakes. Saved this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MakeItWork",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/makeitwork/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T02:31:09.083Z",
                "reviewBody": "I thought this recipe was good, but I made one change, instead of beer, I used coconut milk and it made it so coconutty.  Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "THREELEONS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917215/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-27T15:13:01.903Z",
                "reviewBody": "I bought a bag of tail on shrimp at Costco because we just moved to a beach city and shrimp sounded so good, but I wasn't sure what else to do with them other than the obvious easy shrimp cocktail dish, but that's like an appetizer and I wanted to make a dinner for me and my husband, ya know, something more filling.  I thought the task of making coconut shrimp sounded too elaborate and a nightmare for me because I have the passion for cooking but not neccessarily the experience.  I was wrong.  Making this was easy and fun.  I was surprised at the amount of coconut breading stays on the shrimp too.  The key is the refrigeration time to get it cold enough so that the coconut dough sticks to the shrimp.  I mixed both dijon and regular mustard with the orange marmalade and horseradish sauce.  The result was delicious, great for a beginner too who wants to break out of the macaroni box. I guess it's not really all that good for me cuz it's fried, not something I'd make all the time, but every once in a while for a special occasion.  Definitely a recipe I will make again, Saved.  Thanks.  Hope this review was helpful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "passion4cooking",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1815193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-25T19:33:43.18Z",
                "reviewBody": "OMG OMG OMG  These are SOO good.  I cannot believe how well they turned out for me.  I do not have a deep fryer, I just used a frying pan.  I think the secrets are to make sure and let the battered shrimp chill for the 30 minutes, and to make sure your oil is good and hot.  I piled on the coconut and did not have a problem w/the batter sticking.  I did add some cayenne and some garlic to the batter, and added the beer slowly until I had the right consistency (used ALMOST all of it the recipe called for and I'm sure it would have been fine with all of it).\r\n\r\nThese are just like the Outback's coconut shrimp.  I can't wait to make dinner with the coconut shrimp and the Aussie chicken on this site.  Awesome!  Thank you thank you thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HOLLY9000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450794/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-15T18:15:05.467Z",
                "reviewBody": "absolutely the best! far better than Red Lobster and Sam's frozen version even better than the ultimate Outback Steakhouse. used another reviewer's recipe for sauce...together can't be beat. contrary to some reviewers we love coconut and piled it on...also I began with cooked shrimp which may have cut down on fry time thus not apt to burn coconut as easily. THANK YOU for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAREN WANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/487729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-09T15:02:37.187Z",
                "reviewBody": "I printed off this recipe months ago but have been leary trying it because my boyfriend is not fond of coconut.  However, recently at a well-known restaurant, he surprised everyone by ordering this as an appetizer...and LOVED them.  Immediately I knew I could try this recipe! I'm sorry I waited so long because it was sooooo good! I used med-size shrimp (it was all I had available but the large shrimp is now on my grocery list for this recipe's repeat performance)which made it a tad more difficult to do all the dipping.  Also, I followed the reviewer who said to use marmalade, mustard, honey, horseradish and salt for the dipping sauce.  Delightful!! Thank you Linda for posting this wonderful and appreciated dinner recipe! I would recommend it to anyone! It just as good as the restaurant version!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T15:06:25.047Z",
                "reviewBody": "We had our daughter Tylers' birthday party this past weekend and she made these as part of our appetizers. The batter seemed a little thin, so I added more flour to get the right consistency. I was so anxious to try these, but they ended up flying off the plate! Everyone raved about them, so I guess they were amazing. Tyler placed three shrimp onto wooden skewers and then coated with the batter and coconut. Hubby Drew fried these right on the skewers in our deep fryer. For the dip I subbed the orange marmalade with pineapple preserves. Well, at least I can say that the dipping sauce was great! Thanks so much Linda!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-27T19:21:04.013Z",
                "reviewBody": "I used jumbo shrimp, fried in a saute pan and had no trouble with coconut falling off.  However, the shrimp were a little bland.  If I make them again, will try adding salt and perhaps some thai spices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELAH100",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/348425/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Coconut Shrimp",
            "description": "A beer batter keeps the coconut on these crispy shrimp during cooking.",
            "uploadDate": "2012-07-10T17:50:30.775Z",
            "duration": "PT2M45.999S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5202a046-7129-456e-908c-313ff70a228d%2Ffa6b536a-52be-4da5-9d99-fb90e01dd0fd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1729060941001"
        }
    }
]