[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/115/appetizers-and-snacks/wraps-and-rolls/",
                    "name": "Wraps and Rolls",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16366/appetizers-and-snacks/wraps-and-rolls/egg-rolls/",
                    "name": "Egg Roll Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18252/beef-egg-rolls/",
        "name": "Beef Egg Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F195107.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-04-26T19:48:44.000Z",
        "description": "Crispy fried egg rolls stuffed with ground beef, cabbage, and delicious seasonings. A personal creation of mine that goes well with any Chinese dish. The sherry makes it better.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "16 rolls",
        "recipeIngredient": [
            "1 pound lean ground beef",
            "1 onion, thinly sliced",
            "½ teaspoon dried minced garlic",
            "2 tablespoons soy sauce",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper",
            "2 tablespoons sherry",
            "1 teaspoon ground ginger",
            "1 large head cabbage, finely shredded",
            "¼ cup water",
            "1 tablespoon vegetable oil",
            "1 teaspoon white sugar",
            "2 tablespoons soy sauce",
            "2 tablespoons sherry",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper",
            "2 quarts vegetable oil for deep frying",
            "1 (16 ounce) package egg roll wrappers"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium-high heat, brown beef, then mix in onion, garlic, 2 tablespoons soy sauce, 1/2 teaspoon salt, 1/2 teaspoon pepper, 2 tablespoons sherry, and ginger. Continue to saute just until onions are tender. Transfer mixture to a bowl and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the same skillet, saute cabbage with water, 1 tablespoon oil, sugar, and remaining soy sauce, sherry, salt, and pepper. Continue to saute until cabbage is crisp-tender, about 5 minutes. Return meat mixture to pan and stir together with cabbage over low heat until heated through. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour oil into a deep pan and heat to 350 degrees F (175 degrees C). Fill each egg roll wrapper with approximately 1/4 cup of filling and roll up according to package directions. Fry in preheated oil until golden brown. Drain on paper towels and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Wraps and Rolls",
            "Egg Roll Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HERCATE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.606217616580311,
            "ratingCount": 193,
            "itemReviewed": "Beef Egg Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "267.1 calories",
            "carbohydrateContent": "22.1 g",
            "cholesterolContent": "21.1 mg",
            "fatContent": "15.8 g",
            "fiberContent": "2.1 g",
            "proteinContent": "9.4 g",
            "saturatedFatContent": "2.9 g",
            "servingSize": null,
            "sodiumContent": "576.5 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-14T14:48:35.207Z",
                "reviewBody": "You all will think I'm crazy, but I cook a lot of Asian foods, including crispy won tons and lumpia (usually with ground pork), and I've never precooked the meat and vegetables before filling the skins.  I didn't this time either.  I just put all the ingredients in a bowl and shmooshed them together, then filled the egg roll skins with the raw ingredients.  This worked perfectly, and saved a lot of bother.  The deep frying process cooked the meat to a safe internal temperature; and to be doubly safe, I drained the cooked rolls in the oven on a rack set over a baking sheet at 200 degrees until the meal was ready. I used fresh garlic and ginger, and added about 1/2 tsp of 5 spice powder.  These came out fine, but frankly, I prefer the taste of ground pork.  When I make them again, that's what I'll use.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-13T15:54:05.45Z",
                "reviewBody": "Wow! \nI followed the recipe exactly, except (1) I used two 16-oz bags of cole slaw to save a little work, (2) I added a can of bean sprouts, (3) I used spring roll wrappers because they were much cheaper and sounded fun, and (4) instead of deep-frying, I sprayed with canola on all sides, laid the rolls out on a cookie sheet, and baked at 400F for 25 minutes, turning them over after 15 minutes. (They still turned golden brown and needed blotting with paper towels, but I skipped the 2 qts of boiling oil part.)\n\nThey turned out really well, which was not a surprise ... but a little TOO meaty for my taste. Next time I'll reduce the meat or even leave it out altogether.\n\nThe spring roll wrappers came with about 60 in a package for $1.22, dry on the shelf. Dipping them in hot water and rolling was MUCH easier than I expected from the description (btw, many thanks to the previous reviewer's \"goofy\" face analogy!)\n\nThe biggest surprise? I made 12 full-size rolls, and have only used maybe 1/5 of my filling. I'll definitely be able to fill all 60 wrappers if I have that many. My ingredients, not counting seasonings, cost about $8, so these rolls cost less than a dime each. That’s buying cole slaw mix and using 90% lean ground beef (which I still drained after browning)! If I'd cut up the cabbage, the cost would have plummeted to perhaps a nickel apiece.\n\nJust like the restaurant version, I like these best with hot mustard, dipped in soy sauce. The recipe's definitely a winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WEAVRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/weavre/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-03T02:18:39.153Z",
                "reviewBody": "Outstanding! I made very few changes: I browned the ground beef WITH the onion and garlic, drained it, then added the other ingredients in step 1. I omitted the sherry in step 1, and halved it in step 2, but when I tasted it I wished I hadn't because it tasted like it was missing something. Like other reviewers, I, too, added shredded carrots and celery. Next time I'll remember to add diced scallions also. I also drained the cabbage/beef mixture and LET IT COOL TO ROOM TEMP before attempting to wrap. Another thing: I could NOT find egg roll wrappers, so I used whole wheat tortilla wraps and they were great! But here's a tip on wrapping...it's kind of quirky so bear with me: Imagine your wrapper is a bald guy's face/head. Put your mixture where his mouth would be. Then, fold his \"ears\" in. The sides should be perfectly parallel. Begin rolling the wrap starting with the chin. BE SURE THAT THE OUTER EDGES STAY PARALLEL THE ENTIRE TIME! IF THEY BEGIN TO FORM A V, STRAIGHTEN THEM OUT AS YOU ROLL! Continue to wrap tightly. Once wrapped, dab a little water on the both wrap surfaces and roll wrap up in a towel for 3-5 minutes to \"set.\" I used a dish towel that was lying around. Sorry for the goofy analogy, but I didn't know how else to describe it. Hope this helps! Finally, I started out deep frying these in a deep wok, but that didn't work out too well so then I did the rest of them in a deep frying pan with a more shallow amount of oil and they came out beautifully. Have fun!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DivineHealth7",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1478626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-27T19:24:03.443Z",
                "reviewBody": "These are wonderful if you lay them out on a cookie sheet and freeze then bag them. You can fix a couple to go with a meal whenever you want.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1299614/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-03T17:34:22.827Z",
                "reviewBody": "These eggrolls are great!! To save time I used the preshredded cabbage in the salad section for coleslaw and for more flavor I added minced celery shredded carrots and green onions and cooked the eggrolls in peanut oil. They also reheat nicely in the stove. Serve with your favorite Asian dish!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula Stotts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/680301/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-14T12:39:55.373Z",
                "reviewBody": "I too omitted the sherry.  Just a little hint in wrapping these.  I cool the mixture before wrapping, I make sure the filling doesn't have any liquid when wrapping.  This prevents the wrapper from breaking apart.  Also roll them tightly to keep them together.  Lots of fun to make!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Terri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-30T22:53:32.687Z",
                "reviewBody": "These are by far the best egg rolls i have ever hade. My husband had three of the down before i was finished cooking all of them. The only word that comes to my mouth is WOW!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "shannon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/623378/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-20T22:05:16.77Z",
                "reviewBody": "WOW! A really great simple recipe that tasted fantastic! Even impressed the boyfriend with this one. Somethings I had to change: (1) I had no Sherry, so I did some online research and read that you can use a little vanilla extract as a substitute. Did that, thought it tasted great. (2) I used 1 bag of coleslaw mix thanks to another reviewers tip. (3) I rolled the eggrolls and then I brushed a thin coating of veg oil over the entire roll since I don't have canola. (4) I oven baked mine at 400F for about 20 minutes, rotating halfway through. Follow others advice and it came out fantastic. I plan on making a double recipe and then freezing them for my on the go lunches. Very please!   PS - didn't have any good dipping sauces, so dipped them in honey. WOW!!!!!!!!!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "molitor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4002770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-30T22:53:40.28Z",
                "reviewBody": "I discovered this recipe about a month ago and I've been asked to make it 4 or 5 times. I substitute cooked chicken and everyone always has seconds. (I just need pointers on wrapping the egg rolls.) Thanks so much.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ILOVECOMPUTERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779871/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-08T02:30:00.17Z",
                "reviewBody": "I made them exactly as stated. Sorry they were not all that great. I guess the 5 stars are coming from people who added or took away from this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "sdbooker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4635620/"
                }
            }
        ]
    }
]