[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19215/ricotta-cookies-iii/",
        "name": "Ricotta Cookies III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7673653.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-04-28T20:57:38.000Z",
        "description": "This is a delicious light & fluffy cookie with a hint of lemon in the frosting. The ricotta cheese gives them a heavenly texture.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "2 cups white sugar",
            "2 eggs",
            "16 ounces ricotta cheese",
            "2 teaspoons vanilla extract",
            "4 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "½ cup milk",
            "½ teaspoon butter",
            "½ teaspoon shortening",
            "4 cups confectioners' sugar",
            "1 tablespoon lemon extract",
            "½ cup colored candy sprinkles"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the 1 cup of butter and sugar. Beat in the eggs, one at a time, then stir in the ricotta cheese and vanilla. Combine the flour, baking powder and baking soda, stir into the ricotta mixture. Drop by rounded spoonfuls onto the prepared cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the frosting warm the milk, 1/2 teaspoon of butter and shortening, in a small saucepan. Cook over medium heat, stirring occasionally until solids are melted. Remove from heat and gradually stir in the confectioners' sugar and lemon extract. Dip each cookie into the icing then dip in colored sugar or sprinkles.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Lisa"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5510948905109485,
            "ratingCount": 274,
            "itemReviewed": "Ricotta Cookies III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "172.4 calories",
            "carbohydrateContent": "28.4 g",
            "cholesterolContent": "21.2 mg",
            "fatContent": "5.5 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.6 g",
            "saturatedFatContent": "3.1 g",
            "servingSize": null,
            "sodiumContent": "80.3 mg",
            "sugarContent": "18.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-18T15:22:39.78Z",
                "reviewBody": "Great Italian Christmas cookie.  For those of you who make it and don't know what to expect...these are not intended to have a flavor explosion; they are about the texture and mild sweetness.  Some people add the almond extract for more flavor, I like them the way they were intended to be made...without extract.  An added tip...use a small cookie scoop so they stay round and symmetrical.  You can also add another teaspoon of vanilla for a little more sweetness.  Lastly, the lemon icing isn't quite right for this cookie...just use a powdered sugar/milk icing, and it adds even more sweetness to the taste of the cookie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TARA1972",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/577349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-08T19:15:27.23Z",
                "reviewBody": "I needed to use up a bunch of ricotta, so I tried this. Light & fluffy, a perfect cookie with tea. After reading reviews I decided to be skimpy on the icing (because of complaints about it being too sweet) and I'm glad I did.  I also decided to use almond extract instead of lemon (just because it's my favorite) and skip the colored sprinkles or colored sugar. My family liked these a lot.  Here's a tip to reduce the mess on the glazing process - a little cheat thing I saw on a tv show:  I put my glaze in a ziploc bag, sliced just a tiny tip of one corner, and then just drizzled the glaze over the cookies while they were still on the cookie sheet to the desired thickness.  No muss, no fuss. And I always bake my cookies on sheets lined with foil so there's also no clean-up.  Just toss the glazey foil away!  I'll make these again at Easter time and do the colored sugar/sprinkles to be festive.  This goes in our permanent recipe file.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1988569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-02T21:26:42.797Z",
                "reviewBody": "These cookies are great - like mini cakes!  My only complaint is the icing, which I think tastes a little \"fake\" with the lemon extract.  I experimented and found what I think is a better alternative:  instead of milk and lemon extract, substitute the juice of one lemon plus about two tablespoons of water plus 2 cups of powdered sugar(I halved the entire recipe to make a more manageable quantity).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mama Cass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/497756/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-25T14:55:53.19Z",
                "reviewBody": "Five stars to the cookie, two to the icing. To the person who asked for a better icing recipe, I have one that I use on ALL cookies. To the 4 cups of conf sugar, add 2 heaping Tbl. of \"Just Whites\", a powdered egg white that you can find in the baking aisle of your supermarket. Add enough lemon juice (not extract) to make a thick paint-like consistency (not icing thick!) Dip each cookie in the mixture and allow to dry, about 1/2 hour. Icing will harden in a thin glaze. You can also use water or milk instead of lemon juice, as well as food coloring or other flavoring. When decorating sugar cookies that are cut w/cookie cutters, you can apply this icing more precisely with a small paint brush. (If you're going to further decorate with sugar or sprinkles, do it before it dries.) When they harden, you can stack them without the icing smearing all over. Enjoy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMOMMEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1315108/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:40:43.187Z",
                "reviewBody": "Delicious light fluffy cookies! My friends and family loved these!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/303790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-16T14:57:57.733Z",
                "reviewBody": "The raw dough was the best part of the recipe...I couldn't stop snitching spoonfuls with that great ricotta flavor! I added grated lemon peel to the dough which enhanced the flavor a lot. The cookies were a tad less exciting in comparison but still good. They formed well with my mini ice cream scoop and looked perfect when they came out of my oven after exactly 13 minutes. I think the glaze does taste very powdered-sugary. I agree that this is a huge batch of cookies and I spent way more time than I wanted to in my kitchen and after the mess I made on my counter with the glaze I might hesitate to make these again. I did enjoy doing something different departing from the good old chocolate chip cookie recipe as I needed to use some leftover ricotta. These are actually really better the next day I think!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETTHING111",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742187/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-10T01:53:32.08Z",
                "reviewBody": "I have made these coolies several times and they  always receive raves. I originally made them with almond extract in place of the lemon and I still prefer them that way. But I made them along with maraschino cherry cookies for a reception so I made them as written with the lemon and everyone loved them. I volunteer weekly at a local hospice, in fact the first time I tried them was there and I made them to use up some leftover ricotta. One of the current residents asked me to make anise flavored cookies and said she likes soft cookies so I made these for her last week using anise extract. Today I had planned to make a Valentine's Day dessert but when I got to the hospice Laura asked me to make these again. Before I left she must have already eaten at least eight of them. So thank you, Lisa, for a great recipe and thank you for adding a little enjoyment to one woman's final days.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "janet7th",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3202695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-19T19:17:58.857Z",
                "reviewBody": "These were incredible!! They literally disappeared when I served them. I will be making these for the holidays. Thanks for a great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEETA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/480386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:50:35.5Z",
                "reviewBody": "These are good cookies. The lemon flavor is really good. The flavor kind of reminds me of Fruit Loops.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Gayle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/331502/"
                }
            }
        ]
    }
]