[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22252/spaghetti-pizza-lasagna/",
        "name": "Spaghetti Pizza Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F76369.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-05-03T21:04:49.000Z",
        "description": "I got this recipe from a friend and I haven't found anyone who doesn't like it!",
        "prepTime": null,
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 - 9x13 inch dish",
        "recipeIngredient": [
            "1 pound spaghetti",
            "1 pound lean ground beef",
            "1 cup milk",
            "2 eggs, beaten",
            "salt and pepper to taste",
            "1 (32 ounce) jar pasta sauce",
            "1 teaspoon dried oregano",
            "1 teaspoon garlic powder",
            "1 tablespoon dried minced onion",
            "1 (8 ounce) package sliced pepperoni sausage",
            "3 cups shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet over medium heat, cook beef until brown; drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat milk and eggs together until well combined; season with salt and pepper.  Place pasta in a 9x13 inch baking dish.  Pour milk mixture evenly over pasta.  Pour pasta sauce over that.  Distribute beef evenly over pasta sauce and sprinkle with oregano, garlic powder, minced onion and pepperoni slices.  Top with shredded cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until hot and bubbly, 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Naomi Ritter"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.139240506329114,
            "ratingCount": 158,
            "itemReviewed": "Spaghetti Pizza Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "510.5 calories",
            "carbohydrateContent": "40.4 g",
            "cholesterolContent": "106.3 mg",
            "fatContent": "26.6 g",
            "fiberContent": "3.3 g",
            "proteinContent": "25.9 g",
            "saturatedFatContent": "11.9 g",
            "servingSize": null,
            "sodiumContent": "833.5 mg",
            "sugarContent": "8.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-04T15:42:26.563Z",
                "reviewBody": "This receipe was great but I did change a few things. I used angle hair spaghetti. I sauteed finaly chopped onions with the beef. I added all the seasonings into the egg mixture. I put a thin layer of pasta sauce on the bottom of the pan. I then put the spaghetti noodles in. Then the egg mixture. Then a layer of pasta sauce. Then a layer of shredded monteray cheddar cheese. Then the beef which I still sprinkled oragano and garlic powder over. Then the rest of the sauce. And finally lots of shredded monteray cheddar cheese. I took out the pepperonis though. I also cooked it for about an hour to make sure the egg was done. It turned out great and even my picky boyfriend loved it!! THANKS",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Amanda",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2191524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-13T15:35:08.327Z",
                "reviewBody": "I also have a similar recipe.  I use Alberto's homemade noodles (wide or linguine) 12 oz.  I put it in one large round baking dish or two small ceramic pie dishes (one for freezer).  This looks more appealing like pizza and I slice it in pizza slices.  Children and teens love it.  I use a little more sauce than this recipe calls for.  If you need a quick meal the meat can be omitted.  I use this recipe all the time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "judy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2452107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-15T17:42:15.427Z",
                "reviewBody": "This dish was very good I also added all my left over from making a pizza the night before. Fresh mushrooms green peppers and even some canadian bacon. Used a combination of monterey jack cheese mozz chedder and parmesan. Kids LOVED it. I added some onion and garlic cloves to the hamburger. Thank you for submitting this recipe. Nice twist to traditional spaghetti.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2556875/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-23T20:12:03.297Z",
                "reviewBody": "All in all it was good! After 30 mins I took it out and the egg/milk mix was very watery. I increased the temp to 375 and let it cook another 15 mins. I took it out and the middle looked a little better but it still only registered 140F on the thermometer. I then microwaved it for 5 minutes and the egg center finally finished cooking and reached 160 degrees. I let it sit for 10 minutes before cutting it. We liked it especially the cheesy meaty topping. Might add 8 oz. more sauceand some ricotta cheese to the egg/milk mixture next time to try and jazz it up but we will definitely make it again. Yummy! Well I made it again and this time I added 8oz of ricotta cheese to the milk/egg mixture and baked at 375F for 45 mins. It came out perfect. The only thing is next time I will use less pasta because the addition of the ricotta almost had my 15 x 9 inch corningware bake dish overflowing!!! This is a keeper recipe and sure to please the little ones in the family too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JEG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2645629/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-15T18:25:24.593Z",
                "reviewBody": "I halved this recipe and it was ample for a family of 4. Tastes great but there was a watery milk mixture at the bottom of the casserole dish when I spooned it out to serve. I only used a handful of pepperoni that I purchased from the deli section at my grocery store (about.50 worth of pre-sliced pepperoni and I only used 1/2 of that. It was fairly spicy.) I also didn't have hamburger so I used meatballs that I had in the freezer - just threw some in a pan sauted with some onion till I could chop up the meatballs and used in place of burger. Overall a decent recipe that I would try again but would definitely use less milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl Cliff Flood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2130100/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T22:29:00.857Z",
                "reviewBody": "The first time that I made this I followed the directions completely. It came out ok but was not what I had hoped for. I made it a second time and I added double the sauce double the cheese a teaspoon of crushed red peppers and 3 fresh crushed garlic cloves. This was a TOTAL improvement and will be a keeper but with a few more tweaks here and there... I think that I will add a container of ricotta cheese the next time I make this...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Monty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/503339/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-14T18:13:18.17Z",
                "reviewBody": "I make a very similar version of this recipe that I call Baked Spaghetti. I use angel hair pasta it holds together really nicely when slicing and serving it and I always use a mixture of mozzarella and parmesan cheeses for more of an Italian flare. It s such a quick and easy meal to prepare on a weeknight but it s still very yummy and satisfying.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ms. Chef Esh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mschefesh/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-02T15:56:52.42Z",
                "reviewBody": "My boyfriend loved this dish! I did layer it a little different: First Used more pasta sauce which I spread a thin layer on the bottom then the noodles then the eggs (which I had mixed all the dry spices INTO the egg mix). Then I spread another thin layer of pasta sauce over the noodles followed by a little cheese the meat and then the remaining pasta sauce and cheese on top to cover all. Overall my family thought it was pretty good but it made alot...hopefully leftovers are equally as good! Thanks Naomi!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/379190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-08T19:17:36.263Z",
                "reviewBody": "This a very tasty dish! My whole family (including a couple picky toddlers) LOVED it! I cut the recipe in half and we still had quite a bit left over. But it's just as good the second day as it is the first! The only thing I will do different next time is leave out the spices. I use an already \"spicy\" spaghetti sauce and it just didn't need the extra on top. And I'm sure that I used more cheese than the recipe called for but you can never have too much cheese! This would also be a great recipe to serve to company. It's spaghetti just a little dressier!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANICEB75",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1181034/"
                }
            }
        ]
    }
]