[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7409/strawberry-torte/",
        "name": "Strawberry Torte",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F640860.jpg",
            "width": 4000,
            "height": 3000
        },
        "datePublished": "1998-04-16T00:56:08.000Z",
        "description": "Light and fluffy, easy and elegant. This recipe is from my Mom!",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 8 or 9 inch springform pan",
        "recipeIngredient": [
            "11 ounces cream cheese, softened",
            "¾ cup white sugar",
            "2 teaspoons vanilla extract",
            "1 pint heavy whipping cream",
            "2 (12 ounce) packages ladyfinger cookies",
            "1 (16 ounce) package frozen strawberries",
            "1 tablespoon cornstarch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Strain strawberries and set aside, reserving juices. In a saucepan bring cornstarch and strawberry juice to a gentle boil. Remove from heat and let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip cream cheese, sugar, and vanilla together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a separate bowl beat whipping cream until stiff peaks form. Fold whipped cream into cream cheese mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange ladyfingers around sides and bottom of the 8 or 9 inch springform pan, standing ladyfingers lengthwise around sides of pan. Pour 1/2  of the filling into the pan, then place a layer of ladyfingers on top of filling. Pour remaining filling over ladyfingers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread strawberry sauce over top of cake and place the whole strawberries on top. Refrigerate and remove from pan once thoroughly chilled.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Star Pooley"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.732510288065844,
            "ratingCount": 243,
            "itemReviewed": "Strawberry Torte",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "514.1 calories",
            "carbohydrateContent": "56.3 g",
            "cholesterolContent": "206.7 mg",
            "fatContent": "28.9 g",
            "fiberContent": "1.3 g",
            "proteinContent": "8.9 g",
            "saturatedFatContent": "16.7 g",
            "servingSize": null,
            "sodiumContent": "174.8 mg",
            "sugarContent": "19.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-09T18:44:03.21Z",
                "reviewBody": "Very easy to make, yet elegant.  A friend of mine had already made it and made a couple of suggestions.  She first added 1/2 teaspoon almond extract to the cream cheese mixture. Then the order used was lady fingers on bottom and sides, half the cream cheese mixture, another lady finger layer, all of the strained strawberries, the strawberry juice/cornstarch mixture (with 1/2 to 3/4 cup reserved), the rest of the cream cheese mixture, then in a spoke pattern add the reserved juice mixture.  With a skewer, swirl the spokes until a pretty pattern emerges.  Pile fresh strawberries in center.  Garnish with mint sprigs and white chocolate curls.  It won her first prize in the local Strawberry Festival.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALLIESUE420",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/637517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-19T17:40:08.75Z",
                "reviewBody": "This recipe is fabulous. I changed it slightly. I put the frozen strawberries in a pan with the cornstarch. Cooked down the strawberries and then took the cooked mixture and pureed it with 1/2 cup of sugar and once cooled poured it over the top of the torte. I think it complemented the torte more than just a little strawberry sauce. It looked great,everyone at my work raved about it, and none was left. Will make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MINGMING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/945538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-19T01:06:03.827Z",
                "reviewBody": "The first time I made this I found the 11 oz cream cheese overpowering, so I've always used 8 oz after that.  Even then I think I could use with a bit less cream cheese, but that's totally up to personal taste. Then, because of the other reviews, I layer instead of putting the ladyfingers on the sides -- this allows the ladyfingers to soak in moisture and better complement the texture of the cream.  I just use a nice, transparent flat-bottomed rectangular glass bowl and it still looks good enough to serve at a party.  And the most important tip -- since I use fresh strawberries, I mash them and instead of putting aside the strained strawberries, I fold them into the whipped cream/cream cheese mixture.  This transforms it into a really strawberry dessert instead of just a strawberry-and-cream concoction.  Although shaved chocolate looks good as a topping, I think it deflects the taste of strawberries, so I don't recommend it.  This is a really good strawberry refrigerator cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTMAS8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1338078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-03T18:43:29.497Z",
                "reviewBody": "I made this for my company Christmas party this year, and it was finished off completely! I followed some other's advice and cooked down a bag of frozen strawberries with 3/4 cup of sugar and 2 tbs. cornstarch (making sure to mix the cornstarch with some of the strawberry juice first). Then I pureed the mixture in a blender and let it cool. I did cut down some of the ladyfingers because they were too tall when I was assembling the sides. After I put the cake together, I poured the cooled strawberry mixture on top of the entire cake. I chilled the cake for 24 hours, and then used the leftover cream mixture to pipe rosettes around the top border and in the very center of the cake, and used fresh strawberries to border the bottom of the cake (and one on the top for good measure). I will definately make this again, and next time, I'd like to put sliced fresh strawberries in the cream filling too. Thanks so much for such an elegant recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARRAHS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/981035/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-09T18:56:18.733Z",
                "reviewBody": "Great Desert. Good for any occasion. I had a hard time getting the Lady finger cookies to stand up though. So what I ended up doing first was laying down the lady fingers on the bottom on the pan and pouring 1/2 of the cream cheese/whipping cream mixture on top of those. Then I insert the lady fingers around the edge of the pan. It helped them stand up straight and hold them in place. Once I had inserted all the cookies around the edge I poured the rest of the mixture on top and added the strawberry topping. The strawberry topping was a little bitter, so I would suggest sifting a little powdered sugar on top of that. Tasted wonderful. Very simple recipe - Will definitely make it again!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Poveda Scout",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/706641/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-07T19:44:13.25Z",
                "reviewBody": "This cake was incredible. I made it for some very picky eaters and every one of them LOVED it. They even said it was better than a similar cake from a famous New York bakery! I did simplify the recipe a little by using frozen whipped topping instead of fresh cream. I also used a 24 oz package of frozen sweetened strawberries and layered the strained strawberries and a little of the glaze over the lady finger in the center layer of the cake. I used the rest of the glaze on the top of the cake, as directed, and decorated with fresh, whole strawberries. I refrigerated over night and WOW! It not only looked like a store bought cake, but tasted like it came from a bakery.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs. Sweetie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1749115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T05:26:25.13Z",
                "reviewBody": "Excellent!  I've already made this a couple of times with fabulous results.  Everybody who tasted it raved.  One of my husband's co-workers declared it his favorite dessert; another one told him to give me a kiss for making it!  I followed the directions, except mashed some extra strawberries in the filling and another layer of strawberry glaze in the middle as other reviewers suggested.  Yay!  I made it with store bought ladyfingers once and homemade ladyfingers the other time (recipe from this site) and I definitely thought the homemade version had better flavor, even though they didn't have as much volume.  Thank you for the definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hotstuff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1539720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-07-18T20:40:59.7Z",
                "reviewBody": "WOW! This was amazing! What a beautiful presentation! I made for a family get together and within 20 minutes it was GONE! I had a 10in springform pan so I used 16oz cream cheese, 8oz cool whip vs. heavy cream (only to save time), and doubled everything else, which was perfect! It filled all the way up to the top without overflowing. For the vanilla I sub'd half for almond and was happy with the result. I followed another reviewers suggestion on layering: ladyfingers, 1/2 filling, drained strawberries, 2/3 thickened strawberry sauce, other 1/2 of filling and then remaining 1/3 of sauce. Swirl sauce with filling and top with shaved chocolate, mint sprigs & a few sliced strawberries! Simply beautiful. Chilled for about 8 hours and when I removed the pan sides it held together! Thank you for the post!  PS: I used frozen sliced strawberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONARCH38",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1047736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-28T23:52:16.24Z",
                "reviewBody": "One of the best recipes I've ever tried from this website! I took this into work, and it was gone in no time. I had several requests for the recipe as well.\r\n\r\nI only made one small change. The local grocery was out of ladyfingers, so I bought an angelfood cake and broke it into bite sized pieces. The finished cake felt heavy, and I was a little worried that it might be too thick--but it melted in my mouth!!! I usually am very critical of my own cooking, but even I couldn't find one bad thing to say about this one. Thank you Star!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARANICOLE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1077954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T18:48:49.04Z",
                "reviewBody": "I made this according to the recipe and was a little disappointed by the taste. It looked beautiful but if I were to make it again I would definitely put strawberry in both of the layers and not just on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "COLOEATON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1094072/"
                }
            }
        ]
    }
]