[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2258/side-dish/sauces-and-condiments/marinades/",
                    "name": "Marinade Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18056/cornell-chicken-marinade/",
        "name": "Cornell Chicken Marinade",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3917879.jpg",
            "width": 1536,
            "height": 2048
        },
        "datePublished": "2000-05-20T12:41:49.000Z",
        "description": "A lovely chicken marinade with oil, vinegar, poultry seasoning, egg and salt and pepper. Your chicken will love you for this baste, and so will the family.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P1DT0H10M",
        "recipeYield": "3 cups",
        "recipeIngredient": [
            "1 egg",
            "1 cup vegetable oil",
            "2 cups cider vinegar",
            "3 tablespoons salt",
            "1 tablespoon poultry seasoning",
            "1 teaspoon ground black pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Crack the egg into a medium bowl and whisk until beaten. Slowly whisk in the oil until fully blended. Then whisk in the vinegar, salt, poultry seasoning, and ground black pepper. Set some of the sauce aside  to use for basting while grilling. Place chicken in shallow baking dish, and coat with sauce. Cover, and marinate in the refrigerator for 24 hours.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Marinade Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MCCLELLAND"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.573684210526316,
            "ratingCount": 190,
            "itemReviewed": "Cornell Chicken Marinade",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "85.9 calories",
            "carbohydrateContent": "0.3 g",
            "cholesterolContent": "0 mg",
            "fatContent": "9.2 g",
            "fiberContent": "0 g",
            "proteinContent": "0 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "873.1 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-16T08:30:48.67Z",
                "reviewBody": "anyone from upstate NY knows that this is the best barbeque sauce!  I have used it for years, and every fire department in the region uses it as a base for their marinade.  The man that invented this sauce was a Cornell University professor at the agriculture school.  He humbly gave up the rights to his own claim of fame and let it have the Cornell name associated with it instead.  I usually do cut down on the salt though, as I do find it to be a bit too salty.  I think the original recipe on the Cornell co-op extention site calls for the use of Kosher salt specifically.  If one ever makes it to the NY state fair, this professor and his family have a stand called, \"Baker's Acres\" where you can try this chicken from the originator of the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TUNISIANSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1452636/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-08T23:53:20.597Z",
                "reviewBody": "Y'all are using this wrong. It is not a marinade, it is a basting sauce. Look up the original recipe on Cornell's website. You do not expose the chicken to the sauce until you start cooking it; then you baste the chicken with the sauce repeatedly while you grill it. I grew up in Upstate New York, and this was frequently made at summer church socials and fire department picnics. For a large crowd you make large charcoal pits out of cement blocks and lay out split broilers on large wire grills; you make an extra grill to lay over the top of the chickens and two people can flip over maybe a dozen chickens at a time. The sauce is mixed up in pails and applied with big paint brushes. Again, you don't marinate the chicken, that would make it too salty, and it would be impractical to do so when serving hundreds of people, which was how the recipe was originally written.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bob D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/685323/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-01T20:16:39.447Z",
                "reviewBody": "This recipe is originated from Cornell University which is 10 minutes from my home.  If you cut the recipe in half you can eliminate the egg.  I strongly recommending that you marinate the chicken overnight and it does make an abundant amount of marinade.  Enjoy - You'll love it.  Perfect chicken everytime :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUEENSHARON00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/915173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T17:00:39.327Z",
                "reviewBody": "Like Judy (review below) I have enjoyed this ever since I could remember.  My parents grew up about 20 minutes form Cornell and I spent almost every summer up there visiting my grandparents.  We had this every 4th of July at my grandparents boat club bbq and lots of other bbq's since.  Three things that I can add to the reviews.  1) we use white pepper in ours and 2) if you don't like \"vinegary\" recipes, you should marinade it for less time (about 3 hours).  3) I actually put marinade in a bag, put the chicken in it and freeze until I am ready to cook it.  Now - if I could just find a spiedie marinade!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCaldwell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/115741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-27T18:35:20.423Z",
                "reviewBody": "When this recipe was invented in the 1950s by Professor Baker at Cornell University, only larger broiler chickens and stewing hens were sold. This bbq sauce was invented to be used for bbqing smaller fryer size birds (2-3 lbs) like we mostly use now.  As a result this recipe is best used on chicken quarters, which is the leg and thigh portion, or a wing/breast combo.    If you use it on boneless skinless breasts only you must be aware that there isn't quite enough mass to handle the heady aromatic marinade if you let it marinate for hours.   Just a brief marinate time will do for boneless skinless chicken breasts. The effect will be luscious, moist and succulent, not over seasoned.  It's almost an Italian flavor, but subtle when used as a marinade for half chickens.  Hopefully this will clear up some misconceptions that are causing some cooks' concerns.  And remember don't cook the chicken over too high of a heat - medium coals is better. Traditionally served with a baked ora buttered boiled salt potato (just boiled in extra salty water like the salt miners did), coleslaw, and a roll. That's UPstate NY's traditional bbq.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KelliCooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/109563/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T17:00:47.357Z",
                "reviewBody": "I've used this recipe for about 6 years now and love it.  I never buy marinade again, its the best!  I also add garlic powder to this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DMICKINKLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/646190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-17T17:31:20.53Z",
                "reviewBody": "The smell of this chicken on the grill is the most impressive thing you may ever encounter. people i don't even know will come over to ask what i'm cooking. as for the vinegary taste the other reviewer mentioned -- IT IS SUPPOSED TO BE VINEGARY! i have loved this recipe my whole life i hope many of you love it too. i grew up in texas and this isn't a traditional bbq recipe for the south. however i've never served this to anyone that hasn't liked it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TOBYSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/288855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-30T01:06:31.96Z",
                "reviewBody": "I got this recipe years ago from my ex-mother in law.  what a fabulous recipe!!!!  she would always make it for us when we would visit her in Catskill, NY.  I remember my ex-father in law, cooking it slowly almost all day.  just remember it  needs to be cooked over low heat.  it will flare up and burn quickly.   LOVE this recipe!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Koch",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1685545/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-12T15:10:26.7Z",
                "reviewBody": "I will make this again but the recipe needs some changes. Three tablespoons of salt is way way too much! Especially because poultry seasoning (no matter what kind you use) has salt in it anyway. My family liked this though. I used it on chicken breasts but I think it would taste better on dark meat maybe thighs will work better next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "RANDI5",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037446/"
                }
            }
        ]
    }
]