[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
                    "name": "Apple Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18353/all-american-apple-pie/",
        "name": "All American Apple Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1038905.jpg",
            "width": 1684,
            "height": 2047
        },
        "datePublished": "2000-05-25T23:59:13.000Z",
        "description": "Quick and easy, with a great non-crust topping.  Try a variety of apples, mix it up...",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "½ cup vegetable oil",
            "2 tablespoons cold milk",
            "1 ½ teaspoons white sugar",
            "1 teaspoon salt",
            "6 Fuji apples, cored and sliced",
            "¾ cup white sugar",
            "3 tablespoons all-purpose flour",
            "¾ teaspoon ground cinnamon",
            "½ teaspoon ground nutmeg",
            "½ cup all-purpose flour",
            "½ cup white sugar",
            "½ cup butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Crust: In a large bowl, mix together 1 1/2 cups flour, oil, milk, 1 1/2 teaspoons sugar and salt until evenly blended. Pat mixture into a 9 inch pie pan, spreading the dough evenly over the bottom and up sides. Crimp edges of the dough around the perimeter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling: Mix together 3/4 cup sugar, 3 tablespoons flour, cinnamon, and nutmeg. Sprinkle over apples and toss to coat. Spread evenly in unbaked pie shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Topping: Using a pastry cutter, mix together 1/2 cup flour, 1/2 cup sugar and butter until evenly distributed and crumbly in texture. Sprinkle over apples.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Put pie in the oven on a cookie sheet to catch the juices that may spill over. Bake 45 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Apple Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Amy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.572357723577236,
            "ratingCount": 615,
            "itemReviewed": "All American Apple Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "528.9 calories",
            "carbohydrateContent": "72.9 g",
            "cholesterolContent": "30.8 mg",
            "fatContent": "25.9 g",
            "fiberContent": "3.6 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "375.7 mg",
            "sugarContent": "43.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-10-28T23:55:21.483Z",
                "reviewBody": "That an awesome and easy to make pie.  Well, I took a shortcut and used a frozen pie crust.  But, it was so easy.  I picked this recipe becasue I was out of brown sugar and did a search to see if there was such an apple pie using only white- and here it is!   I did take one reviewer's advice and added 1 TB lemon juice and 2 TB cornstarch - then as advised, put it all in a saucepan to ensure the apples cook better.   After about 20 on 'low' (and stirring frequently!), I poured it into my premade crust.  Then, for the topping, I didn't have a pastry cutter, so I used a fork.   And, I'm a sweet tooth, so I doubled the amounts for the crumb crust.  I added cinnamon and a little sugar now and then as I was mashing with my fork.  I loaded the pie with these crumbles.   After about 40 min, I took it out (remember, I already cooked my apples earlier), and it was golden brown and crunchy on top and my crust was not overdone or dry since I didn't have to bake as long.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Termommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1576452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-19T20:12:51.607Z",
                "reviewBody": "This recipe is excellent! I made a few slight adjustments, however, that made the pie even better. Use just under the amounts shown for oil and salt for the crust. Add 1 TBS of lemon juice and 2 TBS cornstarch to the filling mixture and cook in a saucepan until tender, then put in the  unbaked pie crust. Use 1/2 cup brown sugar, 1/4 cup sugar, and a few dashes of cinnamon, along with the other ingredients, to make the topping. You can also add some rolled oats and chopped pecans to the topping mixture for added variety. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMYMARIE25",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1089958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-04T14:08:30.84Z",
                "reviewBody": "This was the best apple pie I've ever made, and I've been baking for years. I needed to bake it longer than the recipe called for, but as soon as it was goldening up, I took it out. It got rave reviews from everyone at dinner. I found that the recipe was good just as it was. (Some previous submitters had recommended cutting sugar or butter). If you're extremely health conscious, I guess you could, but it's absolutely delicious as is. Also, those complaining that it was doughy only had to bake it longer. If you tap lightly on the crumb topping, and it leaves an indent, then it still needs to bake some. \r\n An absolutely outstanding pie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NUMUM4199",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/793273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-06T00:49:17.437Z",
                "reviewBody": "I served this for 4th of July and it was the hit of the party. My mother said it was the best apple pie she'd ever tasted - better than her grandmothers! I used small gala apples (6 were just enough) and sliced them pretty thin (about 3 cm. thick) - they were perfect for this pie. I took another reviewer's advice (\"1 TB lemon juice and 2 TB cornstarch - then put it all in a saucepan to ensure the apples cook better. After about 20 on 'low' (and stirring frequently!)\") and I added more flour and sugar to the crumbly topping which made it firmer but just as buttery and delicious. The topping still wasn't \"firm\" when putting it on the pie (it \"plops\" on) but it bakes to perfection. I also added a few shakes of ground cloves to the apple mixture as well as dashes of cinnamon nutmeg and cloves to the top of the crumble before baking and it gave it a nice aroma and look to the top crumble crust. The bottom crust is TO DIE FOR. Take the time to make the crust yourself - it totally makes the pie. Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie N",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1619994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-09T17:56:22.31Z",
                "reviewBody": "Best apple pie I've ever eaten. I did however add more cinnamon and about 2 tablespoons of brown sugar. Also used a 9-inch store bought pie crust. 3 granny smith and 1 golden delicious apple chopped into small chunks were a plenty. For the topping I pulsated the ingredients in a food processor. It came out almost like a sugar cookie dough. Then rather than sprinkling it I dropped gobs on top of the pie and pressed it all together with my fingers forming a top \"crust.\" I wrapped the edges with aluminum foil to prevent burning and the end result was a gooey caramel-like center with a crispy flaky sweet crust on top. It was awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Martie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/martie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-09T17:55:03.217Z",
                "reviewBody": "Great recipe! I'll admit I had my doubts about the crust but it turned out fine. Nice to be able to make a pie without getting flour all over. I found that the pie was done after 45 minutes in the oven. For those of you having trouble with the topping keep in mind that the butter/margarine needs to be cold (out of the fridge not at room temperature) in order to make crumbs. Good luck! Can't go wrong with this one. Thanks Amy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JUDY TOOMEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723456/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-04T16:24:35.907Z",
                "reviewBody": "Excellent pie - sometimes there's nothing better than a really good apple for dessert especially if it's topped with vanilla ice cream! The crust on this was pretty good but in the future I think I'd use \"Grandma's Secret Pie Crust\" from this site because the dough was a bit difficult to work with. After I got it into the pie plate I chilled it for a bit. For the apples I used Granny Smith and a ton of them! I used 1/2 cup of white sugar and 1/4 brown sugar upped the cinnamon to 1 tsp. added a couple splashes of lemon juice 2 tsp. of vanilla and 2 Tbsp. of cornstarch. Tossed every thing with the thin sliced apples and placed it into the crust. For the topping I used half white and half brown sugar and added 1/4 cup of quick cooking oats. This definitely takes longer than 45 minutes to bake. For me it took over an hour and I had to keep checking it. So I guess it all depends on your oven. It's definitely worth the wait though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-10T12:28:11.297Z",
                "reviewBody": "Fabulous! My chef husband was very impressed. I used Fugi apples sliced very thinly and also pre-cooked them with lemon juice cornstarch and the filling ingredients for about 10 minutes before spreading in crust. I also used a 10\" pie pan so I increased the crust and topping ingredients a bit. I added brown sugar oats and bit more flour to topping ingredients to get it more crumbly. Baked for about 43 minutes. Absolutely perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly V.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2065518/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:49:21.35Z",
                "reviewBody": "I don't know what more I can say about this EXCELLENT apple pie! We were getting last minute company and I needed a quick dessert and I enlisted my younger daughter to whip this up for me. I had granny smith's on hand so we used those and added a little bit more sugar to offset the tart flavor of the apple. We cheated and used a packaged pie crust and added cinnamon to the topping. Some other reviewers suggested cutting back on the butter but I felt the amount for the topping was perfect. Thanks so much Amy for a really great pie recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-26T22:14:13.93Z",
                "reviewBody": "You should really peel the apples first",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "tabithabea77",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4757083/"
                }
            }
        ]
    }
]