[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15008/desserts/specialty-desserts/liqueur-desserts/coffee-liqueur/",
                    "name": "Coffee Liqueur",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7384/chocolate-cappuccino-cheesecake/",
        "name": "Chocolate Cappuccino Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1955460.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1998-04-22T12:53:04.000Z",
        "description": "This recipe becomes a favorite as soon as it is tasted. It was once referred to as 'sinfully rich and velvety smooth'. Best if made a day before serving.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "1 - 9 or 10 inch cake",
        "recipeIngredient": [
            "1 cup chocolate cookie crumbs",
            "¼ cup butter, softened",
            "2 tablespoons white sugar",
            "¼ teaspoon ground cinnamon",
            "3 (8 ounce) packages cream cheese, softened",
            "1 cup white sugar",
            "3 eggs",
            "8 (1 ounce) squares semisweet chocolate",
            "2 tablespoons whipping cream",
            "1 cup sour cream",
            "¼ teaspoon salt",
            "2 teaspoons instant coffee granules dissolved in 1/4 cup hot water",
            "¼ cup coffee flavored liqueur",
            "2 teaspoons vanilla extract",
            "1 cup heavy whipping cream",
            "2 tablespoons confectioners' sugar",
            "2 tablespoons coffee-flavored liqueur",
            "1 (1 ounce) square semisweet chocolate"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Butter one 9 or 10 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the chocolate wafer crumbs, softened butter, 2 tablespoons white sugar, and the cinnamon. Mix well and press mixture into the buttered springform pan, set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium sized bowl beat the softened cream cheese until smooth. Gradually add 1 cup white sugar mixing until well blended. Add eggs, one at a time. Beat at low speed until very smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt the 8 ounces semisweet chocolate with 2 tablespoons whipping cream in a pan or bowl set over boiling water, stir until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add chocolate mixture to cream cheese mixture and blend well. Stir in sour cream, salt, coffee, 1/4 cup coffee liqueur, and vanilla; beat until smooth. Pour mixture into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the center of oven at 350 degrees F (175 degrees C) for 45 minutes. Center will be soft but will firm up when chilled. Do not over bake. Leave cake in oven with the heat turned off and the door ajar for 45 minutes. Remove cake from oven and chill for 12 hours. Just before serving top cake with mounds of flavored whipped cream and garnish with chocolate leaves. Yields 16 servings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Flavored Whipped Cream: Beat whipping cream until soft peaks form, then beat in confectioner's sugar and 2 tablespoons coffee liqueur.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Chocolate Leaves:  Melt 1 ounce semisweet chocolate in a pan or bowl set over boiling water, stir until smooth. Brush real non-toxic plant leaves (such as orange leaves) on one side with melted chocolate. Freeze until firm and then peel off leaves. Freeze chocolate leaves until needed.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Coffee Liqueur"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cigdem Buke Ugur"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.789130434782609,
            "ratingCount": 460,
            "itemReviewed": "Chocolate Cappuccino Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "618.7 calories",
            "carbohydrateContent": "45.1 g",
            "cholesterolContent": "157.5 mg",
            "fatContent": "45 g",
            "fiberContent": "1.8 g",
            "proteinContent": "9 g",
            "saturatedFatContent": "26.9 g",
            "servingSize": null,
            "sodiumContent": "332.5 mg",
            "sugarContent": "36.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-22T03:13:30.09Z",
                "reviewBody": "Fantastic cheesecake!!  I did have some trouble melting the chocolate, so the 2nd time I made this cheesecake, I just melted the chocolate in the microwave and stirred the 2 Tb. of cream in with with sour cream.  I also combined the 1/4c.water, instant coffee and liqueur & put in the microwave til it was hot.  By doing this, you avoid overmixing the batter and warms the batter slightly so the chocolate blends easier!   Great recipe and I really enjoyed making it!!!  Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSEY_C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-16T18:26:23.81Z",
                "reviewBody": "I have made this cheesecake at least a dozen times and my family and friends request it all the time!!!  I make a few modifications: instead of instant coffee dissolved in hot water, I use 1/4 c. espresso for a little stronger coffee flavor.  If you don't have an espresso machine, you can pick up an espresso at the coffee shop.  I also use 1 1/2 times the crust recipe so that the crust is a bit thicker and I can press it halfway up the sides of my springform pan.  I also buy a 16 oz. container of whipping cream and use the remainder (after using 2 Tbsp to melt the chocolate) to make the whipped cream, which means I double the powdered sugar and coffee liquer.\r\n\r\nI can't say enough good things about this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sally Bray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-28T00:58:47.28Z",
                "reviewBody": "This is a wonderful cheesecake that is easy to make.  I make a cup of expresso instead of instant coffee and then I melt some dark chocolate in a small amount of whipping cream and pour it over the cooled cake.  It hardens and forms a delicious crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hippiechic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2135315/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-07T01:47:21.123Z",
                "reviewBody": "Wonderful cheesecake!  I made a few changes including doubling the crust portion, otherwise I thought it would be too thin and used 1/2 cup strong coffee (4 tsp instant coffee in 1/2 c. water) for the coffee and coffee liquer.  I also used strong coffee in the cream portion and increased the amount of sugar (times 3) to make it sweeter.  It got raves and I will definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUZYJC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/709658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-22T03:14:16.53Z",
                "reviewBody": "This was good the first day but excellent the next so I would recommend 24 hours for the cheesecake flavors to meld. I subsituted 4 t instant coffee disolved in 1/2 a cup of whipping creaam for the coffee and coffee liquer the recipe calls for. I used chocolate sandwich cookies for the crust and would either use more cookies or less butter the next time I think chocolate grahams would work better than the sandwich cookies though. I melted the chocolate in the microwave with no problems. All in all excellent recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANGELLEE74",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/450468/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T21:04:22.977Z",
                "reviewBody": "I made this as a piece of an insanely decadent birthday cake for my husband so I divided the batter in half and baked it in an 8\" spring form- the resulting cakes were maybe 2\" thick so it makes a nice thick cheesecake. Because I made it thinner/smaller it didn't have to bake as long (about 30 min). I used 1/2 cup of espresso instead of the liquor and instant coffee and I sweetened it using concentrated fruit juice. I also used low far cream cheese. The chocolate seized with the cream (I used it anyways) and it still smoothed out in the batter. The cheesecake turned out fantastic. The final product is really only as good as the chocolate and coffee you use though so don't skimp and buy cheap stuff. I'd recommend melting the chocolate alone (without the cream) and then just add the cream alongside the sour cream. I will make this many times over I'm sure. Thank you for a wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FLIESE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/804707/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-28T20:04:54.417Z",
                "reviewBody": "I have made cheesecakes before and this one included is awesome. Here is some things I did to make this come out the way I wanted. I used Graham Crackers instead of chocolate cookies. I greased and floured the spring form pan as well as placed wax paper on the bottom. I also cooked the cake in a water bath to prevent cracking. I baked it for 50 minutes. I checked to see if it was done by tapping lightly on the side to see if it jiggled like jello. If it does then it is done. I left it in the oven with the door closed for another 50 minutes. I then removed cake and chilled overnight. To remove the cake from the pan I took a boning knife and placed it in HOT water and wiped it off. I gently cut around the edges slowly to loosen the cake from the pan. I repeated this method until I could get my knife all the way under the cake without disturbing the crust. Always dip the knife in the HOT water and wipe it off before make another attempt at loosening the cake. I also took that same knife and cut around the side of the pan to loosen the cake. Again I dipped my knife in HOT water and wiped it off and then began the slow cuts. If your cake cracks then take a frosting knife dip in HOT water wipe it off and smooth over the cracks no one will know PROMISE. You can sprinkle the ground up crust mixture over the top to change it up a bit. ENJOY",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Katrina Ramsey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4617550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-14T07:19:15.687Z",
                "reviewBody": "I love this cheesecake and so do everyone else who have tasted it! This was the first cheesecake of any kind that I ever tried to make and it turned out PERFECTLY! Everyone thought I bought it from a bakery. I used espresso instead of strong coffee and I baked it in a water bath. It took 3 hours to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETTOOTH23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/638738/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-11T16:24:55.28Z",
                "reviewBody": "I see that most of the comments with less than 5 stars have the problem of the chocolate seizing up in common.  Chocolate seizes on a double boiler because moisture gets into the mix (steam from the lower pan).  If your chocolate seizes up, add butter a little bit at a time until it smooths out again.  That will solve the seizing problem.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lmarion517",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7841538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-05T22:15:55.577Z",
                "reviewBody": "I had some trouble with this recipe. First their was not enough crust to cover the pan so after making what the recipe originally calls for I had to cut the crust recipe in half and make it again. That made enough. I also recommend melting the butter it makes it much easier to mix. I too had trouble getting the chocolate to melt. As soon as I added it to the cheesecake batter it became lumpy. Does it need to cool a bit? The recipe doesn't say. I did serve this the day after making it and I thought it tasted just OK. Honestly it was a little bit bitter and needed more sugar. I also couldn't taste any coffee flavor. I don't know that I would make this again. Something was off.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "amydoll",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742336/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chocolate Cappuccino Cheesecake",
            "description": "See how to make sinfully rich and chocolaty cheesecake.",
            "uploadDate": "2012-08-30T17:04:54.352Z",
            "duration": "PT3M42.583S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F5c83f71f-1a88-4340-a3f4-adc512af7576%2Fdc694740-4794-4057-a6c6-5f05d749a93d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1814844147001"
        }
    }
]