[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/704/world-cuisine/european/uk-and-ireland/",
                    "name": "UK and Ireland",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/706/world-cuisine/european/uk-and-ireland/irish/",
                    "name": "Irish",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18464/mums-irish-apple-pie/",
        "name": "Mum's Irish Apple Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F10577.jpg",
            "width": 1289,
            "height": 1109
        },
        "datePublished": "2000-06-04T23:10:13.000Z",
        "description": "As a little boy I grew up helping my mother make apple and fruit pies. She was from Cork in southern Ireland so I'm guessing the recipe is Irish and possibly the same one her mother taught her. Sadly my mum is no longer with us, but her legendary apple pie lives on in my memory. I promise you will love this pie!",
        "prepTime": "P0DT1H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "¾ cup cake flour",
            "½ teaspoon salt",
            "1 tablespoon white sugar",
            "1 cup unsalted butter",
            "3 tablespoons shortening",
            "¼ cup sour cream",
            "⅛ teaspoon lemon juice",
            "5 large Granny Smith apples - peeled, cored and sliced",
            "½ cup white sugar",
            "2 tablespoons all-purpose flour",
            "½ tablespoon ground nutmeg",
            "⅛ teaspoon lemon juice",
            "1 egg, beaten"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch pie pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Crust: In a large bowl, combine flours, salt and sugar. Cut in butter and shortening until coarse crumbs are formed. Mix in sour cream and lemon juice. Keep mixing until dough forms a ball; dough may be slightly lumpy, this is fine. Wrap dough ball in plastic wrap and allow to chill for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Once chilled, take dough out of refrigerator and cut it in half; keep one half covered and in the refrigerator. Roll dough to 1/8 of an inch. To lift pie shell, roll dough around rolling pin and then unroll into pie pan. Trim overhanging edges of pie crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Filling: Place apples into pie shell. In a small bowl, combine sugar, flour and nutmeg; mix thoroughly. Sprinkle mixture over apples. Squirt lemon juice over apples. Place pie in refrigerator while top crust is rolled out.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove pie from refrigerator. Brush outer edge of bottom crust with beaten egg. Place second crust on top of pie; crimp pie shell edges together. Brush entire top crust with egg and cut 4 steam slots into it.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated 350 degrees F (175 degrees C) oven for 45 minutes, or until golden brown. Allow pie to completely cool before serving. Serve warm with whipped cream or vanilla ice cream.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "recipeCuisine": [
            "European",
            "UK and Ireland",
            "Irish"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "BRIANGREEN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.655172413793103,
            "ratingCount": 87,
            "itemReviewed": "Mum's Irish Apple Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "526.9 calories",
            "carbohydrateContent": "61 g",
            "cholesterolContent": "87.4 mg",
            "fatContent": "30.5 g",
            "fiberContent": "3.5 g",
            "proteinContent": "5.4 g",
            "saturatedFatContent": "17.1 g",
            "servingSize": null,
            "sodiumContent": "163.2 mg",
            "sugarContent": "28 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-27T02:42:48.257Z",
                "reviewBody": "Problem rolling out pie crust? Here's a simple solution. Years ago I could not roll out pie dough for anything! I hit upon this idea thru trial and error and it has worked well for me over the years and it's very easy to do. On the surface you plan on rolling out the dough, wipe the area with a wet cloth and IMMEDIATELY BEFORE IT DRIES, sprinkle with flour and rub it around. Then roll out your dough. It works every time and you can use the same area for all your pies you want to make.....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SANDJEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/404062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-25T16:03:54.327Z",
                "reviewBody": "I made this pie for St. Patrick's Day and it looked great and was so tasty! I may go slightly lighter on the nutmeg next time, but it was the crust I couldn't stop thinking about for days! Sour cream was the secret ingredient that made it wonderful. I don't think I've ever made a homemade crust before (I always get the Pillsbury folded up kind) but it was easy! Also, I used a shamrock-shaped cookie cutter to cut three shamrocks in the top crust. I didn't remove the cut pieces, I just scooted them over slightly. These acted as decorative steam slots. I also like to put any leftover rolled out crust dough in a small pan, sprinkle it with cinnamon and sugar and put it in the oven with the pie for a few minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "REDD GIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/613223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-04T02:23:04.953Z",
                "reviewBody": "Thank you all for your kind reviews. It's just fantastic to see so many people enjoying this recipe. I have made this pie many, many times and would agree with all of the reviewers who say to cut back on the nutmeg. I would recommend that you use no more ½ a teaspoon of nutmeg when you make it, in fact if you can get hold of mixed spice (not 5-spice!) that works even better! You can use just all-purpose flour for the crust too and it works just as well, also 1-cup of butter is two sticks :-)  Hope you all continue to enjoy the pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BRIANGREEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/95064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-27T02:45:20.32Z",
                "reviewBody": "This was rated by my husband as \"excellent pie baby.\" I did make some variations and let me say right now that this is my second pie this week and I am NOT good at rolling dough. It didn't look as good as it tasted because I can't seem to make the dough as thin pliable and uniform as others can. I don't think this has as much to do with the recipie than with my inability to do proper pastry. My variations include: Jonagold apples (next time I will use granny smith because these were too sweet) and instead of 1/2 T of nutmeg I used 1 t. of cinnamon and 1/2 t. of nutmeg and a tiny dash of allspice. Also I cut the apples into chunks rather than slices and put the pie into a 425 degree oven for 10 mintes and then reduce to 350 for another 35 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SOPHIEJJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-05T13:48:24.28Z",
                "reviewBody": "I have to admit that I just made the crust last night. I used it to top my chicken pot pie and it was amazing! I upped the salt a bit and cut back on the sugar and it was the best savory pie crust I have ever had. I am not a pie crust fan but this was so delicious that I was saving the crust for last and picking at the kids left overs. The apple pie filling seems pretty solid and would make a great pie especially with that crust. My husband and I agree that this will be \"The Crust\" recipe for savory and sweet pies from now on. BTW- I did use only All Purpose flour and substituted vinegar for the lemon juice. I also put my butter/flour mixture in the freezer for about 15 mins before adding the liquids. The dough was pretty easy to work with considering my kitchen was an inferno. If you have a food processor the dough is such a breeze to put together. I'll never buy ready made crusts or look for another recipe again. Thanks Brian!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Z",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699815/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-30T22:57:48.967Z",
                "reviewBody": "I love to make pies and the crust texture and flavor is one of the most important parts to me & the filling is basic work. So I love to try all differnt crust recipes.  Being born in Ireland and this crust being different from usual I wanted to try this one.  I did change right away the nutmeg amount thinking it was a print error as I hadn't read the reviews just looked at the star rating.  Nutmeg is a very strong spice. I sprinkled cinnamon/sugar over the top crust and used a crust ring to prevent over browning. Placed a round cookie/pizza pan in the oven, preheated to 425 and placed pie on the sheet reduced to 350 after first 10 min.  I changed nutmeg to 1/4 teaspoon and that was acceptable for my taste.  This is more of a crumbly texture crust than flaky break apart one and I found that it had to much butter or oily texture, taste.  If I were to make it again I would use 1 1/2 sticks of butter and a 1/2 cup more flour and see if this would help take some of the greasyness out of the crust and give a more pleasing crumble,flaky texture and good taste.  This much butter/crisco makes for easy rolling and handling for beginner pie makers but not so good taste/texture. Great pie crusts and fillings take lots of practice with a delft (light,fast)hand,the coldest of just the right amount of ingredients. My little Grandaughter is 12 and just starting to practice making pies! Happy Pie Making to you all.  \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SYLVIAH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1337817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-25T09:54:16.56Z",
                "reviewBody": "Outstanding pie!! I cut back on the nutmeg and added cinnamon for my preference. The crust was outstanding!! I thought I had the perfect crust recipe but this one is better!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TCSTEFFEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1434246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:57:33.507Z",
                "reviewBody": "I used a frozen crust because I was short on time but the filling for the apple pie is great. Next time I'll make the crust too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "schmerna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/240/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T23:51:20.17Z",
                "reviewBody": "This pie was great and it was the first time I ever attempted something as difficult as an apple pie. The crust was amazing and looked beautiful coming out of the oven. The lemon juice had a great flavor to the pie. Would put in more cinnamon next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NIGHTSHADED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/668826/"
                }
            }
        ]
    }
]