[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18820/spinach-feta-casserole/",
        "name": "Spinach-Feta Casserole",
        "image": {
            "@type": "ImageObject",
            "url": "https://www.allrecipes.com/img/misc/og-default.png",
            "width": null,
            "height": null,
            "caption": "Spinach-Feta Casserole"
        },
        "datePublished": "2000-06-09T12:07:48.000Z",
        "description": "I use this as a main dish casserole, side dish or as an appetizer--whatever the occasion calls for. If you prefer, you may also add 1 can of rotel tomatoes to the cheese-spinach mixture for a little zing.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H35M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "2 (10 ounce) packages frozen chopped spinach",
            "8 ounces crumbled feta cheese",
            "2 cups shredded mozzarella cheese",
            "1 cup cubed processed cheese food",
            "1 cup melted butter, divided",
            "2 tablespoons distilled white vinegar",
            "½ teaspoon garlic powder",
            "salt and pepper to taste",
            "1 (16 ounce) package phyllo dough"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the spinach, feta cheese, mozzarella cheese, processed cheese food, 1/2 the butter, vinegar, garlic powder, salt and pepper. Mix well and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a layer of phyllo dough into the bottom of a lightly greased 2-quart casserole dish. Spread the spinach and cheese mixture into the dish and top with 4 layers of phyllo dough, spraying each layer with butter-flavored cooking spray. Drizzle the remaining butter over the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 425 degrees F (220 degrees C) for 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "ROMDI"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.176470588235294,
            "ratingCount": 68,
            "itemReviewed": "Spinach-Feta Casserole",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "547.7 calories",
            "carbohydrateContent": "31.8 g",
            "cholesterolContent": "108.4 mg",
            "fatContent": "37.7 g",
            "fiberContent": "1.7 g",
            "proteinContent": "18.6 g",
            "saturatedFatContent": "22.9 g",
            "servingSize": null,
            "sodiumContent": "1164.1 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-09-23T20:08:48.857Z",
                "reviewBody": "This was a great cheesy spinach in light pastry dish after following reviewers suggestions.  My changes were: didn't overdo the butter, used less than 2 tablespoon, brushed phyllo with butter , I'm thinking I will not even put butter on the bottom layer next time, it was a still a little too greasy, soggy for me (on the bottom (no one else complained),layered dough in between, didn't put spinach mixture to the edge of the dough so the browning was beautiful, used 3 cloves of sauteed minced garlic cloves instead of garlic powder, DID NOT use the processed cheese, yuck, only used 2 cups of mozzarella, and only used 8 oz of feta, 4 oz regular, and 4 oz low-fat feta to cut the calories, like you care at this point LOL.  Served at a large family gathering and young and old raved. Several family members took the measly leftovers home and had them for lunch the next day. 2 e-mails to me the next day were similiar- they had to guard their lunches from co-workers. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sojourner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1530724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-21T00:32:44.997Z",
                "reviewBody": "This recipe is easy and FABULOUS!  I cook for groups, and tried this on a group of twenty eight folks.  The recipe multiplied nicely, too.  I multiplied it to show for feeding 32, and made two large casseroles in my corningware casserole cooking pans.  It was all eaten except for two small pieces!  The only thing I did different than the original recipe is that I exchanged the process cheese food for the real medium cheddar cheese, per a suggestion from another reader.  The feta cheese amount is just right, and the whole thing got rave reviews from everyone who ate it.  This is an attractive dish.  Also, since I made it the night before our big luncheon, I just want to say it re-heats nicely without too much problem with the philo dough. So when I cooked it, I cooled it down, then covered it with foil then refridgerated it overnight.  I took it out of the 'fridge in the morning about two hours before I had to reheat it so it would come to room temperature. I turned the oven onto the same as the cooking temp (425 degrees) though a lower temp could easily be used.  I warmed it up for fifteen minutes or so.  Advice on reheating:  keep an eye on it as it is cooking - the philo dough got a little brown around the edges, but turned out just fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VEGGIEANGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1189373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-05T19:13:00.163Z",
                "reviewBody": "Yeah!  I followed the suggestions of previous reviewers and sauteed 3 cloves of garlic instead of using garlic powder, did NOT use the processed cheese and made a couple layers of spinach instead of just one.  I also used 20 oz of fresh spinach instead of frozen, an italian cheese mix instead of just mozzarella, and an egg wash in-between layers instead of butter.  In fact, I did not use any butter what-so-ever.  As for the phyllo, I wound up using half of a 16 oz package, randomly laying down layers, about 4 to 6 per layer.  And I have learned that phyllo can be very forgiving, so do not worry about small tears.  In the end, no one will notice, nor will they care since this is soooooo good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DC Girly Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/172956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-10T11:31:00.39Z",
                "reviewBody": "Great recipe. Delete the processed cheese in fact you can combine and add any cheeses that you like in this recipe and will still have a great dish. Suggest spraying a butter flavored cooking spray instead of butter on the phyllo dough. You will not be able to tell the difference and you will save alot of calories! I use this recipe all of the time now and continue to get raves. My family will ask me to bring this dish to all family gatherings!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROMDI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/114634/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-24T00:37:59.883Z",
                "reviewBody": "I have to say I wasn't thinking that this would be as good as it was. This was SO good. I used Munster cheese in place of the cheese product. I also sauteed a little bit of fresh garlic and onion with olive oil mixed that up with the spinach and then added it to the rest of the cheese. I used a LOT of dough. Layers and layers upon layers. Used NO butter. Lightly coated each layer of dough with egg. Put 5 layers on the bottom a bunch of the mixture 5 more layers some mixture a few more layers some mixture and 5 on top. YUM!! Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "freedumryde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3135619/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-23T17:13:14.03Z",
                "reviewBody": "This was quite good but I did change it a bit. The recipe is unclear re how much phyllo to use. It says 16 oz but then refers to 5 layers. There are 40 sheets in 16 oz. I used 8 oz (1 roll) with 10 sheets on top and 10 on the bottom. I substituted greek yogurt for the cheese spread ricotto would work fine too. As suggested I used fresh garlic (3 cloves) and 1/4 cup butter. With those changes it got rave reviews from both vegetarians and nonvegetarians.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "catherine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1162093/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-01T03:39:02.577Z",
                "reviewBody": "To make this dish actually edible try cutting the butter out of the recipe. My husband and I ate two bites each then just about threw up. Thing is I halved the butter called for and this dish was still swimming when pulled out of the oven. I suggest trying the recipe without the butter (except for the small amount you put on top just before going into the oven). This will cut down on the amount of fat by a tonne. Toodle-loo. -Tanstar",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "TANSTAR_THE_ROCKSTAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/465520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-11T20:31:30.543Z",
                "reviewBody": "This was VERY tasty. However not what I would consider a casserole. I recommend adding more layers of phyllo dough to the bottom and layering it inbetween the spinach. That would tone down the cheese and make it more substansial as a stand alone dish. This would also make a very good dip! It tasted great with some chips. I'm sure with the right bread it would be great too. We also took the butter down a notch and it tasted fine. Great recipe thanks so much for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chris Reed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/21014719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-11T11:56:09.327Z",
                "reviewBody": "There was way too much butter! I had to throw it away because no one would eat the greasy mess. My advice is to definitely halve the butter!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "ELI MOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/474193/"
                }
            }
        ]
    }
]