[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/106/appetizers-and-snacks/fruit/",
                    "name": "Fruit",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18842/my-own-famous-stuffed-grape-leaves/",
        "name": "My Own Famous Stuffed Grape Leaves",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4521063.jpg",
            "width": 3002,
            "height": 3002
        },
        "datePublished": "2000-06-09T21:08:19.000Z",
        "description": "These are grape leaves, stuffed with a tantalizing mixture of rice, fresh dill, mint and lemon. 'Yum' is the only one word to describe these. These can either be a main dish or an appetizer, depending on your appetite. Serve with good crusty bread and a Greek salad, if desired.",
        "prepTime": "P0DT0H40M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 cups uncooked long-grain white rice",
            "1 large onion, chopped",
            "½ cup chopped fresh dill",
            "½ cup chopped fresh mint leaves",
            "2 quarts chicken broth",
            "¾ cup fresh lemon juice, divided",
            "60 grape leaves, drained and rinsed",
            "hot water as needed",
            "1 cup olive oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large saucepan over medium-high heat, saute the rice, onion, dill, and mint for about 5 minutes, or until onion is soft. Pour in 1 quart of broth, reduce heat to low and simmer for another 10 to 15 minutes, or until rice is almost cooked. Stir in 1/2 of lemon juice and remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Take one leaf, shiny side down, and place 1 teaspoon of the rice mixture at the bottom (stem) end of the leaf. Fold both sides of the leaf towards the center, roll up from the broad bottom to the top, and place into a 4-quart pot. Repeat with all leaves, leaving no gaps as leaves are placed in pot (to prevent from opening while cooking). Sprinkle with remaining lemon juice and with olive oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour chicken broth over all to cover grape leaves. Cover pot and simmer for about 1 hour (do not boil, because this will make the stuffing burst out of the leaves). Remove from heat, remove cover and let cool for 1/2 hour. Transfer to serving dish and serve.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Fruit"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Patti Moschonas"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.435483870967742,
            "ratingCount": 124,
            "itemReviewed": "My Own Famous Stuffed Grape Leaves",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "302.6 calories",
            "carbohydrateContent": "30.9 g",
            "cholesterolContent": null,
            "fatContent": "18.7 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3.6 g",
            "saturatedFatContent": "2.6 g",
            "servingSize": null,
            "sodiumContent": "573.2 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-05-17T23:22:10.797Z",
                "reviewBody": "As a person of Lebanese heritage, I have tasted and cooked many stuffed grapeleaf recipes.  Most of them have meat, and I was looking for a vegetarian version.  I used a vegetable broth instead of chicken for this recipe.  This recipe was OUTSTANDING for flavor. I also added some toasted pine nuts.  My one suggestion is to make sure that the rice is undercooked before stuffing. I cooked it to long, and the final cooking time of one hour was to long for the rice.  It was kind of mushy.  But the flavor and texture (before the last cooking) was delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OZZIEBEAR2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1421965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T21:28:58.967Z",
                "reviewBody": "Wow!  These were great.  Just like you'd get at an expensive restaraunt, but only abuot $5 for everything!\r\nHere's some tips to make these come out better:\r\n1.  Add the Mint.  The recipe calls for mint, but never says to add it.  I added it at the sam time as the dill.\r\n2.  Use at least 3 grape leaves and 2+ Tbsp of stuffing.  I like my Dolma a bit larger than my pinky (the size you get when you follow the directions).  I arranged three leaves in a triangle, with their stems overlapping at the center, tips pointing out, and added about 2 Tbsp of rice mix right to the center.\r\n3.  Roll them tight, and make sure you're not overstuffing for the amount of leaves you use to wrap.\r\n4.  When you arrange them in the pot, if they are not pressed really tight together, they will float when you pour the broth over them.  The ones on the bottom will open up and the rice will come out.\r\n5.  Try them cold.  Refrigerate them overnight before serving.\r\n\r\n- Rick\r\nSan Diego, CA",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RICK WILKINSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/238997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T06:02:07.747Z",
                "reviewBody": "Patti, what a delicious recipe. The rice stuffing is absolutely wonderful. I had a problem with the grape leaves, though. They were tough and chewy no matter how long I simmered them. It was recommeded to me by a friend from Athens to pour boiling water over the leaves, let them sit for 5 minutes, drain and let them sit in a bowl of cold water before they are used. 10 seconds wasn't enough for mine. Maybe mine were fresh leaves. Also, my friend suggested to put a plate over the grape leaves as they simmer so that they don't fall apart. This was a lot of work and I ended up having to through it all away but I'm willing to try it again with these changes. I'll write a new review when I do this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELLECA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/47409/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T06:00:10.827Z",
                "reviewBody": "This is a really tasty recipe. If I serve it as a main course I add 1 lb of ground lamb a handful of pinenuts or pistachios a handful of dried cherries or cranberries and about 2 oz of crumbled feta cheese. The lamb has a considerable amount of fat in it so you can use half the amount of olive oil or eliminate it altogether. If you like Mediterranean and Middle Eastern Food you will love this recipe. Don't let the pot get too hot or your leaves will burst; I use flavorful basmati rice so I prefer the rice to be fully cooked before stuffing the leaves.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLADD01",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/717960/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-14T06:00:54.983Z",
                "reviewBody": "I've made these twice - once with ground veal and once without the veal & olive oil.  I like it without the veal and the olive oil.  I use jarred grape leaves from a speciality store so I don't have to cook them as long (but they aren't shiny green either).  I agree w/ Rick, for a main dish, I like my leaves bigger than the recipe directs.  To help keep them closed during the simmering, sqeeze the stuffed leaves w/ your hand before placing in the pot.  I crave these, they are so good!  Thanks Patti!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STACY D.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/54931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-28T03:21:49.187Z",
                "reviewBody": "Fabulous recipe!  A couple of changes: veggie broth instead of chicken, dried herbs (adjusyed quantities), a little parsley, and grape leaves from a jar.  It came out awesome.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K_ONION",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/915095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-16T17:47:38.333Z",
                "reviewBody": "these were great!. altho the rolling got abit tedious:P. i made a few changes simply because i didn't have exactly the ingredients on hand. i used instant brown rice which sped up the cook time of the rice mixture. i would simply reduce the amount of moisture to what the box requires for 2 cups. other wise you have to cook the extra moisture out. the brown rice gave it a bit nutty of a flavor which i really enjoyed. also i dont like mint. so i replaced the mint with parsley. i used dry herbs instead of fresh. i truly recommend giving the rolls and extra squeeze packing them tight as possible in the pot AND putting a plate on top to help them keep from busting.. really an easy impressive recipe. thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMMANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723128/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-05T20:28:02.467Z",
                "reviewBody": "I gave this recipe a 4 rather than a 5 as the rice mixture did not turn out quite as flavorful as in the local deli. Next time I may add more of the mint or dill, and perhaps some toasted pine nuts.  However, the method works perfectly if you follow directions exactly; (and yes, it DOES tell you when to add the mint; add it with the dill!) the rolled leaves stay intact if packed closely together in cooking pot. I actually crowded them a little. On the grape leaves; best bet is to buy Mazetta jar of grape leaves, they are quite large and work well.  You want the grape leaves pretty tender, so just cook them longer (we cooked ours about 2 hours on a very low simmer) if needed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Minda Hannenberg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/865162/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-28T17:09:42.257Z",
                "reviewBody": "This is an excellent recipe. For starters, the rice is awesome on its own!  When I made the stuffed grape leaves I added a handful of toasted pine nuts, and that gave it a bit of extra lift.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Good EatNZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/goodeatnz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-20T00:24:08.057Z",
                "reviewBody": "Wow. These were very time-consuming to make and they didn't even taste good. The smell when cooking these was awesome though! The #1 part of the instructions was basically to make soup. Way too much liquid. I can't say I've got any inclination to try this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Carly Urbanski Johnson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4176219/"
                }
            }
        ]
    }
]