[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/854/desserts/cookies/refrigerator-cookies/",
                    "name": "Refrigerator Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/10831/thin-mint-cookies/",
        "name": "Thin Mint Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5125043.jpg",
            "width": 1285,
            "height": 960
        },
        "datePublished": "1998-04-24T23:04:28.000Z",
        "description": "If you love chocolate and mint you are sure to love this homemade version of the Girl Scout Cookies.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "1 ¼ cups all-purpose flour",
            "½ cup unsweetened cocoa powder",
            "¼ teaspoon salt",
            "½ cup butter, softened",
            "1 cup white sugar",
            "1 egg",
            "½ teaspoon mint extract",
            "3 (1 ounce) squares semisweet chocolate, chopped",
            "¼ cup butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat 1/2 cup butter or margarine until creamy.  Add the sugar, and beat until mixed well.  Beat in egg and mint extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift flour, cocoa, and salt together into a small bowl.  Add flour mixture by halves into creamed mixture, beating well after each addition.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Divide dough in half.  On lightly floured surface roll dough into two 1 1/2 inch diameter cylinders.  Wrap each cylinder in waxed paper, and refrigerate 5 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).  Thirty minutes prior to baking, place both cylinders in freezer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove one cylinder at a time, and slice 1/4 inch thick pieces with very sharp knife.  Place on cookie sheets about 1 1/2 inches apart.  Bake 10 to 12 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1/4 cup butter or margarine and the semisweet chocolate in a double boiler or in the microwave.  Drizzle over warm cookies.  Place on wire racks, and let cool and harden completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Refrigerator Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lauren"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.153846153846154,
            "ratingCount": 91,
            "itemReviewed": "Thin Mint Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "175.3 calories",
            "carbohydrateContent": "21.7 g",
            "cholesterolContent": "30.7 mg",
            "fatContent": "9.8 g",
            "fiberContent": "1.3 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "91.3 mg",
            "sugarContent": "13.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-14T02:09:32.45Z",
                "reviewBody": "Unbelievable!  This tastes exactly like Thin Mints (Girl Scout version)!  Just make sure you slice the cookies thin enough in order for them to harden.  I changed the recipe a little by using Andes Creme De Menthe Chips (2 oz.) and Semi-Sweet Chocolate Chips (1 oz.)  for the coating.   Also, I didn't chill mine as long as the recipe says to.  I chilled for about 1 1/2 hours and then transferred to the freezer for the 30 minutes before baking.   These are delicious and I will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENBON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/604951/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-21T16:25:30.64Z",
                "reviewBody": "I had to give this recipe three stars because of the chocolate coating.  I followed the recipe exactly and it hardly had any minty flavor since most of it got cooked out while in the oven.  The chocolate coating never fully hardened so the cookies HAVE to be refridgerated at all times or else the coating gets soft at room temperature.  After my first batch I modified the chocolate by adding the additional two (1 ounce) chocolate squares from the box, a tablespoon of mint extract, and some additonal hershey dark chocolate mini's.  I think the problem was in the butter that was added... butter doesn't solidify well at room temp.  Maybe less butter next time... or perhaps substitute with a small amount of crisco?  After the modifications, the cookies tasted wonderful and adding mint to the chocolate makes a HUGE difference!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Renee Ercol",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/709937/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-16T00:25:37.07Z",
                "reviewBody": "These were great-much better than the Girl Scout cookies! I ommitted 1/4 cup of flour and they were the perfect consistency. I didn't refridgerate them for as long as the recipe says; just an hour and they were fine. I dipped the tops of the cookies in melted semi-sweet chocolate chips (about half the bag) and added about 1/3 tsp of mint extract to the melted chocolate which I think really helped with the minty taste of the cookies. Also did not add the butter to the melted chocolate...didn't think it was really necessary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chelsea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3008184/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-12T18:51:54.857Z",
                "reviewBody": "After our cookie sales had ended, I gathered our GS troop for this homemade version.  I had some cookies prepared in stages, so the girls could do each part of the process.\r\nWe then did a taste test of the GS cookie and our own, all the girls voted that they preferred the homemade version!  10 thumbs up!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIT_BUDDY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/277346/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T04:07:05.437Z",
                "reviewBody": "My family went crazy over these delights. After freezing I sliced dough on my electric food slicer to achieve perfect consistent thickness.Instead of drizzling chocolate I dipped cookie face down into chocolate melted in top of double boiler (had to triple the recipe to have enough)Cookies are firm enough to handle with tongs. End result is near perfect match to Girl Scout version only better.Well worth the time. Chocolate lover's dream! Keep refrigerated.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Aunt Mikie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-10T20:00:30.827Z",
                "reviewBody": "I have to disagree with some reviews my cookies were amazing! I had read that they were dry so I just omitted the 1/4 cup of flour and they are super flavourful. Nice chocolate minty goodness. Woohoo",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROCKSTARLOVIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2095831/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-06T18:50:25.92Z",
                "reviewBody": "Maybe I expected too much because of the prior reviews but I thought the texture just was too chewy they were too minty and the chocolate was too sticky. The mint wasn't quite the right flavor or same flavor of mint that the Girl Scouts seem to use. These may be \"Thin Mint Cookies\" but they certainly aren't close to the Girl Scouts version. I followed the recipe to the letter. Doubt I will ever make these again but may try to see about fixing it somehow.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "PHONETEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1316866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-06-03T21:11:12.703Z",
                "reviewBody": "YUMMY",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RYERYE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1109081/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-29T02:56:03.253Z",
                "reviewBody": "I wish I would have read more of the reviews before doing this recipe - especially given how time-consuming it is. Part way through I started to wonder if it was worth the money savings to make these at home versus coughing up the 3.50 a box and supporting the girl scouts. The cookie dough was about as easy to work with as partially dried out playdough. I ended up adding about 1/2 c. of water and they were still too dry. Then you chill them then you cut them then you smash them back together because they crumbled apart when you cut them. Then you bake them then you dip them in chocolate that refuses to re-solidify at room temp because of the butter mixed with the chocolate. The result was a very small batch of extremely labor-intensive cookies that were not nearly minty enough (the mint volatilizes during baking and you lose most of the flavor) and is messy to eat. I will give this another shot BUT: I will add 1/2 c to 3/4 c milk/water to the dough and double the mint extract. I will scoop out the dough with a teaspoon measure and flatten them with floured hands rather than going though all the chilling/cutting/time. I will also add 1 t. mint to the melting chocolate and not add any butter. If the chocolate you are using is firm at room temp then it will return to firm at room temp as long as you don't add too much to it. I don't think adding 1 t. of liquid mint will affect this. I will report back. If this doesn't work my money will continue to go to the girl scouts",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "LORIKAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1433571/"
                }
            }
        ]
    }
]