[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20917/egg-and-hash-brown-pie/",
        "name": "Egg and Hash Brown Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2991529.jpg",
            "width": 2448,
            "height": 2449
        },
        "datePublished": "2000-06-18T04:39:12.000Z",
        "description": "Not only is this casserole easy to make and great tasting, it's pleasing to the eyes with it's shades of golden brown, yellow, and green. This dish is great served with sliced fruit and toast or muffins. You may substitute chopped cooked ham for the bacon if you wish.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "6 slices bacon",
            "5 eggs",
            "½ cup milk",
            "3 cups frozen hash brown potatoes, thawed",
            "⅓ cup chopped green onions",
            "1 ½ cups shredded Cheddar cheese, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble, and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 7x11 inch baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat together the eggs and milk. Stir in the bacon, hash browns, green onions, and 1 cup shredded Cheddar cheese. Pour into the prepared baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven 25 to 35 minutes, or until a knife inserted in the center comes out clean. Sprinkle the remaining Cheddar cheese on top, and continue baking for 3 to 4 minutes, or until the cheese is melted. Remove from oven, and let sit 5 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "HSTR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.389473684210526,
            "ratingCount": 285,
            "itemReviewed": "Egg and Hash Brown Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "223.4 calories",
            "carbohydrateContent": "12 g",
            "cholesterolContent": "147.3 mg",
            "fatContent": "17 g",
            "fiberContent": "1 g",
            "proteinContent": "13.5 g",
            "saturatedFatContent": "8 g",
            "servingSize": null,
            "sodiumContent": "360.9 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-01-01T19:20:49.91Z",
                "reviewBody": "This recipe is wonderful, but you can take it to another level by increasing ingredients and cooking it in your crockpot over night.  Increase potatoes to 32oz bag (cubed hashbrowns), 12 eggs, 3 cups shredded cheese, 1 cup milk, 1/2 cup chopped onion, 1/2 cup chopped green pepper and 1 cup or more of ham, sausage, bacon, canadian bacon, any combination you want.  Cook in your slow cooker for 10 to 12 hours.  You can add just about anything to this recipe and it is done when you wake up in the morning.  The Smart Crockpot cooks too hot, so if using this cooker, reduce cooking time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1754394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-10T14:02:58.687Z",
                "reviewBody": "We made this last weekend with a few modifications and other reviewers' suggestions.  I browned the hash browns in some butter with the green onions, fresh garlic and cut-up bacon.  I put this in the bottom of the pan and poured the egg mixture on top (added some Lawry's Seasoned Salt to the egg mixture, too).  I also used Kraft Mexican cheese with peppers in place of the cheddar.  It was fantastic - got rave reviews from my family - even the picky eaters!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THELBERG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thelberg/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-22T16:25:42.48Z",
                "reviewBody": "This is my favorite \"quickie\" breakfast! I do change it up a bit. I add 1 cup of chopped spinach. I also take canned flaky biscuits and press them into muffin tins. Fill with the mixture and bake. When done, I let them cool, then package individually in quart freezer bags. Then I have breakfast muffins ready to go at a moments notice! YUMMY!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gmcbiker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2062069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-23T04:55:45.39Z",
                "reviewBody": "Glad that you are enjoying my recipe.Thanks for all reviews! Some of you are right this is a basic recipe...as it was meant to be. BUT, it is a starting point as all recipes are for you to tweak to your own taste. We (my family) as I was growing up used this, adding many variations to it. My father loved spicy & hot -- so he used hot sausage and bacon/ adding 1 cup of diced each red peppers and green peppers that he lightly sauted first. We also served it with mushrooms, spinach, water chestnuts and also added lots of ham. Get creative -- make it to suit yourself and your family. Sometimes I just like it the basic recipe eating it with crousants or toast, OJ and some kind of fresh fruit..I hope you enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AnnM.H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721393/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-20T14:57:08.123Z",
                "reviewBody": "This was pretty bland and dry.  I made it again and browned the hash browns in butter with a little oil adding garlic salt and pepper.  I put the hash browns on the bottom of the baking dish, combined the remaining ingredients adding salt and pepper to taste and then poured over the hash browns.  It had more taste and using the hash browns as a 'crust' with the butter added seemed to really help with the dryness.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Wilemon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/536781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-19T13:59:27.793Z",
                "reviewBody": "This was great with my alterations taken from other reviewers. I sauteed the hashbrowns with the white of the green onion fresh garlic seasoned salt salt pepper and butter and put in the bottom of the pan. I used ham AND bacon and some dry mustard in with the egg green onion and cheese mixture. Looked beautiful and tasted great - lots of flavor!! Made it this morning for Father's Day and my husband and children loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHITNEYB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/408054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-28T17:09:31.627Z",
                "reviewBody": "My family loved this - especially my daughter who normally does not like \"mixed\" food. I modified it by cutting up the bacon in the frying pan with half an white onion chopped. I took out the onion and bacon but left in the grease and added a little more oil browning the shredded hash browns until golden outside. I added about 8 slices of deli ham to the bowl and mixed together the onion meats and browned potatoes adding dried parsley and S&P. I also added dry mustard and about five shots of hot sauce to the egg mixture. I spread the potato/meat mixture in a greased casserole dish spread cheese over this and then poured the egg mix over all. Baked for 20 minutes at 350 degrees then turned off heat and left it in for another 5 minutes so it would stay tender. I put the little bit of leftovers in the fridge to heat for one more before-school breakfast. I also think this would work for the leftovers to be chopped up and heated put in warm tortillas and topped with salsa and some more cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROBINBRADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/407203/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-02T02:26:30.443Z",
                "reviewBody": "Great recipe!  You can mix it all up the night before and bake in the morning, add 5-10 minutes extra baking time.  It also freezes well (uncooked).  Thaw in fridge and bake- again give extra baking time.  I usually use whatever breakfast meat and cheese I have on hand to make it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/390516/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-23T04:40:58.34Z",
                "reviewBody": "This was a great dish. I made it for a Church Brunch. I doubled the recipe and needed to increase the cook time by 30-45 min. It turned out wonderful and people even asked for the recipe. Thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/583266/"
                }
            }
        ]
    }
]