[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/152/breakfast-and-brunch/potatoes/",
                    "name": "Potatoes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21314/kielbasa-and-potato-bake/",
        "name": "Kielbasa and Potato Bake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3575305.jpg",
            "width": 4128,
            "height": 2322
        },
        "datePublished": "2000-06-18T03:05:19.000Z",
        "description": "An easy variation of the now classic brunch potato bake that includes a very tender Kielbasa.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H30M",
        "totalTime": "P0DT1H45M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "2 cups milk",
            "1 tablespoon minced garlic",
            "1 teaspoon salt",
            "½ teaspoon ground black pepper",
            "1 pound kielbasa sausage, sliced thin",
            "4 large russet potatoes, peeled and cubed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, mix together soup, milk, garlic, salt, and pepper. Stir in potatoes and kielbasa. Spoon into a 7x11 inch casserole dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place casserole on a baking sheet, and bake in the preheated oven for 90 minutes, or until potatoes are tender.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Potatoes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Geneva"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.158783783783784,
            "ratingCount": 296,
            "itemReviewed": "Kielbasa and Potato Bake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "351.7 calories",
            "carbohydrateContent": "33.3 g",
            "cholesterolContent": "42.3 mg",
            "fatContent": "19.1 g",
            "fiberContent": "1.9 g",
            "proteinContent": "12 g",
            "saturatedFatContent": "6.6 g",
            "servingSize": null,
            "sodiumContent": "1363.9 mg",
            "sugarContent": "6.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-09T00:53:55.27Z",
                "reviewBody": "This recipe gets high marks for idea, but low marks for flavor without some tweaking. I was tired of the standard potato/ham casserole and was looking for new ways to use turkey smoked sausage or kielbasa, so I gave it a try. I read previous reviews and incorporated some of other reviewer's ideas and some of my own. What we came out with was a winner, but as written I think the recipe would have been a bland potato stew. I used three medium sized russet potatoes peeled and sliced 1/8\" thick. One can of Healthy Request Cream of Mushroom soup and one full can of skim milk. I sauteed the sliced kielbasa, 1 cup of chopped onion and one chopped red bell pepper with the garlic in a little oil, and added 1/4 tsp of cayenne pepper to the mixture. Once the kielbasa was lightly browned to bring out the flavor I mixed it in the bowl with the potato slices which I'd parboiled for 8 minutes and drained and the soup mixture. Spread that into a 2 qt casserole dish sprayed with cooking spray, baked for 50 minutes, then sprinkled a cup of medium cheddar cheese on for another five minutes until melted and bubbly. We got a terrific dinner casserole and leftovers that we can reheat for a weekend breakfast! This recipe needed less milk, more spice, and the creamy added texture of the melty cheese. Once I added these things to the mix it was a great casserole that we'll repeat!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jewel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1509803/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-27T15:50:54.267Z",
                "reviewBody": "Okay, my last review was incomplete (my changes didn't post!), so I'll update it. :) First things first: OMIT THE SALT! You can add some if you need it, but it's hard to remove salt from a recipe once added! I used a can of mushroom soup, 3/4 can milk, about 1/3 cup sour cream, maybe ½ tsp garlic powder, several shakes of pepper, a can of mushrooms, ½ a small onion, and maybe a cup of frozen peas. I pan-fried the sliced sausage up with the mushrooms and the onion, and I preboiled the potatoes for about 10 minutes. I topped the entire thing with a few shakes of parmesan and maybe a cup of cheddar cheese. Since I preboiled the spuds, the baking time was only around 40 minutes. Very tasty! Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Duckball",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241884/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-05T18:32:32.09Z",
                "reviewBody": "Wonderful recipe and kid friendly too! I used fresh garlic and followed the recipe exactly except I used beef link sausage instead of kielbasa. I can't imagine why some people felt it was \"soupy\". Did they maybe cover it with foil? And bland? NO WAY! I did place it on a foil-lined cookie sheet because I knew it would boil over and it did. But mmmm... the potatoes turned out perfect (firm, not mushy) and the top browned over beautifully. The sauce is creamy and delicious. It got a thumbs up from my entire family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Buckley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/909958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-25T22:30:32.327Z",
                "reviewBody": "My Polish husband loved it...even wants me to give the recipe to his mother! Made a few modifications to improve it. Cut the potatoes into small cubes, about 1/2\". I added about a cup of sour cream to the soup mixture. Also used one clove of fresh garlic rather than garlic salt or powder. Topped with lots of grated cheese. This was awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAHBECKY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/702648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-09T06:38:11.043Z",
                "reviewBody": "This recipe was great!! We had NO leftovers!! :(\r\nI can't understand the reviewers who said they had to bake for longer. How big were your cubes?? Try thin slicing the taters next time. And too much garlic??? Are you people nuts?? Next time I'm adding MORE garlic!! I think that I'll probably add onions too, and perhaps cheese topping the last 15 minutes of baking! Thanks Geneva for sharing this great recipe with us! It's a keeper at this house!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PIXIEBERRY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-14T13:28:33.943Z",
                "reviewBody": "I have been making this for years now, only we use cream of celery soup rather than cream of mushroom.  Other than that, the only difference is I slice my potatoes, although cubing them is probably easier and I top with cheddar the last few minutes of baking.  \r\nI serve for dinner all the time with bread and salad and my 13 month old loves it, she can't get enough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-18T12:18:32.623Z",
                "reviewBody": "I was really on the fence on how to rate this recipe.  Out of fairness, I changed the recipe quite a bit the first time trying it after reading other reviews referring to the bland flavor.  Because my family does not eat mushrooms I used cream of celery soup.  I used potatoe slices, and I also added a cup of cheddar cheese to the mix and then another 1/2 cup to the top for the last 15 minutes of baking.  I also fried the garlic with the kielbasa which I think helped the flavor.  I also added some french fried onions to the top of the casserole with the cheddar cheese at the end.  I would HIGHLY recommend not adding any salt to this recipe as I did not and it still was salty enough.  I only added 3/4 soup can of milk and it was plenty.  After all these changes, I must say this casserole turned out AWESOME!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie Velez-Kirk",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/luxury010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-17T23:50:51.017Z",
                "reviewBody": "I made quite a few variations.  I used 3/4 can milk as recommended in reviews.  I browned the sliced kielbasa with minced garlic and half a sliced onion.  After I removed from pan, I deglazed the pan with a splash of white wine and added that to mix.  I scalloped my potatoes instead of cubing and cooked for 45 min.  I added grated cheese over half the casserole (in case I didn;t like it) in the last 5 minutes of baking and it was sooo much better with the cheese.  I also omitted salt and found it was perfectly salty on it's own.  I want to try this in the slow cooker.  It was good, I thought it would be better than it was though. I think if I make it again, I will add sauerkraut.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "3PinkPetunias",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2101649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-07T17:53:57.483Z",
                "reviewBody": "Wonderful flavors! It looked a little odd when I started baking it. However, the aroma and finished product is to die for! It is creamy and definitely a comfort food. Can be a little salty though. Be careful of that! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie Durfee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/365441/"
                }
            }
        ]
    }
]