[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/819/desserts/pies/pumpkin-pie/",
                    "name": "Pumpkin Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12141/moms-pumpkin-pie/",
        "name": "Mom's Pumpkin Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1054478.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1998-04-28T17:54:39.000Z",
        "description": "This is the pumpkin pie that my mother has made for years. It is a rich pie with just the right amount of spices.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "1 recipe pastry for a 9 inch single crust pie",
            "3 eggs",
            "1 egg yolk",
            "½ cup white sugar",
            "½ cup packed brown sugar",
            "1 teaspoon salt",
            "½ teaspoon ground cinnamon",
            "½ teaspoon ground nutmeg",
            "½ teaspoon ground ginger",
            "¼ teaspoon ground cloves",
            "1 ½ cups milk",
            "½ cup heavy whipping cream",
            "2 cups pumpkin puree"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine eggs, egg yolk, white sugar and brown sugar. Add salt, cinnamon, nutmeg, ginger and cloves. Gradually stir in milk and cream. Stir in pumpkin. Pour filling into pie shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for ten minutes in preheated oven. Reduce heat to 350 degrees F (175 degrees C), and bake for an additional 40 to 45 minutes, or until filling is set.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Pumpkin Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jim Wright"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.444117647058824,
            "ratingCount": 340,
            "itemReviewed": "Mom's Pumpkin Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "344.7 calories",
            "carbohydrateContent": "44.3 g",
            "cholesterolContent": "119.4 mg",
            "fatContent": "16.5 g",
            "fiberContent": "2.8 g",
            "proteinContent": "6.6 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "610.9 mg",
            "sugarContent": "30.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-02T17:38:11.107Z",
                "reviewBody": "I rated this 5 stars because my husband said it was the best pumpkin pie he's ever had.  I reduced the milk to 1 cup, and also made my own pumpkin puree - not hard, ladies!  Get a pie pumpkin, remove the seeds, cut it up into 6 or 8 chunks, place it in a pan with 1/2\" of water, cover with foil and bake at 375 degress for about an hour, or until a knife slides easily into the flesh.  Let cool, and scrape the pumpkin away from the rind.  Mash it up as best you can, then take other's advice and put the puree into a colander and let it drip into a bowl (cover the whole thing with plastic wrap and set it in the frig overnight). This should help avoid having such a watery pie like many have encountered.  Also, once I combined the pie filling ingredients, I ran it all through my blender to smooth it out.  The end result was an incredibly silky texture... This is not a dense, orange pie like you get from a can. Much lighter in color and more delicate. (A little more spice probably wouldn't hurt.) Consider decreasing your oven temp by 15 degrees & baking a little longer till the center sets up. Your crust will thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "luv2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1607149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-06T17:27:48.187Z",
                "reviewBody": "I made this recipe for my in-laws, My father in law is an old fashion pie lover.  His Mother used to make the best pies (so I have been told)!  Well No one has ever been able to recreate that twinkle in his eye like his mom used to get when he hate her pies, Until now!  He loved it so much that he requested I make more so he can take them home and keep them in the freezer so he can have a taste whenever he wants!  He said it was just like how mom used to make, with tears in his eyes!!  VERY WELL DONE RECIPE!!!! VERY MUCH ENJOYED, will use again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HollyBerrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1530643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-30T18:29:40.39Z",
                "reviewBody": "This recipe has become a favorite for my family and friends.  I make about 30 pies between October and November as friend from pumpkin patches send white pumpkins my way!!!  I think I finally perfected it this year...this recipe does make 2 pies and the secret in using fresh pumpkin is in how that is prepared.  After making the puree put it in a collender lined with coffee filters set in a bowl and wrapped with plastic wrap for 24 hours before attempting to make pie.  This will keep pie from becoming soggy and will cook in the time given in the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lesa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1578666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-09T07:43:33.717Z",
                "reviewBody": "ABSOLUTELY UNBELIEVABLE!!!! I made this pie today for mother's day and my mom went nuts! She said it tastes just like the one my grandma used to make for her when she was a little girl! I did change a few things though. I added one teaspoon of cinnamon instead of 1/2 a teaspoon I only put in 1/2 cup of 1% milk instead of 1 1/2 cups and I bought only the regular whipping cream not the \"heavy\" whipping cream. I added about three TBL extra of whipping cream before I poured it in the pie shell because it looked like it needed a little more liquid. I also added one full 15 ounce can of pumpkin and then another 1/2 cup from another can... I baked it according to the time given in the directions let it set at room temp for a few hours then refrigerated it for a few hours and it was DELICIOUS!!!! I couldn't stop eating it!!!! Will definately make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DakotaS20",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/605493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-16T16:42:34.397Z",
                "reviewBody": "Quite delicious but needed a few changes. I also made my pumpkin puree from scratch (baked and pureed pumpkin the day before and drained it overnight in the fridge). I also reduced the milk to 1 cup and even with adding about 1.5x the spices listed it still seemed like it needed a little more. Next time I'll definitely at least double the spices but this recipe makes a very good base to start with to temper to your own tastes. Highly recommended with the butter crust off of this site!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "STARBUCKJB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/782035/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-28T02:01:15.123Z",
                "reviewBody": "I followed the recipe exactly and my whole family loved it. I used fresh pumpkin puree. I cut pie pumpkins in half and scoop out the seeds and goop with a grapefruit spoon - that seems to work out pretty well. Then place on a foil lined baking sheet and place the pumpkins cut side down. (I use a little bit of Pam so they don't stick). Then I completely cover the pumpkin with foil and put in a 350 degree oven for about an hour. However some people say they can get two cups of puree from one pumpkin but I seem to only get one so I have to do two pie pumpkins. After they have roasted I scoop the pumpkin out of the shell and then throw them in the food processor to make the puree smooth and creamy. I've found out after experimenting I don't need to strain it I think the roasting keeps the pumpkin from being too watery as opposed to steaming which I think makes for the watery pies I've heard people complain of. But thanks for the recipe this one is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jerseygirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2076575/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-26T17:07:32.313Z",
                "reviewBody": "I made this and several other pumpkin pie recipes for Thanksgiving, this one was declared the favorite.  My original feeling about it was that it was a little too sweet, but I was voted down.  I might cut the white sugar by half next time, though.  I would also make sure you either have an extra crust or some oven-proof bowls, it was way too much filling for even my 9\" deep dish crust.\n*Used this recipe again this year, and followed it exactly.  Either I didn't do it right last year or my tastes have changed, it's delicious!  It still makes enough for two pies from each batch, but everyone loved them, so they disappeared VERY quickly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookiemomster1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/938507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-08T03:59:26.217Z",
                "reviewBody": "This pie was amazing. I've been making pies from a can since I was a kid and I had a pumpkin leftover from Halloween and had guests coming over for dinner so I thought what the heck and made the pumpkin puree myself. One thing to keep in mind is that it the filling made with homemade pureed pumpkin is much more watery than a canned pumpkin pie so don't be surprised when you put it into the pie crust. I accidentally spilled a good portion of it out of the shell but that ended up being a good thing since it took awhile to cook. I would suggest making a thinner pie rather than deep-dish with this recipe so that the crust won't burn by the time the filling sets up (took about an hour with filling that was maybe 1 1/2 inches thick) and the filling will rise a bit so it won't be thin in the end. I did have maybe 1/3 of the filling leftover after I filled my crust so I threw it in a loaf pan and baked it separately to make a pumpkin custard. I followed the suggestion of another reviewer and drained the puree in a colander lined with coffee filters overnight which yielded at least a cup of water which would have made the pie soggy so I'm glad I did that and would suggest it to another who wants to make this pie from scratch. The end result was the absolute best pumpkin pie that I've ever had. Wasn't difficult but was time-consuming but definitely worth the effort.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SilverLakeLisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1591728/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-24T21:35:48.097Z",
                "reviewBody": "With all the positive reviews I was disappointed with the end product. Used homemade pumpkin puree. Sorry to say it was a waste of time. The pie was edible but NOT as a pumpkin pie. Very little pumpkin taste and too many spices. Filling is very runny (even after I used less liquid.....) however it did thicken up nicely. I have to mention the color: not very inviting. I won't be using this recipe again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Medendorp-Scholte",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/633323/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Mom’s Pumpkin Pie",
            "description": "This rich, 5-star pumpkin pie is simply the perfect Thanksgiving dessert.",
            "uploadDate": "2012-11-02T21:17:32.463Z",
            "duration": "PT2M11.999S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb2ea6387-4e7a-40d8-b151-5844487484ed%2F0a16a1ca-dd0a-4e1e-a751-88c2fc2a0d85%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1942753427001"
        }
    }
]