[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
                    "name": "No-Bake Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12959/desserts/pies/no-bake-pies/peanut-butter-pie/",
                    "name": "Peanut Butter Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/18423/double-layer-chocolate-peanut-butter-pie/",
        "name": "Double Layer Chocolate Peanut Butter Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7642943.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-07-04T17:04:08.000Z",
        "description": "This is a very easy pie to whip up, tastes great, and always a favorite with children and adults alike!",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT4H20M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "½ (8 ounce) package cream cheese, softened",
            "1 tablespoon white sugar",
            "1 tablespoon cold milk",
            "1 cup peanut butter",
            "1 (8 ounce) container frozen whipped topping, thawed",
            "1 (9 inch) prepared graham cracker crust",
            "2 (3.9 ounce) packages instant chocolate pudding mix",
            "2 cups cold milk",
            "4 peanut butter cups, cut into 1/2 inch pieces"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix cream cheese, sugar, 1 tablespoon milk and peanut butter until smooth. Gently stir in 1 1/2 cups of whipped topping. Spread mixture on bottom of pie crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a second bowl, stir pudding mix with 2 cups milk until thick. Immediately stir in remaining whipped topping. Spread mixture over peanut butter layer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Scatter peanut butter cups over top of pie. Cover and refrigerate for 4 hours.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "No-Bake Pie Recipes",
            "Peanut Butter Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "R Johnson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6371681415929205,
            "ratingCount": 226,
            "itemReviewed": "Double Layer Chocolate Peanut Butter Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "648.3 calories",
            "carbohydrateContent": "65.6 g",
            "cholesterolContent": "20.9 mg",
            "fatContent": "37.6 g",
            "fiberContent": "3.7 g",
            "proteinContent": "14 g",
            "saturatedFatContent": "14.6 g",
            "servingSize": null,
            "sodiumContent": "802.7 mg",
            "sugarContent": "44.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-06-13T15:38:22.263Z",
                "reviewBody": "I've made this recipe twice so far.  The first time I made it as is and it was very \"loose,\" even after refrigerating overnight.  The second time I used one cup of milk and one cup of heavy cream to mix with the chocolate pudding, rather than just milk.  My hand-mixer got bogged down a little bit, but the heavy cream gave the chocolate layer a much better consistency...more like a cheesecake.  Although the taste was awesome the first time, having a stiffer consistency the second time around made the taste even better.  I also topped the pie with whipped topping the second time.  I think that breaks up the richness/heaviness of the pie a little and also makes it looks much better.  Guests told me that they've bought peanut butter pies that weren't as good as this one.  I don't care much for peanut butter, but I just finished off the pie while writing this review!  AWESOME!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "THOUGH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/453288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-04T03:31:45.653Z",
                "reviewBody": "I have no idea where my mind was the evening I made this pie, but what could have been a total disaster came out just fine.  First mistake.  I used the whole 8 oz of cream cheese.  Not to worry! I spread the mixture not just on the bottom of the pie crust, but up the sides as well, then reserved the remaining mixture.  Second mistake.  I knew I had chocolate pudding, so, I poured the 2 cups of milk into the measuring cup, got the pudding, only to discover it was Cook & Serve, not instant.  After looking at the clock, realizing the stores were closed and saying a few choice words my momma never taught me, I decided to try something.  I drank a quarter cup of milk (yes, I poured it into a glass first) then filled my measuring cup back to the 2 cup mark with chocolate syrup, and used 2 boxes of instant vanilla pudding. Then I took 3 of the 4 peanut butter cups (I ate one with my quarter cup of milk) took my frustration out on the peanut butter cup by chopping them up pretty small, mixed them with the reserved mixture and put spoonfuls on top of the pie. I held my breath when I served it at a dinner, and everyone raved about the pie.  I mean a good rave. My husband said it was one of the best mistakes I had ever made, so I am sure the pie, made the way it should be, would be excellent, because this was.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARB MAXWELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/492841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-15T00:21:23.437Z",
                "reviewBody": "This pie was very delicious and you can't take just one bite of it! The only reason I rated it a 4 was because the peanut butter layer had too strong of a cream cheese taste. Next time I might add more p.b. or use a lighter cream cheese. Definitely try this recipe out!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KENDRA_07",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/854588/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-25T12:46:54.12Z",
                "reviewBody": "This was so easy & it is so delicios! (But I must warn you all that it is a bit on the rich side)...I followed this recipe exactly except that I used 1 cup of milk & 1 cup of half-and-half to make the chocolate layer. This helped it be more custard-y & a little less like just plain-old-chocolate-pudding. Love this recipe...will make again!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CookinginFL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2181101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-28T07:44:44.263Z",
                "reviewBody": "Very good pie...was gone in less than 2 days! I added chopped chocolate-peanut butter cups on top of the peanut butter filling then mixed chopped chocolate-peanut butter cups in with the pudding mix on top. Would probably be good with crunchy peanut butter too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Martie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/martie/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-30T15:26:52.463Z",
                "reviewBody": "Very Rich!!!. I made the recipe as is with just a few small changes. I made this in a springform pan with an crushed oreo base (I crush oreo's and add butter to help them stick together). Next I spread on the peanut butter layer. I forgot to add the sugar in this layer but I didn't misss it. I then stuck an oreo half in the peanut butter layer all the way around the inside edge of my springform pan. Next I layered on the chocolate layer. I used whole milk and my pudding mix was REALLY thick. I stuck these layers in the freezer for about 30min to allow everything to set well. I topped the pie with whipped cream and sprinkled crushed oreo's on top. This made for a very rich dessert with a nice presentation. I didn't have 4hours to let this sit in the fridge before serving it so I put it in the freezer for about an hour and it setup nicely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ceb00a",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2993719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-31T20:00:38.423Z",
                "reviewBody": "Something is terribly wrong with this recipe. I used exactly what is called for in the ingredients list. After spreading the creamed mixture into the 9\" pie crust there was very little room left for the pudding topping. I went ahead and proceeded with the directions anyway and sure enough the pudding mixture would not fit on the pie. In desperation I put everything in the fridge and hopefully will be able to scoop the rest of the pudding on top of the pie once everything sets. I even double checked the size of the pie crust and it was 9\" as stated on the label. I don't know how all of you got everything to fit in your pie crusts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Charlee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2290904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-29T07:21:33.06Z",
                "reviewBody": "I finally had to give some of this pie away because I kept heading to the fridge for a slice! I also used cream instead of milk and the pie had a fabulous consistency. I made homemade whipped topping with the remainder of the cream and piped it around the edges of the pie. I then melted chocolate and drizzled it over the whipped topping. For a finishing touch I sprinkled it with Reese's Peanut Butter Dessert Topping (which consists of chocolate sprinkles and tiny chocolate and peanut butter chips). I omitted the chopped peanut butter cups. This pie looked like a professionally made one and tasted better. I can't say enough great things about it! The person I gave the pie to was a little down at the time and when I asked him if there was anything I could do he said \"Just keep making peanut butter pies!\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Wiley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2405207/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-27T09:41:47.89Z",
                "reviewBody": "My husband and children cannot get enough of this! I use more chopped up Reese's cups on the top than it calls for and occasionally mix a few of them up in the chocolate layer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYTHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/37701/"
                }
            }
        ]
    }
]