[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/151/breakfast-and-brunch/pancakes/",
                    "name": "Pancake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21014/good-old-fashioned-pancakes/",
        "name": "Good Old Fashioned Pancakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F05%2F07%2FGood-Old-Fashioned-Pancakes-2000.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2000-08-01T21:53:33.000Z",
        "description": "This is a great recipe that I found in my Grandma's recipe book. Judging from the weathered look of this recipe card, this was a family favorite.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "3 ½ teaspoons baking powder",
            "¼ teaspoon salt, or more to taste ",
            "1 tablespoon white sugar",
            "1 ¼ cups milk",
            "1 egg",
            "3 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Pancake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "dakota kelly"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.557230469421677,
            "ratingCount": 17447,
            "itemReviewed": "Good Old Fashioned Pancakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "158.3 calories",
            "carbohydrateContent": "21.7 g",
            "cholesterolContent": "37.7 mg",
            "fatContent": "5.9 g",
            "fiberContent": "0.6 g",
            "proteinContent": "4.5 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "503.6 mg",
            "sugarContent": "3.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-05-23T14:52:53.233Z",
                "reviewBody": "It kills me how people go in and mutilate a perfectly good recipe. Then you have bad reviews and more mutilations. I read these reviews and decided I'd make the recipe just as it calls and I recommend not changing a thing (except maybe adding 1/2 tsp of vanilla to your egg mixture). I DO recommend sifting the flour, twice. That makes for a fluffier pancake. Let your egg and milk set at room tempurature and use unsalted butter. Beat your egg, add the melted butter and beat lightly until blended, then lightly beat in your milk (careful not to overbeat your egg). Add to your dry mixture. Your result is a fluffy, delicious, good old fashion pancake. This is one is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TEVANS211",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1113827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-01T14:36:58.687Z",
                "reviewBody": "Yesterday I ran out of Aunt Jamima pancake mix and I said to my girlfriend \"I gotta buy some more Aunt Jamima.\" And she said \"Buy mix? I always laugh when people do that.\" And I said \"What do you mean?\" And she said \"I make pancakes from scratch.\" So I figured I'd look up a recipe here. It took a while to find one that I wanted to try (I was tempted with the fluffy Canadian ones 'cause I'm Canadian) but then I saw all the reviews for this one and it sounded good. I was really hungry tonight so I got out my griddle. By the way, if you do like making pancakes, I highly suggest investing in a griddle, preferably iron. Breakfast food tastes SO much better on a griddle, and there's much more space to cook and flip. You can cook 6 pancakes on my griddle at a time. ANYWAYS I tried this recipe, and I made the pancakes, and KUMBAYAH they were the best pancakes! The pancakes were fluffy, and mouth watering, and tasty, and soft. The only change I made was adding an extra quarter of a cup of milk because I like the pancakes to be a little thinner and when I mixed the batter up I saw they'd be too thick. These are the best pancakes I've ever eaten. Thanks Verona, and Grandma Verona!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karl Fish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/812069/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-08T16:15:36.437Z",
                "reviewBody": "Wow, what a nice surprise! This recipe was outstanding! I read close to 200 reviews before I made these up and this is what I came up with: I doubled the recipe to make sure I had enough for four of us as others felt that the serving size is off, I have a ton of batter leftover (good for me, it will keep). I let the eggs come to room temp, heated the milk just a tad so that when it was added to the melted butter it would not re-solidify the butter, I used 1/8 cup of sugar, a whole stick of real butter melted all the way through, only 4 TBS of baking powder and 3/4 tsp salt. I also added a splash of vanilla. I mixed wet and dry ingredients seperately. Then when I put the wet into the flour I used a whisk sparingly and it came together beautifully with no lumps. I let the mixture sit for about 10 minutes before starting to make the pancakes. Other said that they had problems with the batter being too thick, I think that using less baking powder and making sure that the wet ingredients were not cold made a big difference. These came out absolutely beautiful and like something out of a magazine. I served this with bacon and fresh strawberries tossed with sugar. Yummy! I will experiment a bit more in the future but this is a great recipe! Thanks Verona for sharing and thanks to reviewers also for sharing their comments!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-15T02:07:02.623Z",
                "reviewBody": "These are great!  I prepared 6 separate batches of the dry ingredients into plastic bags, attached labels for the milk, egg & butter, and will pack them in the travel trailer for our summer trip.  I can't wait to taste them out in the fresh air.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura Sewall Bossart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/756903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-08T21:18:34.483Z",
                "reviewBody": "This had WAY too much salt! Next time I will only use 1/4 - 1/2 tsp. at most!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tanaquil",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1982546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-21T19:00:00.193Z",
                "reviewBody": "I think that people should already know by now that if something goes wrong, it is NOT THIS RECIPE'S FAULT. This is a perfect recipe, it works, and it's just plain right. After reading some of the reviews, there are a few common problems amongst them.  1) Do not use COLD MILK. Start with warm milk. Heat up the milk before using it. Cold milk will only result in something that doesn't puff up during the cooking process. If you need to, melt the butter in the milk, that way your butter doesn't chunk up on you in the batter when the milk is cold.   2)Do NOT over mix your pancake batter! You will end up with FLAT and HEAVY pancakes. You need to mix it just enough, to where all your liquid ingredients are absorbed in the flour, but there are still lumps. The batter should almost look like it's \"rising\" with bubbles sort of. Beating up your pancake batter means beating up your family with bad pancakes.   I'd like to add that the last pancakes out of the batter are going to be tougher than the first batch that came out. As the ladle goes in and out of the batter, that is working the gluten in the flour. Try to use an extra large ladle or scoop, so you can scoop multiple pancakes in one go, reducing the amount of times you dip into the batter. This helps ensure that all your pancakes will stay uniform and tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "K.C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2647395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-15T02:06:43.233Z",
                "reviewBody": "Like most of the others I only used 3/4 tsp. salt and added 1 tsp. vanilla. These are the best pancakes I've ever made at home, thanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SRPAGON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/766451/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:44:00.09Z",
                "reviewBody": "I used 1/4 tsp less salt and added 1 tsp vanilla. Loved these pancakes.  My boyfriend said that they're better than any box brand and that they had the taste of \"sugar cookie dough.\" Goodbye Bisquick, I'm keeping this easy and great breakfast recipe! Thanks Verona!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DREGINEK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22503515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-31T11:35:07.423Z",
                "reviewBody": "Wow, these were absolutely fantastic.  I read many reviews before I made these so I made some changes to the recipe based on all the reviews......I doubled the recipe and made the following changes.  I used 4-teaspoons baking powder, 1-teaspoon cinnamon, 1/2-teaspoon nutmeg, 1-tablespoon vanilla, 1/2-teaspoon salt, 3-cups milk, 3 eggs lightly beaten and 1-stick butter......I melted the butter then added the milk to the butter and heated it (just heat, do not boil).  So I had 3 bowls - 1 with the dry ingredients all sifted together, 1 with the warm liquids and 1 with the eggs lightly beaten.  I then added the liquids to the dry ingredients and mixed a bit then added the eggs to the mixture.  Mixed with a wire wisk until it was well blended together.  I let it sit on the counter for 10-minutes before cooking.  Served with bacon and eggs.  This was made for 4-people and none was left.  The kids told me these are best pancakes they have ever had and to never use bisquick again.  Thank you so much for the fine recipe.  Its a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PORUSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415535/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Good Old Fashioned Pancakes",
            "description": "See how to make one of our top 5 most popular recipes!",
            "uploadDate": "2012-10-30T22:50:11.680Z",
            "duration": "PT2M7.878S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F89f0e8b6-f8aa-42e2-9406-d09467f7cc8b%2Ffe302586-e488-4059-ae65-368645d07bdd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1934957687001"
        }
    }
]