[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/252/main-dish/savory-pies/",
                    "name": "Savory Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2270/main-dish/savory-pies/shepherds-pie/",
                    "name": "Shepherd's Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/24202/shepherds-pie-vi/",
        "name": "Shepherd's Pie VI",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F11%2F23%2F6266186_original-2000.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "2000-08-04T03:01:04.000Z",
        "description": "This Shepherd's Pie is a layered casserole of beef, carrots, and potato.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "1 (2 quart) casserole",
        "recipeIngredient": [
            "4 large potatoes, peeled and cubed",
            "1 tablespoon butter",
            "1 tablespoon finely chopped onion",
            "¼ cup shredded Cheddar cheese",
            "salt and pepper to taste",
            "5 carrots, chopped",
            "1 tablespoon vegetable oil",
            "1 onion, chopped",
            "1 pound lean ground beef",
            "2 tablespoons all-purpose flour",
            "1 tablespoon ketchup",
            "¾ cup beef broth",
            "¼ cup shredded Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of salted water to a boil.  Add potatoes and cook until tender but still firm, about 15 minutes. Drain and mash. Mix in butter, finely chopped onion and 1/4 cup shredded cheese. Season with salt and pepper to taste; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of salted water to a boil.  Add carrots and cook until tender but still firm, about 15 minutes. Drain, mash and set aside. Preheat oven to 375 degrees F (190 degrees C.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large frying pan. Add onion and cook until clear. Add ground beef and cook until well browned. Pour off excess fat, then stir in flour and cook 1 minute. Add ketchup and beef broth. Bring to a boil, reduce heat and simmer for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the ground beef in an even layer on the bottom of a 2 quart casserole dish. Next, spread a layer of mashed carrots. Top with the mashed potato mixture and sprinkle with remaining shredded cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 20 minutes, or until golden brown.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Savory Pie Recipes",
            "Shepherd's Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jacquie"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.468156766687079,
            "ratingCount": 3266,
            "itemReviewed": "Shepherd's Pie VI",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "451.8 calories",
            "carbohydrateContent": "52.5 g",
            "cholesterolContent": "64.5 mg",
            "fatContent": "17 g",
            "fiberContent": "7.3 g",
            "proteinContent": "23.1 g",
            "saturatedFatContent": "7.3 g",
            "servingSize": null,
            "sodiumContent": "294.6 mg",
            "sugarContent": "5.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-07T02:58:15.653Z",
                "reviewBody": "Very good.  Every  bit as good as what Ive purchased in Irish restaurants.  I made a few crutial changes to this recipe in order to arrive at perfection:  add 1/4 cup of worstershire to the ground beef mixture before cooking.  Without this, the meat is too bland.  Also, add a packet of brown gravy mix to 1 cup of water (instead of 3/4 c. beef broth) and stir into the browned and floured meat mix to simmer for 5 min.  This gives the meat a little bit of gravy, which the mashed potatos love!  Finally, instead of 5 carrots, I add 8-10 oz. of frozen peas and carrots right on top of the meat mix and before the mashed potatos. It tasts great and adds color to the dish.  This recipe is going in the favorites file.  ***** stars for flavor and presentation!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SCIOTA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/515622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-29T16:33:02.55Z",
                "reviewBody": "OK, I have FINALLY perfected (at least for us) this recipe.  I brown usually around 1 - 1.5 lbs of ground beef.  I try and get something lean.  Add two tablespoons of flour and mix it in.  Then add two tablespoons of ketchup, 1/4 cup of worcheshire sauce, a packet of brown gravy and one cup of water.  When it starts to thicken I add about a cup and a half of mixed veggies (corn, green beans, carrots, and peas).  Simmer until thickened.  Put in a 2 quart casserole dish cover with mashed potatoes and whatever else you like (I add slivers of butter to the potatoes) and bake at 375 for 20 minutes.  FANTASTIC!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin0220",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1530362/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-12T18:53:23.39Z",
                "reviewBody": "I made a lot of shepherd's Pie and this is my favortie.\nTIME SAVING HINT: to make preparation even faster and easier use instant mashed potatoes for the topping ... although I much prefer fresh mashed potato. If you don't have beef broth use brown gravy mix with one cup water, but honetly, the broth is good too. If making for only adults I will also sometimes add a little HP sauce to the meat mix ... this gives it a bit of \"zing\". I NEVER add worcestershire sauce...blechh, gross..it has anchovy paste in it!!!\n   Also, although the carrots are very nice, you could use frozen corn and or peas instead of carrot (my kids prefer). But if making for adults, I find they tend to prefer the mashed carrot over the peas and corn, myself included. After my husband tasted the one I made with carrot he said \"That's the best cottage pie I've ever tasted!!! And he's English! There is something very comforting about the combo of carrots and potato.\n   Great idea to mix in cheese and onion to the potatoes. \n(PRESENTATION HINT:I always top my shepherd's pie with a sprinkling of paprika - nice little touch for taste and appearance).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Evie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/963725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-05T19:16:22.123Z",
                "reviewBody": "My hubby always asks his mom to bake her famous Shepherd's Pie when we go to visit.  I have never made it for fear that it would not be as good as hers and he wouldn't want to eat it.  This recipe was fantastic, and everyone gobbled three helpings!  I followed some of the other suggestions here and cooked potatoes and carrots together in the same pot. I mashed the potatoes with 8oz sour cream and salt/pepper.  I used green onion in the mashed potatoes.  I sautéed 2 pressed cloves of fresh garlic in butter with the onions to use in the meat mixture.  I cooked the meat mixture with 1/4 cup Worcestershire sauce and added seasoned salt to taste.  I bumped up the ketchup to 1/4 cup, but I think half that (2 tablespoons) would have been fine.  I used 1 packet of brown gravy mix with 1 cup water instead of the beef broth as suggested.  And I mixed the ground beef with about a cup of frozen mixed veggies (peas and corn).  Everyone loved it; it was definitely a huge hit!  \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MEESELF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1454928/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-19T22:40:05.37Z",
                "reviewBody": "I've made this so many times that I must give everyone my updates.  First, I season the beef with whatever I have on hand (onion powder, garlic powder, seasoning salt, meat magic, etc.)  I use canned veggies (drained), and then top it with  instant potatoes.  (I use either 4 cheese or roasted garlic!)  Then I top with about 1 cup of cheese (any cheddar mix will do.)  The result is delicious AND it is sooooooo much faster!!!  Great weekday meal for the meat-and-potatoes type family! I've also made it with the brown gravy instead of the beef broth - husband did NOT like that... he much prefers the broth.  Gravy gives it almost a beef stew texture.  Update 2:  I also use the bagged steamed veggies that I've become a huge fan of.  And yes, it does taste better if you use real onion and garlic.. just toss in a small food processor to chop.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLS1220",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/558112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-08T17:14:01.57Z",
                "reviewBody": "As already said, this is a sort of cottage pie, as it's made with beef, however it's wrong. you don't put onions or cheddar in the potato topping, sprinkle the cheddar on top if you want before sticking it in the oven at the end or under a grill, but the cheddar is purely optional , don't mash the carrots, they should be in chunks, no ketchup, use tomato puree if you want, but ketchup is a no-no, a splash of Worccester sauce is good, as is a teaspoon of mustard powder inwith the filling, and where are the peas so clearly visible in the photo? Sorry to be so negative, but it's an english recipe (not Irish), and I've been making it for as long as I can remember. There are better recipes to be found than this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Rich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1567993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-23T23:49:40.187Z",
                "reviewBody": "This recipe was fantastic! Like other's here I added a few little extra's into the mix. Instead of the small amount of Ketchup I added 1/4 cup... I used a FULL can of Beef Broth and added 1/4 cup Worcestershire Sauce into the ground beef cooking section I would recommend adding a 1 cup of corn to the beef mixture as well when you add the broth and ketchup..etc...but use niblet corn... NOT peaches & cream or sweet corn as the meal (with the carrots and extra ketchup added) can turn the taste a little sweeter than you might like it. I also added a bug dollop of sour cream to the mashed potatoes before I spread them across the casserole...(makes them smoother and easier to spread) This recipe is a keeper and one of my top 10's here!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FIREPLUGCANADA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-31T16:10:33.973Z",
                "reviewBody": "We REALLY liked this recipe.  When I make any dinner with mashed potatoes I automaticly make way more mashed potatoes needed for that dinner, because I know I will make Shepherd's pie for dinner within two days.  I made a few changes, which my husband said was the best shepherd's pie he has every eaten.  I added 1/4 cup of worcheshire sauce to the hamburger when browning.  I used a can of drained peas and carrots ( and eliminated the 5 carrots), then I added a can of drained whole corn on top of that.  Instead of beef broth, I used a can of Franco American Beef Gravy.   I would recommend this to anyone. Bon Appetit...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Linda Cas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2003281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-05T20:23:16.187Z",
                "reviewBody": "This recipe was very tasty.  I was skeptical about not using any spices in the meat mixture as I am the type of cook who loves spices.  I did add garlic as I cannot imagine cooking without it!!  Meat mixture was very moist, carrots lended a sweet taste to the pie and the onions & cheese in the potatoes was truly a great match.  Would definitely make this recipe again.  Family loved it.  Other than it taking a lot longer than the indicated prep time this is definitely a hit in my books!!!  2 THUMBS UP!!!!!  Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FOXWORTH33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/408058/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Shepherd's Pie VI",
            "description": "See how to make a classic Shepherd's Pie.",
            "uploadDate": "2012-04-04T06:46:35.912Z",
            "duration": "PT5M0.8S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F847985b4-f7b0-4a9e-a844-0ce7e83d783e%2Fbc12c6c1-48d5-4605-80bd-f6c9f4588e21%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1545942738001"
        }
    }
]