[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/345/bread/yeast-bread/flat-bread/",
                    "name": "Flat Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23419/easiest-focaccia-recipe/",
        "name": "Easiest Focaccia Recipe",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1031909.jpg",
            "width": 1745,
            "height": 1536
        },
        "datePublished": "2000-08-10T06:11:49.000Z",
        "description": "Extremely easy, fast and cheap. Great for sandwiches and snacks. You may use more or less olive oil or salt if you wish.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "2 to 4 servings",
        "recipeIngredient": [
            "1 teaspoon white sugar",
            "1 (.25 ounce) package active dry yeast",
            "⅓ cup warm water (110 degrees F/45 degrees C)",
            "2 cups all-purpose flour",
            "2 tablespoons olive oil",
            "¼ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a small bowl, dissolve sugar and yeast in warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the yeast mixture with flour; stir well to combine. Stir in additional water, 1 tablespoon at a time, until all of the flour is absorbed. When the dough has pulled together, turn it out onto a lightly floured surface and knead briefly for about 1 minute.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 475 degrees F (245 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Deflate the dough and turn it out onto a lightly floured surface; knead briefly. Pat or roll the dough into a sheet and place on a lightly greased baking sheet. Brush the dough with oil and sprinkle with salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake focaccia in preheated oven for 10 to 20 minutes, depending on desired crispness. If you like it moist and fluffy, then you'll have to wait just about 10 minutes. If you like it crunchier and darker in the outside, you may have to wait 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Flat Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MORTICIA_ADDAMS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.225,
            "ratingCount": 320,
            "itemReviewed": "Easiest Focaccia Recipe",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "296.4 calories",
            "carbohydrateContent": "49.4 g",
            "cholesterolContent": null,
            "fatContent": "7.4 g",
            "fiberContent": "2.1 g",
            "proteinContent": "7.1 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "147.6 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-17T21:45:44.97Z",
                "reviewBody": "Many reviewers complained that this recipe was \"blah\" or has no flavor. This is because it has very little salt in the recipe -- a crucial factor in bread \"flavor.\" Definitely increase the salt to between 1 to 1 1/4 tsp, depending on your preferences. You might want to check your favorite bread recipe and see how much salt per cup of flour there is and start with that. Also, if you haven't made focaccia before this recipe is confusing. It doesn't state how thickly to roll the dough. It isn't going to rise a lot so unless you want it to be like a flatbread don't roll it much thinner than you want it to be when you eat it. Also start with adding 1/4 cup of water after you add the yeast/sugar/water mixture and then add a TBS of water at a time till the dough forms into a ball.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Islander",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1493223/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-08T01:51:42.267Z",
                "reviewBody": "I was a little dubious after reading some of the reviews but I have made this recipe several times now always with excellent results.  The reference to adding additional water means exactly what it says, add enough\nextra water to incorporate all the flour.  You should have a soft dough; if it is stiff then you put too much flour in to begin with.  Dough does not require a second rising but I have experimented with this and found the difference is minimal and whether you dimple your foccacia dough or leave it flat is a matter of choice.  I think dimpling the dough and allowing the oil and seasonings to pool in the dimples adds more flavour to the cooked product.  Try steeping dried Italian herbs in olive oil abd then pouring the lot over the top of your dough.  Delish!\nI find this recipe creates a focaccia that is crisp on the outside and soft on the inside with big airholes perfect for mopping up tomato based sauces.  Don't over think it and give this recipe a go!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AussieCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/454428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-29T04:08:26.547Z",
                "reviewBody": "I have made this recipe numerous times. Delicious! I have mixed in italian seasoning and garlic powder in the flour mixture for some extra flavor. I've even mixed olives with the dough and put cheese and veggies on top. Will continue to make this time and time again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Henry's Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/483310/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-05T20:51:49.967Z",
                "reviewBody": "This really is an easy Focaccia recipe. I have made it before and just couldn't find my recipe. I also added about a tablespoon of olive oil to my dough because I thought it was in my regular recipe. I place rosemary and parm. cheese on top of mine when I baked. To the reviewer that stated it was not that easy to make I don't think it was any more difficult than most bread recipes. However I make all of my bread with a mixer and dough hook. Just don't over mix or it will be tough.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-12T22:34:11.49Z",
                "reviewBody": "I just made this recipe it was so delicious! I found nothing difficult about the recipe and I've not had very good results with bread recipes until now. There is lots of room to play with the ingredients. I added 2Tbs white sugar 1/2 cup cornmeal and 1tsp. salt and 1Tbs. Olive oil too the flour and enough water to make a stiff sticky dough I followed the directions kneading 1 minute and letting it rise 30 minutes only once and then brushed on some garlic infused Olive oil and some parmesan cheese with a sprinkle of dried onions and some more course salt. It was amazing!! It was light and crunchy mmmmm!!! I am very proud of myself. Next time I will add some cooked pizza toppings as it only took 10 minutes to bake. I will use this recipe often it's so good and I bet this would make yummy breadsticks!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jude",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2246397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-07T23:30:35.607Z",
                "reviewBody": "The first time I made this recipe I found it to be a little bland but very simple and knew it would be easy to modify. This time I added some garlic powder a handful of mozzarella cheese some parmesan some dried onions and a touch of parsley. But instead of rolling it out I made individual rolls. Baked it for about 10 minutes at a touch lower temperature and my family went crazy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hlorri",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/903124/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-23T02:10:42.39Z",
                "reviewBody": "I agree with the previous reviewer. Nothing about this recipe is good. The directions are wierd with the \"adding tablespoons of water\" to the inadequate rising time. There is not enough liquid in this recipe!! And even though I added salt and herbs to the dough itself (not to mention the top) there was a huge lack of flavor. It baked up a little dry too even though I did my best to save it. I've tried many of the other great focaccia recipes on here- try some of those instead of this one!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-16T07:44:08.903Z",
                "reviewBody": "this took no time and i added basil sage minced garlic and asiago cheese. 13 minutes was the perfect cook time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sirmolly/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-21T01:24:26.547Z",
                "reviewBody": "I make this bread about 5 times a week... it's great with a salad and soup, and really dresses up just about any meal. It's absurdly easy and utterly delicious. I add a tsp of white sugar to the flour, and preheat the oven a couple minutes only before raising the dough, then turn it off and put the dough in to bake into a cold oven. I also use coarse salt to sprinkle and extra virgin olive oil ... it's really tasty. You can add seasonings, shredded cheeses, black olives, etc to vary.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARALEISA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1081603/"
                }
            }
        ]
    }
]