[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/835/desserts/cakes/chocolate-cake/",
                    "name": "Chocolate Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7601/chocolate-mint-mayonnaise-cake/",
        "name": "Chocolate Mint Mayonnaise Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F186983.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-05-07T19:15:18.000Z",
        "description": "Don't let the mayo put you off - this is our family's favorite birthday and every other occasion cake, very moist and devilishly rich! This cake stores well at room temperature and is great for picnics.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 9 inch cake layers",
        "recipeIngredient": [
            "½ cup unsweetened cocoa powder",
            "1 cup white sugar",
            "2 cups all-purpose flour",
            "2 teaspoons baking soda",
            "¼ teaspoon salt",
            "1 cup water",
            "1 cup mayonnaise",
            "1 teaspoon vanilla extract",
            "1 (4.5 ounce) package chocolate covered thin mints",
            "6 tablespoons unsweetened cocoa powder",
            "2 cups white sugar",
            "⅔ cup milk",
            "½ cup butter",
            "1 pinch salt",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift together the flour, baking soda, salt, 1 cup white sugar, and 1/2 cup cocoa. Add mayonnaise, 1 teaspoon vanilla, and water. Beat with and electric mixer on medium speed for 3 to 4 minutes. Pour batter into prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 25 minutes. Turn oven off, remove cake layers and allow to cool for 10 minutes in pans. Invert 1 layer onto a serving plate and the other layer onto a cooling rack. Top layer on plate with enough unwrapped mints to fully cover top. Return cake to oven for 3 to 5 minutes to soften chocolate mints, then spread evenly with a spatula. Top with second cake layer and allow to cool before frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Fudge Frosting: Combine 6 tablespoons cocoa, 2 cups white sugar, 2/3 cup milk, 1/2 cup butter, and a pinch of salt in a saucepan over medium high heat. Stirring constantly bring mixture to a boil and reduce heat to low, allowing mixture to boil gently for 3 minutes without stirring.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove from heat and let cool for 3 minutes before beating in 1 teaspoon vanilla extract. Beat with an electric mixer until just barely thick enough to spread without running off the cake. Spread over top of cooled cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Chocolate Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cris Wise"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8,
            "ratingCount": 40,
            "itemReviewed": "Chocolate Mint Mayonnaise Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "267.2 calories",
            "carbohydrateContent": "39.3 g",
            "cholesterolContent": "14.2 mg",
            "fatContent": "12.4 g",
            "fiberContent": "1.5 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "4.3 g",
            "servingSize": null,
            "sodiumContent": "212.1 mg",
            "sugarContent": "29 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-03T14:06:05.95Z",
                "reviewBody": "This is an excellent cake - a few tips though. For true mint lovers the mint between the layers just isn't enough; for that extra oomph get crumbled Andes mints in your baking section of the grocery store and add approx 1/4 c right into the cake batter while mixing. They melt into the cake when baking and come out great! I also sprinkled some on top of cake after icing. Use a different thicker fudge frosting - this one is too thin. Also don't cook for the full time listed - I cooked for about 20 mins and stick with the old toothpick test and you'll be ok. Also found I needed to make two batches for the cake to be thick and moist as we like.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lillian Marzette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1966896/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-26T16:00:51.873Z",
                "reviewBody": "This cake was fabulous.  I made it for my husband's birthday, and, although he says he hates mayonnaise and can taste it in anything, he hadn't a clue there was mayo in the mix!  The second time I made the cake, I substiuted chcolate caramel bars for the chocolate mint patties, since I am not a huge fan of mint.  It was even better with a layer of peanuts on top of that to make a chocolate Snickers cake!  I will definitely be passing this recipe along to all of my friends and family!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIE COWEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-01T22:11:49.39Z",
                "reviewBody": "I made this cake for my son's 4th birthday party. It was great! People told me they really liked the cake. I was a little concerned by some of the reviews that talked about the icing being runny. I beat the icing for several minutes and when it still seemed runny I put the icing pan in the freezer where it firmed up quite nicely. I highly recommend this cake and will be saving the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CONNIEMM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/473066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-12T02:01:16.123Z",
                "reviewBody": "I've made mayonnaise cakes before but I find that this is the best \"base\" recipe just make sure that the cakes are not overcooked or they will go decidedly chewy. The first time I made this I happened to have a jar of Betty Crocker frosting in the cupboard and being a lazy person I used that instead of making the frosting from the recipe. The result was absolutely superb and I've used the store bought frosting ever since. One great thing about this recipe is that the mint stops the cake from becoming too overpowered by the chocolate content.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RUDDLES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-09T23:05:59.903Z",
                "reviewBody": "My son loves chocolate mint so I picked this cake to make for his 13th birthday. I would say the cake was OK but not fantastic. The mint layer did taste good and was just the right amount of mint taste not too strong. However if I made this recipe again I would use a different frosting recipe. After completing the frosting as directed it was more like a glaze and way too runny to actually use to frost the cake. It took over an hour for the frosting to cool and thicken enough to put on the cake and that hour included time spent cooling in the refrigerator. Also the cake layers took less than 25 minutes to cook. I checked them after 21 minutes and they were done. If I had left them in the full 25 minutes they would have been overcooked. Otherwise this was an easy to make cake recipe with acceptable results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SALPARKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1017864/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-18T01:45:11.623Z",
                "reviewBody": "WOW!!! I have baked this cake twice now and both times it was a hit at my husband's office. He has brought it in around 7:00am and the cake has been gone by 9:00am. I decided to bake it in a bundt pan and just drizzled the \"frosting\" over it. I have been asked for the recipe by several people and I have gladly shared it with them. Thank you for sharing it with us Cris!! HAPPY BAKING!!! I have been asked for the recipe from several people and I have gladly shared it with them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacqueline J. Buell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/695617/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-05T02:11:17.28Z",
                "reviewBody": "My husband asked for a mayonaise cake for his birthday. I found this one. The mint intriqued me. The cake was excellent but I had a little trouble with the frosting. I beat it and beat it it never really got thick enough to spread on the cake. It was more like a glaze. What I put on the sides of the cake mostly ran off. But the frosting tasted good. I will make this again but may try a different frosting. Love the thin mints between the layers.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy Wing",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/134996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-21T08:16:47.33Z",
                "reviewBody": "Cannot believe I forgot to rate this. I have made this more than once and LOVE IT. I get nothing but rave reviews on it people always tell me that it looks like it came from a bakery. I add chocolate mints to the frosting while I am baking to give it that extra mint kick and then sprinkle with jimmies (chocolate sprinkles for those not from mass!!) to make it look nice... what a cake!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CADON23",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/967043/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-23T21:31:00.603Z",
                "reviewBody": "i dont get how to make it its hard!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "brook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3702852/"
                }
            }
        ]
    }
]