[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20568/lasagne-verdi-al-forno/",
        "name": "Lasagne Verdi al Forno",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F421809.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-08-23T08:09:41.000Z",
        "description": "A recipe from my home in Emilia-Romagna, Italy; this lasagna made with spinach pasta cannot be beat. It's excellent if you want to impress some guests, or even yourself. It may be a bit time consuming, but it's well worth the TLC you put into it.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 9x13-inch dish",
        "recipeIngredient": [
            "5 ounces spinach - rinsed, stemmed, and dried",
            "2 eggs",
            "⅝ cup semolina flour",
            "1 teaspoon salt",
            "1 ½ cups all-purpose flour",
            "2 tablespoons butter",
            "2 slices bacon, diced",
            "1 carrot, diced",
            "1 stalk celery, diced",
            "1 onion, diced",
            "3 ½ ounces lean ground pork",
            "3 ½ ounces lean ground beef",
            "3 ½ ounces minced ham",
            "2 tablespoons tomato paste",
            "1 teaspoon dried oregano",
            "1 cup beef stock",
            "salt and pepper to taste",
            "3 ½ ounces chicken livers, trimmed and chopped",
            "2 tablespoons butter",
            "2 tablespoons all-purpose flour",
            "2 cups warm milk",
            "1 pinch salt",
            "1 pinch ground nutmeg",
            "1 ⅔ cups grated Parmesan cheese",
            "1 pint ricotta cheese",
            "3 tablespoons butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "For the pasta dough:  Steam the spinach in a steamer or over boiling water until bright green, 2 minutes.  Squeeze to remove excess moisture and process in a food processor to make a paste.  Combine spinach with eggs, semolina, and salt and process until smooth.  Stir in enough of the flour to make a smooth dough.  Knead briefly, cover and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the ragu:  In a large skillet, melt butter over medium-high heat. Saute bacon, carrot, celery and onion until onion is translucent.  Stir in ground pork, ground beef and minced ham, and cook until browned. Stir in tomato paste, oregano and beef stock. (Reserve the chicken livers for later.) Season with salt and pepper, reduce heat to low, cover and simmer 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For the bechamel:  While the ragu is simmering, combine 2 tablespoons butter and 2 tablespoons flour in a medium saucepan over medium-low heat.  Whisk to make a roux.  Remove from heat, let rest one minute, then whisk in warm milk.  Return to heat, simmer 10 minutes, stirring constantly, until thickened.  Season with salt and nutmeg.  Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To cook pasta:  Bring a large pot of lightly salted water to a boil.  On a floured surface, divide pasta dough into three portions.  Roll each portion out to a thin sheet.  Have ready an ice water bath. Cook each sheet 3 minutes in the boiling water; remove from the boiling water and dip in the ice water; drain and dry on a clean, dry cloth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To finish the ragu:  Stir the chicken livers into the simmering sauce.  Cook 1 minute, remove from heat and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).  Grease a 9x13 baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble lasagna:  Place one pasta sheet in bottom of prepared baking dish.  Spread one-third of the ragu, one-quarter of the bechamel, one-third of the ricotta, and one-quarter of the parmesan over the pasta.  Repeat layers twice.  Top with remaining bechamel and parmesan and dot with butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven 30 minutes, until top is golden brown.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Arianna"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.634615384615385,
            "ratingCount": 52,
            "itemReviewed": "Lasagne Verdi al Forno",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "551.8 calories",
            "carbohydrateContent": "31.4 g",
            "cholesterolContent": "186.6 mg",
            "fatContent": "33 g",
            "fiberContent": "2 g",
            "proteinContent": "31.8 g",
            "saturatedFatContent": "17.4 g",
            "servingSize": null,
            "sodiumContent": "1044.4 mg",
            "sugarContent": "5.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-09-13T16:20:27.263Z",
                "reviewBody": "D*MN! is all I and my family can say! I took this to a big family get together and it was voted unanimously (By northern italians) the BEST lasagne they ever had.  We are talking raised in northern Italy folks. Well, I made a few adjustments, to make it a bit easier. I used Barilla oven ready lasagne noodles, mixed my ricotta with 0ne egg and 1 frozen, but thawed and squeezed dry box of spinach. I thickened the bechamel by using 4T of flour instead of 2, it was very runny with just 2. (Dont skip the nutmeg, this is a great flavor complement. For the meat I used 7oz each of ground Buffalo, pork and veal. (Veal makes a difference, dont just use ground beef) and instead of tomato paste, I added 1 16oz can of wild porcini marinara.(found at Trader Joes) This is going in my forever book here at home. Not too saucy, not too cheesy, PERFECT!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelsolake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/189512/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-16T13:07:09.2Z",
                "reviewBody": "The best lasagne I have ever had. I am never going back to the American version. The bechemel sauce really is key to this dish. One thing for new cooks making bechemel sauce, make sure you use whole milk. I tried making it once with skim milk and it didnt work. You need that fat in there. You can make the meat sauce a day or two ahead so it will develop its flavors more :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenwee99",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jenwee99/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-24T13:08:38.577Z",
                "reviewBody": "Alrighty,\r\nI found the pasta easy to make if you use your food processor. A good marble or teflon rolling pin makes rolling the pasta a breeze. No real need for a pasta machine  here. You can also make the pasta sheets the night before, layer between wax paper and refrigerate to expedite things in the kitchen  the next day.(do not cook pasta until ready to use)\r\nI decided to double both sauces just in case I felt a single batch was too little.  (another reader complained of too little sauce) If you use a small food processor to chop your vegetables  you will be done in record time.\r\n I used most of both sauces when I assembled the lasagna. What a delightful  aroma while the Ragu was cooking.\r\nThis is not difficult, it just sounds that way. \r\nExcellent  flavors! Do try this one, you will be pleased, my guests certainly were.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATHY A",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1087826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-31T22:35:19.653Z",
                "reviewBody": "We tried this once with regular lasagna noodles and were most impressed with the sauce.  We made the mistake of making too many layers though.  The second time, we made the spinach pasta ourselves, added some cooked spinach and eggplant to the layers, made extra sauce and it was amazing.  I highly recommend going heavy on the sauce part and trying to make the pasta... it was a little hard, but fun and worth the effort!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOOANDLEEANN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/559546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-07T20:54:23.967Z",
                "reviewBody": "This lasagne is divine.  It's beautiful to look at, the fresh pasta melts in your mouth, the ragu is substantial without being overpowering, and did I mention the bechamel?  The overall effect is sophisticated, yet comforting.  Rolling out the pasta is the most labor intensive part, but after the first try it will be very simple to do the next time.  MAKE THIS LASAGNE.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLIND",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/145337/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-18T22:58:19.087Z",
                "reviewBody": "This so goooood! I've made it several times exactly as written and its been perfect every time. I usually make it for a friend that hates pasta but loves 'noodles'. He loves this because the pasta is so thin and there are so many flavors. It usually takes a bit longer for the prep time though. Can't figure out why..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lynne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5517150/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-14T23:56:52.417Z",
                "reviewBody": "This was pretty good but I'm not a fan of bacon or ham so I left it out. The veggies were overpowered by the cheese so I might add more next time. And I wouldn't add any salt next time either between the meat and the stock it is salty enough. I also didn't understand adding butter to the cheese so I left it out for a healthier dish. The overall flavor was very good and not as time consuming as I expected. Great way to get veggies into the kids!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SugarDuJour",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/spiderella/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-11T16:31:41.67Z",
                "reviewBody": "Fantastic recipe although not for someone in a hurry. I made an alternate version of this same recipe by leaving out the chicken livers and substituting ground turkey and turkey ham. Although there was a change in taste the calories and fat content dropped significantly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMPACT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/223894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-30T15:27:49.03Z",
                "reviewBody": "Excellent recipe - so nice to see it done properly. I always infuse the milk for my bechamel with bay leaves though. Traditionally bay is an essential flavour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILVERSURFERUK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1388810/"
                }
            }
        ]
    }
]