[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
                    "name": "Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16051/appetizers-and-snacks/snacks/popcorn/",
                    "name": "Popcorn Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20808/kettle-corn/",
        "name": "Kettle Corn",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F06%2F30%2FKettle-Corn.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-08-26T22:59:53.000Z",
        "description": "Take a trip to the county fair with a bowl of old-fashioned Kettle Corn. Your family will never want plain popcorn again! If you use white sugar, it will taste like popcorn balls and if you use brown sugar, it will taste like caramel corn.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "10 cups",
        "recipeIngredient": [
            "¼ cup vegetable oil",
            "¼ cup white sugar",
            "½ cup unpopped popcorn kernels"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the vegetable oil in a large pot over medium heat. Once hot, stir in the sugar and popcorn. Cover, and shake the pot constantly to keep the sugar from burning. Once the popping has slowed to once every 2 to 3 seconds, remove the pot from the heat and continue to shake for a few minutes until the popping has stopped. Pour into a large bowl, and allow to cool, stirring occasionally to break up large clumps.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Snacks",
            "Popcorn Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SUE202"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.60104643557881,
            "ratingCount": 1529,
            "itemReviewed": "Kettle Corn",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "209.3 calories",
            "carbohydrateContent": "24.8 g",
            "cholesterolContent": null,
            "fatContent": "11.9 g",
            "fiberContent": "2.9 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "0.6 mg",
            "sugarContent": "10.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-02-24T19:59:58.623Z",
                "reviewBody": "Cheap, quick, and easy!  I put oil and three kernels in the pot, when all three kernels pop I add the sugar and stir it around well, then I add the rest of the popcorn kernels and put the lid on.  Then I alternate shaking the pot for three seconds with letting it sit on the burner for three seconds until I hear the popping begin to slow down, then I take off the lid and sprinkle some salt in, replace the lid, give it another shake and pour it out into a bowl.  Haven't had a batch burn yet with the \"3-second shake and sit\" technique.  ;-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRYSTENL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/627994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-01T03:47:43.7Z",
                "reviewBody": "SUCCESS!!! The other reviewers aren't kidding, this kettle corn tastes just like the stuff at the fair. Here are some tips... I used a wide and heavy bottom stainless steel pan with high sides. Be sure to use the 3 kernel test (Preheat your pan with medium-high heat, add all of the oil along with 3 kernels of popcorn. When the 3 kernels pop, the oil is ready!). Once the oil is ready, add the rest of the popcorn and quickly sprinkle the sugar on top. Place a lid on the pan. Alternate, in three second intervals, between leaving the pan on the stove top and lifting and shaking the pot. Once the popping has slowed, remove from the stove top and immediately sprinkle with salt. Let it cool a little and try not to eat the whole batch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PABLOJR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1218902/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-18T13:58:58.187Z",
                "reviewBody": "I am the \"sue\" who submitted this recipe and I am so glad & thankful for the great reviews!  I had the 3 kernal test (I always use Orville Redenbachers's corn too as the better corn really makes a difference) in the directions and was a little disapointed to see when the recipe appeared online - had been left out.  I always use a stir crazy popcorn machine as this is always a multiple batch making recipe @ my house - left over corn is not as good but still always eaten!!  I heat the oil, put in 3 kernals and when they pop - add the sugar.  When it melts (happens quickly) add the rest of corn.  As soon as the popping stops, dump it into a waiting bowl and sprinkle with salt.  Dive in and enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donald Myers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/814027/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:39:18.513Z",
                "reviewBody": "Great snack, Sue. I added 1/4t salt to the sugar and oil. This way the salt and sugar form a crispy coating around the kernel. Yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-04T02:06:13.22Z",
                "reviewBody": "I don't have one of those neat hand-crank popcorn-making-thingys.  I have absolutely zero experience making popcorn on the stove.  What I do have is a pot that I normally use for chili and pasta, a fondness for kettle corn, and a heck of a of a nerve on me.  Here's what I did, mistakes and all:  I did the 3-kernel test, and then added the sugar and the popcorn at the same time.  (I'm not going to call that a mistake, but I think next time I'll add the sugar, let it melt, and then add the popcorn - the way I did it this afternoon, the popcorn started to pop before the sugar was melted.)  I used canola oil and thought it was fine.  I added 1 tsp of salt plus a pinch or two to the sugar; next time I might stick to just 1 tsp, as I found some pieces to be a little salty.  I did the three-seconds-on-the-heat/three-seconds-off-the-heat thing, shaking the entire time, and I probably pulled it a little early because I'd rather have a few unpopped kernels than burned sugar and popcorn.  The end result was very, very tasty.  Some of the pieces carmelized quite a bit, others didn't; I preferred the ones that didn't, but that didn't stop me from eating the entire batch by myself.  Cleanup was no problem; the cooled sugar melted right off again with hot water.  Thanks for the great recipe!  Edit:  Later, I tried letting the sugar melt before adding the popcorn.  I thought the sugar carmelized too much - it tasted burned instead of sweet.  I'll add them at the same time from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZeldaSayre",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/102702/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-03-01T16:28:10.42Z",
                "reviewBody": "Wow!  This became a really fast hit in my family.  After making it a few times, though, I do have some suggestions.  The last time I made it was the best.  Instead of using oil, I melted about 1/4 cup of butter flavored shortening.  It made the kernels pop much faster lighter, and had a hint of a buttery taste.  Very nice.  I also, added a  few drops of decorator's icing coloring to the melted shortening and sugar mixture.  When the popcorn pops, it explodes into a really beautiful color.\r\n\r\nYou can even mix two colors together[only two batches of popcorn is needed for that;)]",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TREESAP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395014/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T02:10:43.233Z",
                "reviewBody": "This was really good. It did take me a couple of tries to perfect the technique though. The first few times I made it I had a big gooey mess in the bottom of the pot. Make sure you start shaking as soon as the corn starts to pop and don't stop until it is done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Navy_Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/585390/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-07-07T03:57:26.63Z",
                "reviewBody": "A few recommended tips :   1.) The shaking of the popcorn is key, however remove the popcorn from cooking pot ASAP, or the shaking you did over the stove will be rendered pointless.   2.) Heat up the oil with 3 popcorn kernels, when those 3 pop add sugar, and rest of the kernels. WAIT 30 SECONDS, this ensures all your kernels are the same tempature and will not burn.  3.)Use peanut oil if no one is allergic for better flavor outcome.  4.) Use both sugars, my family likes confection sugar vs. white sugar. Our ratio for the recipe is more confetioners sugar than brown.  5.) If you're a sweet and salty person add salt to taste. In our family we add a lot.  6.) For a small hint of butter, after your popcorn is done popping and is in a diffrent bowl, use the hot cooking pot you cooked your popcorn in to melt butter and then drizzle over your popcorn, this is simply delicious !   Good snack on New Years Day at 1 am, thank you !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "hungrytravelers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6186649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T22:16:42.733Z",
                "reviewBody": "This is the best popcorn I've ever had. I first added three kernals until they popped then added the sugar to the oil and stirred it a bit so most of the sugar dissolves in the oil. Then I added the rest of the kernels. This is really easy to make and it absolutely taste great!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Priscilla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/907464/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Kettle Corn",
            "description": "See how to make your own kettle corn from scratch!",
            "uploadDate": "2013-08-21T22:09:10.111Z",
            "duration": "PT1M1.875S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2e955e34-efc3-4ef1-ab13-4a26d091fdf3%2F783f355c-7285-44df-b136-c3977ecc66cd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2621324270001"
        }
    }
]