[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21148/chile-rellenos/",
        "name": "Chile Rellenos",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1039793.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2000-08-29T05:03:18.000Z",
        "description": "Delicious green chiles stuffed with cheese, dipped in a special batter and fried in canola oil.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "12 Anaheim chile peppers, charred and peeled",
            "1 pound Cheddar cheese, cut into strips",
            "1 cup milk",
            "1 cup all-purpose flour",
            "1 egg, beaten",
            "1 teaspoon baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "1 teaspoon canola oil",
            "½ cup all-purpose flour for coating"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove seeds and membranes from peppers.  Stuff each pepper with a strip of cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl combine milk, the 1 cup flour, egg, baking powder, baking soda, salt and canola oil; mix well to make a batter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour enough oil in heavy frying pan to reach 1 inch in depth and heat over medium-high heat.  Roll each pepper in the remaining flour and dip in the batter.  Fry until lightly browned on both sides.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "PANCHITA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.203703703703703,
            "ratingCount": 216,
            "itemReviewed": "Chile Rellenos",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "741.2 calories",
            "carbohydrateContent": "52.3 g",
            "cholesterolContent": "170.6 mg",
            "fatContent": "42.3 g",
            "fiberContent": "3.3 g",
            "proteinContent": "39.2 g",
            "saturatedFatContent": "25.3 g",
            "servingSize": null,
            "sodiumContent": "1746.4 mg",
            "sugarContent": "10.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-10-27T00:19:59.7Z",
                "reviewBody": "In order to get authentic tasting chile rellenos, you should use a couple of eggs, seperated.  Whip the whites w/an electric mixer until stiff peaks form.  Beat the yolks seperatley and fold them into the whites (preseverving the volume of the whites).  Then you can dip the stuffed chiles into the egg...and don't worry about slopping it on.  You want the entire chile covered.  When your chile comes out of the oil, you'll have a nice fluffy coating...rather than a heavy egg-y tasting batter that most homemade recipes call for.\r\n\r\nAn easy way to char your chiles is to heat up the broiler in your oven and toss the peppers directly on to the racks.  (Poblano's can be substituted w/great results). You want the entire surface to be browned and blistered, so you will have to flip them occasionally.  Then, stick the peppers in a zip-lock and let them steam for about 1/2 an hour or so.  When you return to them, they'll be cool enough to handle, and the skin will be really easy to peel off!!  Make sure not to remove the stems when you slit open the chiles to remove the seeds and membranes.\r\nFollow these tips, and you will have one tasty little treat!!\r\nAlso, I use white cheese rather than cheddar (I use Oaxacan cheese...but for areas where Mexican cheese isn't available, Monterey Jack is a good substitute)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RedRobynNAU",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/643193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-23T19:54:28.373Z",
                "reviewBody": "My husband thought these were very good, I thought they were decent.  Something has to really blow me away to give it 5 stars. I followed one of the suggestions below and also did some research on authentic chile rellenos.  I don't know the exact type of chile's I had, a friend gave me some from her garden.  To char them, I tossed them in an 8x8 pan and put the oven on broil and rotated them as they would brown and blister.  when all sides were done, I put them in a ziplock bag to steam.  I returned to them about 45 min. later and they were cool enough to handle and the skin came off so easily. After slitting and cleaning out the peppers, I stuffed them with the cheddar cheese strips. The only ingredient I used for the batter was some eggs and a bit of flour....I took 3 eggs, separated them, and beat the whites until they were stiff and formed peaks. Then I beat the yolks with 1 TBsp. flour until they were pasty. I folded this mixture into the egg whites and stirred gently.  Then I rolled the stuffed chiles in flour and slopped on the egg mixture.  The batter puffed up beautifully when fried and really makes the authentic chile rellenos. I topped mine with warmed mild salsa. Husband gobbled them up! I am glad to have another dish to add to my collection.  Thanks to Panchita and the reviewers below mine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MomSavedbyGrace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1366670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-08T21:56:41.41Z",
                "reviewBody": "This was the best and easiest recipe for rellenos, I tweaked it just a little  and instead of going thru the hassle of cutting the cheese, I used string cheese, the combo stick with cheddar and mozzarella cheese, I sliced it in ½ (long way) and with that, I was able to get 2 rellenos out of one stick, it fries nicely and it doesn’t splatter like some cheeses do..  I made a tomato gravy type sauce to pour over the rellenos, that calls for one can of diced tomato with juice, 3 finely chopped celery sticks, ½ cup finely chopped onions, 2 finely chopped fresh jalapenos (remove seeds and membrane) and handful of chopped cilantro, sauté celery, onions, and jalapenos till soft, let cool and pour into blender, add the can of diced tomatoes, cilantro and blend till smooth, season with garlic salt and pepper to taste,   Just pour the amount you want over the rellenos,  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "STELLA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/597732/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-11T21:23:59.19Z",
                "reviewBody": "My husband loved these and told me I could make them every week.  They really are good.  I did take the advise of other reviewers and beat the egg whites separate then folded them into the rest of the batter.  It made the batter nice and fluffy.  Also, I used Jack cheese as I prefer rellenos with a white cheese, otherwise I followed the recipe.  The best salsa to use with these is \"Tomatillo Salsa Verde\" submitted by Kimberly.  Give it a try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NAUTICOLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/626711/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-17T15:16:13.627Z",
                "reviewBody": "I'm spoiled I guess... I've lived in Southern California all my life and love Mexican food of all types. For me Anaheim peppers are too mild and I'll go for the Poblano any day (and who said Poblanos were \"screaming hot\"? They're pretty mild...) So I used Poblanos of course. These were not too difficult to make (time intensive yes. Difficult? No) but the result was not worth the effort for me when I can easily go buy really good rellenos. I'm used to a softer batter - not the crispy fried-fish like texture of these. Done with good cheese though they are a reasonable substitute if you just can't get to decent Mexican food. While I enjoyed these they were not what I was expecting from a Relleno. They got three stars because they were still quite tasty and had I not been expecting a specific result I would have loved them. Definitely worth doing for fun and a taste of Mexico if you're just dying for it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Spencer & Serena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rochellekarina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-06T02:28:11.797Z",
                "reviewBody": "I found it easier to seed the chiles before roasting them so that they don't tear up much.  Also, be sure to completely coat the stuffed pepper with meringue, which acts as insulation against the oil.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catherine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3447206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-06T18:14:47.037Z",
                "reviewBody": "You must use \"Big Jims\" to get the proper flavor/spice/taste.  That is the long skinny green chile.  These were very rich!  We only needed two a piece with a side of black beans and rice for a VERY filling meal.  For the batter I used 4 eggs, separated.  Whipped the whites and then blended the yolks separately with 1 TBSP of flour and some salt and then whip into the whites.  Dip the chiles into some flour and then into the batter and place seam side down into the pan.  Yum, yum but I still prefer the local hole in the wall chile rellenos and much less work when someone else makes them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise Peacock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2326483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-22T18:58:21.74Z",
                "reviewBody": "This recipe was excellent and I impressed the hell out of my girlfriend whom had tried this same dish at a restaurant we went to just a couple of weeks prior. I was told that mine was much better than the place we had dined at. WOOHOOO thank you !!! Make sure you separate the eggs beating the whites first then beating the yolks and then folding the yolks into the whites, then add your batter ingredients, it turned out amazingly well :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "geoneex",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5848090/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-07T01:28:25.31Z",
                "reviewBody": "This dish was fantastic. My boyfriend wanted seconds and even thirds. I used the canned whole chiles and added monterey jack in with the cheddar. It turned out very well. The only downside was that the batter made a huge mess afterward. Oh well that's what 409 is for. I will be making this one again. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LEEWARD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/901205/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chile Rellenos",
            "description": "Try these cheese-filled and fried Anaheim chile peppers for lunch or dinner.",
            "uploadDate": "2016-02-23T16:38:52.978Z",
            "duration": "PT1M21.148S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ff9ea8f8f-c0b4-4fdd-8e14-4b44c0b41010%2Fa665edea-a54b-47e3-8009-3dc7e04aea2d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4770035097001"
        }
    }
]