[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/395/desserts/cakes/pound-cake/",
                    "name": "Pound Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21702/grandmothers-pound-cake-ii/",
        "name": "Grandmother's Pound Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8463002.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-09-08T01:52:20.000Z",
        "description": "This recipe is over 100 years old and is the original kind of pound cake: it contains 1 pound each of butter, sugar, eggs and flour and contains no salt, baking powder or flavoring (but flavoring such as vanilla extract or almond extract can be added if desired!)",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H10M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "3 8x4-inch loaves",
        "recipeIngredient": [
            "2 cups butter",
            "3 cups white sugar",
            "6 eggs",
            "4 cups all-purpose flour",
            "⅔ cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease 3 - 8x4 inch loaf pans, then line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time.  Beat in the flour alternately with the milk, mixing just until incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter evenly into prepared loaf pans. Bake in the preheated oven for 70 minutes, or until a toothpick inserted into the center of the cakes comes out clean.  After removing them from the oven, immediately loosen cake edges with a knife.  Allow to cool in pans for 10 minutes, then remove from the pans.  Strip off the parchment paper and cool completely on wire racks.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Pound Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "WHOLEGRAINWOMAN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6262773722627735,
            "ratingCount": 685,
            "itemReviewed": "Grandmother's Pound Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "263.6 calories",
            "carbohydrateContent": "33.1 g",
            "cholesterolContent": "70.2 mg",
            "fatContent": "13.5 g",
            "fiberContent": "0.5 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "8.2 g",
            "servingSize": null,
            "sodiumContent": "103.7 mg",
            "sugarContent": "20.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-01T06:29:35.923Z",
                "reviewBody": "I have made this about 30 times since finding this recipe...I SOOOO should have posted this rating sooner. This was FANTASTIC...I noticed the last two people rated this with ONE star and they must be crazy or not experienced with baking. I bake almost every day...for the past 10 years and this is BY FAR the best pound cake recipe I have found yet. It is moist, tasty fluffy and flavourful....I think I baked it in less time, but I prefer things baked with a lower temp and less time...just a personal preference. I took it out as soon as the center seemed remotely cooked and left it on the counter for about an hour before attempting cutting it. It was soooo good. My hubby and kids ate a whole one that night and my hubby took another to work the next day and got rave reviews from it. This is the only pound cake I have made since finding this recipe and it will of course be the last...we have found a winner!!! SOOO tasty and moist. I have made this recipe as is about 25 times and a few times I made it with berries or apples or just with cinnamon. Its sooo good the way the recipe intended, but also good once in awhile with berries. Thanks soooooo so much for posting this recipe. Its definately a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pokoyo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2228243/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-30T19:29:18.447Z",
                "reviewBody": "This recipe was super easy to put togetherI used a 10 inch bunt cake pan and it turn out great the time has to be changed to 40minutes @350",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "David Moyer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2948596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-25T23:09:34.903Z",
                "reviewBody": "This is my Grandmother's Recipe too!  I have made a few changes over the years\r\nthough... I sub heavy whipping cream for the milk and add Vanilla, Butter and\r\nAlmond flavored extracts!  It's a beautiful cake!  A hit at every party!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUEENKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/214731/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-11T18:17:17.237Z",
                "reviewBody": "I took the following suggestions from the invaluable reviews: 1. Add a tablespoon of vanilla. 2. Replace 1 cup of white sugar with 1 cup of brown sugar. 3. Beat the butter and sugar for 5 minutes, and then for another minute as each egg is added. I also beat for a minute after adding the vanilla (which I do after the eggs). Result: A gorgeous, dense, flavorful, buttery cake with a crisp brown crust. For those who like Sara Lee pound cake (and I do) this creates a very similar flavor. Fantastic cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "limniade",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5963668/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-20T20:35:32.553Z",
                "reviewBody": "An excellent recipe and a true pound cake, where you use an actual pound of each ingrediant. I reject any recipe that does not have a pound of butter in it. Those cakes are good, but not true poundcakes. I've become a poundcake snob. LOL!\n\nI add some lemon zest, or a full two teaspoons of vanilla extract sometimes. I've also been known to trade the sweet milk, for buttermilk. \n\nI've made this and the other Grandmother's poundcake from this site over and over and will not use any other recipes for my pound cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy Lindquist Liedel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1283134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-09T17:43:48.907Z",
                "reviewBody": "I think the individuals that posted bad reviews have no concept of what pound cake is. If you're used to Sara Lee or Entenman's, don't bother. Real pound cake got it's name because you are supposed to use a pound of each ingredient. The result should be a very dense cake. Of course, you have to be careful not to overbake or you'll end up with something too dry!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "James Anthony Butler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-11T02:11:18.063Z",
                "reviewBody": "Yes, this is the formula for a classic American pound cake as it has been made for well over a century and a half (1:1:1:1 or 1 pound butter, 1 pound sugar, 1 pound flour, 1 pound eggs.) I used this as a base for petits fours, and the texture stood up to repeated cuts (I halved the recipe, and baked in a 9\"X13\" pan, then cut 7X10 into (70) 1-1/4\" squares) and didn't shed crumbs, neither when it was cut, nor when the fondant was poured over it. I did, however, add more milk. This was so short on liquid that the result was closer to a dough than a batter. I added 50% more milk, and added extracts (combo of almond, vanilla, orange, lemon , maple and coconut) as I needed the cake to have sufficiently assertive and complex flavor to stand up to the uber sweet fondant. The 9\"X13\" was done in 27 minutes. I cooled it in the pan for about 13 minutes, and it released beautifully onto the rack to finish. This cake is appropriately dense, sturdy and velvety moist (with additional liquid.) It's a 4-1/2 star recipe as is, but a 5 with additional milk and flavoring, which yields distinct sensory improvement.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-26T16:29:24.943Z",
                "reviewBody": "made this real pound cake again today. I dont understand the one star ratings this recipe is getting. you absolutely MUST beat the softened butter and sugar for more then five minutes with a good mixer. more like ten minutes. beat that mix like it owes you money. add the eggs one at a time. add your flavorings before the flour. remembering to subtract that liquid amount from the milk amount. add the flour and mix JUST UNTIL its blended in. I made a lemon bundt pound cake today. i used 1 and 1/2 juice and rind of regular lemons. added vanilla also. I only needed small amount of milk. im goin to glaze this deliciousness with lemon glaze and serve it for thanksgiving dessert.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elena Lemmon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9371789/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-19T15:24:43.75Z",
                "reviewBody": "This was delicious and exactly what I was looking for: rich, classic pound cake. I've made this cake twice in the last week.  Once with a tsp of almond extract and once with a tsp of vanilla.  I scaled it down to 15 servings to make one good sized loaf.  Because I didn't have enough of the right ingredients on hand, I substituted half of the white sugar for brown sugar, and the unsalted butter for salted butter. Instead of using parchment paper I buttered and floured the loaf pan. Result was terrific with (or despite??) my modifications!  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bibi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1806438/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T01:00:22.717Z",
                "reviewBody": "This turned out terribly. There was far too much butter and I know I followed the recipe to a tee. It was rubbery and tasted more like sweetened bread than any pound cake. If this was the intended outcome then it turned out just right, otherwise it's really just not a pound cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Csachick",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/611806/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Grandmother's Pound Cake II",
            "description": "This recipe is over 100 years old and is the original kind of pound cake: it contains 1 pound each of butter, sugar, eggs, and flour and contains no salt, baking powder, or flavoring.",
            "uploadDate": "2021-08-25T05:18:50.409Z",
            "duration": "PT1M11.008S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F34448bfd-4e87-45ac-9955-b33d1c4430c3%2F746f8b26-d5c2-495e-a278-833da1718314%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6269391869001"
        }
    }
]