[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21414/tiramisu-iii/",
        "name": "Tiramisu III",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3930993.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2000-09-08T21:58:37.000Z",
        "description": "Try this substitute for mascarpone in this recipe:  16 ounces of cream cheese combined with 1/2 cup heavy cream and 5 tablespoons sour cream.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT7H0M",
        "recipeYield": "1 - 9x13 inch dish",
        "recipeIngredient": [
            "5 egg yolks",
            "¼ cup white sugar",
            "½ cup Marsala wine",
            "1 cup heavy cream, chilled",
            "2 tablespoons white sugar",
            "1 pound mascarpone cheese",
            "2 cups strong brewed coffee, room temperature",
            "2 tablespoons white sugar",
            "½ cup brandy",
            "1 tablespoon vanilla extract",
            "48 ladyfinger cookies",
            "3 tablespoons unsweetened cocoa powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "To make zabaglione:  In the top of a double boiler, beat yolks and 1/4 cup sugar until smooth and pale yellow.  Place over simmering water and gradually beat in Marsala.  Continue to beat over simmering water until soft mounds form, 5 to 10 minutes.  Transfer to a cool bowl, cover and refrigerate 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whip heavy cream with 2 tablespoons sugar until soft peaks form.  Fold in mascarpone and zabaglione.  Cover and refrigerate 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, combine coffee, 2 tablespoons sugar, brandy and vanilla.  Arrange 16 ladyfingers in the bottom of a 9x13 inch dish.  Spoon about 1 tablespoon of coffee mixture over each cookie.  Ladyfingers should be soaked, but not crumbling.  Spoon one-third of the cheese mixture over the ladyfingers, and spread evenly.  Sprinkle with 1 tablespoon cocoa.  Repeat layering twice.  Cover and refrigerate 5 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "IANKRIS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.512195121951219,
            "ratingCount": 41,
            "itemReviewed": "Tiramisu III",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "497.4 calories",
            "carbohydrateContent": "37.7 g",
            "cholesterolContent": "257.1 mg",
            "fatContent": "30.9 g",
            "fiberContent": "0.9 g",
            "proteinContent": "9.2 g",
            "saturatedFatContent": "16.3 g",
            "servingSize": null,
            "sodiumContent": "98 mg",
            "sugarContent": "9.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-03-28T08:11:00.747Z",
                "reviewBody": "Well, my first time making, and boy I was impressed.  I compared recipes and many were similar but the quantities in this recipe were easy to acquire and assemble NO WASTE ie: only needing 1 tub of cheese, 250 ml (1 cup) of whippig cream etc. Only thing I wished being a virgin  TIRAMSU maker was to have a bit more detail about the importance of creaming the cheese before adding the egg custard, I did well but if wasn't perfect. So my tip would be to have the cheese room temp and use a heavy duty rubber spatula to work the cheese so it is soft and NOT curduy, but then again it could have been my brand of cheese.  LOVED THE RECIPE",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EYEZZCREAMM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/904182/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-03T12:58:41.07Z",
                "reviewBody": "This is a very good tiramisu. By using a zabaglione the problem of uncooked eggs is eliminated. Make sure to use sweet marsala. There is a recipe for ladyfingers submitted by Roxanne that is good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CRAIG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/255916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-04T20:55:41.39Z",
                "reviewBody": "I have made this twice and will make this again and again. VERY GOOD! I made a couple of changes I didn't have the Marsala but I substituted Brandy and the second time White Rum. I didn't add any alcohol to the coffee mixture there was enough flavour from custard mixture; also this is a good way to make so children and adults who don't want or can't have the extra alcohol. Instead of dusting with cocoa powder I grated finely bittersweet chocolate over top. Did I say how Good this is well it is Really Good.Try this one and you may not go back to cheesecake and I love cheesecake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLOVERDALE1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772039/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-10T21:36:45.98Z",
                "reviewBody": "This is a wonderful tiramisu recipe. What most people don't realize is that the \"store bought\" or often times \"restaurant served\" tiramisu is a knockoff that leaves much to be desired. Tiramisu is meant to have strong flavors to be truly Italian. I make this every time my office has a \"food day\". It's gotten to the point that when word goes out we are having a potluck I am bombarded with emails ensuring that I will be bringing the tiramisu. PLEASE NOTE - this recipe is meant to be made ahead of time and chilled preferably overnight. Rushing this dish will result in your disappointment and in a crunchy layer of ladyfingers and lumpy cheese mixture. To properly make tiramisu takes time and patience. I am Italian and it has taken me years to perfect tiramisu because of the time involved to make it correctly. If you make this properly between the chill times and actual work times it should take about 3 hours BEFORE you chill it which should preferably be overnight or at least 4-5 hours. If you take your time and are patient and ensure that your mascarpone mixture is lump-free you will have wonderful success with tiramisu!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3188345/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-11T20:39:27.123Z",
                "reviewBody": "My first Tiramisu and it came out very well. The only substitution I made was Kahlua instead of brandy for soaking the ladyfingers. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRIFF228",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1111662/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-31T16:28:24.273Z",
                "reviewBody": "This recipe is very authentic Italian! When we were in Italy a year ago we tried many tiramisus...and this one is very much like all the Italian ones...and even better than some of those. As far as the zabalione and whipped cream layers I added a little more as the layers were a little thin. So I use about 1 1/2 of everything the recipe calls for!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2069389/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-06T23:18:42.587Z",
                "reviewBody": "This wasn't as hard to make as I had originally thought. At first I thought the zabaglione tasted too \"eggy\" but when it was combined with all the other ingredients and left in the refrigerator for most of the day the final product tasted superb. I served it to friends (who I later found out were Tiramisu connoisseurs and had eaten it all over the world) and they said it was very good. Now I don't have to order Tiramisu at restaurants...I can make it at home!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARIASA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-16T20:06:26.483Z",
                "reviewBody": "A bit disappointed. I served this anyway since I spent so much money on the brandy and the Marsala wine. I think the problem was that it tasted too \"eggy\". I would only add 4 yolks not 5. Also it did not have the light airy taste of the cafe Tiramisu. I also recommend adding more than 1 TBS liquid to the lady fingers it took a full day for them to lose their \"crunch\".",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1235530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-09T23:03:46.653Z",
                "reviewBody": "I hate it when people \"redo\" a recipe that they have given 5 stars however I am putting in my two cents worth. I am not sure that I have had a tiramisu before but it is my sis's fav so I tried it. She loved it and said it got better over time. I am making it again for the second time for my step-daughter. I used a 9 by 9 and made 1 1/2 times the mixture to fill my pan. I used Godiva Choc. liqueur in place of brandy. I also grinded up dark choc and milk choc covered espresso beans and sprinkled on top along with the cocoa. The soft ladyfingers from Trader Joe's worked great. I am not sure if this is what true tiramisu is supposed to taste like but I really enjoyed it and will make again for special occasions. Thanks for the great recipe (and sorry for the revisions!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ALANA1966",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/886200/"
                }
            }
        ]
    }
]