[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
                    "name": "Custards and Puddings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14445/desserts/custards-and-puddings/flan/",
                    "name": "Flan Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/20979/spanish-flan/",
        "name": "Spanish Flan",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2015%2F09%2F691985.jpg",
            "width": 600,
            "height": 600,
            "caption": "Photo by dfdez78"
        },
        "datePublished": "2000-09-11T18:55:23.000Z",
        "description": "Delicious Spanish flan, everyone will love it!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 - 9 inch round",
        "recipeIngredient": [
            "1 cup white sugar",
            "3 eggs",
            "1 (14 ounce) can sweetened condensed milk",
            "1 (12 fluid ounce) can evaporated milk",
            "1 tablespoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium-low heat, melt sugar until liquefied and golden in color.  Carefully pour hot syrup into a 9 inch round glass baking dish, turning the dish to evenly coat the bottom and sides.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat eggs.  Beat in condensed milk, evaporated milk and vanilla until smooth.  Pour egg mixture into baking dish.  Cover with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven 60 minutes.  Let cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, carefully invert on serving plate with edges when completely cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Custards and Puddings",
            "Flan Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ASOTO"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.384680134680135,
            "ratingCount": 1188,
            "itemReviewed": "Spanish Flan",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "348.8 calories",
            "carbohydrateContent": "56.7 g",
            "cholesterolContent": "100.1 mg",
            "fatContent": "9.7 g",
            "fiberContent": null,
            "proteinContent": "9.5 g",
            "saturatedFatContent": "5.4 g",
            "servingSize": null,
            "sodiumContent": "138.7 mg",
            "sugarContent": "56.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-11T20:30:47.453Z",
                "reviewBody": "Best recipe. Simple and the traditional way of making flan. Tips: Keep your baking dish warm/hot in the oven while you make the flan, so that when you do pour your caramel (melted sugar) into it, the caramel doesn't harden as quickly. When melting sugar, be patient and keep the heat LOW because the sugar may brown too dark. Don't fret if you still have small lumps of sugar in the end.. they will desolve when you bake the flan. As for the flan mixture, blend everything in a blender (adding the condensed milk last because its thicker) for the most effective and fastest way of mixing. Also, personally 3 eggs is not enough for me.. I add 5 (known people that add a lot more)... but the egg  amount depends on YOUR density peference. Good Luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "artsychicany",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1873495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-05T15:34:35.11Z",
                "reviewBody": "For first time flan makers: By no means an I a novice in the kitchen:(just never made caramel before) however, it took 3 tries and several phone calls before I got the caramel right. The recipes do not say that the sugar will go from syrupy to hard and rocky looking and that continued cooking and stirring will return it to the liquid caramel state you are striving for. Not knowing this caused me to toss the first two batches.  Be patient, took almost half an hour. Keep the heat low and keep it moving in the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Dolores",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2364615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-10T21:02:12.343Z",
                "reviewBody": "This is the one.  I've made several flan recipes from this site and others and this recipe is the best. Have made this one several times now, and it is by far the best.  Some hints:  Melt the sugar with a drop or two of lemon juice. Do not stir the sugar while it's melting, just swirl in the pan occasionally. If you are worried about the sugar hardening too fast, heat the pan under hot water until ready to pour in sugar and dry with a towel.  A warm pan will give you a little more time to tilt and coat the bottom before the sugar hardens. When you pour the custard into the sugared pan, pour it through a sieve to strain the mixture (I would recommend this tactic with all custard type dishes). Bake the flan in a water bath...it's not hard to do, and yields much better results. Last, bake this dish a day ahead of time.  Let it sit overnight in the fridge (cover with wrap) before warming the pan's bottom in a warm water bath, then invert to release on a plate. Much of the carmel will have liquified and will run over the flan. Yum!  If there's some hard surgar left in the pan, who cares?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Gless",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/131770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-05T08:31:02.483Z",
                "reviewBody": "This is the recipe i've always used... but for what here in Mexico we call Chocoflan or Pastel Imposible (in southern mexico.. Impossible Cake)... all you have to do is prepare a chocolate cake mix and pour it over the flan mixture, then bake it on water bath (350 degrees) for 1:20 hours.... I promise you won't regret it :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Icy Tea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1234403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-09T15:11:41.17Z",
                "reviewBody": "This was an awesome recipe!  Easy to make and more wonderful to eat!  If you are worrying about the carmelized sugar hardening too fast, mix all the ingredients first, and then melt the sugar and swirl in the baking dish.  This way, there is no gaps between swirling and pouring your flan  mixture into the dish.  Also, as a slight variatioin, I added 4oz. (half bar) of cream cheese to the recipe - to give it a firmer texture, since you're only using three eggs.  After the flan had cooled completely (about an hour), we could eat it right away instead of torturing ourselves and waiting overnight.  You'll be glad you added the cream cheese!  Serving suggestion - serve with a scoop of dulce de leche ice cream - you can't go wrong!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JADENIKITA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1039312/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-13T05:53:02.127Z",
                "reviewBody": "WOW! Great, restaurant-quality flan that's creamy, rich, and the perfect sweetness. I blended the ingredients in a blender, which eliminated the need to strain the egg mixture, and I used a water-bath to make sure it had a delicate texture. Also, I kept the baking dish I was using over the oven vent to keep it warm, so the caramel didn't harden right away and was easy to spread. I've made this a few times, and it's perfect every time! For an adult variation, replace 2oz. of the evaporated milk with 2oz. of caramel cream liqueur. Yummo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Natalie F.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1514183/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-05T00:40:44.32Z",
                "reviewBody": "I liked this flan. It is a bit different than most I've had because of the reduced amounts of eggs. However, it works very well and it was tasty. One thing I wanted to mention.... the caramel/syrup thing seems to give some people problems but it can be done very easily with this short cut I use ALL THE TIME! I took a pyrex measuring glass (the 2 cup capacity one) and added 1/2 c water , then I added the cup of sugar to that water and stirred. Then, I placed it in the microwave and VOILA!!! Depending on the power of your microwave, the time will vary. It will take about 7-10 minutes at high power for the water/sugar mix to turn to caramel. Take a peek to make sure it doesn't get too dark though or it will taste bitter! You want it a medium amber color. DO NOT touch the syrup at any time!! I have a friend that did and the skin on her finger practically came right off and she didn't stop screaming for a while. OK?? BE CAREFUL! If you notice that the syrup hardens when it gets on the pan, don't worry. It will do so!! The important thing is to get it distributed in the pan as good as you can. It will melt again when baking. I always use a water bath and do not cover with foil (or anything else).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-25T17:26:34.38Z",
                "reviewBody": "I loved this recipe. I decided to use this recipe since it seemed easier than the rest. I followed other suggested suggestions and used 1 extra egg and added cinammon. I also put some vanilla in my sugar after it melted down. I used a water bath by placing it onto a cookie sheet filled with water. I ran out of foil so I placed another cookie sheet upside down on top of the flan. Its's a trick I use whenever I run out of foil and it works great every time. This was my first time making flan and I expected it to be complicated but it was so much easier than it seems. I plan to keep using this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMeisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2899763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-01T16:44:11.223Z",
                "reviewBody": "I like that it has less eggs and it takes little ingredients for the flan but it is missing a key ingredient for caramel.   1. Add some WATER! I learned this from foodnetwork, add til it looks like \"wet sand.\"  With plain sugar you're more opt to burn it. 2. Keep stirring, constantly  3.  Take it off the heat the moment it reaches the color you want and have your dish(es) ready because it will harden almost immediately. I use individual glass custard cups. 4.  Sugar likes to recrystallize, as one reviewer noticed, so add a few drops of something acidic.  I always have lemon juice on hand so I use that.  5. Try medium heat, med low is too low.  You can go higher but be careful.  Then for the flan, it is custom to give it a \"baño de maria\" or \"water bath\" by inserting your flan dish into a larger dish, and filling the larger dish with hot water that reaches about halfway of your flan dish.  It prevents it from cooking too much.  And last but not least, I learned from experience that you NEED to give flan many hours of refrigeration, preferably overnight.  You need to give the caramel time to re-liquefy, otherwise you'll be like my first flan ever and have hard candy discs! I hope this helps, its truly not difficult with a little advice and a bit of practice.  Happy baking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alaena39",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3629080/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Spanish Flan",
            "description": "This creamy flan custard will become everyone's favorite dessert.",
            "uploadDate": "2012-06-05T22:06:34.806Z",
            "duration": "PT2M35.52S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa69ce660-8c49-443e-880a-a05c140bbc1b%2Feeb742a0-6f75-40c2-bf84-72e66a2cda51%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1675230941001"
        }
    }
]