[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16166/desserts/specialty-desserts/pralines/",
                    "name": "Praline Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21038/pralines/",
        "name": "Pralines",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F423715.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2000-09-13T20:00:36.000Z",
        "description": "Had these in New Orleans and loved them, so I tried different combos and liked this best.",
        "prepTime": null,
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "1 ½ cups toasted pecans",
            "1 ½ cups white sugar",
            "⅜ cup butter",
            "¾ cup brown sugar",
            "½ cup milk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Line a baking sheet with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In large saucepan over medium heat, combine pecans, sugar, butter, brown sugar, milk and vanilla. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop by spoonfuls onto prepared baking sheet.  Let cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Praline Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MARKR"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.46829268292683,
            "ratingCount": 205,
            "itemReviewed": "Pralines",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "179.6 calories",
            "carbohydrateContent": "24.5 g",
            "cholesterolContent": "9.6 mg",
            "fatContent": "9.4 g",
            "fiberContent": "0.8 g",
            "proteinContent": "1 g",
            "saturatedFatContent": "2.8 g",
            "servingSize": null,
            "sodiumContent": "29.3 mg",
            "sugarContent": "23.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-02-23T00:34:48.093Z",
                "reviewBody": "I'm from New Orleans and have been making pralines since I was a child. The proportions of this recipe are about right, but it leaves out the most essential step, which is beating the mixture after it reaches soft ball stage until it develops a matte sheen. The texture should have tiny crystals. The pralines should snap when you break them, and melt in your mouth.\n\nIt takes some practice to know exactly when to stop beating -- too soon and you have a translucent caramel. If you go too long, the mixture is too thick to spread when you're dropping them.\n\nAnother trick is to not stir the syrup after it starts boiling to prevent early crystallization. If you're tempted to scrape down the sides, don't do it -- instead, cover the pot a couple of minutes and let the steam wash them down.\n\nAlso, we always used raw pecans, not toasted. A pinch of salt brings out the flavor of the pecans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kikinola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6597304/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-12T03:55:02.873Z",
                "reviewBody": "These pralines were awesome!  A word of caution to anyone who is not familiar with candy making:  when your mixture has reached the desired consistency/temperature, remove from heat and transfer hot pan to an ice bath.  Beat the mixture until light in color and thick, then spoon (using two spoons) onto a baking sheet lined with wax or parchment paper brushed with butter.  Let cool, then peel wax paper or parchement away from the pralines.  The ice bath part is important as if you just cool slightly and spoon out then you will have a runny mess, not the praline shape that is desired.  Other than that, this recipe was AWESOME!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNDMN28",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/182112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-13T19:27:35.763Z",
                "reviewBody": "I read a lot of the recipes and reviews and combined a lot of ides for this...and here's some useful info.  Iused 2 cups pecans - both chopped and whole. Toast them for 10 minutes on 300 for a crunchier praline, stirring once. 3/8 cup butter is 6 Tablespoons. Use whole milk or even light cream. Use 1/2 teaspoon salt.  Vanilla keeps its flavor best if stirred in after removing from heat.  The ice bath was great idea as it needed to cool to coat the pecans the best. \r\nThen I cooled them in the freezer so I could eat them right away because they were yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "FRALTONY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/915360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-13T21:54:20.153Z",
                "reviewBody": "I do not have a candy thermometer so I let the mixture boil for 3 minutes. I used buttermilk and did not toast the pecans--mine were pretty fresh; I've found that toasted nuts are needed when they are not very fresh. Also using a mix of broken pecans and intact halves seems to work best for me--I leave most of the halves intact to keep the flavorful pecan oils inside. I am from Louisiana and had never made pralines myself as I could easily obtain them back home. I now live out west and have not been able to find them in my town. After the expense of having some shipped from New Orleans a couple of months ago I decided to try this recipe after having reviewed several different recipes. I am really glad I did. This satisfied my praline craving without having to wait for the FEDEX man! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAJAJOJO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/274202/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-22T16:00:41.197Z",
                "reviewBody": "This recipe was excellent and very similar to the Pralines at River Street Sweets in Savannah, GA. I did not toast my pecans. The best outcome seemed to depend on when I poured them out on the cookie sheet. The ones that I spooned out immediately were too flat and glossy. The ones that I spooned out after the mixture had cooled were too crumbly. The ones that I spooned out after the mixture had cooled for 2-3 minutes were the perfect consistency. I would recommend waiting just a couple of minutes, then quickly spooning them onto the cookie sheet. I will definitely be making these many times over the holiday season!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ATHOMELAUREL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1057992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-20T21:05:52.74Z",
                "reviewBody": "Wow! Just got back from a trip to Georgia and these ARE like the Savannah pralines!  On the advice of others, I used an additional 1/2 c. pecan pieces, chopped, and evaporated milk instead of regular milk (I heard somewhere that that is what they use).  I didn't bother toasting the pecans although I imagine they would add some nice flavor.  Still tasted good w/untoasted, so if you don't have the time to toast, I wouldn't sweat it.  I used a candy thermometer, and after it reached the soft ball stage, I took it off the burner, added the vanilla and stirred quickly.  Because the ice bath seemed a little too much overkill for some reviewers (and it wasn't setting fast enough for me!), I just filled the sink w/cold water and dipped the bottom of the pan for maybe 5-10 seconds.  I removed the pan and stirred the heck out of it, then used a small cookie scooper to immediately scoop the stuff onto the foiled pans.  I figured that if these are as sweet as some say, I'd opt for the smaller sizes.  They're ready almost immediately!    I love baking, but candies have always eluded me in the success category.  I am shocked that these not only turned out, but they turned out GREAT.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLDROE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1430470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-23T16:00:54.64Z",
                "reviewBody": "Terrific recipe! I made these to give away as Christmas treats, but they never made it to the tins.  They were devoured by my family in less than 48 hours.  The only thing different that I did was to put the pot(of praline ingredietns) in a ice water bath prior to spooning them onto the baking sheet.  If you do this, make sure you stir the mixture constantly as it forms quickly.  The ice bath helps the pralines to set with a smooth texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Salena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1694479/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-17T21:41:58.973Z",
                "reviewBody": "Excellent praline recipe. I have just come back from a trip to Savannah Georgia and brought River Street Sweets pralines home with me. My family loved them so much they begged me to make some pralines and I have to say this recipe is very close to River Street Sweets. River Street Sweets pralines have a little more depth in flavor. I used light cream instead of milk. I let them sit 2 to 3 minutes before I poured them onto my cookie sheet. That seemed about the right amount of time...sooner and they would have been too liquidy and too much longer they would have been too hard. Next time I make these I will try using buttermilk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pyar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3033898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-19T03:50:00.247Z",
                "reviewBody": "This is a great praline recipe- I've never made them before and this was the first and will be the only recipe I try! Relatively easy- I'd just note that if you don't wait for the pralines to cool down a bit before spooning them out they'll run all OVER the place and though they will still taste great you'll have a real mess on your hands....yum! Pralines rule!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAMELAMATTHEWS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/388712/"
                }
            }
        ]
    }
]