[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21108/oatmeal-whole-wheat-quick-bread/",
        "name": "Oatmeal Whole Wheat Quick Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9168851.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-09-15T19:15:19.000Z",
        "description": "There's no yeast in this bread, so it's good for special diets. You may also use soy milk instead of regular milk if you wish. It's pretty dense, but great when fresh from the oven. Especially with butter and honey on cold mornings!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "1 loaf",
        "recipeIngredient": [
            "1 cup rolled oats",
            "1 cup whole wheat flour",
            "2 teaspoons baking powder",
            "½ teaspoon salt",
            "1 ½ tablespoons honey",
            "1 tablespoon vegetable oil",
            "1 cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 450 degrees F (230 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Grind oatmeal in a food processor or blender. In a large bowl, combine oatmeal, flour, baking powder and salt. In a separate bowl, dissolve honey in vegetable oil then stir in the milk. Combine both mixtures and stir until a soft dough is formed. Form the dough into a ball and place on a lightly oiled baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for about 20 minutes, or until bottom of loaf sounds hollow when tapped.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Zoe"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.183098591549296,
            "ratingCount": 355,
            "itemReviewed": "Oatmeal Whole Wheat Quick Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "88 calories",
            "carbohydrateContent": "15.1 g",
            "cholesterolContent": "1.6 mg",
            "fatContent": "2.2 g",
            "fiberContent": "1.9 g",
            "proteinContent": "2.9 g",
            "saturatedFatContent": "0.5 g",
            "servingSize": null,
            "sodiumContent": "166.2 mg",
            "sugarContent": "3.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-08T17:19:35.717Z",
                "reviewBody": "Very tasty. I have made this bread several times now and it always turns out well. It is a good recipe for add-ins. For example. try throwing in a handful of shredded American cheese for a cheesy bread. Also, when you make this bread, do be sure to measure in the oil before adding the honey. This way, you have an oiled spoon to measure the honey with, and the honey just slides out nicely instead of sticking to the spoon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1969723/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-25T16:32:05.763Z",
                "reviewBody": "Nice wheat taste, not too sweet.  I didn't feel like grinding up the oatmeal, and it turned out fine.  However, the batter was too runny to just slap on a baking sheet, so I put it in a pan.  If you do so, beware: grease the pan very well, as this bread likes to stick!  This was EXTREMELY fast; from start to finish it took no more than 25-30 minutes.  The finished product is very small; if you want a real-sized loaf I suggest doubling the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HAGANRD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/772885/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-22T02:37:58.547Z",
                "reviewBody": "This was a great recipe. My first non-sweet bread recipe I've made from scratch. Very tasty and delicious.\n\nI did as others recommended, and doubled the recipe to create a full-size loaf. I baked it at 350 for 1 hour in a loaf pan, and that was perfect.\n\nSubstitutes I did: Skim milk instead of whole. Extra virgin olive oil instead of vegetable oil, and I added 1/2 cup of ground flax seeds. Both the olive oil and ground flax added healthy fats to the bread, and the flax also added a little extra fiber and protein.\n\nI also didn't grind the oats, either. I like having big pieces of grain in my breads.\n\nThanks for sharing your recipe! It's so nice baking bread at home so you can control what goes into it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KELLYRO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/581087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-22T13:52:44.623Z",
                "reviewBody": "I originally chose this recipe because it was full of healthy stuff, but I will continue making it because it is absolutely delicious!  I made the following substitutions to make it a little healthier:  2 tbsp sugar-free maple syrup for the 1.2 tbsp honey and 1 tbsp natural applesauce for the 1 tbsp vegetable oil.  I also made these additions for flavor:  3/4 cup raisins, 1/2 tsp cinnamon, and 1/2 tsp imitation vanilla.  Also, I did not grind the oatmeal and found that I would prefer it this way.  I used 1/2 cup skim milk + 1/2 cup 2% milk and would recommend this as well.  I love to eat this for breakfast in the morning spread with a little butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EMILY052005",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1246647/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-11T13:00:19.357Z",
                "reviewBody": "I didn't like how the first loaf came out so small, so I modified a few things and baked it again a few hours later so that I could get the desired result.  Consequently, I doubled the recipe, put the batter into a greased loaf pan, and baked it for 1 hour at 350 F.  Both loaves were dense (like the recipe said that they'd be) and yummy (esp. with butter/jam/whatever on a slice)!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PerkyKoala",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-26T10:28:02.57Z",
                "reviewBody": "I soured my milk with two tablespoons of lemon juice. Instead of baking this on a oiled baking sheet, I baked this in a greased loaf pan. Right before baking, I drizzled a couple tablespoons of melted butter over the dough in the pan. GREAT breakfast bread. I made a strawberry cream cheese spread to schmear over it--the family flipped for it. I bet this would make an EXCELLENT beer bread using beer in place of the milk.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-22T03:44:10.5Z",
                "reviewBody": "Five stars for simplicity healthfulness taste texture and versatility. This bread turned out better than I thought it would. I doubled the ingredients and poured the batter/dough into a loaf pan. I baked it at a slighly lower temperature for a bit longer and it turned out beautifully. I did cover the loaf with foil about halfway through the baking time. I only substituted one ingredient: I used vanilla soy milk instead of cow's milk - I realized as I combined the dry ingredients that I was out! The vanilla flavor did wonders for the bread. It's a tinge sweeter I think than if I had used regular milk. It made my home smell wonderful too as it baked. I will definitely make this bread again probably substituting something else (applesauce or yogurt) for the oil and I may add other fruits nuts or seeds if something catches my fancy. All in all a fabulously simple tasty and nutritious bread. Thank you SO much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "~Severed*Consciousness~",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1985703/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-10T01:19:48.75Z",
                "reviewBody": "I bake bread nearly every week, and as we were just about out of bread and out of yeast (and the store didn't have any yeast in stock!), I was looking for a good whole-grain quick bread. This recipe looked like it fit the bill.\n\nAs others had suggested, I doubled the recipe, used a loaf pan, and baked it for an hour at 350F. I used maple syrup instead of honey and, lazy me, didn't grind the oats.\n\nThe taste is excellent, and the texture is definitely dense and hearty. This is not a bread one could use for sandwiches, so I'll have to bake something else in a day or two, but I'm glad to have this very quick and delicious recipe. I may try to process the oats a bit next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "owlice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2666983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-22T22:17:46.343Z",
                "reviewBody": "This is the first bread I've ever made - and it actually came out great! I didn't grind the oatmeal, subbed applesauce for oil, soy milk for milk, and 1 Tbsp of splenda for the honey because I didn't have honey. I added about 1/2 C of ground flaxseed, about 1/4 C of unprocessed bran, and some sesame seeds just because I like them. I also sprinkled some sesame seeds on top and sprayed the top of the dough with spray oil. It turned out dense and soft on the inside with a nice crust. When I made it a 2nd time with less additions, 1 C of milk was too much. I'm going to experiment with more add ins, like seeds or dried fruit. Love this bread!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "urbangrrl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2637036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-24T07:36:17.03Z",
                "reviewBody": "it tasted great but no matter what i do it always come raw inside and hard outside..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Mister P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2079338/"
                }
            }
        ]
    }
]