[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/363/desserts/custards-and-puddings/",
                    "name": "Custards and Puddings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14445/desserts/custards-and-puddings/flan/",
                    "name": "Flan Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22220/creamy-caramel-flan/",
        "name": "Creamy Caramel Flan",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8898771.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-09-19T19:50:41.000Z",
        "description": "This recipe is a cross between egg custard and cheesecake.  Rich and delicious.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT8H0M",
        "recipeYield": "1 10 inch round",
        "recipeIngredient": [
            "¾ cup white sugar",
            "1 (8 ounce) package cream cheese, softened",
            "5 eggs",
            "1 (14 ounce) can sweetened condensed milk",
            "1 (12 fluid ounce) can evaporated milk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small, heavy saucepan over medium-low heat, cook sugar, stirring, until golden.  Pour into a 10 inch round baking dish, tilting to coat bottom and sides.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat cream cheese until smooth.  Beat in eggs, one at a time, until well incorporated.  Beat in condensed and evaporated milk and vanilla until smooth.  Pour into caramel coated pan.  Line a roasting pan with a damp kitchen towel.  Place baking dish on towel, inside roasting pan, and place roasting pan on oven rack.  Fill roasting pan with boiling water to reach halfway up the sides of the baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven 50 to 60 minutes, until center is just set.  Cool one hour on wire rack, then chill in refrigerator 8 hours or overnight.  To unmold, run a knife around edges of pan and invert on a rimmed serving platter.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Custards and Puddings",
            "Flan Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jo Poynor"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.62807525325615,
            "ratingCount": 691,
            "itemReviewed": "Creamy Caramel Flan",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "349.7 calories",
            "carbohydrateContent": "41 g",
            "cholesterolContent": "141.9 mg",
            "fatContent": "16.6 g",
            "fiberContent": null,
            "proteinContent": "10.5 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "191.2 mg",
            "sugarContent": "40.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-26T03:38:16.2Z",
                "reviewBody": "Here is how NOT to make this recipe: The first time I made it, I poured the sugar syrup into the glass baking dish, and because the glass was cool, the sugar hardened almost immediately. So after I spent the next 30 minutes chipping a rock-hard blob of sugar out of the bottom of my dish, I tried it again. But this time, I put the baking dish in a hot oven for about 5 minutes before adding the sugar. The hot dish kept the sugar liquified just long enough for me to get an even coating. After I learned that trick, the flan turned out very well. I made this for dessert after a Mexican-themed dinner, and everyone really liked it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/714148/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-26T15:50:03.93Z",
                "reviewBody": "I let this flan sit over night in the fridge, but when I flipped it out of the pan the next day, almost all of the caramel stayed in the pan with hardly any of it at all on top of the flan. What am I doing wrong?? Can anybody help me??",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "I Need Help",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2180775/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-15T20:32:05.263Z",
                "reviewBody": "so good, so creamy! I don't usually care for the regular flan consistency, so I tried this creamy one - oh my so good and so easy. I didn't use their caramel recipe though - too many people seemed to have problems with it.  I used a carmel recipe I have (1 small box brown sugar, 1 stick butter, 1 cup half and half, pinch of salt, tsp of vanilla- boil for three minutes).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMITTIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28753/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-16T16:55:47.09Z",
                "reviewBody": "This is my grandmother's recipe.  I love it!. Have been making it for years.  TIP:I just put all the ingredients in the blender and it makes a very smooth and creamy flan. Great time saver!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SandraJZ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2317101/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-01T16:11:39.093Z",
                "reviewBody": "I havent made this recipe but it is exactly the same as mine, so I bet is the best one on this page!! =D\nOne person said that she poured the caramel in a cold glass baking dish and it hardened immediately, so she had a hard time taking it out and doing it again.. Let me tell you, I have made this recipe for years and sometimes it hardens like u said and theres no problem, since you normally put the flan mixture on top and its going to be cooked in the oven, melting the caramel again, evenly on the bottom. So, if the caramel is not spreaded evenly at the beginning, dont worry, the flan is going to turn out amazing anyway..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gaby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2704489/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T19:03:12.903Z",
                "reviewBody": "This caramel flan is perfect.  I have made it twice, once for a dinner party and once for a wedding reception.  Everyone who tries it LOVES it, even people who don't necessarily have a liking for flan.  People also keep asking me when I am going to make it again.  The melted sugar is very simple if you pay attention because it will seem like the sugar will never melt and then all of sudden it is brown and fluid.  Simply pour into the pan quickly and try to coat as much as possible before it hardens.  It doesn't matter if it coats the bottom of the pan unevenly because the flan mixture sitting in the pan for 8 hours while it is refrigerating, will smooth out the melted sugar and make a perfect topping once it is flipped.  (Trust me, both times the sugar hardened too quickly but the end result was perfection.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAROLYNWEB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1018547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-04T19:28:44.237Z",
                "reviewBody": "This tastes really great - the whole family loved it! I made it exactly as written. Some other reviews had trouble with the caramel but I made mine - just sugar - in about 7 minutes. I did warm the pan in the oven while it was heating and everything turned out a dream. One note about the pans - you really need a proper deep cake pan (NOT springform as water will get in) - I used an 8\" pan with 3\" sides and it was perfect. I did have a 10\" pan but found it wouldn't fit into any of my baking pans for the \"bath\" - I also would find it challenging to find a 10\" rimmed platter (and it does need a rim as the caramel is runny) - so the 8\" was great to fit into a baking pan and onto a plate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3628370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-27T17:12:34.873Z",
                "reviewBody": "Loved this recipe! I made three for a big party and it was great. Some tips I used were to let the eggs and cream cheese come to room temp before mixing, be sure to beat well after each egg is added for the lightest texture and don't overcook sugar in the first step. If you do make more than one at a time like I did, do not try to do the carmelized sugar in one large batch, it will not work well, I had brittle sugar by the time it had all melted, then I redid it in individual batches. But I used the brittle for decoration.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "fitforaqueenclothing.com",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/212781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T22:55:15.043Z",
                "reviewBody": "This has a very nice texture. It is very dense and more like cheesecake which I like. I did have a few problems though. I can't melt sugar and make caramel. I used a recipe that calls for 2 cups of sugar and 3/4 cup of water and cooked that and made beautiful caramel. Just a reminder to others make sure all your ingerdients are at room temp. not just the cream cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            }
        ]
    }
]