[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21712/chocolate-covered-strawberries/",
        "name": "Chocolate Covered Strawberries",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F845742.jpg",
            "width": 3888,
            "height": 2592
        },
        "datePublished": "2000-09-22T04:03:07.000Z",
        "description": "This is the simplest version of chocolate covered strawberries I know. Paraffin was originally used instead of shortening. Turn the strawberries upside down and insert by the toothpicks into a piece of styrofoam for easy cooling, or simply place them on a sheet of wax paper. White chocolate may be drizzled over the milk chocolate for a fancier look. They are perfect for weddings when decorated with frosting bow ties, bells, butterflies, roses, etc.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT0H15M",
        "recipeYield": "3 cups",
        "recipeIngredient": [
            "16 ounces milk chocolate chips",
            "2 tablespoons shortening",
            "1 pound fresh strawberries with leaves"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a double boiler, melt the chocolate and shortening, stirring occasionally until smooth. Holding them by the toothpicks, dip the strawberries into the chocolate mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Insert toothpicks into the tops of the strawberries.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the strawberries upside down and insert the toothpick into styrofoam for the chocolate to cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kitten"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.809951060358891,
            "ratingCount": 1226,
            "itemReviewed": "Chocolate Covered Strawberries",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "115 calories",
            "carbohydrateContent": "12.7 g",
            "cholesterolContent": "6.2 mg",
            "fatContent": "7.3 g",
            "fiberContent": "0.4 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "31.3 mg",
            "sugarContent": "10.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-19T02:36:25.843Z",
                "reviewBody": "Chocolate can be a mystery, so Here is a tip to keep your chocolate from becoming too thick. When you are melting over a double boiler, don't let the water touch the bottom of your upper pan.  Heat until only 1/2 of the chocolate is melted, then remove from heat and stir gently until it is all melted.  The chocolate should actually be cool or tepid to the touch.  If it's hot, chances are it will sieze up and thicken.  If it does that, no amount of heating or stiring will fix it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carrie Causey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1496190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-20T21:31:24.75Z",
                "reviewBody": "Sooooo Good! I am giving one dozen of these to my Mother and Father in law for their 9th anniversary. I am on a fixed budget and it only cost me $4.50 to make these - No Kidding! $2.50 for Strawberries (18), and the chocolate (milk & white) was on sale for $1.00 a bag each! They look gorgeous and taste even better. I also used a small crock pot instead of a double boiler which worked out well. I dipped the strawberries in milk chocolate, let them cool in the fridge for approx. 15 minutes and then took a toothpick, dipped it in white chocolate and strung it over the milk chocolate. AWESOME!!! Check out the photo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn Powell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1527759/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-09T02:40:57.047Z",
                "reviewBody": "Just FYI:  Chocolate chips come in 11.5 ounce bags now.  I used half milk chocolate and half semi-sweet chocolate and I did not use shortening, but butter (a little less than 2 T due to smaller bag of chips).  Since chocolate burns easily and then gets hard and globby (even in the microwave), it is good to get the water in the double-boiler actually boiling, melt the butter (or shortening) first, and then add the chocolate so everything is nice and toasty warm for it to gently melt.  If you don't have a double-boiler, try using a regular pot, get the water boiling in it, then use a smaller pot to rest in the big one to melt the butter & choc chips.  These are really tasty.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LADYJAYPEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/819317/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-02T21:58:26.67Z",
                "reviewBody": "I've been making chocolate covered strawberries for awhile, and the key is proper tempering and good chocolate. You shouldn't need to add anything at all to the melted chocolate -not even butter or shortening. It detracts from the the flavor of the chocolate. One of the best types of chocolate around is Callebaut -it's superb, and you can find it online. I have found that the higher quality the chocolate is, the better consistency it has for dipping when tempered. Tempering requires a lengthy explanation, but Allrecipes has an excellent article on how to do it here: http://allrecipes.com/HowTo/Tempering-Chocolate/Detail.aspx \n\nTrust me, you *will* notice the difference between properly tempered chocolate and non-tempered chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "JLeigh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1700971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-31T19:17:35.437Z",
                "reviewBody": "Awesome!  I've never made these before because I assumed that they would be very difficult and time-consuming, but these were very simple.  I used an 11.5 oz. bag of milk chocolate chips and slightly less than 2 Tbsp. of shortening and they turned out perfectly. I don't own a double boiler so I microwaved the chocolate chips and shortening in a glass bowl (about 2-3 minutes at 70% power) and used the toothpicks and styrofoam idea, which worked very well.  I dipped 30 medium to large-sized strawberries and still had quite a bit of the chocolate mixture left over.  I'm sure that I could have dipped at least 10 more strawberries.  Also, be sure that the strawberries are thoroughly dry so that the chocolate will stick properly.  Thanks for a great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GERILYNN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/119311/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-05T18:16:48.497Z",
                "reviewBody": "These are great!!  Very easy!!  This makes ample chocolate for dipping, so you could dip a few bananas or extra strawberries (I had a lot of chocolate sauce left over.)  Next time, I think I'll use semi-sweet chocolate instead of the milk chocolate - I think it would taste even better.\r\nI was unsure of how far to dip the strawberries (all the way to the top?), but I saw a picture of dipped strawberries in a magazine, and they had only dipped the strawberries half-way to the top, with white chocolate drizzled in zig-zags across the chocolate.  Beautiful!! Since strawberries are known to be grown with a lot of pesticides, I rinsed the strawberries first with a veggie wash, but I was careful not to bruise them, and I let them drain on paper towels until they were thoroughly dry so the chocolate would adhere properly. Any moisture would have interfered with the chocolate adhering.  Thanks for this great recipe!!  So easy, yet so beautiful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-25T20:06:46.543Z",
                "reviewBody": "I used a regular pot on the stove and melted the 2 T. of shortening first and then added an 11.5 oz. pkg. of Guittard milk chocolate chips.  It melted up very smooth!  I stuck toothpicks in the (dry) strawberries, dipped them in the chocolate, and then placed them in upside down plastic strainers/colanders with small holes.  They worked really well and the strawberries were very tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JODI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/834078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-08T06:55:20.467Z",
                "reviewBody": "I LOVE making chocolate covered strawberries, especially for Valentine's Day.  Over the years I've learned to add a little kick to them.  Here are my little secrets - 1) I use semi-sweet chocolate and definitely drizzle the white chocolate over for a beautiful effect; 2) SPIKE THEM! - and here's how... Fill a syringe with a sweet white dessert wine, like a nice Reisling, and slowly inject the wine into the strawberries from near the stem (after you've done the dipping in chocolate.)  You want to inject enough wine to saturate the berries, but watch not to add too much otherwise they end up becoming runny.  These are always a hit when I bring them to dinner parties and of course when treating my husband to a romantic dinner at home.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rashmi B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1560999/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-02T15:47:14.22Z",
                "reviewBody": "These were an excellent, easy and elegant dessert that we really loved. Like some others, I omitted the shortening and did not miss it. I also found that 12 ounces of Ghiradelli Dark Chocolate (or \"bittersweet\") chips was good for 2 pounds of strawberries.  I also just dipped the berries,let the excess chocolate drip off, and placed them on a wax paper lined cookie sheet in the refrigerator for about 4 hours until I was ready to serve them.  (The chocolate hardened in about 30 minutes.) I still had a little bit of chocolate left, so I drizzled it over pretzel sticks and put them in the refrigerator to harden. Once the chocolate was set, I put them in a zip lock bag to enjoy later. We will definitely make these strawberries again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/686299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-19T22:04:19.530Z",
                "reviewBody": "I am wondering how you got the strawberries to stay on the toothpick when dipping!!! Every time I tried this, the srtawberry was so heavy, when I dip it in the chocolate, it falls off the toothpick and into the double boiler!!! I ended up just holding then end and getting chcolate all over my fingers and leaving the berries on wax paper to dry. I was just making them for fun so the appearance didn't have to impress anyone!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alyssa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1461948/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chocolate Covered Strawberries",
            "description": "See how to make luscious chocolate-covered strawberries.",
            "uploadDate": "2012-04-04T00:05:22.013Z",
            "duration": "PT1M42.102S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F041853d0-97e1-4571-9449-7758d74e359a%2Fa4b71e14-df7e-4931-b2c7-a43e9e7fad30%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1545751365001"
        }
    }
]