[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21829/marinated-pretzels/",
        "name": "Marinated Pretzels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8108082.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2000-09-24T05:03:16.000Z",
        "description": "Large, salted sourdough pretzels work best for this appetizer. The marinade gives them a tangy, addictive flavor that's wonderful for parties, and goes well with any beverage.",
        "prepTime": "P0DT1H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "1 (15 ounce) package pretzels",
            "¾ cup olive oil",
            "1 (1 ounce) package dry Ranch-style dressing mix",
            "3 tablespoons garlic powder",
            "3 tablespoons dried dill weed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Break the pretzels into a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, blend the olive oil, ranch-style dressing mix, garlic powder and dill weed. Pour the mixture over the pretzels. Marinate 1 hour, tossing approximately every 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the marinated pretzels on a large cookie sheet. Bake approximately 10 minutes. Allow the pretzels to cool, then serve.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sue"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.322834645669292,
            "ratingCount": 127,
            "itemReviewed": "Marinated Pretzels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "104.1 calories",
            "carbohydrateContent": "3.1 g",
            "cholesterolContent": null,
            "fatContent": "10.2 g",
            "fiberContent": "0.3 g",
            "proteinContent": "0.5 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "140.4 mg",
            "sugarContent": "0.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-06T23:33:47.017Z",
                "reviewBody": "I make these all the time but the cook time and meaurements are different. I use about 3/4 of a pound bag of pretzels, 1 package of ranch, 1 tablesspoon garlic powder and 1 tablespoon of dried dill and definitely not olive oil! Use vegetable oil and use just slightly over 1/2 a cup. Cook at 250 and stir to coat every 15 minutes for 1 hour. I promise they will be perfection. I have made them for years and they have been a hit, each and every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Luvchocolate100",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2917674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-21T15:38:17.917Z",
                "reviewBody": "Well folks, I did some testing.  My sister wants to serve these on the appetizer table at her wedding, so I did a trial run. First time I did three batches, using three different oils, and then baked half of each batch and let the other half unbaked.  For each batch I used 16 oz pretzels, 1/2 cup oil, 1 package Ranch (I had the bulk stuff, so I used 3 T which is almost 1 oz), 1 T garlic, 1 T dill weed.  I tried them with EVOO, veggie oil, and melted butter.  Results?  As far as the oils, I personally liked the EVOO best, but it isn't significantly better, so we are going with veggie oil for the wedding.  Melted butter didn't work well. It clumped up and definitely needed baking.  As far as baked vs unbaked, there was really no significant difference, other than I thought the baked ones tasted slightly burned.  I baked at 250 for 28 minutes.  Even with only 1 T garlic, the garlic was overwhelming.  I just mixed up a second batch using 16 oz pretzels, 1/2 cup veggie oil, 4 T ranch mix (if you are using the packages, I'd just go with one package) and 3 T dill.  Skipped garlic altogether. Didn't bake.  Much better.  These keep well, prob. for 2 weeks. Tip: get good quality dill.  The first I got from a bulk food store, and it tasted like dried grass.  Then I got some from Frontier Herbs, from a bulk bin at a health food store.  It was much darker green, and is delicious.  I'm only giving this recipe 3 stars because of the huge garlic amount, and because it doesn't need baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Zonya Gingrich",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2398434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-22T15:25:53.843Z",
                "reviewBody": "My family makes pretzels similar to these...however they don't need to be baked.  Prepare and let the pretzels \"marinate\" in the oil mixture for 8 to 10 hours (shaking or stirring every so often to get the oil distributed) and the mixture will soak into the pretzels.  Also, replace the oil with popcorn oil for added flavor (as mentioned by another reviewer as having done).  These are addicting!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chikee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2111971/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-08T00:06:39.393Z",
                "reviewBody": "These were so easy and went over very well at a Supebowl party. I did use vegetable oil as per some reviewers advice. While I love olive oil it does have a very distinctive flavor that I just didn't see lending itself well to such a \"snacky\" food. I used 1 tbls of both the garlic powder and dill as well again per reviewers advice. I will certainly make these again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jena",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1775811/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-06T19:24:17.627Z",
                "reviewBody": "I liked the idea of this recipe but I don't usually have dry ranch dressing mix on hand. I made up the core ingredients of seasoning that's in ranch dressing used vegetable oil instead of olive (because olive oil tends to be a bit heavy when making snacks like this) and added about a 1/4 c. of grated Parmesan/Romano cheese. Tasty. Good change from your usual pretzel.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-23T17:04:14.88Z",
                "reviewBody": "Excellent recipe that is sooooo simple! I took the advice of others and used vegetable oil vs. olive oil and cut that to a little over 1/2 cup. I also used 1 tbsp. each of garlic powder and dill vs. three. I put everything into a tupperware container to toss and marinate. I think you just have to judge with your oven - start with a low temp. and toss every 10 minutes until done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-29T17:53:06.72Z",
                "reviewBody": "Made these many times. People ask me to make them all the time now too. I use only a half cup of oil and often use veggie (or regular olive oil not extra virgin). Also I use 1 TB garlic powder 1 TB dill and 1 TB lemon pepper instead of the 3/3. I usually about 1/4 tsp of cayenne for heat. And I cook at 250 for an hour stirring every 15 minutes. Yeah yeah I know I made of ton of changes. It's developed over the couple of years I've been making them. I still think my rating and review are valid the recipe is quality just for the idea alone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "PrincessJenna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644064/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-10T00:25:11.78Z",
                "reviewBody": "I use butter flavored popcorn oil when marinating pretzels instead of olive oil. I love the light buttery flavor along with the other spices. I've never made marinated pretzels with the big sourdough pretzels until today and I liked it better. They're not as pretty but they soak up the flavors much better. Yum! They're addictive. If you're serving them to more than 4 people you might want to make a double batch!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie Beeson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1413116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-20T19:48:40.01Z",
                "reviewBody": "very good! but I don't bake them just let sit for a day or two shaking occasionally",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "leftoverQueen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4068486/"
                }
            }
        ]
    }
]