[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
                    "name": "Lemon Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22202/lemon-ice-i/",
        "name": "Lemon Ice I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F649154.jpg",
            "width": 3872,
            "height": 2592
        },
        "datePublished": "2000-09-29T19:26:37.000Z",
        "description": "An easy citrus ice.  I often use oranges instead.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT2H10M",
        "recipeYield": "1 9x9 inch dish",
        "recipeIngredient": [
            "1 lemon, juiced and zested",
            "1 lemon, juiced",
            "2 cups white sugar",
            "4 cups milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, stir together lemon juice and zest with sugar until smooth. Slowly stir in milk. Pour into a 9x9 inch dish and place in freezer, stirring once when it begins to harden; freeze until firm, at least 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "You may also use an ice cream maker. Follow the manufacturer's instructions. When sherbet is soft-serve consistency, serve immediately, or transfer to a container and freeze until firm.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Lemon Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "bsteimle"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.492307692307692,
            "ratingCount": 65,
            "itemReviewed": "Lemon Ice I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "346.5 calories",
            "carbohydrateContent": "78.1 g",
            "cholesterolContent": "13 mg",
            "fatContent": "3.3 g",
            "fiberContent": "1.7 g",
            "proteinContent": "5.8 g",
            "saturatedFatContent": "2.1 g",
            "servingSize": null,
            "sodiumContent": "67.8 mg",
            "sugarContent": "74.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-22T00:51:26.03Z",
                "reviewBody": "Here's a tip for zesting a lemon:  Use a vegetable peeler to remove the paper thin layer of lemon peel.  Put these strips of lemon peel in a food processor along with the sugar from the recipe.  Pulse the food processor until the lemon peel is in bits.  Works great and is extremely quick.  No more grated knuckles!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURENY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/617701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T13:51:54.14Z",
                "reviewBody": "I SOOO love lemons and this is perfect for a hot Texas summer! Just beware mine took a little longer than the 2 hours noted to freeze (using the pan-in-the-freezer method) and you should plan to serve it all the day you make it - it became VERY firm by the next day. I must say though - my favorite part of this recipe was the reviewer tip to peel the lemon with a vegetable peeler and then whirl the shavings with the sugar in a food processor. Genius!! My knuckles thank you. (Now I can make Lemon Pudding Cake twice a week instead of once...:) ) NOTE: The name is a little misleading; it's more like lemon ice cream rather than an ice or sorbet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Provost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-04T17:19:00.267Z",
                "reviewBody": "The milk curdled when I added it to the lemon juice/sugar mix...what did I do wrong?  Help, I really want to try it!    RE-REVIEW  I'm so glad I tried it again!  I did as suggested above, and used the whisk beaters on my handheld electric mixer to first whisk the lemon juice and sugar together then while whisking, I slowly drizzled in the milk.  I used 4 cups of skim and 1 cup of 2% since I have a 4 qt. ice cream maker, and others said it was overly sweet with just 4 cups of milk.  It turned out wonderfully, not quite as creamy as a sherbet, but I would think if you used whole milk or some half & half, it would be richer, but I liked it as is.  I just wish the recipe listed a specific amount of lemon juice so I can get consistent results, as lemons can vary in their juiciness.  I actually used four smaller lemons and zested them all.  I bet it would be good with lime and orange, even raspberries as well and you could make your own rainbow ice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GARDENMOMMY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1447332/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-11T04:46:38.327Z",
                "reviewBody": "Delicious with Meyer lemons. For the person who wanted to know how to prevent clotting whisk the sugar and lemon together until smooth. Then slowly drizzle in milk a little at a time while whisking quickly. Keep whisking and adding milk in a little at a time until it's all gone. I also second the person who cut the milk down to 3 cups since my ice cream machine is a 1.5 qt. I make lots of ice cream and this recipe's a keeper! (It's also lower fat than my other ones...but now I wonder how this would taste with half cream and half milk...) So I made this a second time wth smaller less ripe meyer lemons (6 total) 1.5 cups of sugar and 2.25 cups of milk - still delicious and impressive.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ENTHUSIAST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/711506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T00:27:36.537Z",
                "reviewBody": "This is a wonderfully refreshing dessert. Since my family likes tart lemony desserts I decreased the sugar to 1 1/2 cups and in addition to the two lemons I added 3/4 cup of bottled lemon juice. This is a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAGGIE MCGUIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/392086/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T15:28:56.02Z",
                "reviewBody": "I made this last night and my family loved it! Make sure you mince the lemon zest as teeny as you can. I decreased the sugar to 1 1/2 cups and increased the lemon juice by quite a bit as we like things very tart. I would suggest adding the lemon juice a tablespoon at a time until you have the tartness you like. (As the recipe is written I think the lemon ice would be extremely sweet.) Once processed make sure you let the lemon ice age in the freezer in a tupperware container until it is a nice scoopable texture. (My kids ate some straight out of the ice cream maker and loved it soft as well.) Very nice and refreshing for a warm Southern California evening. You should try this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MJB628",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/133325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-23T19:41:46.807Z",
                "reviewBody": "Great recipe!  Following the advice of others I reduced the sugar to 1-1/2 c., (actually 1 c. sugar and 1/2 c. of Splenda), and increased the lemon juice to 3/4 c. of Meyer lemon juice.  For those who would like to know how much juice one lemon has, I measured 1/4 c. from a medium sized lemon.  It's only a general guideline. I'm sure it could vary depending on ripeness, etc.  My result was excellent.  Just the right amount of sweetness and tanginess, and I love that I don't have to feel guilty eating it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gloria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1099861/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-10T15:03:47.467Z",
                "reviewBody": "this is a great recipe i made it in my icecream maker and it came out great.Although at first i put too much mixture into the icecream maker so it didn't freeze and i had to pour half of the mixture out. it is a great recipe one of the best i've made so far. i reduced the sugar content to 1 1/2 cups like other paople said and it turned out wonderful! i used 1 lemon 1 orange and 1 lime and used skimmed milk for a very low fat alternative to ice cream. it goes great if you put it in a waffle cone. i left half of the mixture to make a couple days later and this batch was the best because i had kept it in the fridge which was very cold so it speeded up the freezing process and could be eaten straight out of the ice cream maker! it does go rock solid if left in the freezer so you need to thaw it for a bit so it's not as hard. i might make this again. thanx!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "teenagechef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1141405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-08T19:47:16.217Z",
                "reviewBody": "This is so refreshing. I will use more lemon and a little less sugar next time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "mamaiscookin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1395602/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-06T04:41:26.73Z",
                "reviewBody": "I have to admit that I just used bottled lemon juice and I don't think I'd make it that way again. This was certainly different than anything else I've ever had and _very_ sweet! Also it took 5 hours in the freezer (stirred every hour or so) before it was even remotely scoopable and even then it was mushy and melted almost immediately. If I try this again I'll use more lemon less sugar and start it in the morning to freeze all day.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Amata",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/869245/"
                }
            }
        ]
    }
]