[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1014/meat-and-poultry/pork/tenderloin/",
                    "name": "Pork Tenderloin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22224/easy-and-elegant-pork-tenderloin/",
        "name": "Easy and Elegant Pork Tenderloin",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F602402.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2000-10-01T03:21:35.000Z",
        "description": "This main dish is beautiful in its presentation and always comes out tender and juicy even if you overcook it a little.  The crust of bread crumbs holds in all the juices and adds a great look and taste to the finished product.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 cups Italian seasoned bread crumbs",
            "½ cup olive oil",
            "2 pounds pork tenderloin"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix bread crumbs and olive oil in bowl to reach consistency that would be moist enough to stick to the meat when pressed.  Place pork on a shallow cooking sheet.  Press the crumb mixture onto all sides of the meat until there is no pink showing, usually 1/4 inch thick.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for at least 35 minutes until a meat thermometer reads 165 degrees F (75 degrees C) or until there is no pink when the pork is cut.  Let the pork rest for 10 minutes, then cut into 1/2 inch slices.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Pork Tenderloin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan Burget"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.42716049382716,
            "ratingCount": 810,
            "itemReviewed": "Easy and Elegant Pork Tenderloin",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "437.4 calories",
            "carbohydrateContent": "26.7 g",
            "cholesterolContent": "65.3 mg",
            "fatContent": "23.5 g",
            "fiberContent": "1.3 g",
            "proteinContent": "28.6 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "624.7 mg",
            "sugarContent": "1.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-29T14:42:05.39Z",
                "reviewBody": "I am going to go ahead and give this five stars because it is a good starting point. I knew there needed to be more seasonings added and the reviews verified that. I rubbed olive oil over the tenderloins, followed by some dijon mustard. Sprinkled on garlic powder, salt and pepper and then rolled in Japanese panko bread crumbs with crushed rosemary. Seared on top of the stove with some butter for a few minutes and then put in the oven to finish cooking. Everyone loved this. It looked beautiful, was incredibly moist and simple to prepare. Cannot wait to make it again. Served with sauteed green beans and seasoned potato wedges.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-22T04:04:41.783Z",
                "reviewBody": "I had no time to marinate and I NEVER make good pork, so I tried this tonight. It was WONDERFUL...so good that this is the first review I'm writing! All three of my kids asked for more, and they won't eat anything! Here's what I did: trim fat, coat with olive oil, sprinkle with salt, garlic powder, onion flakes and cracked pepper. Then I refridgerated it in a bag for an hour, but I think it would have been fine without. Then I poured some Progresso Italian Bread Crumbs into the bag and shook it until coated. Baked at 425 for 45 mintues. It was mouthwatering. Served with mashed potatoes and peas and it was a huge hit with almost no work. Try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy Vella Noland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-28T11:51:12.747Z",
                "reviewBody": "My teenagers inhaled this one!! I coated the tenderloin with oil and made homemade bread crumbs as my girls can't eat most storebought crumbs as they have milk intolerances. I mixed in oregano, basil, rosemary, onion and garlic powder. This was the most moist pork I've ever had. Do place it on a sheet of tinfoil to keep from having to scrub the pan and tent it with tinfoil, because it burns within a few minutes if left uncovered. Uncover during the last few minutes to brown crust. It certainly helps to have it stand at the end. Overall, it was just terrific",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMVASILE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1017381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-10-21T03:35:30.897Z",
                "reviewBody": "Original Review Dec 2003: This was an incredibly quick and easy recipe.  The presentation is beautiful and it was delicious!  I followed the recipe exactly, with the exception of sprinkling the tenderloins with a little garlic powder and black pepper prior to breading.  It does seem to be a lot of breading, but the crumbs contain all the flavor, and using the amount called for ensures you have enough left for a nice breading after slicing.  Line your pan with foil -- the meat won't stick and you won't have a pan to wash! :)  Update - Feb 2009:  I've made this so many times and just wanted to add that I try to remove from the oven when the internal temp is 145 because USDA guidelines for whole pieces of pork have changed since my original review.  Because pork tenderloins are so lean, you don't want to overcook them as they can easily dry out. A bit of pink is good in this instance! Use a meat thermometer and remove when temp hits 145. Keep in mind that the internal temp will rise a few degrees during the standing process. So juicy, tender and delicious! One of our favorite recipes!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DISCOBUNNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-09T20:04:21.4Z",
                "reviewBody": "Easy, yes and perhaps you could even get away with elegant depending on what you choose to serve as your sides.  First, you do have to spruce up the Italian seasoned bread crumbs.  I always doctor them up with a bit of garlic, parsley, italian seasoning, crushed rosemary, and Parmesan cheese.  I eyeball everything and mix it together. Now, instead of the oil I tried something a little bit different.  I used an egg wash - two eggs with a little milk.  I dipped the tenderloins in the egg and bread crumb mixture twice, essentially \"double dipping\" in order to get a nice thick bread crumb coating.  I sprayed the bottom of the pan with Pam to prevent sticking, put the tendeloins in and took the rest of the egg and breadcrumb mixture combined them forming a stuffing mixture and layed that into the pan as well.  I sprayed a little Pam over everything, baked the tenderloins at 400 for 20 minutes, turned them and baked for another 25 minutes.  They were moist, tender, and juicy - perfect.  There's nothing worse than dried out pork!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-10T04:17:43.27Z",
                "reviewBody": "Excellent dinner tonight! I did alter it some picking ideas from others here. I marinated it for 2 hours in a baggie of olive oil, mustard, crushed garlic, salt & pepper & some sliced green onions.\n\nThen I put the breadcrumbs in a large baggie, placed the tenderloin in & shook it up til it was coated. I baked at 425 covered w/ tented foil. Baked 1/2 hr & then removed foil. Baked til it registered 145 degrees. Let it rest for 10 mins & it was very tender & flavorful. My very picky chef father in law was impressed! I served w/ roast potatoes, salad & leftover green bean casserole we had yesterday (Easter). Thanks for the inspiration!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "brielove",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1056858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-18T18:41:12.403Z",
                "reviewBody": "This couldn't have been any more tender!  Instead of mixing the olive oil with the bread crumbs, I rubbed the tenderloin with the oil, then rolled in the breadcrumbs.  Such an easy dish to serve for company.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DIANAMATT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/601862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-11T03:41:27.89Z",
                "reviewBody": "This had so much flavor and was so tender and juicy. I seasoned it with onion and garlic salt. Then put it in a medium size bowl rolled it in olive oil then added italian seasoning and bread crumbs in a gallon size ziplock bag, put the pork in the bag and pressed the bread crumb mixture on. Cooked it at 350 uncovered for 1 hour. YUMM\nThank you !!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Coot226",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23546917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-21T17:40:36.653Z",
                "reviewBody": "Two things. The pork should be seasoned first with a pinch of salt and pepper. Then maybe a touch of sage or bay leaf. I use both. Secondly, today's pork is no longer slop-fed like years ago so it does NOT have to be cooked to 165! I tried this recipe and it was too dry without sauce.The fact is with such a lean cut, never cook boneless pork loin past 150-155 at the most. Todays pork is grain fed and does not carry the bacteria it once had. Any good restaurant will cook pork loin to medium at the most. And use a thermometer that you can leave in the meat while cooking. The same reason you don't cut the meat for at least 15 minutes after cooking is the same reason you don't poke holes in it with a thermometer. All the juices will leak out. You can get a meat thermometer with the base that sits on the counter for under $ 10.00. For anyone who roasts meat, this is an essential kitchen tool. It will make all the difference in your roasts. I promise!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "bonyng",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5572075/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Easy and Elegant Pork Tenderloin",
            "description": "This roast is simple to prepare, and impressive enough for the fanciest occasions.",
            "uploadDate": "2012-08-19T23:39:21.959Z",
            "duration": "PT1M58.41S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa5e39992-8c85-4573-a277-5dfd0fbc4f3f%2Ff8647730-c887-418e-8c7e-6996564929ce%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1794027544001"
        }
    }
]