[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/172/soups-stews-and-chili/soup/cream-soups/",
                    "name": "Cream Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14775/soups-stews-and-chili/soup/cream-soups/cream-of-potato-soup/",
                    "name": "Cream of Potato Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22861/slow-cooker-creamy-potato-soup/",
        "name": "Slow Cooker Creamy Potato Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F557259.jpg",
            "width": 3504,
            "height": 2336
        },
        "datePublished": "2000-10-06T23:04:15.000Z",
        "description": "This is a very rich and creamy soup.  A great family favorite. It may be cooked on the stove or in a slow cooker. Garnish with chives, if desired.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT6H30M",
        "totalTime": "P0DT7H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "6 slices bacon, cut into 1/2 inch pieces",
            "1 onion, finely chopped",
            "2 (10.5 ounce) cans condensed chicken broth",
            "2 cups water",
            "5 large potatoes, diced",
            "½ teaspoon salt",
            "½ teaspoon dried dill weed",
            "½ teaspoon ground white pepper",
            "½ cup all-purpose flour",
            "2 cups half-and-half cream",
            "1 (12 fluid ounce) can evaporated milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place bacon and onion in a large, deep skillet. Cook over medium-high heat until bacon is evenly brown and onions are soft. Drain off excess grease.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer the bacon and onion to a slow cooker, and stir in chicken broth, water, potatoes, salt, dill weed, and white pepper. Cover, and cook on Low 6 to 7 hours, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, whisk together the flour and half-and-half. Stir into the soup along with the evaporated milk. Cover, and cook another 30 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Cream Soup Recipes",
            "Cream of Potato Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ROZANRENEE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.405777166437414,
            "ratingCount": 727,
            "itemReviewed": "Slow Cooker Creamy Potato Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "552.6 calories",
            "carbohydrateContent": "74.2 g",
            "cholesterolContent": "59.2 mg",
            "fatContent": "19.3 g",
            "fiberContent": "7.4 g",
            "proteinContent": "22 g",
            "saturatedFatContent": "10.3 g",
            "servingSize": null,
            "sodiumContent": "1151.3 mg",
            "sugarContent": "9.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-03-23T02:09:00.857Z",
                "reviewBody": "Basically good recipe, had to change some things though.  I used heavy cream instead of half n half, and added at least 1 cup shredded cheese at the end to thicken it up a little.  Also, I've had bad experiences with putting bacon in something and cooking it for a long time (turns back to mush!).  So I cooked the bacon, drained it on paper towel and refrigerated it.  I then sauteed the onions in the grease and added those in the beginning.  Then I used the crumbled bacon in the individual bowls when served.  You definetely have to add more spices, too...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DEBMILLIKAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/582046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-10T16:38:38.06Z",
                "reviewBody": "I like this recipe, but like others I modified it some to better suit my family's tastes.  Almost seems a shame to review it based on my modifications because if I had all the ingredients on hand to make it as is, I am sure it would have been great as well.  That being said, I used 5 cups chicken broth instead of the broth/water mix, substituted black pepper and reduced dill to 1/8 tsp, substituted 2% milk for the half and half cream and omitted the evaporated milk altogether.  I also fried the bacon separately from the onion, sauteing the onion instead in olive oil with about a 1 c of carrots and a stalk of celery.  Then I added both the bacon and the vegetables to the slowcooker together for step 2.  I did also puree about 1/4 of the soup and about a 1/4 cup of potato flakes to thicken it some before step 3.  Family loved it, particularly the children. As far as cooking the bacon in the slowcooker for that amount of time, I didn't experience any problems as far as the soup being greasy or overpowered by the taste.  The bacon was soft though.  If you prefer crispy bacon in your soup definitely wait to add it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Toasty Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2223426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-20T23:45:55.933Z",
                "reviewBody": "I wasn't so sure this would be a four star recipe as I was making it but it turned out well in the end. I wish I had followed another reviewer's advice and fried the bacon first then set it aside and sauteed the onions in the bacon grease. Cooking them at the same time didn't work so well because the onions were done well before the bacon leading to burned onions which in turn led to brown soup. Next time I'd add the onions at the beginning but wait to serve the bacon with each individual bowl. It gets soggy being in the broth. I also had to bump up the slow cooker to high for awhile because the potatoes just weren't getting soft enough. After I added the flour half and half and evaporated milk I expected the soup to get really thick and creamy but it stayed pretty thin even after adding more flour and bumping the slow cooker back up to high again. So I transferred everything to a pot on the stove and cooked it at a little bit higher temperature being careful not to boil it. Even then it never did get quite as thick as other potato soups I've had. The flavor did turn out great after adding more salt and dill weed. My husband and I both really liked it and it's not as fattening as other potato soups especially using fat-free half and half and fat-free evaporated milk. I'd make this recipe again but I'd probably do it all on the stove instead of in the slow cooker.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MEGAN24",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1083780/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-17T20:30:13.28Z",
                "reviewBody": "This is a great recipe. I used it when we did family poker night with my in-laws. I followed other user suggestions and did not add the bacon until the very end and also substituted heavy cream for half and half. I sauteed my onion in butter instead of bacon grease so there would not be brown flecks in my soup. Also we all added a generous spoonful of cheddar cheese before eating. This is like a giant stuffed baked potato in a bowl!!!! Everyone loved it and there were no leftovers!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jmlionhunter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1600813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-30T15:33:41.543Z",
                "reviewBody": "I love potato soup and potato soup with bacon is heaven! I substitute milk for the cream because otherwise it seems so creamy it is like a white sauce instead of soup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chellebelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/273710/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-28T03:44:02.163Z",
                "reviewBody": "This made an excellent tasting soup. I didn't have condensed chicken broth so I used 2 cans of non-condensed chicken broth 1 chicken bouillon cube instead (still added the listed 2 cups of water). When the potatoes were done...blended some of them in the blender along with the flour and half-and-half mixture and part of the evaporated milk. Then just put that back in the crockpot along with the rest of the evaporated milk for 30 more minutes. Added a little more salt pepper onion and garlic powder to taste...and served with shredded cheddar and \"Real Bacon Bits\" in a jar on the side. Also wanted to speed it up a little so cooked it for 3 hours on high then 2 hours 20 minutes on Low in a 6-1/2 qt crockpot. Thanks for this great recipe Shirley! Will definitely be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gizmo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1615902/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-13T17:13:11.657Z",
                "reviewBody": "This recipe is so great! It's thick creamy and very filling. I am going to halve the recipe next time for just two people. I used the slow cooker for mine with no problem... I even had it cooking on high for 3.5 hours without realizing it and thought I ruined it but didn't thankfully. I don't know why/how other people had runny watery soup but I had no problem. I didn't cook the onions beforehand I just put them in the cooker raw. I also didn't put in the bacon either I saved it to garnish when we were ready to eat (I used ready-to-eat bacon which you can heat up in the microwave for however many you need/want - so convenient). Also added shredded cheese as a garnish too. I put a couple pinches of crushed red pepper flakes and a garlic clove minced to add more zing and flavor. I used lowfat evaporated milk and regular half and half. I also used reduced sodium chicken broth as well. The grocery store didn't have large potatoes unbagged... so I used 8 red-skinned medium-sized potatoes instead. I also mashed half the potatoes as well before I added the creamy mixture. Mm Mm Mm. Thank you for sharing! It was perfect for a cool fall day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "chumblcj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/927434/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-25T16:49:43.717Z",
                "reviewBody": "A winter party hit! I loved this soup! It was creamy and delicious - the bacon stays crispy and everyone at my party loved it. I made it a second time in a much larger batch and realized it thickens nicely over the 30 minutes after adding the flour/cream combo so don't be too hasty - adding more flour destroys its creamy consistancy and takes out some of the flavor",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LSANDERSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/572538/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-21T01:41:30.297Z",
                "reviewBody": "I was very pleased with this recipe! It came out thick creamy and tasty! I didn't have condensed chicken broth so I used 21 ounces of chicken broth (from a carton) and one cup of water. As it simmered away all day I had to add 1/4 cup of water a few times because the liquid got too low. Added the half and half and evap. milk and turned it up to high for the last 30 minutes. This thickened it up perfectly! I took some reviewers' advice and cooked the onions after the bacon. Saved some of the cooked bacon in the fridge for a garnish and I also snipped a bunch of fresh chives to put on top. Served with Fantastic Focaccia Bread from this site for dipping. Soooo good! A great comforting meal for a fall day!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:41:02Z",
                "reviewBody": "This tasted good but I was a little disappointed with the consistancy (only because I like potato soup to be thick). I would suggest using baking or yukon gold potatoes rather than red. Overall it was alright I was just looking for something else. Thank you Shirley.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Creamy Potato Soup",
            "description": "A rich, creamy potato with bacon soup you make in the slow cooker.",
            "uploadDate": "2014-01-27T23:00:41.983Z",
            "duration": "PT2M40.694S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F251a4e68-138f-4306-9035-8386526d1dd9%2Fe642ae7d-b893-446a-b36d-40abfa9d0c36%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3114539640001"
        }
    }
]