[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17158/desserts/chocolate/milk-chocolate/",
                    "name": "Milk Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22584/chocolate-covered-caramels/",
        "name": "Chocolate Covered Caramels",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F556040.jpg",
            "width": 4272,
            "height": 2848
        },
        "datePublished": "2000-10-09T18:08:22.000Z",
        "description": "These caramels are easy and WONDERFUL for anytime of the year!  Everyone loves them! I can't make enough of them. You can omit the chocolate and just have wonderful caramels.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT2H25M",
        "recipeYield": "64 pieces",
        "recipeIngredient": [
            "1 cup butter",
            "2 ¼ cups brown sugar",
            "1 cup light corn syrup",
            "1 (14 ounce) can sweetened condensed milk",
            "1 teaspoon vanilla extract",
            "1 pound milk chocolate",
            "1 tablespoon butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Grease an 8 x 8 inch square pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a heavy 4 quart saucepan melt butter over medium heat; add brown sugar, corn syrup and milk.  Stirring constantly, heat to 242 to 248 degrees F (116 to 120 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball.  Remove from heat and stir in vanilla extract.  Pour into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When caramel has cooled and set, cut into 1 inch squares.  Chill in refrigerator until firm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt chocolate with 1 tablespoon butter in the top of a double boiler or in a bowl in the microwave. Stir until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dip caramel squares in chocolate and place on wax paper to cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "Milk Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cheryl Johnson"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.571428571428571,
            "ratingCount": 126,
            "itemReviewed": "Chocolate Covered Caramels",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "63.3 calories",
            "carbohydrateContent": "8.8 g",
            "cholesterolContent": "6.3 mg",
            "fatContent": "3 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "21.2 mg",
            "sugarContent": "7.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-06-06T01:47:17.95Z",
                "reviewBody": "Delicious candies! Home-made is always best and nowhere is this more true than with candy. These remind me of the trademark Rolos chocolate caramels only these of course are better. Having made this recipe several times over the last few months however I wondered why I had such trouble melting the butter/chocolate mixture and keeping it workable while I finished dipping the caramels. The chocolate would stiffen far too quickly and getting it back to a workable consistency was more difficult the second time round. I decided to read the reviews in an effort to discover what I might be doing wrong and though my particular problem wasn't mentioned I did read of one reviewer who suggested eliminating the butter from the chocolate mixture. I hoped this would solve my problem and voila! I was not disappointed; the unadulterated chocolate mixture was now smooth and creamy and remained workable for a longer period of time. Butter or no however I'd recommend having a little more than a pound of chocolate on hand. I've never managed to get by with only a pound. I use Callebaut milk chocolate chips for this recipe and others and am never disappointed. A good quality chocolate should be used because its flavour and texture are superior to that of cheaper varieties. To keep costs down I purchase Callebaut milk chocolate in the bulk section of my grocery store. This recipe will always have a place in my recipe box. Thanks Cheryl!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Pam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/30965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-03T17:33:56.92Z",
                "reviewBody": "I have never made caramels before, but this recipe was easy to follow and the results were fantastic.  Dipping each caramel in chocoloate seemed like too much work for me, so I poured half of the caramel in the pan, sprinkled a layer of semi-sweet chocolate chips and poured the rest of the caramel over it.  A fraction of the work with all the flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAJY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/895266/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-11T05:16:40.67Z",
                "reviewBody": "Just a note for folks who say it came out grainy - be vigilant with wiping down the sides of the pan! Using the canned milk makes crystalization less likely but caramels are still prone... so get out your wet pastry brush or wet paper towels and WIPE ALL THE TIME to stop the crystals.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sinopa2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1150193/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-12T16:38:02.95Z",
                "reviewBody": "These are great!! And make wonderful gifts. Wrap in freezer paper & put in a nice jar, candy dish, or tin. \nAlso be sure you get to the right temp or you will get candies that are hard if to hot, or really chewy if to cool. And for those getting a grainy chocolate you can take out the butter altogether or use a 1/2 of food grade coco-butter (or 30% of your chocolate ratio) this makes for a wonderful chocolate experience too. Also keep your chocolate over a double boiler on the lowest heat possible, this will keep it at a dipping level. Instead of the dipping method I like to pour a layer of chocolate in a wax papered lined Pan (or over my marble block) let it set completely then pour my carmel over this, let it set up. Cut into squares & slightly separate the squares, or put them on to a cooling rack with a cookie sheet under them, then slowly pour your remaining chocolate over each. You can then reheat the chocolate that drips off and repeat process. This will  get a uniform & perfect coating over each candy. They look like you bought them from a fancy chocolate shop, ;c)  it sounds hard but it is much easier to get a good coat with out all the mess, dipping, & fork marks. I have had a lot of holes and marks in my candies, lol.. I love that I figured this out. Thank u to the one who posted this recipe, it's great!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "letsbake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7848246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-12T01:01:09.757Z",
                "reviewBody": "Happily these aren't as super-sweet as my husband expected them to be. I poured the recipe into a 9 x 13\" pan and cut them into 3/4\" squares. This gave me about 150 caramels. I used the carmels for Lisa's \"Caramel Filled Chocolate Cookies\" (Cookie Cookbook). I had a hard time getting them out of the pan after refrigerating so I just worked with them at room temperature. These would make an excellent Christmas gift for the caramel-lover on your list. Thanks Cheryl!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Irene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/132657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-21T05:05:46.247Z",
                "reviewBody": "by the way if you decide not to coat them w/ chocolate lightly dust them with a pastry brush with cornstarch to keep them from sticking..the gloss goes away but they remain separated",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/302898/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-26T17:52:31.31Z",
                "reviewBody": "Super easy and really yummy caramel. I made it without the chocolate and added 1/2 tsp of salt to bring out the flavor. Note that this caramel will stick to wax paper. Wrap these in plastic wrap if you want individually wrapped pieces.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kistafool",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/508367/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-01T15:17:36Z",
                "reviewBody": "We made these chocolate covered caramels last year and they are simply to die for. I'm a big fan of chewy caramel with rich flavors and dark smooth chocolate. Together this created a real treat. My tip for getting them to stay their shape and look pretty is cut them into squares and then refrigerate them so they're cool when you put the warm chocolate on them. The best way I've found to put chocolate on them is to use a pastry brush and just pick up the caramel and paint the bottom then the top. It works wonderful and they look great. I then put them on wax paper and put in the fridge right away. I found some great chocolate boxes and accessories at Michael's craftstore and I'm going to gift these for Valentine's this year. The caramel taste of this treat is very addicting...Enjoy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Garber Sundholm",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1558213/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T21:55:31.903Z",
                "reviewBody": "I had never attempted making caramels before this so I was worried but surprisingly this recipe could not have turned out any better! The caramels are rich and creamy and so flavorful. Next time I make them though I will keep half of the batch without chocolate because after a few days the chocolate gets a little bit crusty/grainy. But if you eat them while they are fresh they're fabulous. The caramels without chocolate however keep fresh for a long time. VERY good recipe...thank you!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/906761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-12T02:31:52.060Z",
                "reviewBody": "Help!  I have tried the recipe twice but my caramels came out way to hard.  The 2nd time I used the lower end of the temperature range.  The flavor is wonderful though, but they are way too hard.  Did anyone else have this problem?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "jbloomer78",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1671313/"
                }
            }
        ]
    }
]