[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17281/desserts/nut-desserts/",
                    "name": "Nut Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17285/desserts/nut-desserts/almond-desserts/",
                    "name": "Almond Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22592/almond-buttercrunch-candy-i/",
        "name": "Almond Buttercrunch Candy I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F86601.jpg",
            "width": 1302,
            "height": 1243
        },
        "datePublished": "2000-10-09T21:31:57.000Z",
        "description": "This recipe has been in our family for years, and it is our favorite. It is delicious and addicting. Get ready to go on a diet after the holidays!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "3 1/2 pounds",
        "recipeIngredient": [
            "2 (11.5 ounce) packages milk chocolate chips, divided",
            "2 cups butter",
            "1 pound brown sugar",
            "1 cup blanched slivered almonds, divided"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 200 degrees F (95 degrees C). Grease a 14 x 18 inch cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle one package of chocolate chips on prepared pan. Place in warm oven until chips melt, about 5 minutes. Remove from oven, and spread melted chocolate over bottom of pan; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large heavy saucepan over medium-high heat, combine butter and brown sugar.  Stirring constantly, heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads.  Immediately remove from heat.  Stir in 3/4 cup slivered almonds and pour onto pan with melted chocolate; spread mixture evenly.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle remaining package of chocolate chips over the almond layer.  The heat from the almond layer will melt the chocolate chips; spread melted chocolate evenly.  Sprinkle remaining 1/4 cup almonds over chocolate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut into squares, or allow to harden in a solid sheet and break it apart like brittle.  Cool completely before removing from pan.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Nut Dessert Recipes",
            "Almond Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JANIS-RAINEYDAYGIRL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.618181818181818,
            "ratingCount": 55,
            "itemReviewed": "Almond Buttercrunch Candy I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "162 calories",
            "carbohydrateContent": "15.2 g",
            "cholesterolContent": "21.3 mg",
            "fatContent": "11.4 g",
            "fiberContent": "0.2 g",
            "proteinContent": "1.2 g",
            "saturatedFatContent": "6.5 g",
            "servingSize": null,
            "sodiumContent": "68.3 mg",
            "sugarContent": "14.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-17T16:27:40.78Z",
                "reviewBody": "I've made this recipe over a dozen times and I'd like to share a few things I've learned.  Temperature is critical anytime you work with sugar.  The final consistency is almost 100% dependant on the temperature.  At 245 you get caramel, at 310 you get toffee.  I would not recommend making this without a candy thermometer.  Use the thickest pot you can, to prevent scorching.  Stir ocassionally until 300 and then not at all until 310.  This reduces the time it takes to climb the last 10 degrees and reduces the chance of burning.  Remove from heat at precisely 310-do it fast and pour it fast, trust me on that.  I don't add the almonds, I like the skor bar quality of the candy without them, and I don't use the bottom layer of chocolate on the pan, I never get good adhesion, it falls off when you try to eat it.  I only put chocolate on the top.  When the candy hardens enough that your finger only makes a small dent in the top add the chips, give them a minute or 2 to melt and then spread with a knife or the back of a spoon.  My chocolate has always stuck when doing it this way.  If you need it ready fast put in the fridge or freezer, otherwise it can take a while for the chocolate to harden.  For breaking it into pieces I just slam mine against the counter and let it break into odd sized pieces.\nThis candy is always met with excitement when I bring it to a gathering.  I hope this helps anyone who wants to make this wonderfully addictive candy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "milk_an_honey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666333/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-20T20:07:35.433Z",
                "reviewBody": "December 19, 2012: Over the years of making this candy, I have simplified everything. No longer do I put chocolate on the bottom. I now use 3 cups of toasted nuts & this year I used a combo of cashews, almonds & pecans. In past years, I've used white chocolate & cashews, which has become a family favorite. This year, I used Lindt 90% Dark Chocolate Bars. After I poured the hot nut filled toffee out on a parchement paper lined cookie sheet, I laid the bars down on top & they melted like butter. Next I melted Lindt White Coconut Chocolate & flung it over the dark, melted chocolate. I used a tooth pick to score back & forth across the chocolate, which made a beautiful pattern. The less sweet dark chocolate pared well with the toffee, which is plenty sweet enough & this creation is yet another favorite of mine. The possibilities are endless! Enjoy & have fun being creative!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janis Kaye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/127509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-28T18:44:41.45Z",
                "reviewBody": "The first time I made this, I cooked the candy to 310 degrees.  In a second it went from smelling great to smelling burnt and separating.  The second time and third time I made it, I buttered the sides of the pan and did not stir it at all until it reached 300 degrees, rather than 310 degrees.  It was perfect and delicious both times.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JSENFT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/547001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-19T01:30:26.127Z",
                "reviewBody": "Update to my previous review: Use the nonstick foil in the bottom of the pan you are using for the chocolate. I find after spreading the warm chocolate put in the fridge to cool and harden while cooking the toffee. I have much better results with the non stick foil vs the wax paper which tends to leave residue. And an A to the pizza cutter idea! Awesome recipe. My 2nd year for xmas gifting and my friends can't get enough of it. I find that using a candy thermometer that attaches to the side of the pan is helpful in candy making. Also I've cut recipe in 1/2 by using 1 1/3 packed cups of Brown sugar and halving everything else. I've also found putting it into the fridge for 3 hours is really helpful. Plus use very good chocolate to make it special!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINBH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/768620/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-03T14:25:35.297Z",
                "reviewBody": "My first attempt at this recipe flopped -I had grainy toffee which had the consistency of fudge - tasted good but it just wasn't toffee. I tried again and Voila! I was able to make wonderful toffee. Here are my tips: most importantly TEST your candy thermometer! If you get 212 degrees in boiling water then you know it's accurate (mine was 10 degrees off!) Also the tip shouldn't be touching the bottom of the pan but somewhere in the middle of the syrup. I used a Silpat silicone baking mat instead of greasing the pan and it worked wonderfully. No sticking at all. I didn't stir as much the 2nd time since someone said that allows the candy to heat up very quickly at the end and scorch. I also used a wire whisk instead of a wooden spoon that I used the first time. Lastly I made one batch without the bottom chocolate layer and almonds only on top of the top chocolate layer and broke the toffee up like brittle a little less expensive and still tastes good! Another batch I scored with a knife and broke up into squares when it cooled - also worked great. I used Ghiradelli chips and they melted beautifully but when I used Hershey chips they did not so I'd recommend using a good quality chocolate if you can. I'm proudly going to take my re-worked batches to a cookie exchange today and can't wait to hear what everyone thinks! Oh and another reviewer explained how to make a half batch and it worked perfectly too! (use 1 1/3 c packed brown sugar and halve the other ingr",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Noeller67",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/noeller67/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-18T12:49:35.973Z",
                "reviewBody": "Thank you so much Janis! I carefully read your tips and everything went smoothly. I thought \"that's it?!?\" at the end of it all. Was it ever easy and quick! I roasted roughly chopped almonds in a pot on a medium to low heat I found this brought out the flavor of the almonds and enhanced the Almond Roca. My only question is how do you score the Almond Roca so that the pieces are uniform and appear attractive when presenting them as gifts?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOUNTAIN ASH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T14:57:23.56Z",
                "reviewBody": "Hi Mountain Ash...I'm the one who submitted this recipe. Yes you can score the candy while it's still hot so that you can break it apart into even pieces. Use parchement paper so you can pull it out of the pan after it's completely cooled. You have to work fast and cut through it while it's still good and hot...but it can be done. I've done this myself but I've gotten lazy and just prefer to break it apart. I saw a chopping utensil a few days ago that would work well for scoring the candy. It cuts in a rocking motion side to side. I found it at Harris-Gottschalks. Hope this helps you out. Good luck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANIS-RAINEYDAYGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/539799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T23:43:16.467Z",
                "reviewBody": "I wish mine had turned out better. It seems like too much butter and I used dark brown sugar a mistake. Wish the recipe has specified light brown sugar or white. It is hardening up now and tastes OK but not nearly as good as my previous recipe from my old Better Homes and Gardens cookbook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "roseone33",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4335249/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-28T00:11:09.387Z",
                "reviewBody": "This candy is so wonderful. Everyone begs for it and wants the recipe. Nobody can believe how simple it is with just 4 ingredients. I make 2 batches at Christmas and can't keep it around. For those of you who have had trouble you must use a candy thermometer and make sure it is a good one. Take it off the range immediately at 310 or it will taste burnt. I put all the almonds in the toffee mixture (none on top - just my personal preferance) right when I take it off the heat stir quickly and pour over the milk chocolate. Never failed! Thanks for sharing this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kayster",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1719324/"
                }
            }
        ]
    }
]