[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1557/desserts/chocolate/",
                    "name": "Chocolate Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17156/desserts/chocolate/dark-chocolate/",
                    "name": "Dark Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22953/dark-chocolate-cake-ii/",
        "name": "Dark Chocolate Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1493786.jpg",
            "width": 1250,
            "height": 1268
        },
        "datePublished": "2000-10-14T02:35:45.000Z",
        "description": "The absolute best, richest, and easiest one-bowl chocolate cake recipe ever! It's great topped with chocolate cream cheese frosting!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H35M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 9x13-inch pan",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "2 cups white sugar",
            "¾ cup unsweetened cocoa",
            "2 teaspoons baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon salt",
            "2 eggs",
            "1 cup cold brewed coffee",
            "1 cup milk",
            "½ cup vegetable oil",
            "2 teaspoons vinegar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the flour, sugar, cocoa, baking soda, baking powder and salt. Make a well in the center and pour in the eggs, coffee, milk, oil and vinegar. Mix until smooth; the batter will be thin. Pour the batter into the prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Chocolate Dessert Recipes",
            "Dark Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kelly Smith"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.683982683982684,
            "ratingCount": 693,
            "itemReviewed": "Dark Chocolate Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "319.9 calories",
            "carbohydrateContent": "53.2 g",
            "cholesterolContent": "32.6 mg",
            "fatContent": "11.3 g",
            "fiberContent": "2.3 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "358.6 mg",
            "sugarContent": "34.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-30T22:58:02.47Z",
                "reviewBody": "Ok folks, this cake will put you in chocolate heaven.  Have tried many recipes from this site and this one wins by a landslide.  To be objective, I made this to the T the first time. It was fantastic.  Moist, dark, rich.  But after that, I've been using buttermilk in place of regular milk and used cake flour instead of regular flour (same amount) and the cake was super moist. I've learned when it comes to baking, using buttermilk where a recipe calls for milk makes everything more moist and fluffy.  If Cake Flour is available, use. Be sure to add 2 extra tablespoons of cake flour for every cup of regular flour. The cake flour made it extra light and tender.  No need for vinegar if using buttermilk. The 'sour' in buttermilk reacts with the leavening agents - baking powder/soda - which makes the cake rise and moist.  I've also increased cocoa to 1 full cup & added 2 extra tablespoon sugar when I do, for a devils food style cake.  And forget all the 'multi-bowl cake recipes'.  This is so easy in prep and clean-up.  Too good to be true, but it is.  I usually bake mine in a 10\" bundt (cooking time appx. 38-40 min.) or two 9\" cake pans (25 min.).  When making a layer cake, try frosting it with German Chocolate Frosting II (from this site) for ultimate decadence.  You will get raves for this - even you first time bakers can't get this wrong. Update - Drizzle this with Chocolate Ganache - superb.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-05T03:25:41.7Z",
                "reviewBody": "This cake is absolutely to die for. I have gotten rave reviews. I used some of the suggestions of others. I used buttermilk instead of vinegar and milk. I added a cup of chocolate chips last thing to the batter. I cooked it for 45 minutes at 325 degrees.Oh and for those of you who have had troubles with it falling in the middle....your cake was not done befor you moved it. Just open the oven (DO NOT MOVE THE WIRE RACKS AT ALL)when it looks done and lightly press the top side of the cake (not right in the middle) with your finger. If it feels like anything other than firm cake quickly close the oven again and let it bake for at least another 10 to 15 min., especially if you are cooking it at the lower temp. Mine fell slightly the first time due to this issue. The second time I tested it first and it came out beautiful. I also made it in two foil lined round spring form pans. I lined it with reynolds non stick heavy duty foil and it just peeled right off even though this was a really sticky cake. I made this with dark chocolate cocoa. It was fabulous. For those who like to make this all in one bowl...just start with all the wet ingredients, mixing after each addition, and work your way backwards through the recipe with the flour and chocolate chips being the last ingredients. This way you know that your soda and powder are completely disoved and there will be no bitter spots.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "liesh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2534167/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-27T16:07:27.087Z",
                "reviewBody": "This cake is dark, rich, moist and boldly chocolate.  So easy to mix up even a cave man could do it - no creaming, sifting, adding eggs one at a time, etc.  Best yet, it's such a perfect recipe you can prepare it confidently just as is - nothing you could do to this would improve it. I used this for cupcakes and because the batter was so thin I was able to pour it into the cupcake tins fast, easily and neatly. Baked up nicely in about 20 minutes at 350 degrees.  I frosted them with my own vanilla buttercream recipe and they were decadent.  Thank goodness for the predetermined portion control of cupcakes, because it would be very easy to overindulge with this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-26T11:46:00.633Z",
                "reviewBody": "This cake was delicious! I made it exactly as specified. When I saw how runny the batter was I was a bit concerned but it turned out spongy and moist. I took a reviewer's advice and made the cream cheese chocolate frosting and it was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kazza",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2763611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-19T18:49:07.55Z",
                "reviewBody": "Yes, for what it is, this is a 5-Star recipe--but it's not a one-bowl recipe!  I'm surprised that no one knows the purpose of the vinegar.  It's to sour the milk.  You put the vinegar in a glass measuring cup and then fill with milk to to the 1 cup line.  Then wait 15 to 25 minutes until the milk shows signs of souring (curdling).  This is a time-honored method of inexpensively adding flavor and richness to baked goods.  Buttermilk can't match it.  I remember years ago, learning to cook in my mother's kitchen and scoffing at her old-timey farm-raised ideas.  I used buttermilk instead of soured milk in my dad's favorite Coconut Raisin Cookies and had to listen to him tell how I just couldn't match my mom for making good cookies.  I went right back to the sour milk!  The Farm Journal Test Kitchens supported my findings, too.  \n\nThe other item I would mention is DON'T FORGET THE VANILLA!  No chocolate cake is ever complete without vanilla.  Yes, the coffee (I use espresso) brings out the rich, deep flavor notes of the chocolate, but the vanilla highlights the \"flowery,\" sweet notes.  To achieve the full depth and range of chocolate flavor, you need the vanilla.  Then, when you smother this complex, delicious cake with a sweet frosting, you will have a truly complete chocolate experience.  I chop this cake into serving-sized cubes and freeze them in squares of plastic wrap.  Perfect treats at a moment's notice!  Thank you for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CatherineCooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5166574/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-24T18:35:23.263Z",
                "reviewBody": "Woohoo! This cake is the best and I never rate anything 5 stars! Even better than Hersheys' recipe. You can't taste the vinegar at all and a hint of coffee flavor will only show up depending on the frosting. Because I love chocolate so much I made a few adjustments; dusted the pan with cocoa powder instead of flour and added 1/4 c more cocoa to the recipe. Though I'm sure it would come out just as good as is! It was a snap to mix up in one bowl a snap to rinse off the bowl and utensils and a snap to bake (even though my stove has issues). I only had a glass pyrex dish and despite that it still came out moist. You know the kind of moist where if you touch the top some fine crumbs will sticks to your fingertip. Yummy. It was very much like Starbauchs black out cake if you have had it. Only without the ganache. I frosted it with Chocolate Cheese Frosting found here on Allrecipes by Carol. I will definately be using this recipe when I want a quick and fool proof moist cake. I had heard that the best chocolate cake recipes called for vinegar but this was the first that proved it. Thank you Kelly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGFORTHEKING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1319549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-08T00:19:05.34Z",
                "reviewBody": "I was looking for a devil's food cake recipe similar to the flavor of store bought cake mixes for ages. This one is it! It is better than the commercial mixes too as the cake does not fall apart getting it out of the pan. Also I was able to cut down the amount of sugar by half without any loss of flavor or texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AQUARIUS2058",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/673713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T03:48:11.267Z",
                "reviewBody": "This is THE BEST chocolate cake I have ever tasted! Wow, and so easy. I didn't even have to get the mixer out; did fine by hand. As suggested by others, I replaced milk and vinegar with buttermilk. I used this recipe to make cupcakes, baked at 350 degrees for 24 minutes. Perfection.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mkecupcakequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mkecupcakequeen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T23:14:06.82Z",
                "reviewBody": "I have used this recipe for many cakes and have gotten rave reviews from everyone.  I find it moist enough, chocolatey enough, everything enough.  I haven't and won't change a thing.  If it is worth 5 stars, it doesn't need changing.  If it needs changing, it isn't worth 5 stars!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lpbeier",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2622335/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-07T18:56:01.970Z",
                "reviewBody": "This cake tasted just like a boxed cake mix. Boxed cake mix is good, but if I'm going to all the effort of making a cake from scratch I want it to taste better than the boxed stuff. I don't know why I choose to try this when I have previously used 2 amazing chocolate cake recipes (black magic cake and one bowl chocolate cake III from this site. From now on I'll stick to those). I did appriciate how easy this was to make though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jog Dish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2967134/"
                }
            }
        ]
    }
]