[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17526/desserts/fruit-desserts/lemon-desserts/",
                    "name": "Lemon Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22961/ultimate-lemon-cake/",
        "name": "Ultimate Lemon Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F20414.jpg",
            "width": 2104,
            "height": 1683
        },
        "datePublished": "2000-10-14T03:42:31.000Z",
        "description": "This is the ultimate lemon cake for anyone who really loves lemon. It's cool, refreshing, yet moist and rich.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "1 - 10 inch Bundt pan",
        "recipeIngredient": [
            "¾ cup butter",
            "1 ¼ cups white sugar",
            "8 egg yolks",
            "3 teaspoons baking powder",
            "¼ teaspoon salt",
            "2 ½ cups all-purpose flour",
            "¾ cup milk",
            "1 teaspoon vanilla extract",
            "¼ cup lemon juice",
            "3 cups confectioners' sugar",
            "½ cup lemon juice",
            "2 cups confectioners' sugar",
            "¼ cup lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan. Mix together the flour, baking powder and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the butter and sugar until light and fluffy. Beat in the egg yolks one at a time, then stir in the vanilla and lemon juice.  Beat in the flour mixture alternately with the milk, mixing until blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into prepared pan. Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the hot lemon glaze:  In a saucepan, combine 3 cups confectioners' sugar and 1/2 cup lemon juice.  Bring mixture to a boil and cook for 1 minute.  Keep mixture warm until ready to use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the Icing Glaze:  In a small bowl, mix 1/4 cup lemon juice and 1 1/2 cups of confectioners' sugar.  If mixture is too thin, add more sugar until desired consistency is reached.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Assemble the cake:  Pour 3/4 of hot lemon glaze over warm cake while it's in the pan.  Let cake cool for 60 minutes, then remove from pan.  Reheat the remaining hot lemon glaze to the boiling point, then brush glaze onto the top and sides with a pastry brush.  Using a fork, drizzle Icing Glaze over cake.  Refrigerate for at least 2 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Lemon Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lissa Metz-Gomez"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.782608695652174,
            "ratingCount": 69,
            "itemReviewed": "Ultimate Lemon Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "635.6 calories",
            "carbohydrateContent": "115.1 g",
            "cholesterolContent": "201.9 mg",
            "fatContent": "18.1 g",
            "fiberContent": "0.9 g",
            "proteinContent": "6.2 g",
            "saturatedFatContent": "10.3 g",
            "servingSize": null,
            "sodiumContent": "279.5 mg",
            "sugarContent": "88 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-07-29T03:27:27.497Z",
                "reviewBody": "I don't know what either of the other reviewers are talking about. The sugar IS listed in cups not teaspoons. My cake rose just fine. Plus if you either reheat the cake pain in a sink of hot tap water for about 30 seconds and then tap it out it comes out easily. To make it even easier just use parchment to line the bottom of the cake pan before you butter and flour it. ANY good baker knows both of these tricks and I can only assume the other people who have reviewed the cake don't bake very often or at least they don't bake cakes. This recipe was exquisite very lemony and rich. If you don't like as much lemon just use 1/4 cup milk in place of the lemon juice in the cake recipe and you'll essentially have a white cake to use with the lemon filling and glaze.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VERITYESSENZA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/667021/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-10-21T19:21:57.653Z",
                "reviewBody": "We do a food network night (my kids and I)and my 11 year old son who is disabled especially enjoys it. He won the cake contest with this recipe. It was great moist lemony and tasty. My neice asked me to make it for her wedding party. If you had a negative experience with this you should remember that over mixing adding ingredients in the wrong sequence or not correctly measuring some ingredients can totally change the outcome of a recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOTHERTERESA1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1219120/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-29T03:26:18.56Z",
                "reviewBody": "I often have clients request \"lemony\" cakes in my home dessert business. I have several \"old reliable\" recipes but I was intrigued by this recipe. I made the cake 3 times as an experiment with friends & clients & the response was consistent (& I agree): the lemon flavor is good but the cake is way too dense (egg yolks versus whole eggs). The cake was easy to make & I didn't have any problems with the cake coming out of the bundt or tube pan. I always use Baker's Joy spray (plus parchment paper for tube pans) & never have problems. I did like the glaze and decided to use it with another recipe on this site. I modified the Kentucky Butter Cake recipe and then glazed the cake with the lemon glaze from this recipe. The result was good--a lemony cake that was moist and not too dense.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "TLBRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-19T18:01:04.047Z",
                "reviewBody": "The only thing that makes this an \"ultimate\" lemon cake is the fact that you drizzle on so much lemon \"sauce\" afterwards.  With that stuff - you could soak a couch cushion in it and it would taste the same. The batter has very little lemon flavor to it - just some lemon juice.  Lemon doesn't hold up well to baking - the flavor sort of dissapates.  I did change the recipe - and I know I hate people's reviews when they change it but - well if others do it, so can I!  I wanted a lemon CAKE.  Not a plain cake soaked in lemon juice.  So - I added the zest of a whole lemon to the batter.  I couldn't see making this thing with what little lemon juice it called for and having any remaining lemon flavor after baking.  Zest was necessary!  Also - I didn't just use egg yolks.  I didn't see the point - so rather than use EIGHT egg yolks: I used 4 whole eggs.  Less work, less hassle, and the cake cooked up BEAUTIFULLY.  This is a very solid nicely colored lemon cake.  Well, at least MY version was!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SINGLEGUYWHOCOOKS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/917476/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-25T02:31:57.67Z",
                "reviewBody": "Very lemony flavor. I've made this cake twice. The first time in a rush I didn't wait the full hour cooling time. The cake fell apart coming out of the pan because the center was still hot. (But it tasted yummy so if at first you don't succeed...:) Second try I added an additional 1/2 cup sugar and 1/4 cup more lemon juice to the cake. Before pouring on the hot glaze I used a metal skewer to poke holes in the cake. This allowed the hot glaze to soak more evenly into the cake. I cooled the cake in the pan 1 hour according to directions ran a butter knife around the sides of the pan before turning and it came out perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1700550/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T23:10:51.967Z",
                "reviewBody": "This recipe is superb and the reviewers who had trouble with it were probably not following the directions. I used a commercial oil-flour spray rather than butter and flour and the cake came out of the Bundt pan neatly and well. The glaze is delicious and I have made this cake several times with no problems whatsoever. As for its density I was very pleased with it and thought the cake was perfectly moist and delectible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BALTIMORE_BOY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/862992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-29T03:27:57.09Z",
                "reviewBody": "This is the absolute best lemon cake I have every put in my mouth. I have to agree I don't know what the negative reviews are about. The first time I made the cake I did have a problem with it falling out in pieces. But the cake was so delectable every morsel was eaten. I found the cake very time consuming but DEFINITELY worth it!!!!!!!! Thanks for the wonderful recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENNIFER N",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721220/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-11T02:39:41.03Z",
                "reviewBody": "I think this is one of the worst lemon cakes I have ever made.  I have tried doctoring the recipe, but it is stiff, dense, lacking taste...vanilla and lemon don't do well together.  I would like to warn you that there are much better recipes out there, especially the lemon cake in the Silver Palette Book.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "JTIMBAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/150695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-02T19:52:41.257Z",
                "reviewBody": "This is my favorite lemon cake. I've only had it stick to the bundt pan once but I think it was because I didn't remove it as soon as I was supposed to. The several other times I've made it it has been fantastic. Use real lemons for ultimate flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DRQUINN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/891331/"
                }
            }
        ]
    }
]