[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1642/everyday-cooking/",
                    "name": "Everyday Cooking",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/87/everyday-cooking/vegetarian/",
                    "name": "Vegetarian",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16778/everyday-cooking/vegetarian/protein/",
                    "name": "Protein",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/270/everyday-cooking/vegetarian/protein/tofu/",
                    "name": "Tofu",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22657/tofu-turkey-ii/",
        "name": "Tofu Turkey II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4015405.jpg",
            "width": 1632,
            "height": 1224
        },
        "datePublished": "2000-10-14T07:24:34.000Z",
        "description": "This is an incredibly delicious and guilt-free alternative to the traditional bird, and I make it every holiday. I've even tried this out on meat eaters, and they were asking for seconds! The directions may seem a bit daunting at first glance, but don't worry!! It is much, much easier than it appears and the actual preparation time you spend in the kitchen is under fifteen minutes.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT3H5M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound firm tofu",
            "1 teaspoon salt",
            "¼ teaspoon dried marjoram",
            "¼ teaspoon dried savory",
            "¼ teaspoon pepper",
            "1 (12 ounce) package dry bread stuffing mix",
            "⅔ cup water",
            "¼ cup soy margarine",
            "1 slice bread, cubed",
            "½ teaspoon sage",
            "2 tablespoons water",
            "5 tablespoons vegetable oil, divided",
            "1 teaspoon barbeque sauce",
            "½ teaspoon prepared mustard",
            "1 tablespoon orange jam",
            "1 teaspoon orange juice",
            "1 tablespoon sesame seeds"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Drain and rinse tofu; in a food processor or blender,  process tofu until smooth.  Stir in salt, marjoram, savory and pepper.  Line a sieve with 2 sheets of paper towel and place over an empty bowl.  Place tofu in lined sieve and press against sides to form a deep well in the middle.  Place 2 more sheets of paper towel over tofu and refrigerate for 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, in a medium saucepan over medium-high heat combine stuffing mix, 2/3 cup water and margarine.  Bring to a boil; reduce heat to low, cover and simmer for 5 minutes.  Remove from heat; let stand 5 minutes and fluff with a fork.  To the stuffing add bread cubes, sage and 2 tablespoons water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "After tofu has chilled for 2 hours,  preheat oven to 350 degrees F (175 degrees C).  With 2 tablespoons of the vegetable oil, grease a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the top layer of paper towels from the tofu.  If necessary, again press tofu against the sides of the sieve to form a well.  Spoon the stuffing mixture into the well and smooth the surface with a spoon.   Invert the tofu mold onto prepared baking sheet.  Remove the remaining paper towel layer and shape the tofu with your hands if it has cracked or lost its shape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, prepare the glaze by combining barbecue sauce, mustard, orange jam, orange juice, sesame seeds and remaining 3 tablespoons oil.  After tofu has baked for 30 minutes, brush or spoon the glaze over it.  Return to the oven and bake for 20 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Broil for 3 to 5 minutes, or until tofu is browned and crispy.\n"
            }
        ],
        "recipeCategory": [
            "Everyday Cooking",
            "Vegetarian",
            "Protein",
            "Tofu"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Holly"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.8043478260869565,
            "ratingCount": 46,
            "itemReviewed": "Tofu Turkey II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "786.8 calories",
            "carbohydrateContent": "76.9 g",
            "cholesterolContent": "0.8 mg",
            "fatContent": "42.4 g",
            "fiberContent": "5.9 g",
            "proteinContent": "28.2 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "2124 mg",
            "sugarContent": "10.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-11-23T17:40:00.577Z",
                "reviewBody": "My family LOVES this recipe (all vegetarians/vegans) I do change quite a bit:  Make tofu part as directed ( I now use the vaccuum packed super-firm tofu and you don't need to drain it.  \"Stuffing\" is Awesome Sausage, Apple and Cranberry Stuffing from this site (I use tofurkey brand apple sage sausage and veggie broth).  Place stuffing on a 9x13\" pan molded into a half sphere.  Cover this with the tofurkey mixture.  I use the maple glaze from the allrecipe called \"Maple Roast Turkey\" by Lipo.  The glaze is WONDERFUL!!!  I have made this the last 3 to 4 years at the holidays and have had to make a bigger batch as even the meat eaters are gobbling it down.  Best vegan gravy is Ann Gentry's Golden Gravy from her Real Food Daily cookbook.  Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/946415/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-15T23:53:58.537Z",
                "reviewBody": "It was dry no flavor and I had to use my ingenuity and redo this entire recipe. I started by marinating the tofu overnight and adding many spices added fresh parlsey to everything (rubbed sage powedered sage garlic & onion powder oregano chives marjoram savory salt and pepper and made a moist stuffing in accordance with the quantities you are asked to use in the recipe label and increased the margarine and liquid content by more than double in accordance; adding onions celery and mushroom to stuffing and spices also. Made a Vegan Gravy adding fresh parsley and all of the above spices and was added to stuffing and used as a sauce over the tofurkey. It was a hit for 54 employees - some who have never tasted Tofu before.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "QUEENSHARON00",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/915173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T19:31:52.84Z",
                "reviewBody": "WOW! This recipe is wonderful for vegan and vegetarians at holiday time--especially Thanksgiving. It looked and tasted great--my seriously VEGAN son was thrilled and impressed! By doubling the tofu mixture we were able to serve more; we just added a little extra oven time. We used our usual stuffing recipe but made with soy margarine as suggested and it seemed more traditional for us (we add finely diced celery onions mushrooms apples and red peppers in iron skillet). This seems fussy and complicated but it is really simple. This is much better than any store-bought version and is much cheaper too! THANKS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARLENEFWATKINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/502899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T21:51:53.63Z",
                "reviewBody": "This was surprisingly good! I was reading the reviews before I printed the recipe out and they got my hopes up. But when I started making it I was like woah this doesn't look anything like I pictured and I was just sure that the paper towel thing wasn't going to work. But I kept going if it didn't turn out oh well. So when it was time to take it out of the fridge the paper towels came off just fine! I was like wahoo but will it taste ok because i was kinda having trouble with the stuffing. I took ya'lls advice and changed the glaze I used a cranberry glaze the \"turkey\" turned out awesome my mom and I were so pleased. I highly recommend that u try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EDANDSMUCKERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/795483/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T19:30:41.997Z",
                "reviewBody": "This was a really great recipe. Very delicious and flavourful. My first Thanksgiving since going vegetarian and I didn't even miss the turkey.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*_HOLLY_*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/222075/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-21T21:17:28.467Z",
                "reviewBody": "This is a really easy and great recipe. I read some of the reviews before making this for my son who is vegan. BEWARE to those who are planning on using boxed stuffing mixes as recommended by some reviews. Lots of them have added dried chicken or turkey for flavoring and most of them contain gelatin. Check box ingredients first if staying vegan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Can_It_Rachael",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/can_it_rachael/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-07T14:24:56.64Z",
                "reviewBody": "I've made this recipe for my boyfriend last Christmas as well as his family - 3 out of which are vegetarian. The recipe turned out great and they all enjoyed it. As a meat-eater myself I was slightly hesitant but it was pretty good. Definitely a recipe I would recommend if you want to make that extra effort for your vegetarian friends and/or family. Two suggestions: 1) Use extra firm tofu - a little harder to work with but doesn't crack as much; and 2) I simply use turkey Stove-Top stuffing eliminating Step #2 (just prepare as it says on the box) - easier and tastes great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "shammy_girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1547407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T19:30:36.78Z",
                "reviewBody": "This is becoming one of my favorite recipes and I've made it for two Thanksgivings in a row. It really is rather easy to make and non-vegetarians like it too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynnie O'Lynnie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/337548/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-09T19:30:22.653Z",
                "reviewBody": "I would give this ten stars if I could! It was surprisingly easy and really delicious. A must-try for all vegetarians and adventurous non-veggies.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HEYPIG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/71900/"
                }
            }
        ]
    }
]