[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/807/desserts/pies/custard-and-cream-pies/",
                    "name": "Custard and Cream Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12955/desserts/pies/custard-and-cream-pies/banana-pie/",
                    "name": "Banana Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/22898/banana-cream-pie-made-easy/",
        "name": "Banana Cream Pie Made Easy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1554866.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2000-10-16T21:32:57.000Z",
        "description": "Cool and rich with extra banana flavor.",
        "prepTime": "P0DT0H25M",
        "cookTime": null,
        "totalTime": "P0DT1H25M",
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "3 cups heavy cream",
            "½ cup crushed ice",
            "1 (3.5 ounce) package instant banana pudding mix",
            "1 (3.4 ounce) package instant vanilla pudding mix",
            "3 bananas, sliced",
            "1 (9 inch) pie shell, baked",
            "1 cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Using an electric mixer, whip 3 cups heavy cream on low speed until it starts to thicken. Add crushed ice and continue to whip another 4 minutes. Increase speed and add vanilla and banana pudding mixes, whipping until pudding mixes are blended fully with the cream and the mixture thickens. Increase speed to high and beat until mixture is stiff.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line the bottom and half way up the sides of pie crust with banana slices. Cover bananas with half of the banana cream mixture and top completely with banana slices. Top with the remaining banana cream mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, whip 1 cup cream until stiff peaks form. Using a pastry bag, pipe cream onto top of pie, covering completely. Refrigerate 1 hour before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Custard and Cream Pies",
            "Banana Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ANGELA ALEX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.592356687898089,
            "ratingCount": 157,
            "itemReviewed": "Banana Cream Pie Made Easy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "606.2 calories",
            "carbohydrateContent": "46.1 g",
            "cholesterolContent": "142.7 mg",
            "fatContent": "46.6 g",
            "fiberContent": "1.5 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "26 g",
            "servingSize": null,
            "sodiumContent": "517.6 mg",
            "sugarContent": "23.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-27T23:55:00.03Z",
                "reviewBody": "Excellent recipe!! As an experienced cook I suggest leaving out the crushed ice, it is NOT necessary to the thickening of the cream. Also, a graham cracker crust (ready made is fine), is really yummy with this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "amy t.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2078407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-23T15:40:39.89Z",
                "reviewBody": "This came out so awesome! For those reviewers who talked about it being too thick, I only had about a cup of cream so I substituted low fat milk for the other two cups and it came out perfect! Not to mention that it was a perfect consistency and lower in calories too! Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stephanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1791790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-04T14:40:31.03Z",
                "reviewBody": "This is excellent! There are a couple of minor things I would change one being to use more bananas. I used four small ones and would use five depending on the consistency you want. Also the crushed ice thing was odd to me. I tried to beat it until it melted but still had to pick out several pieces. Not sure what would be the way around that. The only other thing I may change is to add a little sugar to the top layer of whipped cream when I beat it. It doesn't call for it and none of the previous reviewers mentioned it so I didn't use any. But if you taste the top layer by itself (I pick things apart to eat them:) it of course doesn't taste very good. All in all a YUMMY pie that I will make again! Thank you Angela! Oh by the way I used No Roll Pie Crust II off this sight and it is so flaky and easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristin Pozniak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/242909/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-26T17:55:34.25Z",
                "reviewBody": "Definitely the easiest and best banana cream pie I have made. My family insists on one a week. I found this recipe can make two pies easily and they can be frozen for future use. I also recommend adding half a packet of sugar to the whip cream. A MUST TRY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MICHELE TIBBO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/256123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-01T14:31:40.933Z",
                "reviewBody": "UPDATE 8/2008: This recipe is foolproof. I made this recently with a pregnant friend of mine and I left the recipe with her. I found out later she ate all of the pie and then made another one the next day! I too added some vanilla pudding mix and a bit of sugar to the whipped topping. Perfect. FANTASTIC! I also made a strawberry cream pie with this recipie subing banana pudding mix with strawberry glaze to taste. BOTH pies were HUGE hits! Handed them out to boyfriend's parents family friends and the rest was gobbled up by mom and pop!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pinkpigeon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2403019/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-26T05:25:54.14Z",
                "reviewBody": "Best banana cream pie recipe ever. This was much better than anything store-bought and a hundred times better than anything from a cafeteria or buffet. The pies (I was able to make two with this recipe) were very rich and delicious yet not too sweet. I didn't have any crushed ice on hand but it made no difference as far as I could tell. Also the whipped cream topping tasted much better after adding some powdered sugar. It's not necessary to pipe on the topping as I just used a spatula. Everything tasted great together in Nilla pie crusts. After making one with peach on the bottom my advice is to stick with the bananas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Strangelove",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1572444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-19T02:45:23.28Z",
                "reviewBody": "So good! I made only one pie but mounded the filling up in the middle and I ended up putting it in a ready made shortbread crust. This is a wonderful desert to make if you don't want to spend much time on it no time at all to mix together. I will use my homemade regular pie crust next time and actually might not whip as long as I did because it was just a smidge too stiff. I would have liked it a touch creamier - still a great pie and much better then other versions I've tried. This would also make a great filling for a summer trifle recipe with various fruits or even switching the banana mix for chocolate for a chocolate cream pie. Options!! Thanks for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVIST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/491160/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-03T19:46:32.857Z",
                "reviewBody": "Awesome recipe and so easy to make. My family loves it. Instead of a baked pie shell, I just buy a pre-made graham cracker shell. Also, no need to use crushed ice. Just wet the inside of your mixing bowl and your metal mixers with water and then put them into the freezer for a few minutes. My family always does this when we make whipped cream. Also, if the banana mixture gets too thick, I just add some milk and stir to thin it out so it's nice and creamy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "anemptyroad",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4975174/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-05T16:17:44.78Z",
                "reviewBody": "Fabulous pie! This was the first time I've made banana cream pie and it got rave reviews. I was told it was the best people have ever had. I followed others' suggestions and used 5-6 bananas banana cream pudding and added powdered sugar and vanilla to the topping. One thing I found with the crushed ice was to put it in a blender to totally crush it. This is definitely in my recipe box permanently! Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShadowB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/769252/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-25T20:28:44.747Z",
                "reviewBody": "This was very easy and made enough to generously fill TWO ready-made graham cracker crusts (I used one graham one chocolate cookie crust). You do not need the ice in this recipe. In fact I used heavy whipping cream just brought from the store (so it wasn't even all THAT cold) and it worked just fine. The creamy consistency/texture of cream pies is what makes them great. I decided the chunkiness of so many bananas detracted from the creamy texture and the pie as a whole. I will not use as many bananas next time. What bananas I do use will be sliced razor thin. You don't really even need the whipped topping part - or you could put some on each slice when you serve it. This isn't the excellent banana cream pie you'd expect from a great sweet shop -- but it fits the bill in a pinch and you can make as many different flavored pies as they make instant puddings. Couldn't be easier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2402378/"
                }
            }
        ]
    }
]