[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2418/desserts/frostings-and-icings/chocolate/",
                    "name": "Chocolate",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23388/buttermilk-chocolate-cake-with-fudge-icing/",
        "name": "Buttermilk Chocolate Cake with Fudge Icing",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F609899.jpg",
            "width": 2448,
            "height": 3264
        },
        "datePublished": "2000-10-21T02:31:09.000Z",
        "description": "This is the simplest and moistest chocolate cake I have ever found and was a favorite when I grew up. I could even whip it up as a child.  This cake is also great with the boxed fluffy icing so the great chocolate flavor of the cake is not hidden.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "1 - 9x13 inch pan",
        "recipeIngredient": [
            "1 cup buttermilk",
            "2 teaspoons baking soda",
            "2 cups white sugar",
            "2 eggs",
            "3 tablespoons unsweetened cocoa powder",
            "½ cup vegetable oil",
            "2 teaspoons vanilla extract",
            "1 cup boiling water",
            "2 cups all-purpose flour",
            "1 cup white sugar",
            "½ cup unsweetened cocoa powder",
            "¼ cup milk",
            "¼ cup butter",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.  In a medium bowl, combine the buttermilk and baking soda.  Set aside in a warm place.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together 2 cups sugar, eggs, 3 tablespoons cocoa powder, oil and 2 teaspoons vanilla until blended.  Stir in the boiling water, then gradually beat in the flour.  Stir in the buttermilk mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into prepared pan. Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To make the Fudge Icing:  In a saucepan, combine 1 cup sugar, 1/2 cup cocoa powder, milk, butter and 1 teaspoon vanilla extract.  Bring to a boil, and cook for 1 minute. Remove from heat.  Using an electric mixer, beat icing for 3 minutes, or until it thickens to spreading consistency.  Pour over completely cooled cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings",
            "Chocolate"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Sandy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.123076923076923,
            "ratingCount": 195,
            "itemReviewed": "Buttermilk Chocolate Cake with Fudge Icing",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "420.6 calories",
            "carbohydrateContent": "70 g",
            "cholesterolContent": "42.4 mg",
            "fatContent": "14.9 g",
            "fiberContent": "2.2 g",
            "proteinContent": "5.1 g",
            "saturatedFatContent": "4.7 g",
            "servingSize": null,
            "sodiumContent": "273.7 mg",
            "sugarContent": "51.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-06-05T16:53:19.297Z",
                "reviewBody": "This cake should have 10 stars!!!  I made it for my husband's birthday last night.  I used a bundt pan (dusting with cocoa powder in lieu of flour) which required about an 20 minutes extra baking time.  I then let the cake cool for a few minutes in the pan, and then took it out of the pan to finish cooling while I made the frosting.  After the frosting was done, I put the cake back into the bundt pan and then poked holes in the bottom of the cake with a wooden spoon and a fork.  I then poured about half the frosting into the holes.  I would have let it sit like that for awhile but my husband was coming home so almost immediately I put the cake on the serving plate and then using a basting brush, painted the rest of the frosting onto the top of the cake.  Gobs of frosting still pooled into the \"hole\" of the bundt cake.  When my husband took the first bite, he exclaimed - \"Oh My God!  It's filled with chocolate!\"  I ***strongly*** recommend using the highest quality of cocoa powder available as it is the only chocolate in the cake.  I used Ghiradelli.  Also, the batter was quite runny when I poured it into the pan but it cooked up just fine.  I also \"made\" my own buttermilk by adding 1 T. apple cider vinegar to 1 c. milk and letting it set for a few minutes.  I also used 1/4 c. cocoa powder in the cake as opposed to just 3 T..  Amazing recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "empearls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-06T13:23:38.577Z",
                "reviewBody": "I've never made the cake, but I have made the fudge icing and used it on other cakes.  It is delicious and truly tastes like fudge.  I would caution, however, that you do not beat it for the full 3 minutes if you intend to pour it over your cake (I like it poured over bundt cake).  It will not flow down the sides but rather sit on the top in more of a clump.  Stop beating when it looks a little thinner than what you want because it will set very fast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SEY1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1067716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-21T04:06:19.843Z",
                "reviewBody": "After reading the reviews I decided to make a few small changes and made this a 5 star recipe (well at least to me).  I added 1/4 cup of cocoa powder instead of the 3T and an extra tsp of vanilla.  Also I didn't have buttermilk so I added a tsp of vinegar to a cup of regular milk.  The icing was very yummy even though I burnt it while boiling.  I saved it by just pouring off the good stuff and not scaping the bottom of the pot.  Also I only beat it for 2 min and didn't have any problems with it being too thick.  SUPER DUPER and very moist!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LDSGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1368822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-09T01:34:26.53Z",
                "reviewBody": "This cake is divine! So moist and tasty.  Do not skip the frosting step, it compliments the cake perfectly - it is just not the same cake without it.  I have made this cake several times and it has been consistently successful. Just a couple of suggestions:\nI use a little over 1/4 cup of cocoa powder, instead of 3 tbls.\nDo not burn your frosting.\nProperly butter and flour your pan beforehand (I use a 9X13 pan).\nDo NOT overbake. Take out while still slightly moist on the toothpick (not clean like the recipe says). I shut off oven and let the cake sit in for 5 min max after the slighly moist point.\n\nand ENJOY!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DTALER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1328329/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-25T19:22:28.63Z",
                "reviewBody": "The cake wasn't horrible but it wasn't the best that I've had. It was moist as other users have said but you would definitely want to add more cocoa..I used 1/4 cup..I would also recommend sifting the flour before use or use cake flour.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimi Lareux",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2392656/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-30T19:15:38.7Z",
                "reviewBody": "Flavor is excellent. I only gave it 4 stars however because I want more frosting. I took a photo which shows how the frosting doesn't cover the entire cake. Sure it is rich and sweet... but I like chocolate cake that way! The more the better!! I did follow someone else's suggestion of using 1/4 Cup of Cocoa for the cake batter and am glad I did. Now I'm off to make another batch of frosting - yum! -",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "HAV2SING",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/183810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-15T20:49:47.263Z",
                "reviewBody": "This recipe is fantastic! Every chocolate cake I've ever made has come out dry but this one was perfect! and so easy! I beat it by hand not with a mixer and used a chocolate buttercream frosting. Ummmm! good! But beware you'll be coming back for 2nds and 3rds and it is sinfully rich and so delicious! Nana Betty",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRAMERLIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-27T19:32:29.76Z",
                "reviewBody": "I haven't made the cake but I LOVE LOVE LOVE the icing. It's a great way to make a boxed cake mix taste homemade! My family (4boys hubby) eat it all in one sitting. Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LARALEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/926852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-30T16:29:04.67Z",
                "reviewBody": "I bake A LOT and I followed this recipe exactly but I will not make this cake again. I'm unsure why it has gotten such good reviews. Perhaps people have never had a really good piece of chocolate cake before. I'll give it 2 stars because it didn't taste \"bad\" but I think there are things wrong with the recipes for both the cake and the frosting. The cake definitely needed more cocoa powder. Also the texture was strange when it had finished baking. Part of the problem may lie with the method in which it is mixed and it that it is a fairly runny batter. By itself I didn't care for the cake at all. The fudge topping has a good flavor but unless you like to crunch on granules of sugar it should be cooked differently. The sugar needs a chance to dissolve. Fudge should be smooth not crystallized. I think the problem may be that it needs more liquid perhaps some corn syrup. I am going to look for another chocolate cake recipe. In all seriousness the ones out of the box are better. Sorry but this one is definitely not worth the time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "reginarose32",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4051361/"
                }
            }
        ]
    }
]