[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17100/desserts/frostings-and-icings/",
                    "name": "Frostings and Icings",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7486/decorator-frosting-i/",
        "name": "Decorator Frosting I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1128462.jpg",
            "width": 1057,
            "height": 1057
        },
        "datePublished": "1998-05-13T01:27:42.000Z",
        "description": "This is a pure white wedding cake frosting. You can double the recipe if you have a sturdy mixer.  Add milk according to purpose; you need less if you are making flowers or borders than if you are just covering a cake.  Remove what you need for decorating before you thin the rest down for frosting.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "3 cups",
        "recipeIngredient": [
            "1 cup shortening",
            "4 cups confectioners' sugar",
            "4 tablespoons milk",
            "1 ½ teaspoons almond extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine all ingredients in a mixing bowl.  Beat on low speed of electric mixer until well blended and very smooth.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Frostings and Icings"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jean Higginbotham"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2926829268292686,
            "ratingCount": 123,
            "itemReviewed": "Decorator Frosting I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "317.7 calories",
            "carbohydrateContent": "41.9 g",
            "cholesterolContent": "0.4 mg",
            "fatContent": "17.2 g",
            "fiberContent": null,
            "proteinContent": "0.2 g",
            "saturatedFatContent": "4.3 g",
            "servingSize": null,
            "sodiumContent": "2.5 mg",
            "sugarContent": "41.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-05-27T18:40:45.223Z",
                "reviewBody": "I did not follow the recipe exactly. I substitued 1/2 crisco and 1/2 butter. I also used vanilla extract instead of Almond. I am not much of an almond fan, but the icing was great. Not as sweet as others I have used and alot simpler.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bella32484",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2383262/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-12T17:22:24.673Z",
                "reviewBody": "This is a pretty pure white frosting and very easy to work with. Thin it for a crumb coat leave as is for piping and thin if you prefer to frost. The texture is great as well - creamy and fluffy. But it was prettier to look at than it was to eat. I believe it is a combination of factors that made this not as good for flavor -the fact that it was all shortening made the taste flat. Maybe a pinch of salt would have helped that. The almond flavoring while it keeps the frosting white is harsh. I miss the buttery vanilla flavor of other frosting recipes I've tried which are far better. This was one occasion where I pushed most of the frosting off to the side of my plate...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-09-17T03:39:56.043Z",
                "reviewBody": "This is the decorating frosting recipe that I learned when I first started decorating cakes.  I like the almond flavoring but you can also use butter flavoring if you prefer the butter flavor.  Actually butter can be used rather than the shortning but then you will not have a true white frosting that decorators want.  I have also substituted any number of flavorings depending on what I wanted although almond is my personal favorite.  You have to remember this is made for DECORATING, more so than the actual flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Donna Spiker Urchak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/509357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-16T17:25:28.617Z",
                "reviewBody": "I'm a very serious though non-professional cake decorator. I bake and decorate a cake every two weeks and even made my own wedding cake. First I have to say this icing DOES have its place: It's very easy to make cheap and kept in an airtight container in the refrigerator it says good almost forever. I use this for practice all the time but I never eat it. The taste is vile. It's greasy and most people myself included find it way too sugary. There is no reason to serve this to people given there are actually tasty icing recipes out there that are still appropriate to decorate with. If you are coloring the frosting a traditional buttercream is wonderful. If you must have pure white: marshmallow fondant is good for icing an entire cake and boiled icing is great for writing and string work. If you need white flowers gum paste can do the trick. If you absolutely must have pure white piped flowers and there is no way around it I'd check gourmet stores or online to find some goat milk butter which is pure white if it isn't dyed.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Layla",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2228111/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-03T20:53:56.07Z",
                "reviewBody": "I made this today to decorate a birthday cake and I am very pleased with the results. This is teriffic for making flowers borders and writing on cakes. I separated it into 3 bowls and added a different food coloring to each one...I made pink and yellow for flowers and green for leaves. This should be a thick frosting in order to pipe it out of the different decorating tips. I would not thin it down to frost an entire cake...it's very sweet in large amounts!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLBRYAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/529432/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-11T18:42:03.29Z",
                "reviewBody": "The standard decorator frosting that most home cake decorators begin with. Admittedly it's lovely to look at and pipes like a dream. However the taste leaves a lot to be desired. When using only shortening it's essential to add some salt to the mix - just a little will suffice under 1/8 tsp - or the flavor will be dull like it's missing something. That much almond extract will be too strong for those who don't absolutely love almond flavor and there are many. Either half almond and half vanilla (clear if you want to preserve that stark white color) or half vanilla and half lemon are more generally appealing possibilities. Thin to use as a frosting for the entire cake but know ahead of time that this recipe might well be considered too sweet. For me this isn't the overall taste I'm looking for. A frosting made with all or mostly shortening doesn't melt on the tongue the way I like. This frosting leaves a tell-tale gummy cloyingly sweet residue. This frosting is better when reserved strictly for decorating. When used for this purpose I find that cutting the ingredients in half gives me plenty to decorate a 2-layer or 9\" X 13\" cake. Be aware that this will develop a light crust when left exposed to the air for several hours.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-11T01:45:56.06Z",
                "reviewBody": "I used this frosting to make a wedding cake that I entered in a dessert contest at my school and I won.:) It tasted good and it worked nicely to cover the cake and also to make borders and decorations. I used 1/2 cup butter and 1/2 cup shortening instead of one whole cup of shortening. Also I think 1 1/2 tsp of almond ex. was too much and I reduced it to 1 tsp in the second batch. Thank you for this recipe!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ji Eun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1916771/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-11T21:16:01.46Z",
                "reviewBody": "This was exactly what I wanted it to be. I doubled the recipe and used half Crisco half butter and left out the almond extract (since I ran out). I used it to ice and build a princess castle and it was declared the best birthday cake that anybody ever saw! The flavor was really good too unlike most bakery cakes anymore. Thank you so much I'll use this one a lot for decorating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1151739/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-22T21:40:20.577Z",
                "reviewBody": "I loved this frosting! I have used it several times now. It tastes awesome simple to make and is good to frost cakes and cupcakes. I've used different variations - like used vanilla extract and lemon extract instead of almond. It was awesome! I used butter instead of shortening and it still turned out very white. Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "d turner",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2218851/"
                }
            }
        ]
    }
]