[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23406/whipped-cream-cake-ii/",
        "name": "Whipped Cream Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2344172.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2000-10-23T02:37:36.000Z",
        "description": "Cake flour and whipped cream make this cake extremely light and tender.  Fill with your favorite frosting or serve with fresh fruit.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "1 -2 layer 8 inch cake",
        "recipeIngredient": [
            "1 ¾ cups cake flour",
            "2 ½ teaspoons baking powder",
            "½ teaspoon salt",
            "1 ½ cups heavy cream",
            "1 ⅓ cups white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour two 8  inch pans.  Sift together the cake flour, baking powder and salt.  Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Using an electric mixer, whip the cream with the sugar until stiff peaks form.  Beat in the eggs, then stir in the vanilla.  Fold in the flour mixture, mixing just until incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour batter into prepared pans. Bake in the preheated oven for 25 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "sal"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.511111111111111,
            "ratingCount": 90,
            "itemReviewed": "Whipped Cream Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "333 calories",
            "carbohydrateContent": "47.6 g",
            "cholesterolContent": "86.1 mg",
            "fatContent": "14.4 g",
            "fiberContent": "0.4 g",
            "proteinContent": "4 g",
            "saturatedFatContent": "8.6 g",
            "servingSize": null,
            "sodiumContent": "234.3 mg",
            "sugarContent": "26.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-05T17:07:19.543Z",
                "reviewBody": "I made a fairly significant change to this recipe - by mistake.  The result was so wonderful you might want to make the same \"mistake!\"  I committed cardinal sin #1 when it comes to baking and didn't read through the recipe carefully before I began.  Since in most cases you'll make a cake with all ingredients at room temperature, I measured out the cream and set it out with the  eggs.  When I set out to make the recipe I noticed it directed that the cream was to be whipped before adding in the flour, and that wasn't about to happen with it at room temp!  But I wasn't about to start from the beginning either by re-chilling the cream. So... I took a chance and beat the eggs with the sugar for a few minutes to aerate the mixture, then added the dry ingredients alternately with the (unwhipped)cream. I baked it in the 8\" layer cake pans as directed, but I wasn't comfortable with the baking temperature of 375 degrees, so I lowered it to the more traditional 350 and baked the layers about 23 minutes.  I watched it rise nicely and perfectly as it was baking and I was encouraged.  I turned the cake out from the pans and it was stilll perfect. Frosted it with \"French Silk Frosting\" (although a vanilla buttercream would have been nice too), cut myself a slice and was wowed.  The cake has an open and tender crumb, fluffy (almost dainty in its lightness!) and is very moist.  Because it's flavored with just a little vanilla it would be compatible with just about any frosting. Very pleased!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-07T01:24:22.95Z",
                "reviewBody": "This is wonderful cake. I did not have any cake flour on hand so I used all purpose. Subtract 2 tablespoons of all purpose flour for every 1 cup of cake flour This cake turned out wonderful and moist! I made cupcakes with the recipe but next time I will use it as 2 8 in. round pans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tonna Jacobson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7334589/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-14T18:28:55.573Z",
                "reviewBody": "OMG, it's been a while since my family has given a perfect review to something I bake! I made it for mother's day, and it was a huge hit. I followed the recipe exactly and frosted with mocha cream(from this site). It came out fabulous! I made sure not to over beat the batter, and was a bit worried about its texture. It was a bit grainy when I poured in the cake moulds. DOn't worry, it comes out just perfect after baking! Light, fluffy, yet full of flavor. My mother even said it tasted similar to great pound cake. One reviewer said that it tastes like whipped cream? I agree! My brother who is usually very difficult to please, called me at home after I had left their house, to tell me that he had just had a piece, and loooooved it! He also said he would pay at least $40 for it! And he never calls me to tell me he likes something, so that must mean something!\nThanks for that great recipe, outstanding!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariam",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1420206/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-12T16:03:56.317Z",
                "reviewBody": "This was fantastic! I didn't have cake flour so i used All Purpose and it was still delicious! I increased the servings to 12 and I baked the cake in two 9 inch pans. I made fresh whipped cream and layerd the cake with the whipped cream and strawberrys. What a hit! I had to make it twice in one weekend and there isn't one piece left!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2578466/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-09T23:22:15.367Z",
                "reviewBody": "This is the most amazing from scratch cake I have ever tasted. I am glad I tried this one. I knew it was going to be good after I tasted the batter. I followed the recipe and direction but I baked mine in a bundt cake pan. I topped this with Vanilla Glaze from this site and served it with a scoop of my homemade Lemon Poppyseed Ice Cream.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "House of Aqua",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/houseofaqua/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-02T22:36:42.04Z",
                "reviewBody": "It really tastes like whipped cream! ok ok I know the name is Whipped cream cake but I just didn't expect such a nice creamy flavour! Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChefSuddeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1429623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-08T21:20:04.28Z",
                "reviewBody": "A wonderful light and airy cake.And the taste was excellent i put a strawberry and vanilla jam with fresh whipped cream and fresh strawberries in the middle and on top of this cake and everyone love it so much.wonderful recipe thanks for sharing it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELLEN666",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1377017/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-02T15:43:46.983Z",
                "reviewBody": "Made this as a birthday cake and for the layer I added fresh strawberries and buttercream icing. The cake turned out really fluffy and light. It's an easy recipe with a great result.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MOTI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655531/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-26T17:30:36.203Z",
                "reviewBody": "This cake recipe turned out so light and fluffy...almost like a sponge cake consistency. I used all-purpose flour and deducted about 2 tablespoons worth. The flavor was outstanding! I made this in some mini bundt cake pans and into cupcakes and lightly dusted them with some powder sugar. My hubby couldn't stop eating them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Catlin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/catlin/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-13T17:53:47.44Z",
                "reviewBody": "I decided to make this recipe only because I had some extra cream in the fridge I need to use up and I'm so glad I did because this is going into my collection. I was so impressed with the flavor and texture (very crumbly and light) for a recipe that is so simple I didn't quite expect it to taste so good. I made an icing with butter icing sugar heavy cream and vanilla that went wonderfully but a word of caution the cake is very sweet so a dab of icing will do. Would go great with any fruit as well. Update: Sorry I have to change my review and the # of stars. This was awsome as soon as it cooled but after even 2 hours later it completely dried out even after being wraped. I have never had a cake do that in such a short time very strange. For that reason I will not be making it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "CHRISTAL88",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1315425/"
                }
            }
        ]
    }
]