[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/846/desserts/cookies/filled-cookies/",
                    "name": "Filled Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23322/cinnabun-cookies/",
        "name": "Cinnabun Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F484517.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2000-10-26T17:47:47.000Z",
        "description": "These cookies are a big hit with my family and friends. They are so delicious!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H8M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "3 dozen",
        "recipeIngredient": [
            "½ cup butter, softened",
            "½ cup butter flavored shortening",
            "1 cup light brown sugar",
            "½ cup white sugar",
            "2 eggs",
            "1 tablespoon vanilla extract",
            "1 tablespoon ground cinnamon",
            "3 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1 teaspoon salt",
            "½ cup brown sugar",
            "¼ cup butter",
            "2 teaspoons ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together the 1/2 cup butter, shortening, light brown sugar and white sugar until smooth. Beat in the eggs one at a time then stir in the vanilla. Combine the 1 tablespoon cinnamon, flour, baking powder and salt; stir into the creamed mixture. Cover and refrigerate dough for at least 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). In a small microwave safe dish, heat the 1/2 cup brown sugar, 1/4 cup of butter and 2 teaspoons cinnamon in the microwave. Stir frequently until butter is melted and the mixture is well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "On a lightly floured surface, roll out each half of the dough to a 12x6 inch rectangle. Spread 1/3 of the cinnamon mixture over each rectangle. Roll each one lengthwise into a log. Cut into 1 inch segments. Use remaining filling to place a small dollop of the mixture onto the cookie sheet where each cookie will be placed, About every 3 inches. Place 1 cookie onto each dollop with the cut side down.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 8 to 10 minutes in the preheated oven. Flip cookie sheet over onto a tray to remove cookies while they are still very hot. If the cookies are stuck, heat the pan in the oven again for a few minutes to soften the cinnamon dollops.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Filled Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LEEMA"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.409282700421941,
            "ratingCount": 237,
            "itemReviewed": "Cinnabun Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "137.7 calories",
            "carbohydrateContent": "17 g",
            "cholesterolContent": "20.5 mg",
            "fatContent": "7.2 g",
            "fiberContent": "0.5 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "117.7 mg",
            "sugarContent": "8.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-05-16T23:56:28.293Z",
                "reviewBody": "Wonderful taste, just like a true cinnabun. I previous reviewer stated their cookies were a mess and spreaded too much - well my test cookie did the same. So I did it plain on the cookie sheet, without the \"dollup of filling on the cookie sheet\" and it came out perfect, at 350 degrees F, 8 minutes (1/2 inch slices). And for the true cinnabun experience - a glaze! 1 tb melted butter, 2 tb hot milk, 1 t vanilla, dash of mace, dash of allspice, mix well, then add 1 c powered sugar (keep adding and mixing till desired glaze consistency). Mine received raved reviews!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IRENE522",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/601369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T20:06:24.28Z",
                "reviewBody": "These cookies get 5 stars for taste, but the recipe gets a fail. This is a difficult, poorly written recipe. I would not recommend it for inexperienced bakers or people with little patience.  Suffice to say if you decide to attempt it, do the following: Plan to chill the dough for several hours before rolling, and even then, it will still be sticky and soft, so roll it out between two sheets of wax paper (which is not an easy task in itself so alternatively, use one sheet on the bottom and flour your rolling pin lightly and continuously as you roll). Remove the top sheet and simply divide the filling evenly between the two rectangles, leaving none leftover for the 'dollop' (there is not a sufficient amount otherwise). Using the bottom sheet of paper to help you along, roll the dough into a tube. Wrap and let chill in the freezer for about half to one hour. Take a length of dental floss and cut the rolls into sections. Put one roll back to chill in the fridge or freezer while the other is baking. Bake on an insulated cookie sheet for 12 to 15 minutes (they will still spread to about 3 times their original size). If using a non insulated sheet, line it with parchment and bake for the recommended amount of time, or until JUST starting to get light brown around the edges(watch them closely).  Leave to cool on the baking sheet for about 15 minutes and then carefully remove to a cooling rack. Good luck.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Alberta Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/wildrosekitchen/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-26T01:04:45.433Z",
                "reviewBody": "These cookies are not only incredibly delicious, but incredibly beautiful as well. Many people that I shared these with could not stop eating them...there were only a couple who didn't care for these. I made the dough exactly as written, except that I didn't have any butter-flavored shortening, and used plain instead. I rolled each half of the dough out, and poured half of the filling on each piece. After rolling it into a  log, I put it in the freezer for 10-15 minutes. I cut it into slices, totally skipped the dallops of filling on the cookie sheet, and they were perfect. It is very important to cool the cookies on the cookie sheet for about 7 minutes so that the filling can harden up again...if you take the cookies off too soon, the filling will fall out, and the cookies will not look as pretty. It is also important to keep putting the dough rolls in the freezer in between sheets of cookies. All together, this is an incredible recipe that I will make again! Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "larkspur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3097894/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-14T20:25:09.553Z",
                "reviewBody": "These are so tasty! I used 1 cup of butter instead of the half butter half shortening blend. I didn't do anything with dallops..all the sauce was used on the rolled out cookie dough! And that seemed to work out wonderfully. The cookie was a hit at a pot-luck! These do taste like cinnamon rolls! And they are very pretty with the cinnamon swirl. Try this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SYRIELLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/195843/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-15T14:43:38.25Z",
                "reviewBody": "This is a great cookie! First off, I did not do the dollop either. I chilled the dough for 1 hour before rolling. Then rolled the dough out onto wax paper for easier rolling,using the wax paper to help me roll it without cracking the dough. After I let the filling cool and thicken, I used all of the filling in the roll . I used a whisk to help incorporate the butter better. I chilled the dough again for about an hour. Then cut the cookies with a sharp knife and baked on wax paper according to directions. I left them on the sheet for a couple of minutes then moved them to a rack to cool. They were very pretty and OMG they melt in your mouth! They retained their shape and looked like a cinnamon roll. I thought I would ice them, but found after tasting them uniced, they did not need anything else. Great with coffee or a nice cold glass of milk!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2304827/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-10T19:03:02.39Z",
                "reviewBody": "These ROCK!! I had to use my egg substitue (which is a banana mashed with 1 tsp. of baking powder) for the 2 eggs and they still turned out fabulous! I suggest doubling the sugar spread. Instead of going through all of the trouble of flipping the cookie sheet and all that I just spread a dab on the top of each cookie and that worked great. I also had no problem with the spreading as I took Linda McClean's advice and put the dough in the fridge after I rolled it. Worked fine and I will seek that topping next time. YUM-YUM! Thanks Amber!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-22T14:56:14.41Z",
                "reviewBody": "These were truly delicious but the dollop of cinnamon mixture on the cookie sheet wasn't neccassary, as I couldn't tell a difference. I still did it with some though and they all were very good. These also get much flatter and double in size while baking, so if they look small and tall on your cookie sheet before you bake them, no worries!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gottaluvfood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4985228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-29T20:49:25.523Z",
                "reviewBody": "These are wonderful cookies! You need to have a glass of milk handy though because they are wonderfully sweet!! I used a VERY small amount of filling on my cookie sheets and didn't have any problem with them spreading. Also you may want to use a tip I learned a long time ago and use dental floss to actually cut the cookies into 1 inch sections. Dental floss works wonderfully for this type job! The glaze that another reviewer gave for the cookies was great too! Thanks Amber for a really super good cookie........I say ONE because that's all that I got once my husband and son got hold of them!!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DOOBIEBEAR11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/648503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:45:38.67Z",
                "reviewBody": "My daughters and I just finished baking our 600 Christmas cookies and this amazing cookie was a first for us. Oh my gosh the whole house took on the most wonderful smell and the taste was just as fantastic. I did put the dollop of the mixture on the pan and didn't have any problems with spreading. Maybe it was because I chilled my dough after rolling and filling. I like the idea of a sugar glaze but after baking so many cookies I'd had enough but I'll certainly try that next time. Thanks so much Amber!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            }
        ]
    }
]