[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/80/main-dish/",
                    "name": "Main Dishes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17245/main-dish/pasta/",
                    "name": "Pasta",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/502/main-dish/pasta/lasagna/",
                    "name": "Lasagna Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16806/main-dish/pasta/lasagna/meat-lasagna/",
                    "name": "Meat Lasagna Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
        "name": "World's Best Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F11%2Fworlds-best-lasagna.jpeg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2000-10-30T14:21:32.000Z",
        "description": "It takes a little work, but it is worth it.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H30M",
        "totalTime": "P0DT3H15M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "1 pound sweet Italian sausage",
            "¾ pound lean ground beef",
            "½ cup minced onion",
            "2 cloves garlic, crushed",
            "1 (28 ounce) can crushed tomatoes",
            "2 (6 ounce) cans tomato paste",
            "2 (6.5 ounce) cans canned tomato sauce",
            "½ cup water",
            "2 tablespoons white sugar",
            "1 ½ teaspoons dried basil leaves",
            "½ teaspoon fennel seeds",
            "1 teaspoon Italian seasoning",
            "1 ½ teaspoons salt, divided, or to taste",
            "¼ teaspoon ground black pepper",
            "4 tablespoons chopped fresh parsley",
            "12 lasagna noodles",
            "16 ounces ricotta cheese",
            "1 egg",
            "¾ pound mozzarella cheese, sliced",
            "¾ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.\n"
            }
        ],
        "recipeCategory": [
            "Main Dishes",
            "Pasta",
            "Lasagna Recipes",
            "Meat Lasagna Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Chandler"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.79806023481368,
            "ratingCount": 19590,
            "itemReviewed": "World's Best Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "448.2 calories",
            "carbohydrateContent": "36.5 g",
            "cholesterolContent": "81.8 mg",
            "fatContent": "21.3 g",
            "fiberContent": "4 g",
            "proteinContent": "29.7 g",
            "saturatedFatContent": "9.9 g",
            "servingSize": null,
            "sodiumContent": "1400.4 mg",
            "sugarContent": "8.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-11-04T22:17:35.077Z",
                "reviewBody": "Excellent and Authentic recipe!  A little more work and ingredients, but well worth it.  Use FRESH basil for more flavor - I use about 1/2 - 2/3 cup fresh chopped basil.  It cooks down and is sooo aromatic.  The mix of sausage and beef is sublime, so no need for more salt.  I always add a dash of nutmeg to the ricotta mixture (an old italian secret!).  I usually make this a day ahead for the flavors and herbs to meld in the fridge then let it sit at room temperature for about 1 hour before baking. Have made for company too, and always get RAVES on it's authenticity.  Great, winter comfort food and feeds a lot of people.  Another tip for lasagna makers - no need to wash another pot to boil noodles.  Soak raw, hard noodles in a large bowl of very hot tap water for 20-30 min.  Noodles won't be cooked but soft, and can complete it's cooking in the oven.  I learned this from a caterer - try it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-01T01:07:53.797Z",
                "reviewBody": "I made this recipe using some tips and tricks from previous reviewers and from my experience having worked in an italian restaurant.  This recipe does not have to be as time intensive as is recommended in the instructions.  As another reviewer noted, it is not necessary to cook the noodles--just soak them in hot water while you are cooking the rest of the ingredients.  You also do not need to cook the sauce.  Sounds bizarre, but it's true.  If you make the lasagna ahead and leave it in the fridge overnight, the flavors blend perfectly, no cooking required.  For a chunkier tomato sauce, I subbed 1/2 of the crushed tomatoes with diced italian-flavored tomatoes.  I layered everything in this order: sauce-noodles-ricotta mixture-sauce-meat-shredded mozzerella...i did 3 layers like this and then finished with a layer of noodles, sauce and shredded mozzerella and a generous sprinkling of parmesean on top.  Following this method, I had the whole thing put together and in the fridge in less than an hour.  It sat overnight and my husband had it in the oven when I got home from work.  Fantastic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wingingit",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2055855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-06T16:10:16.623Z",
                "reviewBody": "WOW! This really is World's Best Lasagna! From reading all the reviews, I made these changes: Added an additional 1/2 pound of ground meat, omitted the salt, doubled the onions, all the spices, the parsley, canned tomatoes, paste, and sauce. I also doubled the filling ingredients and made three layers instead of two. Everyone raved about the lasagna and I have sauce left over for another use. \r\nSIDE NOTE: For anyone who thinks they don't like ricotta cheese: Buy it at an Italian market. Brands such as Sierra or Polly-O. There is no comparison to the taste or texture of supermarket brands. I think that's why I see recipes with regular cottage cheese instead of riccota. I don't use supermarket riccota under any circumstances, it's just plain nasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNN LUKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/462812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-27T20:15:51.873Z",
                "reviewBody": "I've convinced 3 (now-ex) boyfriends, my husband, and even a couple Italian friends at school that I make the most incredible lasagna they've ever tasted with this recipe. I make it pretty much as shown, except if I have the time, I let the sauce simmer on the stove as long as possible. I also add a bit of whatever red wine I have on hand to the sauce. And I try to make a double recipe, so I can use the sauce for other things - it works wonderfully for Chicken Parmesan, plain ol' spaghetti, and anywhere else you'd use a red sauce.\r\n\r\nEverything tastes better the second day, too. Oh, one more thing - I never boil my noodles. I simply buy regular dried noodles, and make sure I have plenty of sauce in the lasagna. It cooks long enough that the noodles boil in the oven, and you end up with a lasagna that isn't runny and holds its shape well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Zanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/zannetastic/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-01T14:57:44.5Z",
                "reviewBody": "I read all the reviews and really followed \"Cookerbob\"'s advise. Here's what I changed: used 1 lb. LEAN gr. beef tripled the garlic reduced sugar to 1 T. reduced salt to 1 t. used 9 lasagna noodles per pan and used 1 pound mozzarella (shredded) cheese per pan. I read the reviews about omitting the fennel and I have to disagree. I believe the fennel is one of the ingredients that makes this dish outstanding. I made the sauce the day before and simmered for 6 hours. Sounds like a lot of work but come on! How hard is it to check a pot simmering??! I had enough sauce for 2 pans of lasagna so that's what I did. Made 2 baked one and froze the other. I just finally made my frozen one yesterday. I allowed it to thaw in the fridge overnight and then baked as directed. Just as delicious as the first batch!!! My hubby is a lasagna snob and says this is the best lasagna recipe ever. I totally agree!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FIGHTPILOTSWIFE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/943966/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-11T17:49:47.937Z",
                "reviewBody": "I was so disappointed with this lasagna! I won't be using this recipe again. With such a high rating, I thought it would taste better. I followed the recipe exactly, except that I only used 1/3 of the salt called for. (One serving of the original recipe is almost a full daily allowance of sodium.) It was still too salty. It tasted like something you'd buy in the freezer section at the grocery store. Why waste all that time making it at home if it doesn't taste any better than the manufactured stuff and isn't any healthier? There also seemed to be too much sauce and not enough of the ricotta mixture or mozzarella. Suggestions: 1. Leave out the added salt altogether. There's already enough salt in the sausage, parmesan and canned tomato products to season everything. 2. Drain the meat after browning and before adding anything else. All that saturated fat does nothing to improve the flavor. 3. Use oregano instead of Italian seasoning and leave out the fennel. Italian sausage already has fennel in it. 4. Leave out one of the cans of tomato paste. The condensed tomato flavor was so strong it drowned out the spices. 5. Use a full 16-oz block of mozzarella, and grate it instead of slicing it. You'll get more even coverage. 6. Double the ricotta mixture (ricotta, egg, parsley). 7. (Optional) Replace the 1/2 cup of water with 1/2 cup of red wine, preferably chianti or cabernet sauvignon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "METROWESTJP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1449997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-19T12:38:32.187Z",
                "reviewBody": "I quadrupled this recipe for 32 men, and it went over so well ... they came back for seconds, and asked for the recipe for their wives ... now how many men do you know that ask for a recipe?  I made a few changes to this recipe based on past reviews and am glad I did ... here are my suggestons ... use fresh whole wheat lasagna noodles (found in the deli dept.) ... no need to cook them and they come in sheets ... make 3 layers for lasagna dish ... therefore, you would require 8 fresh lasagna sheets ... I had to read through a lot of reviews to figure out what to do with the italian sausage, as it doesn't explan in the recipe how to cook that ... what you do is buy mild italian sausages (couldn't find sweet italian sausage and I understand through most reviews that most people can't) ... you then remove the casing around the sausage, remove the meat and fry the meat until cooked in a frying pan ... instead of using 1 tbsp. salt in the sauce, I used 1 tsp. ... and it was perfect ... I suggest going with your taste ... same thing with the sugar ... go with your personal taste ... the layers were a little difficult to figure out so here is what works ... make 3 layers ... first layer is meat sauce, noodles, mozzarella cheese, and parmesan cheese ... 2nd layer is meat sauce, noodles, ricotta cheese mixture (add a little nutmeg for taste), parmesan cheese ... 3rd layer is meat sauce, noodles, mozzarella cheese, and parmesan cheese ... defiitely add the fennel seeds ... gives great f",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sylvia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2171462/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-22T06:57:04.983Z",
                "reviewBody": "This was very good. It didn't fit in my 9 x 13 pan, but worked out fine by placing part of the ingredients in a loaf pan. Caution: skip the tablespoon of salt! (Have you EVER heard of a recipe that calls for a full tablespoon?) Between the cheeses and the canned tomato products, no additional salt was needed. This recipe would easily be a base for your favorite additions: spinach, mushrooms, zucchini, etc. Other reviewers were absolutely correct: plan to make this the day before serving. It makes all the difference in the blending of flavors and incredible taste. I served this with homemade cheese bread and a crisp green salad.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MANDT2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/297942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-08-29T20:29:05.65Z",
                "reviewBody": "I am giving this 5 stars b/c all of my friends liked it and asked me for the recipe!  I made this for my women's group holiday dinner.  I would personally give it 4 stars.  It was a bit too meaty for me and there didn't seem to be enough ricotta (but I know a lot of peopele don't like ricotta anyways).  I followed a couple reviewer's suggestions and soaked the noodles in a large roasting pan (try it -there is plenty of room to allow the noodles to lay flat) in VERY hot tap water for about 30 minutes. I added the browned meat / garlic / onion mixture to the tomatoes, paste, sauce, seasonings, etc. WITHOUT simmering.  I assembled the lasagna the evening before (sauce, 6 noodles, ricotta, mozzarella slices, sauce, Parmesan, exact same layer again and sprinkled with shredded mozzarella and rest of Parm).  I purchased a 1 lb. package of sliced mozzarella and ended up using all of it (and it turned out fine).  Also purchased mild Italian sausage (not the sweet stuff - couldn't find it).  Be sure to use fresh parsley.  It gives the dish nice color and adds a fresh taste that you won't get from the dried stuff.  Also, be sure to add fennel seed.  It really adds  nice flavor to the dish.  Leftovers were yummy.  I took some to my parents, and my mom had one square.  My dad ate the other 4!  This one's a keeper, and is worthy of all stars because of the compliments - and shortcuts.  Try them, they REALLY, REALLY work!.  Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "World’s Best Lasagna",
            "description": "See how to make this top-rated lasagna from scratch!",
            "uploadDate": "2012-04-13T19:04:41.327Z",
            "duration": "PT1M52.064S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc59f57d1-256a-415b-9e04-51b6de814859%2Faaabbcb0-902c-4765-9961-d45d198983f4%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1560991360001"
        }
    }
]