[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17533/desserts/fruit-desserts/raspberry-desserts/",
                    "name": "Raspberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/25642/white-chocolate-raspberry-cheesecake/",
        "name": "White Chocolate Raspberry Cheesecake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F584781.jpg",
            "width": 4288,
            "height": 2848
        },
        "datePublished": "2000-12-16T19:13:50.000Z",
        "description": "This makes an excellent cheesecake, similar to one you would get in a restaurant. Great for special occasions! Garnish with white chocolate curls if desired.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT10H0M",
        "recipeYield": "1 - 9 inch cheesecake",
        "recipeIngredient": [
            "1 cup chocolate cookie crumbs",
            "3 tablespoons white sugar",
            "¼ cup butter, melted",
            "1 (10 ounce) package frozen raspberries",
            "2 tablespoons white sugar",
            "2 teaspoons cornstarch",
            "½ cup water",
            "2 cups white chocolate chips",
            "½ cup half-and-half cream",
            "3 (8 ounce) packages cream cheese, softened",
            "½ cup white sugar",
            "3 eggs",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, mix together cookie crumbs, 3 tablespoons sugar, and melted butter. Press mixture into the bottom of a 9 inch springform pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan, combine raspberries, 2 tablespoons sugar, cornstarch, and water. Bring to boil, and continue boiling 5 minutes, or until sauce is thick. Strain sauce through a mesh strainer to remove seeds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). In a metal bowl over a pan of simmering water, melt white chocolate chips with half-and-half, stirring occasionally until smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, mix together cream cheese and 1/2 cup sugar until smooth. Beat in eggs one at a time. Blend in vanilla and melted white chocolate. Pour half of batter over crust. Spoon 3 tablespoons raspberry sauce over batter. Pour remaining cheesecake batter into pan, and again spoon 3 tablespoons raspberry sauce over the top. Swirl batter with the tip of a knife to create a marbled effect.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 55 to 60 minutes, or until filling is set. Cool, cover with plastic wrap, and refrigerate for 8 hours before removing from pan. Serve with remaining raspberry sauce.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Raspberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindy Catudal Shank"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.827280779450842,
            "ratingCount": 3387,
            "itemReviewed": "White Chocolate Raspberry Cheesecake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "412 calories",
            "carbohydrateContent": "34.4 g",
            "cholesterolContent": "96.4 mg",
            "fatContent": "28.3 g",
            "fiberContent": "1 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "16.9 g",
            "servingSize": null,
            "sodiumContent": "225.8 mg",
            "sugarContent": "29 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-07T03:20:43.643Z",
                "reviewBody": "I made 2 cakes. The 1st one wasn't very appealing but it tasted great. The 2nd one looked beautiful and tasted even better. What did I do different the 2nd time? I read the cheesecake techniques article found on this website. I wrapped foil around the bottom of my pan & placed the pan on a cookie sheet. Then I filled the cookie sheet w/water. I baked the cheesecake for an hour then turned the oven off & let the cheesecake sit in the oven for another hour. This prevents the cake from sinking in the middle. Everyone loved it! It was delicious and I can't wait to make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ESTELLA93",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/955720/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-31T22:24:44.607Z",
                "reviewBody": "This recipe got rave reviews from my family on Christmas! One tip, which made this even easier to make: I used seedless raspberry jam instead of cooking the raspberries on the stove. I just microwaved 6 tablespoons of jam for 30 seconds before adding to the cheesecake. It was so much easier and tasted fantastic! I also microwaved the white chocolate with half-and-half with excellent results. I will definitely make this again! Everyone was so impressed!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CLEMSONMAV",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1236911/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-04T19:41:56.013Z",
                "reviewBody": "This is SOOOOOOOOOOO delicious -- I've made it three times now, and it is already legendary within my extended family!  :-)  Just a couple of recommendations:  definitely double the amount of cookie crumbs used for the crust; one cup barely covers the bottom of the springform pan.  If you're using smashed up Oreos for your chocolate cookie crumbs (which is what I do), then you don't need anywhere near as much butter or sugar in the crust; the Oreo creamy filling provides lots of sweetness and stick-it-together-ness.  I use 2 cups crushed Oreos, only one tablespoon sugar, and 1/4 cup melted butter -- the crust comes out perfect that way.  Also, I'm not sure if I just have delinquently leaky springform pans or what, but the first time I made this, I ended up with melted butter dripping down from the bottom of the pan all over the bottom of my oven (quite a mess).  Now I put a jelly roll pan on the oven shelf below to catch the dripping butter, and all is well.  :-)  I have ended up with a few cracks in the top of the cheesecake each time I have made this, but once I pile on tons of white chocolate shavings/curls, no one is the wiser!  This cheesecake absolutely could NOT taste better -- people go CRAZY over it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Schilz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1602520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-15T18:42:39.877Z",
                "reviewBody": "Loved it. I'm making this for the THIRD time tonight! Everyone who tried the last one said it was better than my mom's cheesecake... and that's saying a ton! \n\nA couple things though.. make sure you check it 15 minutes early. If it looks done in the over it will be OVER DONE on your plate! Tap the side of the pan with a spoon and if it jiggles as \"one piece\" rather than like jello, it's done. if it doesn't jiggle at all it's over done. \n\nAnd, If you're using a springform pan, you can put prachment paper on the bottom and it will just slide off the pan easly when it's time to cut it. \n\nAnd as for cutting perfect, clean pieces - run a clean, long, thin knife under hot water. Quickly dry it off with a towell and slice straight down and out. Repeat for EVERY SLICE! Yes, it will take a while - but you'll have beautiful, perfect slices. ^_^",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Eliece",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2381865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-25T00:44:44.557Z",
                "reviewBody": "I used 2 cups of Oreo crumbs (I put them in my food processor, cream and all) , 1 Tablespoon sugar and 1/4 cup butter for the crust in a 10 in springform pan. I also used seedless raspberry preserves and that significantly decreased the time I spent making this cheesecake. Heating the preserves up slightly in the microwave (10-15 secs) makes it very easy to drop in the batter. I was very easy and it came out very pretty and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LatinaCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/latinacook/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T02:10:03.483Z",
                "reviewBody": "I have made this cheesecake twice now. The first time i made it, I too, had a lot of trouble getting the raspberry seeds out which made the \"raspberry swirl\" almost non-existent, however, it tasted wonderful. The SECOND time I made it, I made just a few changes. I made it in a 10\" springform pan, and used 4 cups of white chocolate chips to give it extra white chocolate flavor. I also doubled the water to make the raspberry sauce and added 3.5 tablespoons of sugar, which made it drain out and taste wonderfully! I will always make it like that now, and encourage everyone to try this recipe no matter how they make it, or what alterations they make!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Thia Bonadies",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/970059/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-19T22:27:23.763Z",
                "reviewBody": "I made this for my sister-in-law's birthday and it was heavenly! It has a creamy texture with undertones of white chocolate and raspberry. My sister-in-law said it tasted \"professional.\" I doubled the crust using 2 cups of Oreo cookies, 1/4 cup of butter and 1 T. of sugar. Double the raspberry sauce. It's easier to puree the raspberries with the sugar, press the ingredients through a fine-mesh stainer and then cook it. I added 6 T. of raspberry sauce to the cake without it overpowering the taste. The white chocolate and half-and-half can be safely microwaved on HI for 1 minute, stirred throroughly, microwaved and stirred thoroughly. 2-1/2 to 3 minutes should do it. To prevent any leakage, I use a 9\" x 3\" cake pan.  Spray the bottom with Pam, add parchmant paper to the bottom and spray the parchmant. Cook the cheesecake in a water bath for the designated time. Remove from the water bath, carefully loosen the sides of the cake with an offset cake knife, then immediately refrigerate - uncovered - until morning. Never a crack. To remove the cake from the pan, heat water to almost boiling and gently dip the pan in (about 1\") for 10 seconds. Turn the pan over on a large flat plate, tap the bottom and lift the pan away from the cake. Invert cake onto serving plate. If cake stays in pan, repeat the process. The cheesecake will not fall. I always do this with excellent results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/558797/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-12T13:41:40.56Z",
                "reviewBody": "This is an EXCELLENT cheesecake!  I made it for my family Christmas dinner and everyone just raved about it!  I would not change a thing on this recipe!  I plan to make it for New Year's Eve!  A cheesecake tip, when the cheesecake is almost done, turn off your oven and open the oven door.  Do not take it out until the oven and cheesecake are completely cool.  This will avoid cracks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LMACLAREN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/864321/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-05T07:41:57.453Z",
                "reviewBody": "This is a great recipe--everyone I've served it to loved it. I use oreos for the crust. Put them in a ziplock bag and crush them with a meat mallet and rolling pin. Also blend the raspberries and water in the blender and strain the berries before you make the sauce much easier to get the seeds out. Save out a few raspberries to stir into the sauce that goes on top just before serving. Nice with a bit of white chocolate melted with a little bit of milk and drizzled on top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MALINDAGB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/747031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-23T14:58:48.61Z",
                "reviewBody": "Don't know where I went wrong since everyone else is raving about this. I baked mine for 60 minutes. I cooled then chilled it for 24 hours. When cut the center was very mushy. It's like the raspberry sauce had soaked into it. On top it looked beautiful (see picture) so I was very surprised that it didn't hold its texture well. I served it at a guild function and there wasn't one \"swoon\" which these ladies do for great decadent desserts. Not one request for the recipe which is always the usual course of things (as a chef I hate being asked to give out recipes. It's like asking a doctor to give out free prescriptions. But with this recipe I didn't have to worry - no requests.) It tasted fine though nothing spectacular. The white chocolate cannot even be tasted especially disappointing since I used expensive imported Belgian white chocolate. I shouldn't have bothered. I've made many other cheesecakes including just straight ones with no specialty flavorings that were much better. I'm a chef and have worked extensively as a caterer and pastry chef so no rookie here. As cheesecakes go this was merely OK. Not bad but certainly not exceptional. I know that flies in the face of all the other glowing reviews but I'm being completely honest. At best I'd describe this as aggressively mediocre.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "White Chocolate Raspberry Cheesecake",
            "description": "Make this creamy white chocolate raspberry cheesecake.",
            "uploadDate": "2012-05-22T17:35:47.891Z",
            "duration": "PT4M45.869S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F99fbf849-4576-44ac-bd59-50f1712e6bc2%2Ff7636ac4-c215-48fc-ad4c-8ae3652f5f57%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1650901772001"
        }
    }
]