[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/401/desserts/candy/toffee/",
                    "name": "Toffee Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/27026/english-toffee/",
        "name": "English Toffee",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F777304.jpg",
            "width": 2376,
            "height": 1584
        },
        "datePublished": "2000-12-16T03:10:23.000Z",
        "description": "This candy tastes wonderful and takes about 15 minutes to make. My sister and I did three batches in an hour one year for Christmas. I use a cast iron skillet and some times just a few of the almonds to help gauge the readiness.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "1 cup butter",
            "1 ¼ cups white sugar",
            "2 tablespoons water",
            "¼ cup slivered almonds",
            "1 cup chocolate chips"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Butter a 10x15 inch jellyroll pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a heavy skillet over medium heat. Stir in sugar and water. Bring to a boil and add almonds. Cook, stirring constantly until nuts are toasted and the sugar is golden. Pour the mixture into the prepared pan; do not spread.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Immediately sprinkle the chocolate chips on top. Let stand for a minute, then spread the chocolate over the top. Let cool completely, then break into pieces.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Toffee Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "nora"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.201834862385321,
            "ratingCount": 218,
            "itemReviewed": "English Toffee",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "222.2 calories",
            "carbohydrateContent": "22.6 g",
            "cholesterolContent": "30.5 mg",
            "fatContent": "15.5 g",
            "fiberContent": "0.8 g",
            "proteinContent": "0.9 g",
            "saturatedFatContent": "9.2 g",
            "servingSize": null,
            "sodiumContent": "82.9 mg",
            "sugarContent": "21.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-03-19T21:10:16.077Z",
                "reviewBody": "Great toffee. (TIP - Before you make this, make sure it's not raining or too humid outside. Make this on a dry day or else the toffee will be sticky hard and not turn out). I would disregard the review about using only half of the butter.  You will need two sticks of butter to make it right.  Directions:  melt sugar, butter & water to a boil for about 5 min, or until the sugar has completely dissolved. This will help you avoid getting that awful grainy texture after it cools.  Stir constantly w/ a wooden spoon during this 5 minutes or until sugar has dissolved.  Then remove spoon, reduce heat to medium low and keep at a steady low boil/bubble.  Insert candy thermometer and don't stir anymore.  If you use a heavy gauge stainless pot and keep it bubbling low it should not burn at all or need stirring.  Toffee will need to reach AT LEAST 300 degrees and no more than 310.  Take off the heat, add dash of salt and 1 teaspoon vanilla and quickly pour onto a jelly roll pan lined with greased foil or regular parchment paper.  Then follow with the rest of the directions.  For those who are getting burnt toffee before it reaches 300, your heat is still too high. To make the toffee a little less 'stick-to-your-teeth' - add 3 tablespoons light corn syrup and 3 tablespoons water to the sugar/butter mixture before cooking. Add 1 teaspoon of vanilla extract immediately after you take it off the heat. This will make the toffee more 'melt-in-your-mouth' texture and fail-safe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MommyFromSeattle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/857169/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T04:18:11.403Z",
                "reviewBody": "After experimenting, here is what I figured out.  The toffee turns out amazing if you do two things diffent.  First, I used half the amount of butter that was called for.  Second, when cooking with sugar, you have to wait for it to caramelize... that means that you should not stop cooking it until it turns into a light chocolate (toffee apple!) color that is thick and creamy.  Then let it cool... it will start to harden right away. Be sure to take it off as soon as it turns the light brown color so that it doesn't begin to burn.  Happy cooking!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LCDOYLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739766/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-31T00:28:05.363Z",
                "reviewBody": "This toffee was DELICIOUS and turned out perfectly.  I read all of the reviews and decided to follow the correct measurements of the ingredients: 1 cup butter, 1 1/2 cups white sugar, and 2 TB water.  I first melted the butter, then added the sugar and water and stirred continually for 5 minutes.  Then, I stopped stirring and lowered the gas heat as low as possible.  I cooked it for about 15 minutes, stirring every five minutes or so.  Then I added the slivered almonds--I used about 1/2 cup, which I am so glad that I did!  I then clipped my candy thermometer to the side and continued to stir about every five minutes.  When the thermometer reached 300, the mixture had no changed enough yet the rich caramel color, so I raised the heat just a bit and began stirring continuously.  When it reach around 312, the color was perfect and I removed it from the heat.  I quickly poured it onto a cookie sheet which I had prepared with foil and cooking spray.  While I was spreading the toffee (quickly!) I heated 1 cup of semisweet chocolate chips in the microwave for about two minutes, stirring once half way through.  I then spread the melted chocolate all over (this worked much better than allowing the toffee to melt the chocolate chips).  Then I topped the chocolate with chopped walnuts.  This was fantastic, delicious toffee which tasted just like toffee I purchased at a craft fair by the Toffee House.  Thank you so much for this great recipe--I am about to go make some more right now!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2251060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-20T17:53:19.19Z",
                "reviewBody": "This is an excellent recipe, just as is. Do not succumb to the temptation to add less butter. That will result in a product that is not as luxuriously delicious as it could have been. The candy is known in England as \"butter toffee.\" In other words, the butter is the star, and real toffee is crammed full of it. That said, I realize there are many reviews here that refer to the buttery, oily ooze that rises to the top of their toffee. The cause of this is, quite simply, that it was cooked at too high a temperature to allow the chemical process to take place sufficiently. By heating the sugar, we develop the structure of our finished product. In order to accomplish this properly, the sugar has to melt slowly so that there's sufficient time for its molecules to combine with those of the butter, resulting in that delicately crunchy, buttery product. Remember that patience is always your friend when making any candy. Sure, I understand that  it can become tedious to wait and wait for that temperature rise, but better that than to end up with a low quality product that you're not proud to serve or worse yet, that ends up in the trash. With the cost of groceries now days, that's a minor tragedy.  Always cook on low heat and allow the melting process to occur slowly and evenly. The same for the temperature rise. Low and slow - your new mantra. Do this on a nice weather day and follow that one piece of advice, and you'll turn out stuff that will put Heath bars to shame every time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-29T11:04:43.827Z",
                "reviewBody": "I gave it one star so it's easy to find help when people have problems making it.  It's not greasy!  If you are saying your toffee is \"greasy\" that means it SEPARATED!  I have read that when it does that, you can add 1 TABLESPOON of HOT water at a time (no more than 5 of them) until the mixture comes back together.  DO NOT make toffee when it is raining or snowing.  You will not get crunchy candy.  You will get chewy candy that sticks to your teeth.  Use BUTTER (not margarine, crisco, etc.).  Don't cook it too fast.  Goes from done to burnt in a few seconds (as fast as it takes to count 4 mississippis!).  Hope that helps.  Also, use a deep pot.  If you don't, the mix will bubble up and over the pot while cooking.  Candy is very tricky, and can still separate for reasons nobody knows.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Chez Sunfleur",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8579824/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-24T23:26:08.06Z",
                "reviewBody": "Yes the butter is right you MUST use a cast IRON skillet and dance little circles around the pan with a WOODEN spoon with big swoops in between!!! It helps to warm the skillet in the oven for a bit too not too hot though. My family(from England) has made toffee every year for the holidays and I lost the recipe this is the closest so far. It does take longer than the recipe states mine 30min. of stirring.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Billbo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1558168/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-01T23:50:08.747Z",
                "reviewBody": "Although the first batch I made had the oil problem noted by other reviewers I tried again and the next several batches came out wonderful. Only thing I did differently was change pans. The batch where the butter never fully incorporated was made in a non-stick pan. When I switched to regular stainless steel it worked great. Don't know if that was the reason or just coincidence but I changed from my old recipe of many years to this one for the rest of my Christmas cooking. Fast easy and YUM! Can you say teacher gift?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRACY COCHRAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/584665/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-18T04:12:22.373Z",
                "reviewBody": "I haven't made this one yet but it looks similar to the recipe I was using. I recommend using a candy thermometer needs to be 310 degrees for hard crack stage. On my stove/altitude that takes about 15 min. I make it in a non-stick saucepan. After I made it a few times I recognized what it looked like when \"ready\". It's been a year so I will be using the candy thermometer again. Also best to make candy like this on a day that is not humid. Hard to find in Southeast Texas but I've made it so... I definitely recommend the candy thermometer though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Sauter",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/99690/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-21T04:15:25.357Z",
                "reviewBody": "This toffee turns out perfectly everytime! Just be careful not to over-cook it. It's so rich and buttery! I won 1st place with it at our county fair! I used sliced almonds instead of slivered and also added finely chopped almonds to the top of the chocolate. This is now my #1 toffee recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FARMCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/265506/"
                }
            }
        ]
    }
]