[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1961/side-dish/sauces-and-condiments/canning-and-preserving/jams-and-jellies/",
                    "name": "Jams and Jellies Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/38410/strawberry-jam/",
        "name": "Strawberry Jam",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F03%2F824653.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2001-07-22T18:23:42.000Z",
        "description": "This is by far the easiest recipe I have found for strawberry jam without using a pectin.  The jam is soft, spreadable and delicious.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "5 cups",
        "recipeIngredient": [
            "2 pounds fresh strawberries, hulled",
            "4 cups white sugar",
            "¼ cup lemon juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a wide bowl, crush strawberries in batches until you have 4 cups of mashed berry. In a heavy bottomed saucepan, mix together the strawberries, sugar, and lemon juice. Stir over low heat until the sugar is dissolved. Increase heat to high, and bring the mixture to a full rolling boil. Boil, stirring often, until the mixture reaches 220 degrees F (105 degrees C).  Transfer to hot sterile jars, leaving 1/4 to 1/2 inch headspace, and seal. Process in a water bath. If the jam is going to be eaten right away, don't bother with processing, and just refrigerate.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes",
            "Jams and Jellies Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Katharine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5834254143646405,
            "ratingCount": 905,
            "itemReviewed": "Strawberry Jam",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "85 calories",
            "carbohydrateContent": "21.9 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.5 g",
            "proteinContent": "0.2 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "0.2 mg",
            "sugarContent": "21.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-09-26T03:28:42.263Z",
                "reviewBody": "Just the way my grandma makes it! A little advice: you can store the jam in any jar you got but make sure that you put the glass and the lids in boiling water to get all germs off. Place them on clean kicthen toweles upside down and make sure that you don't touch the inside of jar or lid, otheriwse you'll most likley end up with mold in your jam. Once the jam is in the glass, screw the lid on and place them upside down for about ten minuts. This way the jam will stay good for months and you don't have to freeze it. \nSmall jars with a cute red&white piece of cloth around the lid make great gifts!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2507270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-30T04:15:31.187Z",
                "reviewBody": "This was my first time making jam/jelly. It was so easy to make and tastes great!!! My 9 year old son loves it. (I didn't even know where to get the jars from because it is not \"the season\" to make jam in MD yet! The craft store had the jars in stock.) \n\nHere are a few tips and/or lessons I learned...\n\n1. Use a blender or chopper and puree the strawberries until you have four cups. \n\n2. I did not have a thermometer, so I brought the mixture to a rolling boil stirring consistency for ten minutes. (All you will see is bubbles all over the bottom of the pot and foam in some areas. If you put a lid on, it will boil over your pot.)\n\n3. I did the cold plate test to see if the mixture would jell. The first time I was unsure, so I gave it five more minutes of rolling boil time, then tried the plate test again.\n\n4. When you get the jars ready, after soaking them in hot water, use tongs and silicone mitts to handle the glass jars because they will be VERY hot.\n\n5. Place the strawberry jam mixture in the hot jars and put the lid on right away and then turn it upside down.\n\n6. I waited 5 minutes and then turned them back over. This seals the jars.\n\n7. Your jam will not look like jam/jelly, more like thick syrup.  \n\n8. Wait for it to \"set\" After 48 hours you will know if you did it right.\n\n9. I got 2 and a half 16oz jars out of this recipe.\n\nI hope this helps. Check out the mason jar pics of my finished jam.\n\nEnjoy and Good Luck!\n\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Angela V.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2879307/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-02T05:23:52.077Z",
                "reviewBody": "Too sweet. The boil needs to be rolling - you cannot stir it down. It will splatter everywhere. This only set as jam after a night in the fridge. Next time I will cut the sugar - I was going to give a small jar to my grandma, but it is far too sweet. When you taste the mix just after the sugar dissolves, that is not the real sweetness. It intensifies once it's boiled so don't think it isn't sweet enough if you first taste it. I put three small plates in the freezer, put a small dob of jam on one and then replaced. After a minute I checked if I could run my finger through and had it jelled. Easy but too sweet. UPDATE : Gave it to Grandma, she loved it. :)FYI, you need 4 punnets of 250g strawberries to get 4 cups of mashed strawberries. Each result tastes a little different, so yum. I advise to follow it exactly, and it tastes a million times better than any jam from a supermarket. It's better to use the heaviest bottom huge pot you have, and start the boil slowly, move it up in quarter increments until high, this way it doesn't catch and burn. Don't be in a hurry, I burnt it when I needed it that afternoon because I was in a hurry, and brought it to the boil too fast in a thin bottomed pot. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AUSSIEMUM1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1414774/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-25T19:19:31.173Z",
                "reviewBody": "Turned out great!  Water bath is about 10-15 minutes in boiling water for those that don't know.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bill Richardson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2342631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-06T14:21:41.973Z",
                "reviewBody": "Great recipe. I have been canning for years and never made Jam without pectin. I had a dinner party last night. I had left over strawberries so I thought it would be a great idea to make the jam so each of my guest could take somthing home. I did't have pectin on hand so I thought I would give this a try. It turned out great! I read the reviews and the people that said the jam was too thin, they did not boil hard enough. Great recipe!!! I will be using it when I do my jam. Thank You!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Patricia K",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2365289/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-12T13:27:12.59Z",
                "reviewBody": "Wow - fabulous, easy recipe.  I picked 25 lbs. of strawberries yesterday and tried this recipe and a sure-jell freezer jam recipe.  Both were good, but I loved this one. One or two recommendations:  Do not use a saucepan - I started with a 3 qt pan and had to pour the jam into a large stock pot midway through cooking - when it starts to boil, it really bubbles up. It takes a long time to get from 215 degrees to 220, keep stirring so the bottom does not burn and be patient.  I also used the plate test and it worked well also.  The results are great.  I used ziploc plastic containers, and am storing what we are not eating in the freezer - it won't last long.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ginger C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1472623/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-28T19:50:53.5Z",
                "reviewBody": "I am only giving this 3 stars because I feel the instructions are lacking for those who have never made jam.\nI was left with a lot of questions and had to find the answers elsewhere.\nA lot of people said they made this with less sugar than the recipe called for and it turned out fine.\nFor me it didn't turn out at all with less amount of sugar.\nI highly suggest that if you have never made jam before to just follow the recipe as is.\nBut on a fantastic note, my overly runny jam with half the amount of sugar is the most fantastic sauce for pancakes and vanilla ice cream, yummy!!\nI am only dissapointed in the lack of insrtuctions for a newbie, otherwise it tastes great and I am happy with the flopp since there was nothing wasted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "BRIDY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873767/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-29T12:02:50.18Z",
                "reviewBody": "Great recipe!  I've never made jam before, but decided to give it a try.  I actually used frozen strawberries and it was fantastic!  I used 3 cups of sugar and actually will use less next time.  It's super sweet and super yummy!  At first it was runny, but thickened up as it cooled down.  My husband and kids love it!  No more store bought jam for us!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SARAHINNIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/962577/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T22:43:23.573Z",
                "reviewBody": "I've never made Jam before, and this was really easy!  I used Frozen Strawberries and just cooked on low with 3 1/2 cups of sugar until softened.  THEN I mashed them very easily in the pan with a pastry dough cutter.  Due to others' reviews of the consistency, I threw in 1/2 tsp of  gelatin into the still cool strawberry mix and let it sit about 5 minutes before proceeding with the boiling (I didn't have any pectin, nor do I have the slightest idea how to use it).  I should note here that I added to the cooking jam mixture the lemon rind from one of the lemons I used for juice. I did this because of its naturally high pectin level - The rind is removed before canning the jam.  I boiled on high for 25-30 minutes before the plate test passed and it came out... Perfect!  I used the upside down jar \"process\" for 10 minutes instead of the water bath and it all came out awesome :)  I even opened one of the jars the next day to test out the actual canning part.  The lid gave way suction and \"popped\" as it was twisted opened; so the canning had worked as it was suppose to.  The flavor and texture are AMAZING too :). I see no reason to purchase store bought jam, 'cause this stuff is waaaay better",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hismusicnme",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5624306/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "How to Make Strawberry Jam",
            "description": "See how to make amazing homemade tomato and hot pepper salsa.",
            "uploadDate": "2013-05-30T21:18:20.759Z",
            "duration": "PT1M54.323S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F523ab2af-ed24-4988-a57e-3b922bb96e51%2Ffcc2a0da-9320-4910-bb4c-00b84f0f1712%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2421681788001"
        }
    }
]