[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1428/soups-stews-and-chili/stews/jambalaya/",
                    "name": "Jambalaya Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/38060/oven-baked-jambalaya/",
        "name": "Oven Baked Jambalaya",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F29555.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "2001-07-10T01:01:05.000Z",
        "description": "Impress your family and friends when you serve this classic and flavorful Creole dish and best of all, it's easily made in the oven. I brought a huge roaster pan full to a neighborhood fish fry and needless to say, there were no leftovers. Follow the link for the Creole Seasoning Blend, and make your very own seasoning!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "16 servings",
        "recipeIngredient": [
            "½ cup butter",
            "1 large onion, diced",
            "1 large green bell pepper, chopped",
            "4 stalks celery, chopped",
            "4 cloves garlic, minced",
            "1 (6 ounce) can tomato paste",
            "3 leaf (blank)s bay leaves",
            "3 tablespoons Creole seasoning blend (such as the one linked in the footnote)",
            "4 teaspoons Worcestershire sauce",
            "2 (28 ounce) cans whole peeled tomatoes",
            "7 cups chicken stock",
            "3 cups chopped cooked ham",
            "3 cups cooked andouille sausage, sliced",
            "3 cups cooked chicken, cut into bite-sized pieces",
            "3 cups frozen cooked shrimp",
            "4 cups uncooked long-grain white rice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in large stock pot. Saute onion, green pepper, celery and garlic until tender, being careful not to burn the garlic. Add tomato paste and cook to brown slightly, stirring constantly. Stir in bay leaves, Creole seasoning blend and Worcestershire sauce. Pour into a large roasting pan. Squeeze tomatoes to break up into pieces, and add to mixture in pan. Stir in juice from tomatoes, chicken stock, ham, sausage, chicken, shrimp and rice. Mix well. Cover tightly with aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven for 1 1/2 hours, stirring once halfway through baking time. Remove bay leaves before serving.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Jambalaya Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JOSLYN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.534562211981567,
            "ratingCount": 434,
            "itemReviewed": "Oven Baked Jambalaya",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "541.1 calories",
            "carbohydrateContent": "47.6 g",
            "cholesterolContent": "124.7 mg",
            "fatContent": "25.8 g",
            "fiberContent": "2.6 g",
            "proteinContent": "28.5 g",
            "saturatedFatContent": "10.1 g",
            "servingSize": null,
            "sodiumContent": "1857.9 mg",
            "sugarContent": "5.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-11-05T07:36:08.053Z",
                "reviewBody": "Greetings all! :-) Thank you for trying my recipe, and for your reviews. Some have commented on the rice being under cooked, or mushy, and I'd like to address that issue. When I say stir half way through, please be sure to stir completely, from the bottom up and all around the sides. Oven temperatures very dramatically and not everyone has the same type of cookware. For my old oven, and the very large enameled roaster pan I use, the rice did cook correctly. I recently purchased a new gas stove and nothing cooks the same (wish I had my old stove back...LOL). It now takes 1 3/4 to 2 hours in my new oven. With this in mind, I suggest checking the rice more often during the baking time, or adjusting the cooking time and/or temperature to suit your oven and cookware. If you cut the recipe amounts by half, please remember to adjust the cooking time too. While cooking, the rice will absorb some of the spices; therefore the finished dish will not taste as spicy as it does before cooking. The amount of spices listed is for those with average tolerance for spice. Feel free to use more, or less, to suit your taste. Traditionally Jambalaya has more of a porridge consistency; therefore the rice will absorb most of the juices. If you prefer fluffy rice, surely you can cook the rice separately. If you like a soupy consistency, you can use less rice. This recipe can also be prepared in a large stockpot, on the stove top, if you prefer. I find it scorches easier though, so watch it closely.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSLYN H.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/721195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-28T16:52:22.733Z",
                "reviewBody": "PLEASE READ REVIEW BEFORE PREPARING THIS DISH!!!!!\r\nThis is a first for me all across the board. The first recipe I prepared from Allrecipes.com.  The first time I made any type of Creole dish. The first time I joined Allrecipe.com and my first review,(note I joined just to do the review for this dish!!!).  Okay most reviews praise this dish a few say mush, so I was a little leary upon preparing this item.  I gave a taste to one of my guest who is from a small town near New Orleans.  He said excellent - the only thing the rice wasn't cook all the way & to take the tails of the shrimp but said it was the best.  This is a dish that I would advise that you prepare a day before so that the uncooked rice will balance and the flavor will develope.  Also the recipe was vauge regarding the juice of the whole tomatoes.  I decided not to add the juice which paid off with it being more \"ricey\" versus \"tomatoey\".  During the over baking when I stired up the mix I added more creole seasoning(about a tbl spoon), tabasco, fila powder and a 1/4 cup of butter (basically three spats equal to a 1/4 a cup).  In doing so this became the dish of the evening - I never had so many people ask for my recipe. If you can buy a creole season blend - DO IT to make the season mix unless you already have most of the spices it will cost you a FORTUNE!!! In closing, this dish was well worth doing.  1000 praises for a dish well done.  Thank you Joslyn H.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "whendovescry2000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1503083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-18T22:24:53.81Z",
                "reviewBody": "I have never even eaten jambalaya before but my husband loves it so I gave this a try. YUM! Oh my goodness this is good. If you're wondering just how big a pan you need I halved the recipe because it's just the two of us and it just BARELY fit in a 9X13 baking pan. I also used your recipe for the creole seasonings instead of buying ready-made seasonings and they were wonderful as well. My husband was ecstatic that I was able to make this for him. I used little beef smokies for the sausage as another reviewer suggested. Also I didn't have the stock so I just used chicken broth instead and it worked just fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dagny21",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675719/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-07T13:04:30.45Z",
                "reviewBody": "This was good.  I just threw everything into the slow cooker except the rice, let it cook for a couple of hours, added the rice and cooked until the rice was done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Wilemon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/536781/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-13T03:50:30.64Z",
                "reviewBody": "Oh yes!  I've never made Jambalaya before but I will be making it now.  I read a couple of Jambalaya recipes on this site but chose this one because it cooked in the oven once the prep work was done.  This dish was so rich...and satisfying! Scaled the recipe by half, had plenty for dinner, 4 lunches, and some in the freezer.  Read all the reviews and changed a few things based on the experience and sharing of others.  1.  I cooked my rice separately glad I did because the broth was so good.  I do think 2 cups of uncooked rice is too much to cook in the dish based on the broth I ended up with.  2.  Added one bay leaf.  3. Added one king crab leg from Costco.  4.  I did make the seasoning blend and it was great.  Only made 1/2 and still have plenty left over for other dishes.  5.  I put my chicken thighs in raw and it worked like a champ.  I did remove the skin and bones after they cooked.  6.  Used ½ butter and olive oil for the sautéing of the veggies.  7.  I added raw shrimp along with their \"broth\" during the last 15 minutes of cooking so they would be tender.  8. I think the most important thing was that I sautéed the tomato paste for a while.  It must act as a roux.  The only thing I may do differently next time is to sauté the sausage to render some of the fat.  Mine was slightly greasy and I to de-fat, however it was tasty fat.  Great recipe Joslyn H. and thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1321558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-26T02:58:13.287Z",
                "reviewBody": "OUTSTANDING!!!! Easy and delicious. I cut the recipe in half and fed my family of 5 with enough leftover for lunch for my husband and myself.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LAURA4288",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/624974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-05T22:11:14.877Z",
                "reviewBody": "Yumm I made this last year... had to come back and find it again because I lost the recipe that I had printed. I made this recipe as is. Yes it serves alot of people. The recipe states 16 servings. People keep altering the recipe and complaining of a bad outcome... why is that? Some of the reviews of recipes on this site are frustrating for me due to all the changes being made. A true review should be when the recipe is made as is. OK off my soap box This recipe is easy and very very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bren0825",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4526190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-05T15:19:26.967Z",
                "reviewBody": "Great Dish for a CROWD! This makes a huge roaster pan full of Jambalaya. Your guest will not be disapointed at all! Very easy to make and it cooks in the oven for less of a hassel.  I will be doing this again for every potluck and family event I attend.  Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FERBONIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/451835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-29T17:49:21.257Z",
                "reviewBody": "This was great my husband loved it. It took a little longer to cook. Next time I will cut down on the rice and cook it separately to add to individual bowls. With the rice cooked in it was not good as leftovers the rice soaked up all the juices. Otherwise it was great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GABESGIRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/879737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-17T17:11:47.823Z",
                "reviewBody": "This recipe has a great taste but is incredibly hard to cook. If you make this recipe exactly as indicated it takes at least 2 times the amount of the time indicated by the recipe. The recipe also takes at least 1.5 hours to even prepare. Don't think that I'll make this recipe again just because it's wayyyyyyyy too time consuming and its very hard to make it turn out right especially if you would be an experienced cook.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "KLAVIGNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4738815/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Oven Baked Jambalaya",
            "description": "It’s so easy to bake the Creole classic!",
            "uploadDate": "2017-01-12T21:01:38.893Z",
            "duration": "PT1M3.2720000000000002S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F6b8aa291-6d17-4d4c-a913-ac0241153ec2%2F9f3dbf94-b903-4ee7-9596-2c0a9c66c275%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5279958783001"
        }
    }
]