[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/43051/plain-cake-doughnuts/",
        "name": "Plain Cake Doughnuts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3390842.jpg",
            "width": 3456,
            "height": 3456
        },
        "datePublished": "2001-11-13T12:21:14.000Z",
        "description": "A simple cake doughnut lightly spiced with cinnamon and nutmeg. Coat with cinnamon-sugar, or a confectioners' sugar glaze.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "12 doughnuts",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "½ cup white sugar",
            "1 teaspoon salt",
            "1 tablespoon baking powder",
            "¼ teaspoon ground cinnamon",
            "1 dash ground nutmeg",
            "2 tablespoons melted butter",
            "½ cup milk",
            "1 egg, beaten",
            "1 quart oil for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oil in deep-fryer to 375 degrees F (190 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, sift together flour, sugar, salt, baking powder, cinnamon and nutmeg. Mix in butter until crumbly. Stir in milk and egg until smooth. Knead lightly, then turn out onto a lightly floured surface. Roll or pat to 1/4 inch thickness. Cut with a doughnut cutter, or use two round biscuit cutters of different sizes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Carefully drop doughnuts into hot oil, a few at a time. Do not overcrowd pan or oil may overflow. Fry, turning once, for 3 minutes or until golden. Drain on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Jennifer Long"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.387029288702929,
            "ratingCount": 478,
            "itemReviewed": "Plain Cake Doughnuts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "201.9 calories",
            "carbohydrateContent": "25 g",
            "cholesterolContent": "21.4 mg",
            "fatContent": "10.1 g",
            "fiberContent": "0.6 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "2.5 g",
            "servingSize": null,
            "sodiumContent": "301.8 mg",
            "sugarContent": "8.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-06T19:46:32.36Z",
                "reviewBody": "OK, I had to just laugh at some of the reviews I read.....  All those complaints about heaviness and density!  Helloooooo???  These are not your Krispy Kreme yeast-raised doughnuts!  They are traditional CAKE doughnuts.  They are MEANT to be a dense and heavy type of doughnut!  I read up on the reviews, heeded some advice and began with a little extra flour in my dough.  The time listed from start to end for this recipe was 25 minutes, and it was RIGHT ON!  I whipped these up, rolled them out, cut and fried.  My daughter rolled in sugar/cinnamon...and my family of five wolfed them down!  No problems here!  Nice recipe.  Simple and easy dough product.  Fun and delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ginny Maziarka",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1391210/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-10T21:53:40.317Z",
                "reviewBody": "I used to work at a bakery and made all of the doughnuts there. These are pretty good, but need more cinnamon and nutmeg. I also needed to add more flour to successfully roll these out, but don't add any more than what you need to be able to roll them out without making a huge mess. The oil temperature is super important for cooking these just right.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "jef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2307852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-10T20:05:13.56Z",
                "reviewBody": "These doughnuts are SO EASY to make.  I have never made doughnuts before, but they turned out wonderful ~ Crispy outside, soft moist inside!  They were great just plain without the cinnamon-sugar on them, but were excellent when that was added!  A new breakfast treat for my boys!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KathyLP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/272380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-03T18:13:41.263Z",
                "reviewBody": "Well, after reading some of the reviews, I can't seem to figure this out.  I added a little extra cinnamon and nutmeg, and instead of making rolled donuts, a used a 1oz scoop and made \"donut holes\".  They were light and flavorfull, and were enjoyed by all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CAPECHEF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1149105/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-06T01:00:07Z",
                "reviewBody": "This recipe was exactly what I wanted. The dough is sticky and very soft . If you aren't experienced with pastry dough it would be hard to work with. There needs to be more of en explanation in the recipe, so I have to subtract a star from an otherwise perfect recipe, if I could subtract only one half of a star I would.  Let me tell you how to make this into perfect doughnuts.   Once the dough is mixed, chill it for just 15 minuets more or less. using a rubber spatula scrape it out & off the bowl onto a HEAVILY flour dusted counter top, and then also heavily dust the top of the dough with the flour. Now roll it flat & about 3/4 of an inch thick and cut as  directed now it will be easy to remove perfect doughnut shapes from the counter to the pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lazerclaire",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3973312/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-12T16:17:09.077Z",
                "reviewBody": "This was a great easy recipe.  I had everything on hand and mixed up the batter the night before and shaped them so they were ready to be cooked right away in the morning!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PEPELEPEW11",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/545892/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-14T01:41:11.6Z",
                "reviewBody": "I always wanted to make doughnuts, and this was my first attempt.  I used this recipe because it required only basic ingredients.  In fact, I ommitted the nutmeg and cinammon, so the ingredients were few and basic, but the cooking process was not.  \r\n\r\nI scaled the recipe for four servings, and instead of adding 1/3 of an egg, I added a whole egg, thinking it would make the doughnuts richer.  The dough came out extremely sticky and goooey, and it was impossible to roll out.  Half the dough was wasted on my hands, the board, and the roller.  I tried to fry whatever chunks of dough I could, only to have the dough become burnt black in a matter of seconds, causing smoke to fill my apartment.  I boldly bit into one, only to find that the inside was still soft and raw.  I threw away everything: the remaining dough, and the black, grossly shaped chunks.  I went to sleep, vowing to get the recipe right the next morning.\r\n\r\nThis morning I remade the doughnuts, but took several precautions:\r\n\r\n1)I followed the recipe EXACTLY, so that the dough would not become too sticky.\r\n\r\n2)I used flour liberally on the board where I placed the dough, and put flowers on my hands, and on the roller, to prevent the dough from sticking everywhere.\r\n\r\n3)I flattened the dough to exactly 1/4 of an inch, using a ruler to measure the thickness.  This was to make sure that the doughnut would be cooked completely before the outside burned.\r\n\r\n4)I put in a small piece of dough as I heated the oil.  When numer",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SHINYAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/874176/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-26T06:55:27.88Z",
                "reviewBody": "This was my first attempt at making donuts and they turned out perfectly! My first \"experimental\" batch turned black because I had heated the oil on high, but after lowering the temperature, they were golden brown and perfectly crispy with a creamy moist interior. I took a tip from Giada Delaurentis from the food channel and put some cinammon and sugar in a small brown bag and the tossed in the freshly cooked donuts. I simply shook the bag to coat and they turned out fabulous!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Larma",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2282605/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-01T03:03:05.677Z",
                "reviewBody": "OH MY! These were amazing. I added a few more shakes of cinnamon and nutmeg to spice it up a bit. Eat these hot from the pan with a swig of apple cider in between each bite. Nothing says \"Harvest\" better than cider and doughnuts! I will definitely be making this again. IF you should happen to have any leftovers they are not so great cold. You will want to heat them up again in your toaster oven. Thanks Jennifer; I've been looking for an easy TASTY doughnut recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin-Andy Harder Oliver",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/645881/"
                }
            }
        ]
    }
]