[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/46595/amazing-whole-wheat-pizza-crust/",
        "name": "Amazing Whole Wheat Pizza Crust",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F72917.jpg",
            "width": 2048,
            "height": 1366
        },
        "datePublished": "2002-01-31T23:15:21.000Z",
        "description": "A healthy whole wheat crust that comes out soft and chewy on the inside and crisp on the  outside. Use with your favorite pizza toppings or pizza recipes.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H45M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 teaspoon white sugar",
            "1 ½ cups warm water (110 degrees F/45 degrees C)",
            "1 tablespoon active dry yeast",
            "1 tablespoon olive oil",
            "1 teaspoon salt",
            "2 cups whole wheat flour",
            "1 ½ cups all-purpose flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, dissolve sugar in warm water. Sprinkle yeast over the top, and let stand for about 10 minutes, until foamy.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir the olive oil and salt into the yeast mixture, then mix in the whole wheat flour and 1 cup of the all-purpose flour until dough starts to come together. Tip dough out onto a surface floured with the remaining all-purpose flour, and knead until all of the flour has been absorbed, and the ball of dough becomes smooth, about 10 minutes. Place dough in an oiled bowl, and turn to coat the surface. Cover loosely with a towel, and let stand in a warm place until doubled in size, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When the dough is doubled, tip the dough out onto a lightly floured surface, and divide into 2 pieces for 2 thin crust, or leave whole to make one thick crust. Form into a tight ball. Let rise for about 45 minutes, until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 425 degrees F (220 degrees C). Roll a ball of dough with a rolling pin until it will not stretch any further. Then, drape it over both of your fists, and gently pull the edges outward, while rotating the crust. When the circle has reached the desired size, place on a well oiled pizza pan. Top pizza with your favorite toppings, such as sauce, cheese, meats, or vegetables.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 16 to 20 minutes (depending on thickness) in the preheated oven, until the crust is crisp and golden at the edges, and cheese is melted on the top.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Allrecipes Member"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.611313868613139,
            "ratingCount": 1096,
            "itemReviewed": "Amazing Whole Wheat Pizza Crust",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "166.7 calories",
            "carbohydrateContent": "32.6 g",
            "cholesterolContent": null,
            "fatContent": "2 g",
            "fiberContent": "3.7 g",
            "proteinContent": "5.7 g",
            "saturatedFatContent": "0.3 g",
            "servingSize": null,
            "sodiumContent": "235.8 mg",
            "sugarContent": "0.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-04-26T00:25:55.767Z",
                "reviewBody": "Incredible! I modified the recipe a little using only whole wheat flour (3 1/4 cups) and substituted honey for the sugar. I an extra teaspoon of salt and added 1 t. italian seasoning to the dough for added flavor. I put the ingredients in the bread machine on the dough setting and let it do the work for me!! I precooked the crust for 5 min at 500 degrees and then added the ingredients and cooked it for an additional 14 minutes at 425. Pizza came out PERFECT! even those at the table who were skeptical of whole wheat crust RAVED about this recipe. we will be making this one again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sjwRN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1498212/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-17T19:20:43.233Z",
                "reviewBody": "Absolutely delicious!  I tweaked it just a bit.  \nSince I'm doing South Beach, I used 3-1/4 c of whole wheat flour and no white flour.  I also added 1 tbl of basil and 1/2 tbl of oregano to the mix.  I used the dough cycle on my bread machine.  \nI baked the crust at 500 degrees for 4 minutes and then put the ingredients on and baked it for an additional 6 minutes at 425 degrees.  \nIt came out crispy on the outside and chewy inside.  What a great recipe and so easy when you use a bread machine!  \nSince I had plenty of dough left over, I used it to make some breadsticks. I baked them for 3 minutes at 450 degrees, took them out of the oven and brushed them with melted Smart Balance spread, sprinkled a mixture of parmesan cheese and Kosher salt on the top, and baked them for an additional 4 minutes.  We dipped them in the leftover pizza sauce.  \nSo good!  And since I didn't have to feel guilty eating pizza since I'm on South Beach, they were even better.  I will definitely be making this recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristin",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/353281/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-31T08:13:18.53Z",
                "reviewBody": "OK, so I read all the reviews, and decided to tweak the recipe taking pages from a few of the reviewers.  I used all whole wheat flour (3 1/4c) because I'm doing the South Beach diet.  I also added 2tbs of Italian Seasoning to the flour mixture, and put everything in my bread machine, using the \"whole wheat dough\" cycle.  I then prebaked the crusts at 500 for 6 minutes, added the toppings and continued baking at 425 for another 6-7 minutes.  I was AMAZED at 1.) how much dough there was.  Easily enough for 2 thick crusts or 3 thin crusts, and 2.) how much it tastes like regular pizza crust.  My husband even said he couldn't tell the difference!\r\n\r\nI would recommend this to anyone for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TENENIEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/198365/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-21T18:00:26.92Z",
                "reviewBody": "It tastes good but it is not whole wheat unless you use all whole wheat flour.  This recipe should be called \"Wheat Pizza Crust\" \nI try to eat only whole grains and want people to know this distinction.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "nourishyrsoul",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2819782/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-09T21:02:36.4Z",
                "reviewBody": "Excellent!  i did what others did and used only whole wheat flour - I used 3-1/4 c.  It turned out wonderful.  I meant to add some other spices, but forgot - it still was fabulous.  I made 1 thick crust pizza...baked the crust alone for 5 min at 500 degrees, then added the sauce and toppings and cooked for almost 15 min. at 425 degrees.  My husband who usually doesn't like my cooking - and doesn't like pizza loved it.  So did my boys (5 & 2yrs)  This was a big hit!  Will make again many times.  I made it with a 1/2 a jar of alfredo sauce for the sauce and topped with chicken, onions and garlic sauteed in olive oil.  Topped with part skim mozzarella.  EXCELLENT!!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SLPARISH2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/515867/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-05-02T04:34:36.703Z",
                "reviewBody": "Excellent recipe... I used 2 T of honey instead of the 1 tsp of sugar for the yeast. Made 2 thin crust pizza's but next time i will divide the crust into 3 portions for a more thinner crust. Used Organic stone ground w/w flour and organic extra virgin first cold press olive oil. I did use non stick pizza sheets and did not oil the pans and they were fine. Next time shall add some seasonings to the crust just for a change. for toppings I used fresh mushrooms tomatoes red pepper pizza sauce broccoli 'dust' (leftover brocolli floret crumbs from home made frozen brocolli fresh baby spinach part skim mozzarella and grated parmesan cheeses. Very yummy 2 of us ate 2/3rds of one pizza.:) will definitely make again soon may even add some ground flax or toasted wheat germ for added healthyness:) Instructions were very easy to follow and enjoyed the work out from the kneading;) Thank you!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DESIDERATAGRACEFULLY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1058596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-04T05:38:30.733Z",
                "reviewBody": "I was very happy with this recipe!!  I have had trouble using yeast in the past.  Well, the directions in this recipe were totally clear and easy to follow.  I had no trouble and the results were fantastic!  I threw a bunch of dried herbs into the flour mixture for flavor.  This rose very well and made two pizzas.  Just like the description says: soft and chewy in the middle and crisp on the outside.  The bottom and middle were fully cooked too (I've had trouble with doughy-ness in the past...)  I pre-baked at 500 degrees for 5 minutes (without any sauce or toppings).  Then I put on sauce, cheese, a little bit of pepperoni and lots of veggies and baked at 435.  The yummiest pizza ever!  This will be my standard pizza dough recipe from now on.**** Have made this countless times since first reviewing it, and it gets better and better!  Tonight I divided the dough into 4 smaller pizzas, which was great.  I was able to do different toppings on each one to please each member of the fam.  On mine I put gorgonzola cheese and fresh tomatoes, it was soooo delicious!  They baked up really nice too.  I think I will do it this way from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Ramey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689448/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-26T17:03:54.43Z",
                "reviewBody": "Very good recipe. Some suggestions: Use a pizza stone and bake at a higher temperature (500 or higher if you have a good oven). Also you can use all whole wheat flour but you onlyl need about 3 cups.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DCOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1139847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-24T16:19:43.2Z",
                "reviewBody": "I use all whole wheat flour with 3 tbs of gluten and it is wonderful. Bake slightly before adding toppings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BWILKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1211902/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Amazing Whole Wheat Pizza Crust",
            "description": "See how to make a healthy and delicious pizza crust.",
            "uploadDate": "2012-07-17T18:45:54.217Z",
            "duration": "PT4M43.366S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F25f56fbe-79ce-48e8-ad0c-a10dac1740cb%2F7c5988aa-b254-448e-8288-9fcff96e487d%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1739861278001"
        }
    }
]