[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/151/breakfast-and-brunch/pancakes/",
                    "name": "Pancake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/52581/easy-swedish-pancakes/",
        "name": "Easy Swedish Pancakes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3500474.jpg",
            "width": 1659,
            "height": 1658
        },
        "datePublished": "2002-07-27T21:17:38.000Z",
        "description": "This recipe is so delicious and easy to make.  I come from a really Swedish town - Rockford, Illinois - where Swedish pancakes are a favorite for Sunday morning breakfast.  My Dad used to make these for us at home for a special treat. Serve with butter and maple syrup, or lingonberries if you've got them.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4  large eggs eggs",
            "2 cups milk",
            "½ cup all-purpose flour",
            "1 tablespoon sugar",
            "1 pinch salt",
            "2 tablespoons melted butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, beat eggs with a wire whisk. Mix in milk, flour, sugar, salt, and melted butter.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat a non-stick electric skillet to medium heat. Pour a thin layer of batter on skillet, and spread to edges. Cook until top surface appears dry. Cut into 2 or 4 sections, and flip with a spatula. Cook for another 2 minutes, or until golden brown. Roll each pancake up, and serve.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Pancake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "KARI HALL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.156363636363636,
            "ratingCount": 275,
            "itemReviewed": "Easy Swedish Pancakes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "252.4 calories",
            "carbohydrateContent": "21.1 g",
            "cholesterolContent": "211 mg",
            "fatContent": "13.3 g",
            "fiberContent": "0.4 g",
            "proteinContent": "12 g",
            "saturatedFatContent": "6.8 g",
            "servingSize": null,
            "sodiumContent": "161.2 mg",
            "sugarContent": "9.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-04-10T14:26:54.253Z",
                "reviewBody": "Don't really know why I tried this recipe since I am born and raised in sweden and should know my \"pannkakor\" but I did and it's not quite right. I really like my recipe better wich is basically changing the flour to 1 cup and take away an egg or two depending on size. I also usually substitute 1/3 of the flour to whole wheat flour. We also usually eat our pancakes with strawberry jam or other kind of jam. I make them in a 10 inch pan with low edges with a long spatula I bought at IKEA. Just use your wrist to turn the pan to spread the batter out. If it gets stuck just use som butter on the pan. This recipe can also be used as an oven pancake if you add some fried bacon pieces in an 9x13 bakingpan and bake in the oven at 450 for 25-30 min and serve with lingonberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2623964/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-12T01:17:54.983Z",
                "reviewBody": "To the skeptics--no need for extra flour, it is really supposed to be that thin!  I grew up eating Swedish Pancakes and this recipe is very good.  I think the recipe my great-grandmother brought from Sweden was something like: a bunch of eggs, then flour until it's thick, then milk until it's thin.  Not being the greatest cook, I need a more detailed recipe to follow.  This one definitely works.  \r\nA helpful hint I learned from watching my mother make them: use a medium sized frying pan, when it's hot, hold it in your hand, pour a small amount of batter into the middle of the pan then use your wrist to turn the pan and swirl the batter around to make an even layer in the pan.  You don't need to use much batter--these pancakes are supposed to be very thin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dulce",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1517615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-31T00:42:23.09Z",
                "reviewBody": "Ever since I first visited Rockford when I was five, I have loved the swedish pancakes we would get at the Stolkholm Inn. My first effort at making them was with this recipe (because it mentioned Rockford, so I hoped it would be great), and I would have to say, these are close. I followed the recipe exactly and they turned out very yummy and how I remember them to be.  Still looking for the secret ingredient to make them as magical as the Stockholm Inn's.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUTTABETH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/749978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-05T17:15:11.953Z",
                "reviewBody": "I tried the recipe using skim milk and real butter sifted the flour before measuring and measured the butter after melting it. I used a preheated nonstick pan. I expected the batter to be runny having made crepes many times over the years. My only concern was the butter that then congealed a bit in the metal bowl so I gently heated it on a burner and stirred with a wisk. You have to be patient with this recipe and not try to mess with the edges of the pancake until they begin to pull away from the pan or until the very edge begins to brown a bit. I had my pan on a bit high so they didn't quite look like the IHOP ones I love but they tasted awesome! I was able to work a silicone spatula under them to the middle and flip them without cutting. When done I folded them in quarter and put them on a plate in a 170 degree oven until I got all of them made. I sprinkled them with powdered sugar and heated apricot jam. Do I plan on keeping this recipe? Heck yes! I'm going to try it next time with vanilla or maybe try the OJ suggestion too for a change. However the recipe is really great as is. The right tools will help keep the frustration at a minimum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Megan P",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2304116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-19T22:14:32.14Z",
                "reviewBody": "If you've got a temp gauge on your griddle it should be about 380. That makes them cook a little faster but any pancake recipe is going to have you standing over the griddle for a while. Try a fun way my dad used to feed us all at once we had a square pan he'd fill it and cut and make square pncakes. He could make enough to eat for him me and my two brothers until the next batch was ready.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leetah2Hope",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1332306/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-10T02:37:53.857Z",
                "reviewBody": "Excellent recipe. I did add 1 tsp. of vanilla I couldn't help myself. I love these light thin pancakes. I whisk before I pour the batter each time. This little bit of extra attention helps in keeping the batter consistent from first to last. Delicious!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mysticcher",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1299669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-10T14:02:44.033Z",
                "reviewBody": "being born and raised in Rockford and being Swedish I can definately say this recipe is pretty darn close to the famous swedish pancakes you would get here in Rockford...definately try this recipe. Lingonberries & powdered sugar- maybe a little patty sausage ... at nui flika  !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KristynRae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2333862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-10T18:23:50.467Z",
                "reviewBody": "Good recipe! good alternative for carb counters. Good for savory pancakes too; roll pancakes filled with grated colby cheese and finely chopped onions and bake 350 for 10-15 min. Serve with either fresh salsa or sausage gravy - delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kentvee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/341868/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-05T21:38:34.56Z",
                "reviewBody": "I've never made Swedish pancakes before or eaten them before but I thought these were very good. After I made a few I got the hang of it. I think they just need to cook longer than you'd expect for something so thin. They didn't seem to burn easily so I left them cook on the first side until they were very easy to turn. I'll probably make these again soon because they are a nice change from regular pancakes. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "L.B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1669806/"
                }
            }
        ]
    }
]