[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/172/soups-stews-and-chili/soup/cream-soups/",
                    "name": "Cream Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/55451/butternut-squash-bisque/",
        "name": "Butternut Squash Bisque",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F138387.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2002-10-30T16:45:45.000Z",
        "description": "Great use for all that early fall vegetable! Nice start for a fall day dinner or lunch.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H0M",
        "recipeYield": "4 Servings",
        "recipeIngredient": [
            "1 tablespoon canola oil",
            "1 tablespoon unsalted butter",
            "½ cup diced onion",
            "¾ cup diced carrots",
            "4 cups peeled and cubed butternut squash",
            "3 cups vegetable stock",
            "salt and ground black pepper to taste",
            "ground nutmeg to taste",
            "½ cup heavy cream"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil and melt the butter in a large pot over medium heat. Cook and stir the onion in the butter and oil under tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the carrots and squash into the pot. Pour in vegetable stock, and season with salt, pepper, and nutmeg. Bring to a boil, reduce heat, and simmer until vegetables are tender.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a blender or food processor, puree the soup mixture until smooth. Return to the pot, and stir in the heavy cream. Heat through, but do not boil. Serve warm with a dash of nutmeg.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Cream Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PHONELADY55"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.625,
            "ratingCount": 920,
            "itemReviewed": "Butternut Squash Bisque",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "247.8 calories",
            "carbohydrateContent": "21.8 g",
            "cholesterolContent": "48.4 mg",
            "fatContent": "18.2 g",
            "fiberContent": "3.9 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "9.1 g",
            "servingSize": null,
            "sodiumContent": "820.1 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-01-26T20:40:52.407Z",
                "reviewBody": "First:  Definately roast squash first as others have recommended: slice in half, scoup out seeds, place in pan sliced side down in a little water at 375 for about 35 minutes or until done. (or just poke a few holes and bake whole!)  Then you can just use a spoon to scoop out the soft cooked flesh.  Second:  Use the best vegetable broth you can buy.  It makes the soup.  Mine actually tasted better BEFORE I added the 1/2 cup of light cream.  Next time I'd probably leave it out or add less and use half and half.  Third:  Go easy with the nutmeg.  It is powerful stuff and not everyone likes it.  Can easily be added a tiny sprinkle at a time at the very end to individual bowls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suchi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1697196/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-17T14:34:50.02Z",
                "reviewBody": "I loved this & it was such a beautiful soup! (I only gave 4 stars because I think the recipe would have been semi-bland as written) I did roast my squash & then scooped out the insides...much easier than trying to peel it. I could hardly get it cut in half (with a  very sharp knife)...can't imagine trying to peel it.  I added half a golden delicious apple (pelled, cored & sliced) when I added the carrots & wish I had added the other half. I didn't add the squash until the carrots were done since it was alreday cooked. I also added a huge clove of minced garlic (threw it in when the onion was almost done). I used one cup of chicken broth I had in teh fridge & two cups of vegetable broth & I added a bay leaf as well as some cayenne. It added great flavor but I went a little heavy on the cayenne...it was just a bit too spicy. Used an immersion blender to puree (love that thing!) & I did add the cream, pulling it off the heat as soon as it was added, to keep the cream from separating.  I garnished w/ two long sprigs of chives crossed over each other w/ a small dollop of organic yogurt where they intersect. Grated fresh nutmeg over all...it was really, really beautiful. Debated as to whether I should top the dollop of yogurt w/ some of the squash seeds I roasted but decided against it because I didn't want to interfere w/ the smooth texture of the soup. Thansk  for a wonderful, seasonal soup PHONELADY55...we enjoyed it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "IMVINTAGE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1379521/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-01T14:07:54.357Z",
                "reviewBody": "OHMIGOSH! If I could give this 10 stars I would! This was absolutely amazing soup! Since peeling this squash is difficult, I followed another reviewer's idea and sliced the squash lengthwise, scooped out the seeds, turned face down in a baking dish, covered with 1 inch of water, covered dish with foil and baked in a 375 degree oven for 30-45 minutes. This made getting to the squash much easier than trying to peel and cube it! For the stock I used 3 cups of frozen juices I'd been saving up from leftover roasts and such. I'm not sure if this is what gave the soup such an incredible taste, but it was simply fabulous! I did use heavy cream and I would recommend this to everyone because tasting the soup before adding it and after, the cream just gave it the special extra touch it needed! I used an immersion blender to blend all the ingredients rather than trying to transfer to a blender. I highly recommend this soup! I don't typically get so excited over soup - but this was awesome!    PS: I had a small patty pan squash I also threw in there!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MONARCH38",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1047736/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-27T17:45:06.867Z",
                "reviewBody": "Why turn on the oven when a microwave will do it in 1/3 the time? I cook butternut squash (and others) by cutting them in half scooping out the seeds laying the halves on a flat platter covering with plastic wrap and microwaving for 10 minutes or so. Test doneness with a fork or you will see the shell start to collapse. Simply scoop squash out of the shell and use as you wish. Also if I want to cook squash cut up I use my heaviest knife to bully through it then the pieces are easy to peel with a large paring knife. Long live butternut squash!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ajwilliams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2357874/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-07T06:07:14.923Z",
                "reviewBody": "Fantastic soup. I'm not so good with measuring things in cups, so this is what I used: 2 butternut squash, cooked then peeled and cubed. 1/2 white onion. 3 carrots. 1 can chicken, 1 can veggie broth. 2/3 cup of half and half instead of cream. Lots of nutmeg, salt and cracked pepper. My additions to the recipe: 1 teaspoon minced garlic. 2 small peeled and chopped green apples (a good tart variety) and a splash of orange juice while cooking, about 1/4 cup of all natural, unsweetened juice - these add a brightness to the flavor, otherwise it could be a bit heavy and flat tasting. I also added a good teaspoon or two of ground cayenne. Will make over and over!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Yasi",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/841677/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-21T14:18:47.28Z",
                "reviewBody": "You may want to roast the squash first (used 1 medium butternut squash) by slicing into quarters and baking at 350 degrees for about and hour (without adding water to pan--keeps flavor better). I skipped the butter, and tried using a tablespoon of cream cheese to thicken soup since I didn't have heavy cream and wanted to keep it healthy. And if you don't like onions, DO NOT WORRY--you will not be able to taste them! Such a simple recipe! Highly recommended.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JESSIE6381",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1143816/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-14T04:03:29.367Z",
                "reviewBody": "In spite of the fact that I added fresh garlic and a dose of white wine, this was flat and basically tasteless. It might be a good start or base for additional seasonings--maybe cumin, curry or herbs?  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-13T03:14:27.423Z",
                "reviewBody": "I didn't feel like peeling and cubing my squash so I halved it and roasted the halves face down on a baking sheet with a shallow layer of water, and covered it with tinfoil at 375F for 40 minutes.\nThis made the recipe INCREDIBLY easy to prepare, put together, and cook.\nTasty and filling! A family pleaser\n\n***ALSO, I found that 1 cooked squash = 5 cups***",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kady-June",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2532997/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-22T16:50:11.67Z",
                "reviewBody": "This was very tasty!  I added half of  a golden delicious apple and used fat free half and half instead of heavy cream.  I used an immersion blender to puree the soup and that saved me from having to puree it in batches in my food processor.  Peeling and cubing the butternut squash was more time-intensive than I realized.  Next time I will probably roast the squash in the oven while I chop, saute, and simmer the other vegetables.  Then I can just scoop it out easily and add it to the pot after the carrots and onion are tender.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sally Bray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1606993/"
                }
            }
        ]
    }
]