[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/56059/asian-coconut-rice/",
        "name": "Asian Coconut Rice",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F08%2F438992-Asian-Coconut-Rice-Photo-by-abbaplez-resize.png",
            "width": 650,
            "height": 465,
            "caption": "Photo by abbaplez"
        },
        "datePublished": "2002-11-14T06:28:15.000Z",
        "description": "I tried so many different ways to duplicate my favorite restaurant's coconut rice after they went out of business. This one is perfect! Garnish with toasted coconut and chopped cilantro if you like.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 (14 ounce) can coconut milk",
            "1 ¼ cups water",
            "1 teaspoon sugar",
            "1 pinch salt",
            "1 ½ cups uncooked jasmine rice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a saucepan, combine coconut milk, water, sugar, and salt. Stir until sugar is dissolved. Stir in rice. Bring to a boil over medium heat. Cover, reduce heat, and simmer 18 to 20 minutes, until rice is tender.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SILVREZS"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.371202113606341,
            "ratingCount": 757,
            "itemReviewed": "Asian Coconut Rice",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "453.1 calories",
            "carbohydrateContent": "61.4 g",
            "cholesterolContent": null,
            "fatContent": "20.9 g",
            "fiberContent": "1.9 g",
            "proteinContent": "6.8 g",
            "saturatedFatContent": "18.5 g",
            "servingSize": null,
            "sodiumContent": "53.7 mg",
            "sugarContent": "1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-10-28T13:01:53.07Z",
                "reviewBody": "HELPFUL TIPS NOT MENTIONED: Being Asian, cooking rice is a skill I guess you're born with because I totally don't see why ANYONE had issues with burning the rice, it being uncooked, soggy, or whatever.  I cook rice the same way each time, and it comes out perfect. In saucepan, combine rice, coconut milk, water, sugar & salt. Basically the liquids should reach the area RIGHT BEFORE your cuticle (middle of the white semi-circle on your finger nail but not reaching your cuticle).  This is also assuming you've got the rice in the pot leveled, and the tip of your index finger is touching the top of the rice NOT the bottom of the pan.  This is at least how I was raised to always know how much water to put in rice for it to always come out right. Bring to boil then simmer covered for 20 min. You cook until rice is tender.  After 20 minutes, if there is still liquid or a bit soggy, I turn up the heat a tad, cover, and cook until absorbed and fluffy.  It's not rocket science! Always works!  Nothing difficult! Then mix in almonds accents (found in salad section, basically a bag of seasoned almonds to top salads) which adds the right amount of flavor to accompany the coconut taste.  BTW, my husband was not a big fan of this.  I was, but I LOVE rice and the coconut flavor.  We ate it with some japanese wings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-22T21:18:08.53Z",
                "reviewBody": "Rice Cooker!  I mixed the 1 can coconut milk, 1/4 cup water, 1 teaspoon sugar, salt together, then put 2 cups of rice in my rice cooker, poored the coconut milk on top of the rice, mixed it in the rice cooker, then added 3/4 cup water ON TOP of the rice because you need water on top of the rice in order for it to cook right!  It was great!!!!!!!!!  I changed the recipe just a bit to make it cook in the rice cooker, it was great!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CoraGregory",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4705867/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-08T01:20:52.907Z",
                "reviewBody": "I'll admit, when I first tasted this I was disappointed - it was very bland.  I think it smelled so good while it was cooking (honestly, it smelled like I was baking coconut cookies) that the mild, subtle flavor was almost a let-down. HOWEVER, as stated in some of the other reviews, this is supposed to be a dish that compliments other Asian cuisine, and in that respect it is a 5-star recipe.  Serve this with something spicy (I made it with Easy Chicken Satay and Baked Pork - minus the pork - Spring Rolls from this site) and it is perfection!  My guests raved about the rice and I ended up appreciating it more when accompanied by something spicy.   I used light coconut milk, and almost made a big mistake by bringing to a boil over HIGH heat (started to burn!) instead of medium heat, but caught it just in time.  My rice cooked in about 10 minutes.  Will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ChristineM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1958749/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-07T23:22:09.673Z",
                "reviewBody": "I realize that this recipe is supposed to have a very subtle coconut flavor, but I was looking for a real bang for my buck since I was serving this with my Polynesian themed dinner, so for extra flavor I stirred in a few drops of coconut extract and a handful of sweetened shredded coconut.  With that it came out perfect- exactly what I was looking for.  Thanks for sharing the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Tina C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2504011/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-17T12:27:25.857Z",
                "reviewBody": "Tasty, pretty and fragrant, this is a beautiful Asian method of preparing basic rice. It must just be that our taste buds are unfamiliar with this combination of flavors that made this unappealing for us...purely a subjective thing.  I do think, however, that even in a general sense this would be much improved without the sugar.  As a rescue for the leftovers, a coconut rice pudding would have been fantastic. Unfortunately, hubs is not a fan of rice pudding, so the remaining rice went down the disposal. I did appreciate introducing something different to our palates, so no regrets in trying it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-22T15:27:18.757Z",
                "reviewBody": "I was curious about this recipe and decided to try it one night with some pineapple and apricot chicken.  My family loved it!  This is the only rice they want to eat now.  We have a lot of stir fry with vegetables and chicken, and if I don't make this rice, I get in trouble.  The only thing I will say is that I have never had to cook this rice for 18-20 minutes.  I start checking mine at 10 minutes, and it almost burns at 12 minutes.  Great alternative to plain white rice!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Grace",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2021850/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T19:34:19.967Z",
                "reviewBody": "I made this exactly by the recipe...I though it was excellent and though the flavouring was perfect..I didn't think the coconut flavour would be bette rif it was more pronounced. I think it would be too overpowering that way. I made this is flank steak and grilled asparagus, it was super tasty. My boyfriend ate it for 3 days in a row...he loved it! Even though I didn't think it needed tweaking, I thought I would add my brothers (sous chef) solution to that. He said to make the rice with water as you normally would. Then simmer the coconut milk down to half. when it is really nice and creamy fold it into the cooked rice. He said that he holds more of the coconut flavouring that way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shannon O'Keefe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sokeefe/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-15T17:04:28.607Z",
                "reviewBody": "A lot of people said their rice didn't cook and I think it is water in their area, I noticed my rice recipes didn't work well in Washington, but always turned out in Arizona.  Here's what I did to make this recipe:.  Add one tsp. olive oil to a small pan with a tight fitting lid.  Heat oil and then add the rice, stir often for two to three minutes then add the sugar,water and coconut milk (I reduced the water by 1/4 cup, the liquid should be about 1 inch above the rice) bring to a boil, reduce heat to low and cover for 20 minutes.  Perfect rice every time!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Samitestar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2368136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-05T17:24:23.457Z",
                "reviewBody": "I was surprised by this recipe...I was expecting a very strong coconut flavor and was a little disappointed to find out that it was so mild that it if someone else had made it, I would never have guessed that it had coconut in it.  I used light coconut milk, so maybe that was it.  HOWEVER, the thing that surprised me was that even though it wasn't very strong, my husband and I couldn't stop eating it!  It was delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Alle G.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1947517/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Asian Coconut Rice",
            "description": "Try this side dish prepared with jasmine rice and coconut milk.",
            "uploadDate": "2015-11-16T22:06:11.568Z",
            "duration": "PT54.72S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F1a35ac8f-be31-46fe-a733-5200fc3d9ea0%2Fb0734c71-5201-4758-9250-e8179a307714%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4616585267001"
        }
    }
]