[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/396/desserts/cakes/spice-cake/",
                    "name": "Spice Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7490/eggless-milkless-butterless-cake/",
        "name": "Eggless Milkless Butterless Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F249689.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-05-16T03:47:26.000Z",
        "description": "This is a spice type cake.  It is from the depression era or war time rationing.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -8 or 9 inch square",
        "recipeIngredient": [
            "1 cup white sugar",
            "2 tablespoons shortening",
            "½ teaspoon ground cinnamon",
            "½ teaspoon ground nutmeg",
            "½ teaspoon ground allspice",
            "½ teaspoon salt",
            "1 cup raisins",
            "1 ½ cups water",
            "1 teaspoon baking soda",
            "2 cups all-purpose flour",
            "1 teaspoon baking powder"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 8 or 9 inch square cake pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a saucepan over medium high heat combine; the sugar, shortening, ground cinnamon, ground nutmeg, ground allspice, salt, raisins, and water bring to a boil and continue boiling for 5 minutes. Remove from heat and let cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift the flour, baking powder and baking soda together. Add the flour mixture to the cooled raisin mixture. Stir until just combined. Pour batter into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 20 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Spice Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kathy Thurston"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.481481481481482,
            "ratingCount": 54,
            "itemReviewed": "Eggless Milkless Butterless Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "196.6 calories",
            "carbohydrateContent": "42.4 g",
            "cholesterolContent": null,
            "fatContent": "2.4 g",
            "fiberContent": "1.1 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "0.6 g",
            "servingSize": null,
            "sodiumContent": "244.2 mg",
            "sugarContent": "23.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-29T23:45:26.473Z",
                "reviewBody": "VEGAN!! and VERY easy to make. Dirties only one pot a spatula and the baking pan. Didn't even have to use an egg beater or mixer. This must have been a WWII recipe when women were working long shifts and needed cake w/o much time consuming labor or rationed ingredients. What took the longest was waiting for the boiled spiced sugar syrup to cool down but you can be preparing dinner during the half hour in the fridge it needs. This is the perfect day-before-payday-and-I-need-something-for-dessert-but-the-cupboard-is-bare recipe. Looking to see what I had available I made it with no raisins peanut oil instead of shortening whole wheat pastry flour instead of white used double-strenth black tea instead of water and 1/2 teaspoon allspice and 1 teaspoon powdered ginger for the spices. (The tea helps the baking soda work as it is a bit acid.) As others have said it is moist dense and delicious. I have to laugh when I see other reviewers using expensive and/ or non-vegan substitutions like butter or serving it w/ ice cream. Kind of misses the point. If you can use that stuff pick another richer cake recipe; it will taste better. However this is quite amazingly good given the limitations.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Little Old Lady",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5024877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-19T15:54:08.403Z",
                "reviewBody": "I give this a middle of the road rating because my family was split on the cake. The kids loved it! Plain and simple they could've ate the whole cake themselves. As for my husband and I we found it to be much too heavy for our liking. I also had to add 10 extra minutes of baking just to get the center cooked completely. The taste was fine but the texture was very poor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "kathleen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1239530/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T16:27:37.8Z",
                "reviewBody": "This cake is absolutely delicious!! I found it while looking for dessert recipes that did not call for milk or eggs only because I didn't have any in the house. I never knew you could make a cake without these ingredients. I changed it a little because of what I had in the house. I did not have any raisins and I used ground clove instead of nutmeg and allspice and doubled the cinnamon. I also used butter instead of shortening. This was the most moist and chewy cake I have ever had! My boyfriend never eats cake he does not like it because he says it is dry; he LOVED this cake!! It tasted like gingerbread! Many of the reviews say how dense it is so I was nervous and thought it was going to somewhat resemble a moist brick (haha) but I am not sure what they mean it is a little dense but also airy like a cake but soft and CHEWY and OH SO GOOD!! I did have to cook it a little longer than 20mins but I will definitely be making his again soon!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3483388/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-29T23:01:59.81Z",
                "reviewBody": "Very good! Very moist and dense cake. Didn't change anything except double the cinnamon. Also added an orange glaze( icing sugar and orange juice) to the top once it was out of the oven and cooled a bit. I'll definitely make it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LowfatDANCER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1338453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-18T02:19:10.42Z",
                "reviewBody": "I made this so one of our b-day guests could have cake with us. It is a very heavy dense cake with a great taste. I increased the spices to 1 tsp. each & added an orange glaze as suggested by another reviewer. Everyone was surprised at how yummy this 'everything free' cake tasted.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "charolette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1945046/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-20T17:27:42.38Z",
                "reviewBody": "I had been pretty busy this week and hadn't had a chance to go to the store for milk or eggs but wanted something to eat for breakfast. I found this recipe and decided to make it as a coffee cake type breakfast. I don't like rasins so I didn't add them. I would have loved to have added nuts but didn't have any(I need to go shopping!). I did add a little bit of rum axtract to the boiled mixture and then sprinkled brown sugar and cinnamon on top before baking. Other than that I followed the recipe. The cake was heavy but it wasn't dry. The taste was great and it filled me up for sure with my cup of coffee! I will make this cake again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "muggle516",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2485062/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-30T01:34:43.06Z",
                "reviewBody": "I used Craisins instead of raisins plus I added about 2 TBS of chopped walnuts that I had left. I omitted allspice as we didn't have any. I added a tablespoon or two of cocoa so that the cake would be a little chocolatey (but not too much!) and I used margarine instead of shortening. Other than those changes I followed the recipe... And... It was great! It took longer to cook more like 30 minutes but it's a nice change! ESPECIALLY with the cocoa. I really enjoyed the spices and cocoa together. My daughter is eating some with ice cream right now. Thanks Kathy your recipe is awesome!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Duckball",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1241884/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-10T01:18:27.17Z",
                "reviewBody": "absolutely delicious! i combined it w/another recipe i found (changed white sugar to brown added 3 TBSP shortening doubled the cinnamon added 1/2 TSP ground cloves only used 1 C water and used 2 1/4 C cake flour) and cooked it into 11 cupcakes which cooked for 25 minutes. but in the end i have scrumptious little spice muffins!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRRLINTERUPTD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/750119/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-19T17:34:32.27Z",
                "reviewBody": "This cake was awesome!!! I was at the bottom of the bucket on food supplies(need to hit the market) but wanted something fast easy and that I could make with practically nothing. I did use a little different of a recipe because I wanted to get rid of some things. I used a can of coconut milk(instead of water) a tsp of nutmeg and cinn as I had no allspice 3 tsp of cocoa powder half white/half wheat flour and half white/half brown sugar. It turned out awesome and I will absolutely make it again. I served it with some baked sliced apples that I cooked in sugar cinnamon and butter def went very well with it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "braedont",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5228880/"
                }
            }
        ]
    }
]