[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/64599/sauceless-garden-lasagna/",
        "name": "Sauceless Garden Lasagna",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F285788.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2003-09-09T00:29:36.000Z",
        "description": "This is a tasty lasagna that I developed to help use up the abundance of tomatoes and zucchini from my garden. I didn't have any pasta sauce on hand, so I just added the herbs to the vegetable mixture. Even my daughter and her picky friends ate it!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "1 9x9-inch dish",
        "recipeIngredient": [
            "1 medium zucchini, halved lengthwise and sliced ",
            "⅓ cup chopped red onion",
            "1 cup shredded mozzarella cheese, divided",
            "½ cup crumbled feta cheese",
            "2 portobello mushrooms, sliced",
            "4 cups fresh baby spinach",
            "¼ cup chopped fresh basil",
            "1 tablespoon chopped fresh oregano",
            "3 cloves garlic, minced",
            "3 tablespoons olive oil",
            "¼ cup balsamic vinegar",
            "1 teaspoon sugar",
            "½ teaspoon salt",
            "¼ teaspoon freshly ground black pepper",
            "1 (8 ounce) package no-boil lasagna noodles",
            "9 roma (plum) tomatoes, thinly sliced"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Lightly coat a 9x9  inch baking dish with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, toss together the zucchini, mushrooms, spinach, garlic, red onion, 1/2 cup mozzarella cheese, and feta cheese. Drizzle with olive oil and balsamic vinegar, and stir in basil, oregano, sugar, salt and pepper. Stir the mixture until evenly blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a layer of lasagna noodles into the bottom of the prepared pan. Make a layer of tomato slices over the noodles. Spread a generous amount of the spinach mixture over the tomatoes. Don't worry, it shrinks a lot while cooking. Lay slices of tomatoes over the spinach mixture, then another layer of noodles. Start with another layer of tomatoes on top of the noodles, and repeat layering until the dish is heaped with lasagna, ending with the vegetable mixture. Sprinkle remaining cheese on the top.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 to 45 minutes in the preheated oven, until noodles, and vegetables are tender. Let stand for a few minutes to set, then slice and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "your mom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.479166666666667,
            "ratingCount": 192,
            "itemReviewed": "Sauceless Garden Lasagna",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "282.9 calories",
            "carbohydrateContent": "24.6 g",
            "cholesterolContent": "32.4 mg",
            "fatContent": "15.5 g",
            "fiberContent": "2.5 g",
            "proteinContent": "12.9 g",
            "saturatedFatContent": "6.4 g",
            "servingSize": null,
            "sodiumContent": "575.6 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-08-08T03:58:19.61Z",
                "reviewBody": "Fantastic dish! The aroma from the kitchen while this was baking was incredible. Don't be afraid to use the vinegar--as long as you're using Balsamic, it won't have a \"vinegary\" taste!! I added an extra clove of garlic (because we LOVE garlic) and didn't use feta since I didn't have any (just added extra mozzarella). Be sure to let the lasagna rest for at least 25 minutes when you take it out of the oven or else you'll end up with a watery mess. Letting it rest allows the cheese to firm up enough to hold the lasagna together, and allows the veggies and pasta to absorb the juices.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "QUEENLUCY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/448308/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-01T05:27:34.183Z",
                "reviewBody": "This was so so good!  I was really worried about having lots of extra liquid, but that didnt happen at all.  I used about 2 cups of mozzarella cheese and 1 cup of feta.  I seeded the tomatoes before I put them in which might be why I didnt have lots of excess liquid.  Also, don't put the cheese on top of the lasagna right away, but wait until the last ten minutes.  I let it bake for 35 min then added the top cheese layer and left it for 10 more min.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "isandler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2077511/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-17T22:49:27.083Z",
                "reviewBody": "DO NOT USE NO COOK LAZAGNA",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "rockchops",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2405908/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-07T21:56:45.043Z",
                "reviewBody": "This is amazing!! Really very good! I used a 9 x 13 inch pan and didnt use the full amount of tomatoes b/c someone mentioned it was too much. I ran out of tomatoes after the very first layer =( I noticed that everyone had the problem of the veggies releasing liquid in the oven so i precooked all the veggies except the spinach. I drizzles the tomatoes with olive oil, diced garlic cloves, salt + pepper and stuck them in the oven for 20 mins. The dish was filled with liquid when i took it out i just picked out the tomatoes with tongs. I fried the zucchini and red onion in some veggie oil for a few mins so they didnt release so much liquid while baking. I also added olives and a yellow pepper to the spinach mixture. Also since i ran out of tomatoes, i used spaghetti sauce for the other layers. It was really good. You can just use some spaghetti sauce and it works just as well as tomatoes. i really loved it. im going to make it again today and i just made this yesterday!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ak04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2806296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-21T19:24:55.95Z",
                "reviewBody": "This a light nice twist on lasagna. Good taste definitely add extra mozza and feta! Just one complaint the vegetables produced too much liquid for the noodles to absorb despite my cooking it for an hour. I would recommend extra layers of noodles or perhaps a breadcrumb layer to absorb. My Neanderthal man was a bit leery due to no meat and so many vegetables; making the dish suspiciously \"chick food\"... but he tried it and went back for seconds.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETNOTHINGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/590637/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-02T20:37:50.263Z",
                "reviewBody": "This is the freshest tasting lasagna I have ever eaten.Does not sit heavy in your stomach after you have finished.My vegetarian daughter loves it.I have made it many times and it never fails to impress.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKINGINHARROW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1231742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-06T03:56:46.373Z",
                "reviewBody": "Thank you SO much Emily B for this recipe! In general a wonderful vegetarian dish to use up and veggies youve got laying around or from the garden! I however did have pasta sauce- I used Classico's Tomato and Basil. I substituted this for the tomatoes and just made a thin coating of it on top of the noodles or whenever called for. Other things i changed just because it was what i had or needed to use up: Frozen spinach instead of fresh (about half a bag) yellow onion instead of red 1 whole cup (at least) mozzarella inside the dish itself and more for topping 1 whole cup feta dried basil and dried oregano spoonful of minced garlic a fat pinch of fresh thyme 2 shallots just one big glug of balsamic (im not a huge fan) and three glugs of olive oil. Also this fit in a 13x9 pan all the way up to the rim and i had to end up cooking mine probably for 50 minutes. The result is fresh zesty and generally attractive. I probably wont use the Thyme next time- thought it came out too overpowering and i might add more feta to it just because i love feta. A nice medely even with the sauce instead of tomatoes- I might try it sauce-less next time just to see how it turnes out. Good way to get your veggies in and use them up before they go bad. Absolutley excellent easy versitile healthy vegetarian main dish!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ShrimpGhost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1124764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-03T00:22:30.297Z",
                "reviewBody": "YUM!! I added extra spinach and used all fat free cheese as well as no oil. I also added a little bit of tomato sauce between the layers. This was delicious!! Very fresh! The fresh basil really makes this recipe so don't leave that part out!! Thanks for the great recipe:) Great way to get a few serving of vegetables in!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Brooke Elizabeth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2251060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-11T21:39:47.91Z",
                "reviewBody": "This is FANTASTIC!! I was leary because it seems like a lot of ingredients. I thought it'd be too complicated for a weeknight meal but it went together very quickly. I doubled the cheeses as well as the garlic (there's no such thing as too much garlic). My stepson said \" I just learned to love vegetables!\" After his 3rd serving. This is a keeper in my file",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyous",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1772849/"
                }
            }
        ]
    }
]