[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/183/soups-stews-and-chili/stews/",
                    "name": "Stews",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17048/soups-stews-and-chili/stews/pork/",
                    "name": "Pork",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/68611/slow-cooker-guisado-verde/",
        "name": "Slow Cooker Guisado Verde",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2432990.jpg",
            "width": 4080,
            "height": 5736
        },
        "datePublished": "2004-01-10T19:57:01.000Z",
        "description": "An easy tomatillo and pork stew that is my boyfriend's favorite. Make it as spicy as you like by adding more or less jalapenos, or do not add any if you have a more tender palate.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT7H15M",
        "totalTime": "P0DT7H30M",
        "recipeYield": "4 Servings",
        "recipeIngredient": [
            "2 tablespoons vegetable oil",
            "2 pounds boneless pork shoulder",
            "1 large onion, coarsely chopped",
            "3 cloves garlic, chopped",
            "2 (12 ounce) cans tomatillos, drained and chopped",
            "1 (7 ounce) can diced green chile peppers",
            "2 fresh jalapeno peppers, sliced",
            "½ cup fresh chopped cilantro",
            "1 teaspoon dried oregano",
            "salt and pepper to taste",
            "1 quart water",
            "1 cup shredded Monterey Jack cheese",
            "¼ cup sour cream",
            "4 sprigs fresh cilantro, for garnish"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat the oil in a large skillet over medium heat, and brown the pork on all sides. Reserving the juices in the skillet, transfer the pork to a slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In the skillet with the pork juices over medium heat, saute the onion and garlic about 1 minute. Transfer to the slow cooker, along with skillet juices.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the tomatillos, green chile peppers, jalapeno peppers, and cilantro into the slow cooker. Season with oregano, salt, and pepper. Pour in 1 quart water, or enough to cover all ingredients. Cover, and cook on High for 6 to 7 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shred the cooked pork with a fork. Spoon the slow cooker mixture into bowls, and top with Monterey Jack cheese, sour cream, and fresh cilantro sprigs to serve.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Stews",
            "Pork"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Fastcooker"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.451776649746193,
            "ratingCount": 197,
            "itemReviewed": "Slow Cooker Guisado Verde",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "552.8 calories",
            "carbohydrateContent": "17.7 g",
            "cholesterolContent": "121.6 mg",
            "fatContent": "36.9 g",
            "fiberContent": "8.5 g",
            "proteinContent": "37.3 g",
            "saturatedFatContent": "14.5 g",
            "servingSize": null,
            "sodiumContent": "1345.5 mg",
            "sugarContent": "6.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-12-13T22:01:02.72Z",
                "reviewBody": "Mmmm. So good. I simplified this recipe by substituting 2 jars of Herdez salsa verde for the tomatillos and chiles and doubled up on the garlic because I LOVE garlic. I also substituted Dos Equis beer for the water. This was killer. So delicious and so easy. It would make an excellent base for a green pork chilli if you wanted to add a couple of cans of white beans as well. Hominy would be a fun addition too. I will make this again and again. Mmmmmm.\n\nAlso, a note, if you can acquire Mexican oregano, your tastebuds will thank you. It has an amazing earthy flavour that you just can't replicate with anything else.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUSCIOUSLEMONADE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1140360/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-15T02:42:12.733Z",
                "reviewBody": "Fantastic! I used a 32oz. jar of tomatillo salsa to replace the tomatillos, onion, garlic, jalapeno and chiles. It had everything in it. I also replaced the water with chicken stock. During dinner my husband kept coming up with more ways we could use this pork. We ate it like soup, we had it wrapped in tortillas and next I will use it to make enchiladas! Yummy :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Keilypie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1600708/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-06T01:42:59.827Z",
                "reviewBody": "Excellent. I used fresh tomatillos instead of canned, pork tenderloin instead of shoulder, and chicken broth instead of water. The meat was very tender, and had a great flavor. I strained some of the water out of the sauce, and added it back to the slow cooker with the shredded pork. We spooned it into warm tortillas and topped it with avocado, cheese and sour cream. DELICIOUS!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LPEICHEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/246410/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-30T18:59:44.22Z",
                "reviewBody": "This dish was excellent. However you MUST take the advice of others and use chicken broth instead of water for added flavor. I also used pork loin instead of pork shoulder. The recipe came out excellent. My husband and I made tacos with the meat the first night using corn tortillas and the same toppings as called for in the recipe and had it as a stew the following night. My husband was apprehensive at first but ended up loving it! He even called me the next day from work to get the name of the recipe because he was telling all of his co-workers how good it was.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs. Sweetie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1749115/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-07T11:35:52.563Z",
                "reviewBody": "Excellent. A little on the hot side for us but still excellent. I used boneless country style ribs and cut them into chunks before I browned them. I used less jalapeno than called for (last year s harvest which I froze were HOT) and rounded everything out with some salsa verde in addition to the tomatillos and green chilies. I found it unnecessary to add any water. I served this over Mamacita s Mexican Rice along with some sour cream and guacamole and Skillet Summer Squash both recipes also from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-17T21:35:34.017Z",
                "reviewBody": "Not what I call a real mexican recipe as my wife is Mexican and we call this dich chili verde(green chili sauce) but we only use fresh tomotillos,Anihym chilis and jalapenos or serrano chilli's which are simmered in chicken stock for about 1 hour only the stems are removed from the chili's then they are run through the blender using some of the stock poured over the browned meat (cubed)and allowed to simmer we make large batches so you need about 4 lbs of tomotillos,8 to 10 of each type chili (we like it spicy)simmer for a couple hours serve with Mexican rice and flour or corn tortillas enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JS Mooney",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6016842/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-04T22:29:31.89Z",
                "reviewBody": "This is great! I used chicken broth in place of the water and maybe only a 1/2 tsp. dried Cilantro because I don't care that much for it. I also used pork loin instead of pork shoulder because it is what I had. It turned out awesome and quite spicy which I love! Thanks for the great recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rawcalls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1065239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-05T01:26:52.883Z",
                "reviewBody": "I'm going to give this 4 stars since it was good but I changed it around a little. I couldn't find canned tomatillos so I used salsa verde and only one jalapeno (it was pretty fiery). With that it tasted great! However when I went to put the recipe in my \"permanent collection\" I turned to my fiance and said \". I was suppposed to put a quart of water in this thing!\" So...with the other reviews saying to use chicken broth instead of water I say use salsa verde and no water (or broth). It was still stew-like and not bland at all.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2453847/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-17T23:57:44.447Z",
                "reviewBody": "First I want to say a big thank you to Shel1986 for her suggestion to use Herdez brand Salsa Verde. For everyone who complained this recipe was bland next time add 8-16 oz of this Salsa Verde in your crockpot and watch your mouth explode with flavor at dinnertime. I substituted a bottle of Corona beer for the water. Second I omitted the tomatillos green chiles and jalapeno peppers and instead added 16 oz of Herdez Salsa Verde. I doubled the oregano to 2 tsp. I also added 2 T of fresh Key lime juice. (I kept the onions cillantro and garlic amounts as per the recipe). If you don't like super hot spicy then back down on the Salsa Verde and add it in 1/4 cup increments until you get the right level of heat for your personal preference. This pork had a complexity of flavors with the garlic salsa verde oregano lime juice cilantro and onions. I'm not a big pork fan but this turned out to be the best pork recipe I've ever fixed. Forget the chipotle peppers in adobo sauce and find yourself some Herdez salsa verde instead. This recipe is a keeper. In fact I'm going to dig out a couple of more pork shoulders from the freezer to cook and freeze in smaller portions for making enchiladas tacos and burritos.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TSandy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8653517/"
                }
            }
        ]
    }
]