[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1981/meat-and-poultry/chicken/chicken-breasts/pan-fried/",
                    "name": "Pan-Fried",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/69792/bourbon-pecan-chicken/",
        "name": "Bourbon Pecan Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F129380.jpg",
            "width": 2048,
            "height": 1362
        },
        "datePublished": "2004-02-14T14:59:23.000Z",
        "description": "Chicken breasts are coated in a pecan breading, and fried in a skillet. Then a rich bourbon sauce is poured over them before serving. This is a fabulous recipe that my Mother gave me from a upscale restaurant in New York. It is to die for. ENJOY!!",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "½ cup finely chopped pecans",
            "½ cup dry bread crumbs",
            "8  breast half, bone and skin removed (blank)s skinless, boneless chicken breast halves",
            "¼ cup clarified butter, melted",
            "¼ cup Dijon mustard",
            "¼ cup dark brown sugar",
            "2 ⅔ tablespoons bourbon whiskey",
            "2 tablespoons soy sauce",
            "1 teaspoon Worcestershire sauce",
            "¾ cup unsalted butter, chilled and cut into small cubes",
            "½ cup sliced green onions"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together the pecans, bread crumbs, and 2 tablespoons of clarified butter. Spread the mixture out on a plate. Press the chicken breasts into the mixture to coat on both sides.  Heat the remaining 2 tablespoons of clarified butter in a large skillet over medium heat. Place the coated chicken breasts in the pan, and fry on both sides until nicely browned and chicken meat is cooked through, about 10 minutes per side.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small saucepan, whisk together the Dijon mustard, brown sugar, bourbon, soy sauce, and Worcestershire sauce until smooth. Bring to a simmer over medium-low heat, then remove from the burner, and whisk in the 3/4 cup of unsalted butter one piece at a time. Do not return to the heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange the chicken breasts on a large serving plate. Pour the sauce over the chicken, and sprinkle with green onion.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast",
            "Pan-Fried"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "PGRAFF"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.603498542274052,
            "ratingCount": 686,
            "itemReviewed": "Bourbon Pecan Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "485.6 calories",
            "carbohydrateContent": "15.5 g",
            "cholesterolContent": "134 mg",
            "fatContent": "33.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "28.6 g",
            "saturatedFatContent": "16.5 g",
            "servingSize": null,
            "sodiumContent": "537.2 mg",
            "sugarContent": "7.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-11-01T20:28:38.513Z",
                "reviewBody": "Hey everyone, this recipe is my very favorite! Please understand that the clarified butter called for is easy to make, and also imperitive to the success of the instructions of this recipe. You can make clarified butter by melting twice the butter called for in the microwave, pop it in the fridge, and in about an hour (do this ahead of time), you can take it out, pull off the solid top, and you have clarified butter liquid in the cup. Remeasure for an accurate amount. If the recipe burned to fast before, or you had to bake after frying, give it another try. You won't be disappointed. Thanks a lot PGraff, you're a great cook!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mamamelton",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/877658/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-02T22:18:32.763Z",
                "reviewBody": "HELPFUL TIPS NOT MENTIONED: I really don't see how the clarified butter makes or breaks this recipe as mentioned by several because I've taken the time to do it & my picky guests over the years could NEVER tell a difference.  I just use 1T unsalted butter, 1T olive oil.  I do know that this is always hands down the best dish I make and people can't stop eating even if they're \"bird eaters.\"  I just use egg with a splash of milk to coat this (instead of butter) before adding the pecan breading because it sticks better.  I brown each side for 2 minutes, which is perfect, and then stick in the oven at 375 for 15 min.  This is always moist.  I use all of the butter stated for the sauce b/c this helps simmer down the taste of alcohol.  I use Jim Beam and on accident one time, I used a Rum.  Still edible though (thank goodness, considering this is what I use any time new guests come over).  This goes perfect with a strawberry salad and for the best dressing in the world, try the one on \"Strawberry Romaine Salad I.\"  I've never tasted anything so perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-14T02:40:05.53Z",
                "reviewBody": "This recipe is just great. I use less butter in the sauce, about half, or I find it is too oily. Toasted almonds also work for the crust. To solve the problem of the chicken burning easily, I use a little butter and olive olive oil to increase the smoke point. When I brown both sides, about 2 minutes each, I use an old restaurant trick and finish the chicken in the oven at 350 degrees for about 15-20 minutes until done.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bodicea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/37353/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-06T17:06:04.733Z",
                "reviewBody": "I am giving this four stars because I COULD NOT get the pecan/butter mixture to stick to the chicken.  Then it fell off and it also burned during cooking.  \nThe flavor is FANTASTIC and I am going to make again, but this time I will NOT mix butter into pecan and breadcrumbs and coat chicken with egg then roll in mixture.  Also, I will fry both sides and then bake until done.  Very tasty sauce!  Mmmmm!\nUPDATED:  I changed to five stars with this version.  Do not add butter to pecan mixture, keep dry.  Dip chicken in egg and then roll in pecan mixture, will stick nicely.  Then bake in glass dish and pour sauce over.  Very tasty and a little healthier!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "clairedoby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1847742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-04T01:27:12.37Z",
                "reviewBody": "This is my new favorite chicken dish! All the right tastes perfectly blended. A few suggestions- Ask your butcher to pound out the chicken a little for you- it cooks a little faster and more evenly. Keep a cookie sheet sprayed with nonstick cooking spray in a 350 oven so as you finish cooking each piece of chicken you can keep it warm while you finish cooking the other pieces because they won't all fit in one pan. I followed the directions exactly for the sauce but don't know why next time I couldn't just melt the butter seperately then stir it into the rest of the sauce. Enjoy and thanks PGraff for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNJAMS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/600992/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-28T07:18:15.437Z",
                "reviewBody": "Wow! This was fantastic! And I did just about everything possible to screw it up. I was out of Dijon so used regular mustard. Was out of bourbon so used Scotch Whiskey. Was out of butter so used \"tub\" margarine. It still turned out wonderful! Flavorful juicy (not dry like most of my chicken dishes!) my family loved it. Suggestions: Make sure the pecans are chopped/ground very fine so they will stick. Make the sauce ahead of time (it seemed to increase in flavor when we reheated it later for leftovers). The pecan breading will burn quickly so try browning it very fast over high heat in a bit of vegetable oil just a couple of minutes per side then place on a cookie sheet (spray with Pam first) in a 350 oven for 15 minutes or so to finish cooking. I served it with a simple rice pilaf and steamed broccoli. This is a delicious dish quick and easy and a new family favorite. Sophisticated enough for company too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Becky",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1575547/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-23T13:55:40.04Z",
                "reviewBody": "I had to make several changes because 1) I don't like using white bread crumbs 2) the crumbs don't stick to a plain chicken breast 3) the cooking method caused the crumbs to brown more quickly than the chicken can cook and 4) the chicken was bland while the sauce was too strong and fatty. Here are my healthier changes: 1) season the chicken with salt & pepper reserve 1/3 C chicken and brown the rest in a skillet 2) process 1/3 C chicken & egg white with a little milk until mayo-like. Coat chicken with this mixture before coating with crumbs. Sounds gross but I learned this from Michel Richard's cookbook and you can't tell after it's cooked. Plus crumbs adhere to this much better than eggwash or buttermilk and its nearly fat free. 3) use homemade crumbs from whole wheat bread (medium sized for more crunchiness). No need to add butter to crumb mixture. 4) drizzle with EVOO and oven bake for 20 min 5) for sauce use 1/4 C heavy cream instead of 3/4 C butter. This mellows the strong taste of the sauce while cutting out a lot of fat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-06T19:04:47.607Z",
                "reviewBody": "This is similar to pecan-crusted chicken that I make all the time because it is frequently requested by family members. I pound chicken breasts thin and coat with buttermilk and then 50-50 ratio of bread crumbs and pecans (bread crumb mixture will get soggy so reserve some to the side for last couple of chicken breasts). Saute in approx. 2 tbsp butter and 2 tbsp olive oil (to keep butter from burning at high heat-quicker than clarifying butter). For the kids in my family I serve with honey dijon sauce (dijon mayo and honey) or ranch dressing. I also add a little paprika garlic powder and kosher salt to breading mixture. My husband hates nuts but loves this recipe-I just chop pecans really fine. Definitely 5 star!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissajean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1503152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-16T08:46:44.5Z",
                "reviewBody": "This could be a meal I would buy at a fancy restaurant! I made this exactly as written and it was great. At first I thought I had burned the chicken when I turned it over but it was the brown sugar that had caramelized. I would venture to say that this is the best chicken recipe that I've found and I will be making this one again and again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROOKIE COOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1054472/"
                }
            }
        ]
    }
]