[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/96/salad/",
                    "name": "Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/215/salad/pasta-salad/",
                    "name": "Pasta Salad",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16185/salad/pasta-salad/macaroni-salad/",
                    "name": "Macaroni Salad Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/74915/amish-macaroni-salad/",
        "name": "Amish Macaroni Salad",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F410845.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2004-08-04T01:42:02.000Z",
        "description": "A colorful and flavorful macaroni salad made with hard cooked eggs, bell pepper and celery in a creamy dressing. Best macaroni salad I have ever had.  I always get many requests for recipe. Enjoy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 cups uncooked elbow macaroni",
            "3  large eggs hard-cooked eggs, chopped",
            "1 small onion, chopped",
            "3 stalks celery, chopped",
            "1 small red bell pepper, seeded and chopped",
            "2 tablespoons dill pickle relish",
            "2 cups creamy salad dressing (e.g. Miracle Whip)",
            "3 tablespoons prepared yellow mustard",
            "¾ cup white sugar",
            "2 ¼ teaspoons white vinegar",
            "¼ teaspoon salt",
            "¾ teaspoon celery seed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring a pot of lightly salted water to a boil. Add macaroni, and cook for 8 to 10 minutes, until tender. Drain, and set aside to cool.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir together the eggs, onion, celery, red pepper, and relish. In a small bowl, stir together the salad dressing, mustard, white sugar, vinegar, salt and celery seed. Pour over the vegetables, and stir in macaroni until well blended. Cover and chill for at least 1 hour before serving.\n"
            }
        ],
        "recipeCategory": [
            "Salad",
            "Pasta Salad",
            "Macaroni Salad Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CONNIE0751"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.527286135693215,
            "ratingCount": 1356,
            "itemReviewed": "Amish Macaroni Salad",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "532.3 calories",
            "carbohydrateContent": "66 g",
            "cholesterolContent": "132.7 mg",
            "fatContent": "25.3 g",
            "fiberContent": "2.6 g",
            "proteinContent": "9 g",
            "saturatedFatContent": "3.7 g",
            "servingSize": null,
            "sodiumContent": "944.1 mg",
            "sugarContent": "37.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-04-20T17:21:22.247Z",
                "reviewBody": "Okay, I am absolutely addicted to this salad.  However, I have made some changes to it.  First, I prefer bow tie pasta.  I think it gives it a little more visual appeal.  I also dry the pasta on paper towels after I drain it.  This keeps the moisture level down and allows the dressing to coat the pasta better.  I use fat free Miracle Whip to keep the fat content down.  I use four eggs instead of three.  I find the sugar is an important ingredient however, I only use about 1/4 to 1/2 cup.  I also use apple cider vinegar.  I don't add the red pepper because my husband doesn't like them but they do give it a great color.  We all love celery so I add extra and I also chop the leaves from the celery stalks and add those.  I also like to add in a little garlic salt.  It always seems to  make a lot of dressing so I mix in just enough to coat the pasta and let it sit over night.  I cover and fridge the remaining dressing.  Then, if it looks a little dry in the morning, I add more of the dressing.  This keeps it from being too liquidy.  \n\nI have also added in a can of well drained tuna which gives it a great flavor and makes it more of a meal.  \n\nThe dressing also works great as a base for potato salad.  \n\nYUM!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JODIEGARDNER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/699822/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-08-21T19:02:01.09Z",
                "reviewBody": "I wish I had read other reviews before making this ( usually do and this will teach me a lesson). The 3/4 cup sugar just ruined what would have been a great recipe 1/8 to a 1/4 cup would have been fine. Also, use a whole box (16 oz.) of macaroni. Two cups isn't nearly enough for this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "HALPAC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/259398/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-15T03:15:29.763Z",
                "reviewBody": "What a wonderful, delicious recipe! I reduced the sugar a bit but next time will add even less. I think 1/4 or 1/3 cup will suit my families tastes. I had a hard time putting this recipe together since I found myself out of some ingredients. I subbed one cup of Marzetti's slaw dressing and one cup of Mayo for the Miracle Whip. I also chopped one small dill pickle and added a little pickle juice for the relish. Didn't have celery seed so that was left out. With summer coming up I can see myself making this many times over! Thank you for the post. By the way, for the poster that mentioned the restaurant, Das Dutch Haus in Ohio: I used to live in Pittsburgh and a highlight for us moms was to drive over to shop and eat at Das Dutch Haus. Ah, the memories. I loved the food there! :-) *Update* Made this again and used the salad dressing. Used celery salt instead of salt and celery seed. This is just so yummy! Made again and sprinkled with paprika and black pepper. Outstanding! For those of you that think that this is a little soupy, place in the fridge overnight and the noodles soak up some of the liquid. It is perfect the day after preparing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Butterfly Flutterby",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/939980/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-07T16:47:52.713Z",
                "reviewBody": "This is the recipe I use every time I make mac salad! I use real mayonnaise, Miracle Whip doesn't exist in my kitchen. Green pepper instead of red, cut the sugar to 1/2 cup, and no pickle relish. I add an extra hard boiled egg, shredded cheese, and I season the dressing with extra salt, pepper, garlic powder and a couple drops of Louisianna hot sauce for flavor. I cut the mustard to 1 Tbsp. Other good additions are diced ham or bacon. Amish macaroni salad is supposed to be sweet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaye Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kayelynn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-25T16:37:18.473Z",
                "reviewBody": "As per other reviewers' remarks I cut the amount of dressing.  But pasta absorbs all moisture very quickly, becoming dry. So, if not eating the salad right away, I suggest following the recipe as is (I agree with reducing sugar to 1/4 c.)- add enough dressing to salad to satisfy immediate eating requirements- keep the rest for later. You will need it.\nAlso, another reviewer suggested adding cubed cheese - I don't think cheese adds anything to this recipe it's quite simply excellent as is.\nEdit: I have now made this recipe dozens of times.  Yesterday I bought mayonaise instead of Miracle Whip-type salad dressing - in my opinion using mayo requires more sugar - I used a half cup.  Other than that - I'm still making it as above and getting raves from my guests and family.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan Mowbray",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cookinkiwi-1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-13T19:09:28.087Z",
                "reviewBody": "Perhaps I should preface my review by saying I hate macaroni salad....just not a big fan, can easily walk away and not eat it.  Yuck.  My dad requested mac salad for Father's Day and I searched for the \"right\" recipe and found this.  OMG.  I just ate a bowl and it's fantastic.  And the flavors haven't even had a chance to meld.  And I hate mac salad!  I did make some changes, here they are:  I doubled the recipe and used 4-5 C uncooked whole grain elbows.  I diced a md green pepper, a md red pepper, a sm-md red onion, 6 celery ribs, and 4 dill pickle spears (no dill relish, I realized).  I used 6 hard boiled eggs.  In the dressing, I used Kraft Light Mayo w/Olive Oil, yellow mustard, 2/3C sugar (and I would not use anymore, perhaps would use less, maybe down to 1/3C even next time) and I didn't measure the white vinegar, just added a couple of splashes.  I also added  a healthy amt of dill pickle juice (2 good \"splashes\" from the jar).  I added the following seasonings (I did not measure, I just sort of sprinkled across the top to cover, not coat, twice):  garlic salt (and did not use regular salt then), dill weed, and crushed red pepper (about 8 shakes).  I did not use celery seed simply because I hate celery (and I purposefully cut the celery large so I can pick it out :)).  I WILL be making this again.  Thanks for making me a mac salad eater (though, wait, I prob shouldn't be thanking you for adding yet another high calorie \"like\" to my list!)!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lovestohost",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lovestohost/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-06-13T23:40:16.437Z",
                "reviewBody": "I really loved this............but beware, you HAVE to cut the amount of sugar. Thank goodness that I read the reviews before making this and did not add the full amount of sugar.   I used 1/3 cup of sugar and I still found it a little sweet; and I LIKE sweet.  Next time I will only use a 1/4 cup of sugar.  Overall a delicious macaroni salad, creamy with a little tangy zing.  Thank you for sharing this wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBACUB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/537544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-30T01:39:10.577Z",
                "reviewBody": "This really is a fantastic macaroni salad. I did use several suggestions made by other reviewers... I added an extra hard-boiled egg (4 total), I reduced the sugar to 1/2C.(will reduce to 1/4C. next time and see how we like it) and I added only 1/2 the dressing (used Miracle Whip)to begin with. After refrigerating the salad all day I took it out, gave it a good stir, and added about 1/4 of the remaining dressing. This was perfect and didn't make it too \"soupy\". I will make this salad often...thanks so much for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8799/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-18T02:15:44.683Z",
                "reviewBody": "Just what I was looking for!  I chopped a dill pickle, skipped the sugar altogether and added smally cubed sharp cheddar cheese.  I also sliced the egg on top of the salad sprinkled with a bit of paprika sorta like a garnish.  Oh and to take the edge off of the \"miracle Whip\" I subbed about a 1/4 cup of sour cream.  YUM!  Thank you Connie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "I'm nuts too",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/610376/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Amish Macaroni Salad",
            "description": "This salad is light and so delicious, the perfect summer side dish.",
            "uploadDate": "2012-11-26T23:52:26.847Z",
            "duration": "PT2M46.917S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0f96ecac-9010-4085-9d36-9ee1d80c6439%2F781c5302-55cc-4898-87cb-fc13eac74c65%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1990723204001"
        }
    }
]