[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/75414/chicken-tinga-tostados/",
        "name": "Chicken Tinga Tostados",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2630761.jpg",
            "width": 1367,
            "height": 1023
        },
        "datePublished": "2004-08-23T16:21:16.000Z",
        "description": "This authentic Mexican recipe I picked up while living in Mexico.  It has a spicy, smoky flavor from chipotle peppers.  It is perfect for a buffet where people can serve themselves and even better heated up as leftovers the next day! If this is too spicy for you, try using less chipotle peppers.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "6 bone-in chicken breast halves",
            "7 medium onions, thinly sliced",
            "1 clove garlic, chopped",
            "¼ cup vegetable oil",
            "6 medium tomatoes",
            "1 (7 ounce) can chipotle peppers in adobo sauce",
            "1 tablespoon chicken bouillon granules",
            "16 tostada shells",
            "1 cup sour cream",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken into a large pot along with 1/4 cup of sliced onion, garlic, and enough water to cover. Bring to a boil, and cook until no longer pink, about 25 minutes. Remove chicken, cool, and shred meat. Discard skin and bones.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Add the remaining onion slices, and fry until transparent. Place tomatoes into a pan of boiling water (you could use the leftover chicken water), and boil until they split open.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the tomatoes, the whole can of chipotle peppers, chicken bouillon into a blender or large food processor. Process until smooth. Season with salt and pepper. Pour this mixture into a large pan, and add the shredded chicken and cooked onions. Heat through.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, each person spreads some sour cream on their tostada shell, and tops with a spoonful of the chicken.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "NANCHE30"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5133689839572195,
            "ratingCount": 187,
            "itemReviewed": "Chicken Tinga Tostados",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "514 calories",
            "carbohydrateContent": "29 g",
            "cholesterolContent": "107.7 mg",
            "fatContent": "27.1 g",
            "fiberContent": "4.2 g",
            "proteinContent": "38 g",
            "saturatedFatContent": "8.4 g",
            "servingSize": null,
            "sodiumContent": "445.2 mg",
            "sugarContent": "6.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-08-28T17:27:53.41Z",
                "reviewBody": "Just wanted to add a note as I live in Mexico and cook chicken tinga alot.  One of the main ingriedents in traditional Tinga is Cinnamon.  It plays a huge part in the flavour.  I would add 1 cinnamon stick rather then the powder but both work well.  Also a whole can of Chipotle´s would be very hot I would reccomend using 2-3 chipotles and also adding 1 tablespoon of sugar",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "baz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2913330/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-03-07T05:26:09.997Z",
                "reviewBody": "Excellent! I made this in my crock pot and it turned out great. It was also SUPER easy that way - no boiling and the chicken basically falls apart after 8 hours on low so shredding is piece of cake. (I put the chicken breasts in the crock pot with the sauteed onions & garlic; then I blended the tomatoes & peppers and put those in there as well to cook all day.) The first time I made this I used WAY too many peppers (I was trying to do a half batch) and we couldn't even eat it. But the second time we got the spice level right for us and it was a hit - about one whole chipotle pepper per tomato. We also like to put black beans on the tostada with it. Very unique authentic flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GINAXS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-10T07:47:16.79Z",
                "reviewBody": "very authentic flavor! (Needed some salt though.)\n\nIf you are like me and like flavors with \"a kick\" but not TOO spicy go by the equal portions rule.\n\n6 breasts (can use boneless if you like)\n6 onions\n6 tomatoes (large... or two large drained cans of whole tomatoes which are usually smaller)\n6 peppers (and scoop out some extra sauce.\n\nUse this ratio to prepare however much or little you want.  Using 6 breasts will give you PLENTY of food... easily enough for 8 adults and handful of toddlers.  I crockpot cooked mine... it was awesome.\n\nWhen I was in Mexico, they served tinga like this:\n\nTostada shell\nSpread with some mashed or pureed black beans (I use refried sometimes)\nSpread with tinga\nSpread with cheese and cream.\n\nThe cream is essential. If you don't know this healthy trick already, a great, healthy substitute for sour cream is plain yogurt... mmmm... full fat is the best.  You can substitute it in for all your sour cream needs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "gimmedatcheesecake",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1682525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-16T19:29:47.79Z",
                "reviewBody": "When you prepare the tostada it usually goes as follows, a layer or refried bean on the tostada, then shreded lettuce, then the tinga, and then sour cream topped of with a bit of shredded cotija cheese. :)it's a lot better this way.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mexicanmilkyway",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3475910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-28T23:57:51.007Z",
                "reviewBody": "Great recipe it's authentic! Here's a tip for managing the spiciness of this dish (especially when some of your family doesn't do spicy and some like it HOT): Instead of blending the whole can of chipotles into the sauce only blend in maybe one (you can never tell just how hot a given can will be). Then pull a few whole peppers out of the can and add them to the final mixture. Let them simmer in there to get that delicious smoky flavor but avoid breaking them up since the spiciness will mix into every bite if they are in pieces and the seeds get out. Finally blend the remainder of your can into a paste that each person can smear onto his or her tostada according to spiciness preferences. Also - don't worry about your tomatoes being too juicy. This dish should be a little watery (a little juice will slide off the tostada); if it's really really too watery then a) serve it with a slotted spoon or b) let it simmer down for a while and it will thicken just like spaghetti sauce does. Goes great with Agua de Jamaica (an easy and delicious hibiscus tea).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly Behl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1393863/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-24T14:07:35.2Z",
                "reviewBody": "Fantastic!  We loved these tostados.  To save time I used a rotisserie chicken, and a large can of whole tomatos drained.  Also, seven onions is a little excessive.  I used three, and that was plenty.  Very spicy...they just tasted great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "loves2cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1874572/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-02T00:53:41.427Z",
                "reviewBody": "My husband is from Mexico..my Mother-in-Law makes this all the time and I never thought to ask her how. Wanting to make it for dinner tonight I searched for a recipe. This is all the ingredients and it turned out the same. We don't use the sour cream. And I substituted ground beef for the chicken the way MIL does sometimes. Put some shreded lettuce on top of the Tinga and you're good to go!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Royann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2444420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-20T00:54:45.457Z",
                "reviewBody": "This is a delicious and easy to prepare meal. After reading viewer comments regarding spiciness I decreased the chipotles by half. After having tasted the recipe though in the future I will prepare the dish with the full chipotle recommendation. The sour cream and cheese nicely balance the spiciness of the sauce. I used fajita sized flour tortillas instead of tostadas. Fresh slices of avocadoes would be delicious wrapped with the chicken. I served these with cheese and jalepeno mashed potatoes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "tammyfaye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1853495/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-09-24T07:17:47.247Z",
                "reviewBody": "FANTASTIC! Definately follow the directions although the recipe appears to call for too many onions. The recipe was further enhanced by frying our tortillas in oil - providing a nice tostada touch. Lastly serving lettuce and cheese atop this recipe adds a great flavor. enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HAUGHTIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1192194/"
                }
            }
        ]
    }
]