[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/203/meat-and-poultry/lamb/",
                    "name": "Lamb",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1015/meat-and-poultry/lamb/leg/",
                    "name": "Leg",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/112260/stuffed-leg-of-lamb-with-balsamic-fig-basil-sauce/",
        "name": "Stuffed Leg of Lamb with Balsamic-Fig-Basil Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F601260.jpg",
            "width": null,
            "height": null,
            "caption": "Stuffed Leg of Lamb with Balsamic-Fig-Basil Sauce"
        },
        "datePublished": "2006-08-25T22:42:07.000Z",
        "description": "Dried plums and currants tossed with salted, roasted almonds, creme de cassis, and mint is the stuffing for my rolled lamb roast. It's a very easy way to dress up a lamb roast during the holidays. The simple herb rub adds just the right amount of seasoning along with fresh garlic inserted into the top of the roast. My balsamic basil fig sauce creation drizzled over the sliced lamb is the perfect finish touch and extremely flavorful thanks to the fresh basil.",
        "prepTime": "P0DT0H50M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 lamb roast",
        "recipeIngredient": [
            "½ cup coarsely chopped prunes",
            "¼ cup currants",
            "2 tablespoons creme de cassis liqueur",
            "1 ½ tablespoons minced fresh rosemary",
            "1 ½ tablespoons minced fresh thyme",
            "½ teaspoon ground coriander",
            "1 ¼ teaspoons salt",
            "1 teaspoon freshly ground black pepper",
            "1 (4 pound) boneless leg of lamb, rolled and tied",
            "½ cup chopped roasted and salted almonds",
            "2 tablespoons chopped fresh mint",
            "3 cloves garlic, cut into thirds",
            "2 tablespoons olive oil",
            "½ cup balsamic vinegar",
            "5 tablespoons butter",
            "3 tablespoons honey",
            "⅓ cup thinly sliced, stemmed Calimyrna figs",
            "5 teaspoons chopped fresh basil",
            "6 leaves mint",
            "6 leaves basil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the chopped prunes and currants with the creme de cassis in a small bowl, and set aside.  In another small bowl, combine the rosemary, thyme, coriander, salt, and pepper; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Untie and unroll the lamb, lay it out flat on the work surface.  Trim off excess fat, and cut any thick parts open so that it is evenly thick and somewhat rectangular in shape.  Sprinkle half of the herb mixture over the lamb. Mix the almonds and chopped mint into the prune mixture; spread evenly over the lamb.  Roll up starting at one of the short sides, and tie with kitchen twine in 1-inch intervals.  Cut 9 slits about 1-inch deep into the top of the lamb, and insert a slice of garlic in each.  Rub with olive oil, and sprinkle with the remaining herb mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place lamb seam-side up on a rack set in a roasting pan.  Roast in the preheated oven to desired doneness.  For medium-rare, a thermometer inserted into the center will read 140 degrees F (60 degrees C).  Remove lamb from the oven and cover with foil.  Allow to rest for 15 minutes while proceeding with the recipe.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the lamb is resting, bring the balsamic vinegar to a boil in a small saucepan over high heat.  Boil until the vinegar has reduced by half, 4 to 5 minutes. Once reduced, stir in the butter, honey, and sliced figs.  Stir until the butter has melted, then remove from the heat, stir in the chopped basil and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To serve, remove the twine from the lamb and cut into 1/2 inch thick slices.  Arrange on a warm serving platter and drizzle with the fig sauce, garnish with mint and basil leaves.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Lamb",
            "Leg"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Barbara E."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8307692307692305,
            "ratingCount": 130,
            "itemReviewed": "Stuffed Leg of Lamb with Balsamic-Fig-Basil Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "631.2 calories",
            "carbohydrateContent": "29.2 g",
            "cholesterolContent": "147.2 mg",
            "fatContent": "39.7 g",
            "fiberContent": "3.1 g",
            "proteinContent": "38.2 g",
            "saturatedFatContent": "15.1 g",
            "servingSize": null,
            "sodiumContent": "649.1 mg",
            "sugarContent": "22.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-29T20:26:52.233Z",
                "reviewBody": "I am a lamb lover; it's by far my favorite meat,  I made this meal for Xmas dinner and I was expecting perfection since the recipe sounded absolutely divine and I spent so much money on the ingredients.  It was good--but not nearly as delicious as I was expecting.  First, I would suggest you double or triple the herb/spice rub.  Because it was NOT CLOSE TO ENOUGH.  I really think that if I had done this, it might have been a five star.  Double the liqueur amount.  I subbed black cherry liqueur because I didn't want to buy a bottle of cassis I would never drink.  Lastly, the cooking time is off for this recipe.  Lamb just shouldnt be cooked more than medium rare, which means removal from the oven at 125-130 F on the thermometer.  Check your old cookbooks ladies and gentlemen-- the ones printed before our nation became fearful -- medium rare is 130-135F, and meat always rises 5F internally after removal from the oven!  That means 8-9 minutes per pound for lamb.  My 5 lb roast was done in 40 min--so check it early!! Also, because it's butterflied, the ends of the lamb cook to well while the middle is medium rare, so you can even please the philistines who prfer well-done meat with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "sailshonan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2861826/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-15T20:05:00.843Z",
                "reviewBody": "This was a very interesting and elegant dish! The herbs really worked well together, but next time I'll use more rosemary. It wasn't quite as flavorful as I had hoped, though. Here are some tips I'll use for next time:  Be very careful in the roasting time/temp. I roasted at 400 for the first thirty minutes and then turned it down to 335 for another 1 1/2 hours. My 5 1/2 pound leg was well-done and should have come out thirty minutes sooner. It was not dry, though.  If you use dry figs in the sauce as I did, add some water to the vinegar or else it becomes too strong.   Don't worry about the basil in the sauce, it works really well and doesn't overwhelm the dish with contrasting flavors. I even suggest using a little more.  If you don't want to purchase creme de cassis, another option is to use red current jelly. I used both and added some of the jelly to the fig sauce as well.   As other reviewers mentioned, I also used  cranberries (dried) in my filling.   I think as an alternative to the prunes, dates might taste nice in this. Next time, I may use both!  Pistachios would be good in the filling in place of the almonds.   This is a fun recipe to get creative with!  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRLBUG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1320060/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-13T23:52:52.09Z",
                "reviewBody": "We loved this recipe.  We live in a small country town and there was no lamb or figs near so I had to substitute.  I used sliced pork sirloin roast and cherries instead of currants.  I doubled the plum filling recipe so that I could have enough to put inbetween every slice. I had no string so I put the stuffed roast inside of a meatloaf pan and covered with foil. It was so good with the pork we can't even imagine how great it would be with lamb. I ordered a lamb online and can't wait to make it again. Hands down we agreed it was the best dish we've had in months.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JMeisha",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2899763/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-20T17:03:32.343Z",
                "reviewBody": "Figs and balsamic vinegar give this recipe instant crowd appeal. The aged balsamic vinegar that we bought blends beautifully with figs in this recipe -- savory but sweet -- and combines beautifully with the fresh mint and the succulent lamb. A winner in my family!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "odetoMFK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2081612/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-10T17:13:33.553Z",
                "reviewBody": "I made this for my family Easter Sunday and it was a huge hit.  I couldn't find currants so I added some dried cranberries.  I also couldn't find the particular fig type called for in the recipe so I used \"regular\" figs.  It turned out wonderfully!  I cooked the lamb at 325 (instead of 400 directed in the recipe) and it was done (medium rare) in 2 hours.  Stuffing, rolling and tying the lamb was a bit awkward but it sure did taste good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jackie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1775379/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-06T02:58:15.33Z",
                "reviewBody": "I made some changes to the recipe substituting what I had on had: replaced the almonds with walnuts substituted dates for figs dried herbs for the fresh ones. This recipe is fabulous! I enjoyed the meat without the sauce for a more savory flavor and the sauce added a special sweet-tart addition. A previous poster was correct cook it to 125-130 degrees.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyce M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2341411/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T00:54:12.847Z",
                "reviewBody": "Like whoa.  I made this for a number of guests on New Years Eve and made quite the ruckus.  Thank you for your recipe! I cooked it in a Dutch oven without the lid on the stove top for about 8 minutes to brown it up a tad.  I moved it into the oven at 375 F with the lid on until the temperature probe read 145 F-150 F in the center.  It came out beautifully.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MicahtheFlavorous",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5965177/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T23:29:17.217Z",
                "reviewBody": "This recipe is a winner! Made it for Easter and my lamb-hating husband and I both loved it! The key is the wonderful balsamic-fig sauce which would also be good on duck. Do yourself a favor and buy a rolled boneless leg of lamb in netting. When you unroll it cut out the major pockets of fat for a more pleasant dining experience. When you roll it back up with the stuffing get an extra pair of hands to help you put it back into the netting. This works better than tying string and is much easier. This recipe is very forgiving as long as you are true to a few key things: a nice piece of lamb a good quality balsamic fresh basil (or even homegrown dried) figs (or perhaps fresh or dried cherries). Fresh Calamyrna figs weren't available so I used dried \"regular\" figs--worked just fine. I didn't have fresh mint so left it out; didn't miss it (but would use it if I have it next time). I also omitted the almonds because I didn't think they were necessary; they weren't. I ran out of currants so substituted golden raisins. I could just as easily have used craisins or brown raisins. I didn't have quite enough prunes so filled in with a little dried apple cherry and apricot. Couldn't tell the difference. I recommend using creme de cassis but cherry brandy could substitute in a pinch. I didn't want to process the fresh rosemary so just laid small sprigs inside the roast--very \"organic\" looking. (I pulled out the twigs while I was carving). I sprinkled powdered garlic on t",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GoodFoodLover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3681657/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-14T18:00:51.893Z",
                "reviewBody": "I am not a lamb lover AT ALL! In fact it baa's at me! But I hosted Easter and one of my guests could not eat ham, so I added this to my menu. It was THE hit of my Easter table! All of the adults loved it! I gave out every lick of the leftovers. I omitted the almonds due to allergies. And I could not find fresh figs, so I used dried. I also had a 5 pound leg of lamb. It took about 1 hour and 25 minutes to cook. Some advice - double the sauce! Everyone loved it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "francheska",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/335692/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-22T11:28:18.463Z",
                "reviewBody": "did not care for this recipie because i love lamb and i could not taste the lamb at all just all the spices",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LBugg",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7773695/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Stuffed Leg of Lamb with Balsamic-Fig Sauce",
            "description": "See how to make Stuffed Leg of Lamb with Balsamic-Fig-Basil Sauce.",
            "uploadDate": "2013-07-02T21:28:18.705Z",
            "duration": "PT6M49.367S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F35a73bda-beeb-425b-9d64-0542b67ec29f%2Ffc517422-accd-4b60-8305-f5f08b04c86b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2522975346001"
        }
    }
]