[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14875/trusted-brands-recipes-and-tips/kraft-desserts/",
                    "name": "Kraft Desserts",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/129996/chocolate-candy-cane-cake/",
        "name": "Chocolate-Candy Cane Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6177268.jpg",
            "width": 3024,
            "height": 3024
        },
        "datePublished": "2006-11-15T20:10:24.000Z",
        "description": "Crushed candy canes transform chocolate cake into an engaging holiday delight.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT1H40M",
        "recipeYield": "18 servings",
        "recipeIngredient": [
            "1 (18.25 ounce) package chocolate cake mix",
            "1 pkg. (4 serving size)  JELL-O Chocolate Flavor Instant Pudding & Pie Filling",
            "4 eggs",
            "1 (8 ounce) container BREAKSTONE'S or KNUDSEN Sour Cream",
            "½ cup oil",
            "½ cup water",
            "4 (1 ounce) squares BAKER'S Semi-Sweet Baking Chocolate, chopped",
            "18 small candy canes, coarsely crushed, divided ",
            "1 (8 ounce) tub COOL WHIP Whipped Topping, thawed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F. Lightly grease two 9-inch round cake pans. Beat cake mix, dry pudding mix, eggs, sour cream, oil and water in large bowl with electric mixer on low speed just until moistened, stopping frequently to scrape side of bowl. Beat on medium speed 2 min. or until well blended. Stir in chopped chocolate and 2 Tbsp. of the crushed candy canes. Spoon evenly into prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 35 to 40 min. or until toothpick inserted in centers comes out clean. Cool 10 min. Loosen cakes from sides of pans with metal spatula or knife. Invert cakes onto wire racks; carefully remove pans. Cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place one of the cake layers on serving plate; spread evenly with 1 cup of the whipped topping. Top with remaining cake layer. Frost top and side of cake with remaining whipped topping. Sprinkle with remaining crushed candy canes just before serving. Store leftover cake in refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Kraft Desserts"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Kraft"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.923076923076923,
            "ratingCount": 13,
            "itemReviewed": "Chocolate-Candy Cane Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": null,
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-01-05T00:02:49.707Z",
                "reviewBody": "I have been making this cake for one of our Christmas Dinner desserts for years. It is an AWESOME cake. The only change I make to the recipe is to add a 1/2 teaspoon of peppermint extract to up the mintyness factor. Here are my tips: 1)Make sure you crush the candy canes that you put in the cake finely so that they sort of melt in the batter during baking so that you don't get a crunchy bit of hard candy in the cake. 2) I use Duncan Hines Fudge Cake mix. I have tried others and they are also good but the D.H.Fudge is the best. 3) Make sure that you chop the chocolate very fine or you will have large chunks of hard chocolate in your cake. 4) Don't sprinkle the candy canes on the cake until just before serving. They begin to liquify soon after making contact with the cool whip and won't be as pretty but the still will be delicious:) I usually crush the candy canes coarser for the top of the cake. If you are short on time you can crush them all in a ziploc bag at the same time once you are done crushing shake the bag this will cause the biggest pieces to go to the top. Skim off the bigger pieces for the top of the cake and add the finer dust to the cake itself.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "The Cook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1100654/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-09T00:23:46.377Z",
                "reviewBody": "Really delicious! Followed instructions for mixing the cake exactly except subbed mini choc chips for the chopped baking squares. I also baked it in a bundt pan instead of the 2 cake pans and served with a dollop of cool whip and a sprinkle of crushed candy canes. We loved the crushed candy canes in the cake and I don't think it changed the texture of the cake at all. Very moist and rich and definitely company worthy. Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Toasty Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2223426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-23T20:53:56.327Z",
                "reviewBody": "this cake is awesome! the perfect birthday cake or holiday cake. i used dark chocolate cake mix and that made it really dark and yummy. i omitted the candy canes and chocolate pieces. I did not want too much texture because the frosting i used had candy cane pieces and peppermint bark sprinkled on it already. try it! it is really moist and rich. serve in small pieces like cupcakes because it is really choclatey rich.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LittleChef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1077606/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-31T19:18:24.533Z",
                "reviewBody": "Very good! Like the last user I just made the basic cake and didn't add peppermint candy or chocolate chips. Because the mix seemed very thick I added 1/3 cup of 2% milk. Excellent cake! Better than the mix by itself which is good to begin with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/cindy3/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-24T20:49:41.473Z",
                "reviewBody": "I made this cake for the first time today. I followed the directions except I had to convert some unsweetened chocolate to semi-sweet. Overall the cake is good not too sweet. It didn't really have much peppermint flavor at all. Next time I would add more candy canes or peppermint extract.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7208979/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-29T18:48:15.44Z",
                "reviewBody": "Fantastic! I followed the recipe very closely substituting mini s/s chocolate chips because that seemed easier. I crushed the candy canes and used the small pieces in the cake the large pieces for decoration and then sprinkled with candy cane dust. The only real change I made was to make a mint buttercream frosting between the two halves of the cake (using creme de menthe) which made it even mintier and a little less cool whippy. The outside did turn pink after it had sat for about 1/2 an hour but I actually liked that - the candy cane powder made the cool whip taste slightly minty which was a bonus:) I took it to a party and it was devoured within minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2608642/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-08T03:40:10.777Z",
                "reviewBody": "I love this cake! I had some of my friends after school and we made this cake together. It was so much fun! The only changes I made were that I put it in a 9x13 pan rather than deal with the 2 circular pans I used a devils food cake mix and I made a simple cream cheese frosting which was amazing! Very excited to keep making this through the holidays. Highly recommend it:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hayley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20847934/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-12-28T08:02:15.72Z",
                "reviewBody": "Perfect dessert! Followed the recipe exactly tasted even better chilled! I ll definitely make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Michele Lee Rogers",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6149810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-07-27T06:44:27.24Z",
                "reviewBody": "My teen daughter made this cake and the whole family loved it!! The chocolate cake was the moistest richest chocolate cake we've ever made. I will use the cake recipe as my go-to chocolate cake recipe in the future. We did tweak the rest of the recipe in several ways... Since the kids have braces we had to substitute the crushed candy canes with chopped up Andes mints (which were very tasty). Also we used vanilla frosting from a tub instead of the whipped topping. It's nice to have a new chocolate cake recipe and this will also make a great desert for the holidays.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Julesintheheartland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4948725/"
                }
            }
        ]
    }
]