[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
                    "name": "No-Bake Pie Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17367/desserts/pies/no-bake-pies/pudding-pie/",
                    "name": "Pudding Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/136917/french-silk-chocolate-pie/",
        "name": "French Silk Chocolate Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F993379.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "2007-02-23T02:31:20.000Z",
        "description": "Replacing the raw eggs in this recipe with pasteurized eggs or fat-free egg product eliminates food safety concerns and allows you to enjoy this Bake-Off&reg; Contest favorite.",
        "prepTime": "P0DT0H50M",
        "cookTime": null,
        "totalTime": "P0DT2H50M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 Pillsbury® refrigerated pie crust, softened as directed on box",
            "3 (1 ounce) squares Hershey®'s unsweetened chocolate, cut into pieces",
            "1 cup LAND O LAKES® butter, softened (do not use margarine)",
            "1 cup sugar",
            "½ teaspoon vanilla",
            "4  large eggs pasteurized eggs or equivalent fat-free cholesterol-free egg product",
            "½ cup sweetened whipped cream",
            "½ tablespoon Chocolate curls"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oven to 450 degrees F. Make pie crust as directed on box for One-Crust Baked Shell using 9-inch glass pie pan. Bake 9 to 11 minutes or until light golden brown. Cool completely, about 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In 1-quart saucepan, melt chocolate over low heat; cool. In small bowl with electric mixer, beat butter on medium speed until fluffy. Gradually beat in sugar until light and fluffy. Beat in cooled chocolate and vanilla until well blended.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add eggs 1 at a time, beating on high speed 2 minutes after each addition; beat until mixture is smooth and fluffy. Pour into cooled baked shell. Refrigerate at least 2 hours before serving. Garnish with whipped cream and chocolate curls. Store in refrigerator.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "No-Bake Pie Recipes",
            "Pudding Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Pillsbury"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.699074074074074,
            "ratingCount": 216,
            "itemReviewed": "French Silk Chocolate Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "428.2 calories",
            "carbohydrateContent": "33.5 g",
            "cholesterolContent": "130.3 mg",
            "fatContent": "30.9 g",
            "fiberContent": null,
            "proteinContent": "4.8 g",
            "saturatedFatContent": "17.7 g",
            "servingSize": null,
            "sodiumContent": "306 mg",
            "sugarContent": "21.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-12T16:23:35.853Z",
                "reviewBody": "Ohhhhhhhh, decadence.  A mile-high version of the traditional French Silk Pie (see other recipe on this site).   It seems to be updated, calling for pasteurized eggs or egg substitute, but I'm not intimidated by raw eggs, so I just used four fresh, large eggs (and lived to tell about it without incident).  As you beat it, it gets fluffier and fluffier, as well as lighter in color.  For color and taste I thought an Oreo cookie crust might be even better, so I made a crust of 24 regular-size Oreo cookies and 1/4 cup melted butter.  Had I used a traditional pie crust I might have liked this with one more square of melted chocolate.  Very rich, so cut slices accordingly.  This is most likely why the French Silk Pie recipe I'm used to calls for half this amount of filling (and then of course you bury it under a couple inches of whipped cream). I garnished this with fresh whipped cream, raspberries, and mini chocolate chips.  And as it turned out, I found I actually do prefer the pie with the Oreo crust.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-02T15:24:22.8Z",
                "reviewBody": "Great recipe! I too did this with raw eggs and everything seemed to work out just fine. I was just very careful with watching my temperatures.   The kids loved this one too. I'll be making this again for sure!\n\nOk, made this again, and this time I reduced the sugar by 1/4 cup (to 3/4 cup instead of 1 cup), and it came out even better. My daughter said the first go, at full sugar, was too sweet. I cut it back and it still got raves. I'll have to try it at 1/2 cup and see what that does. Still an excellent pie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Marvin Williams",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2599475/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-04T01:02:28.053Z",
                "reviewBody": "Couldn't stop licking the bowl, utensils, etc. this is so good...with my changes....I only added 3 eggs and I added another ounce of chocolate because I wanted a more chocolatey, dense pie.  I used the paddle attachment on my stand mixer for everything except eggs-then switched to wire whip and beat on high. Filled a premade baked pie crust just fine.   ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gloria Rice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-22T18:53:02.217Z",
                "reviewBody": "Wow!!!! This was absolutly amazing! I was a bit worried while making this that it wasn't going to turn out, because upon tasting it it tasted grainy. After adding the eggs this was much better. I used a pre-made Keebler shortbread pie crust. I didn't have any chocolate squares, so I melted 1 tbsp shortening with 3 tbsp cocoa for each oz. of chocolate. Update 1/22/12, I have made this pie several times and it is always amazing. I recently made it again and used egg substitute and it ruined my pie! They would not blend into the rest of the ingredients and it turned my filling into a cottage cheese like filling, wound up throwing it out! From here on out I will always use real eggs!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jog Dish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2967134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-22T07:12:02.37Z",
                "reviewBody": "I have made this several times.  It is one of my husband's very favorite desserts.   I have tried it with a rolled out crust and with crumb crust and by far a chocolate cookie crust is best with this recipe.   I was amazed that this recipe didn't get all 5 stars.  It is smooth, silky and beyond description delicious.   I read the reviews here and on the Pillsbury site and I think the problems come from  substituting ingredients and from not following the order exactly.  Never use margarine and never use egg substitutes.  The chemistry won't work if you make substitutions.   Egg substitutes don't have yolks in them.    Yolks act as emulsifiers and yolks are what turn the granulated sugar into spun silk.   I also suspect that people aren't beating the mixture for a full 2 minutes between each egg which adds up to whole 8 minutes of beating.   I use my Kitchen Aid mixer and a timer.  I scrape my bowl down after each egg and after 2 eggs I take the beater out and carefully scraped down the bowl even more throughly.  It is the beating along with those yolks that make this pie perfectly silky.  If the filling is gritty then you probably didn't beat the batter enough between adding eggs enough or you substituted ingredients.   I used pasteurized shell eggs as suggested.  That is not the same as egg beaters!  You need real shell eggs not anything from a carton.  If you can't find them, I maintain that it is better to wash and dry your eggs because the contaminates are on the shell.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kaththee1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2111303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-30T17:59:02.953Z",
                "reviewBody": "Awesome! I made 4 pies from this recipe.  The first two were very soup like.  I was using what I thought was butter but it was margarine!  When I got it right and used the butter, it was divine!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RaeBrom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5007983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-03-08T18:58:12.54Z",
                "reviewBody": "Love, Love, Love. I did a store-bought Oreo crust, 4 ounces of Ghirardelli chocolate, and covered the whole thing in whipped cream and grated some Ghirardelli semi-sweet chocolate for garnish. I whipped the butter and sugar with the paddle on my KitchenAide stand mixer, and used the whisk for the chocolate and eggs. I beat the eggs for at least 5 mins each, and the pie set like a dream! I smothered it in whipped cream (1 1/2 cups whipping cream, 2 T. sugar, 1/2 tsp vanilla). It turned out smooth, rich, creamy, wonderful! Can't wait to bring this to a party! I will never go to Baker's Square again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "snowmommy22",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/snowmommy22/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-16T23:37:46.22Z",
                "reviewBody": "Loved it! Only suggestion would be to separate the eggs, blending in the yolks as called for but whipping up the whites then gently folding them in for increased volume.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FairyPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/fairyprincess/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-23T21:55:36.237Z",
                "reviewBody": "I will never try another french silk pie recipe. This is the best one. I can not imagine a better one. I made this for my husbands birthday and it was simply amazing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "wholewheatbaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3282239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-19T23:43:34.87Z",
                "reviewBody": "I made 4 French silk pies to compare and get the best recipe. This was the worst by far! Think of making cookies....butter sugar eggs. Now take that mixture and put it in the fridge. That is what this recipe is other than a little cream and chocolate added. I would give zero stars if I could.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Apple",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3868139/"
                }
            }
        ]
    }
]