[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/917/side-dish/potatoes/",
                    "name": "Potato",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/141785/syracuse-salt-potatoes/",
        "name": "Syracuse Salt Potatoes",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F9392569.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2007-05-10T16:54:32.000Z",
        "description": "Salt potatoes are a regional specialty of Syracuse, New York, a.k.a. The Salt City. Salt potatoes date to the 1800s, invented by local salt mine workers who created a simple and inexpensive lunch by boiling small potatoes in brine. The potatoes are still very popular today with the Central New York crowd, making an incredibly easy and delicious side dish.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "4 pounds new potatoes",
            "1 ½ cups fine salt",
            "8 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Wash the potatoes and set aside. Fill a large pot with water; stir in salt until it no longer dissolves and settles on the bottom. Place potatoes in the pot and bring to a boil; reduce heat and simmer until potatoes are tender but firm, about 15 minutes. Drain; cover to keep hot.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the potatoes are cooking, melt the butter in a small pan over medium high heat, or in microwave. Serve immediately poured over potatoes.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Potato"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "kaspmary"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.651933701657459,
            "ratingCount": 181,
            "itemReviewed": "Syracuse Salt Potatoes",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "276.6 calories",
            "carbohydrateContent": "39.7 g",
            "cholesterolContent": "30.5 mg",
            "fatContent": "11.7 g",
            "fiberContent": "5 g",
            "proteinContent": "4.7 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "95.4 mg",
            "sugarContent": "1.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-09-09T17:51:36.26Z",
                "reviewBody": "I have made these potatoes several times now, using baby reds... and they are WONDERFUL!  I think it should be noted for people (such as Aspiring Chef Rita) that the recipe calls for WHOLE potatoes, washed only... do not cut the potatoes up and do not peel them otherwise they will absorb the salt and become too salty.  When they are fork tender (about 15 minutes for me) drain them and let them sit to form the thin salt crust.  I sometimes add chives to my melted butter, just for some color and added flavor even though I know it is not traditional.  I have also boiled reds side by side, one pot with amount of salt this recipe calls for and one pot with just a little salt...and it's amazing how the salty brine makes the salt potatoes so creamy inside!  Made correctly, they are NOT salty... just creamy and delicious!  I served them alongside slow-roasted BBQ baby back pork ribs... mmmmmmmm... wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sourdough girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/453904/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-23T21:46:13.523Z",
                "reviewBody": "I was introduced to these salt potatoes a couple of years ago while visiting friends in upstate New York. I learned they were a big deal to people there, and I was eager to try the bag/kit of salt potatoes she picked up. The concept, she explained, was that the potatoes were boiled in copious amounts of salt that somehow made them flavorful and special. They were good, I thought, but tasted just like regular ol' boiled potatoes to me. In fact, they needed...salt! When I came across this recipe, I just had to try them again myself at home.  And once again I found them good, but tasting no different than regular ol' boiled potatoes - that needed...salt! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2017-02-03T21:55:25.183Z",
                "reviewBody": "DO NOT cut the potatoes prior to cooking! \nIf only you could taste these with the Cornell barbecue chicken that one can find about any weekend of the summer around here(Ithaca, NY/Cornell area)you'd know what it's all about!!  You want them nice and tender, with plenty of butter, but not falling apart.  Also, make sure you are using small, young potatoes- not too big.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TRAPPERS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1451001/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-30T18:38:09.003Z",
                "reviewBody": "first, i want to say thank you for the recipe. I've never measured in terms of cups, it's always been a quarter pound of salt to every pound of potatoes. For all the people saying that these are regular boiled potatoes, they are too salty, not salty enough, etc.. the purpose of the salt is not so much to make the potatoes salty as it is to lower the boiling point of the water. With the different boiling point, it makes the flesh of the potato creamier than normal boiling and less starchy. As for the saltiness/needs salt problem, you may need to adjust the amount of water that you use. It doesn't specify in the recipe, but for this amount of salt and potatoes, you need 3 quarts of water. If you aren't using enough, you might as well eat the salt shaker and skip the potatoes",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rylee Marie West",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/376995/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-03T16:59:59.28Z",
                "reviewBody": "Okay, with 113 reviews on this recipe, I seriously doubt that MY review will ever be read but I'm posting it anyway. :D I love reading stories about architypal food that our ancestors ate. I stumbled upon an article on wikipedia about Syracuse Salt Potatoes and was absolutely enthralled with the story of Irish Salt Miners from the turn of the century. On Wikipedia, they had two recipe links. I followed THERE recipes and my family and I enjoyed a treat STRAIGHT FROM HEAVEN!!!! This is what I learned: 1) Use ONLY \"NEW yellow or white potatoes!!!\" Never-ever use red skin potatoes!!! 2) The ratio of salt to water is 1 cup of KOSHER SALT (never table salt) to 6 cups of water. 3) The salt must be completely dissolved IN the water before you put in the potatoes. 4) Boil them until tender, drain but DO NOT RINSE. Allow to cool until you can eat them and use melted butter to dip them into. I'm telling you, Syracuse Salt Potatoes will be served in our home from now on! :D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ELDERBERRYBABY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/816214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-04T21:57:22.2Z",
                "reviewBody": "I've lived in the Syracuse area all my life...they are Always a summertime staple, the Best one's are the Hinderwadle's, some stores carry their \"own\" brand, but the Hinderwadle's are the \"traditional\" Salt Potato..for those who aren't too big on using the whole bag of salt when cooking the potatoes, try using a little more than half the bag. I always let the potatoes sit covered after draining for a bit before serving.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ITSALLGOOD1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1387041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-16T11:11:09.493Z",
                "reviewBody": "I love salt potatoes.  I used to live in Binghamton and would always get them at a local spiedie restaurant.  I am not really a potato lover but made like this, they are so yummy.  Make sure the potatoes are nice and small - so you can just pop them in your mouth in one bite!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOYBOWES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/852895/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-19T15:42:56.78Z",
                "reviewBody": "I hate to spoil the 5 star rating but I have to. Straight away you know that the amount of salt and butter used in this recipe is not good for you but since I love potatoes I decided to go for it. No one ate more than a few bites!!! The salt was a killer. One person said that this was suicide on a plate. In any event - for all those salt lovers - go for it!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Aspiring Chef Rita",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615195/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-24T13:26:16.99Z",
                "reviewBody": "The author forgot to add that salt potatoes are a summer cookout dish! In fact they are a staple at any clam bake BBQ or cookout in CNY. I don't think I could eat them in the middle of winter. But they go great with hotdogs on the grill and some corn on the cob or even with some steamed clams. I am a CNY native and always had salt potatoes growning up I never knew they were regional until recently.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CUTEMIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1186247/"
                }
            }
        ]
    }
]