[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/201/meat-and-poultry/chicken/",
                    "name": "Chicken",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/659/meat-and-poultry/chicken/chicken-breasts/",
                    "name": "Breast",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/143082/sweet-sticky-and-spicy-chicken/",
        "name": "Sweet, Sticky and Spicy Chicken",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F7245774.jpg",
            "width": 0,
            "height": 0
        },
        "datePublished": "2007-06-08T21:57:59.000Z",
        "description": "This chicken dish uses skinless boneless chicken breasts and tastes delicious. It's great as an appetizer or as a main dish served with rice and a veggie.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H12M",
        "totalTime": "P0DT0H22M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 tablespoon brown sugar",
            "2 tablespoons honey",
            "¼ cup soy sauce",
            "2 teaspoons chopped fresh ginger root",
            "2 teaspoons chopped garlic",
            "2 tablespoons hot sauce",
            "salt and pepper to taste",
            "4 skinless, boneless chicken breast halves - cut into 1/2 inch strips",
            "1 tablespoon vegetable oil"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together brown sugar, honey, soy sauce, ginger, garlic and hot sauce in a small bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lightly salt and pepper the chicken strips.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a large skillet over medium heat. Add chicken strips and brown on both sides, about 1 minute per side. Pour the sauce over the chicken. Simmer uncovered until the sauce thickens, 8 to 10 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Chicken",
            "Breast"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "katemartinodotcom"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.490744821507272,
            "ratingCount": 4538,
            "itemReviewed": "Sweet, Sticky and Spicy Chicken",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "232.4 calories",
            "carbohydrateContent": "13.9 g",
            "cholesterolContent": "59.3 mg",
            "fatContent": "9.3 g",
            "fiberContent": "0.2 g",
            "proteinContent": "22.8 g",
            "saturatedFatContent": "2.2 g",
            "servingSize": null,
            "sodiumContent": "1176.2 mg",
            "sugarContent": "12.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-14T20:36:38.407Z",
                "reviewBody": "Sweet...yes.  Spicy...yes.  Sticky...no Very good flavor but I had the same problem other reviewers mentioned about the sauce not thickening up. I will make it again with the following changes: 1. Dredging the chicken strips in flour before sauteing, which will help them brown better and help thicken the sauce. 2. Saute on med.-high heat instead of medium. The heat called for in the recipe is not enough to sear the chicken. 3. Simmer the sauce while I am preparing the chicken, then add to the chicken as called for. Because, it took much longer than 8-10 minutes to reduce the sauce, and the chicken dried out. I should add my husband loved this recipe. The flavors are good. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "rebecca",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1095080/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-07T02:15:59.4Z",
                "reviewBody": "A-MA-ZING...simply amazing!  I followed the advice of other reviewers and dredged the chicken in flour first.  Then I sauteed an onion and some peppers and set aside.  Next was to quickly sear/brown bite-sized pieces of chicken (you want that crunchy coating) and added the sauce and cooked veggies to simmer.  For the hot sauce you MUST use Sriracha Hot Chili Sauce (Rooster Sauce).  It MAKES the dish.  My chicken was sticky, sweet and spicy just the way it was supposed to be.  What an amazing flavor profile.  I'm thrilled with this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMASPICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704352/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-25T00:49:04.487Z",
                "reviewBody": "AWESOME AWESOME chicken. Used ground ginger and 1 tbs. of hot sauce but could hardly taste it. If you like spicey, use both. My came out VERY sticky! Here's what I did: cut up chicken into small chuncks, put in bag with flour and shake until lightly coated. Put in frying pan at #8 of 10...very hot, until started to really brown. Took several minutes. Then I added the sauce, tossed, dropped to #3 and put lid on until rice was done, probably 15 minutes. Continue to use the same pan even though the chicken sticks and burns on the botton!!!! All that stuff makes it sticky! Will make again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christy Vella Noland",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1334796/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-28T16:39:29.4Z",
                "reviewBody": "I followed the recipe pretty much exactly.  I did notice that when I poured the sauce over the chicken, it seemed to be taking way too long to reduce.  I was also afraid of over-cooking the chicken, so I took it out of the pan.  When the sauce reduced to a thick molasses constistancy, I put the chicken back in to coat it.  I think the juices of the chicken were keeping the sauce from reducing properly and I wanted the chicken juice in the chicken, not the sauce.  This came out good and we enjoyed it, but the chicken was a trifle dry.  Next time I'll remove the chicken as soon as it's browned, reduce the sauce and then add the chicken back.  Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Dianemwj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1415737/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-29T04:21:36.157Z",
                "reviewBody": "Really delicious, tastes like something from a local restaurant that we really like. I did make several modifications though. I lightly floured the chicken and then seared it in a pan sprayed with Pam on medium high, and sprayed the chicken while cooking instead of using oil. Turned down to low after chicken was browned before adding the sauce. I used 3 Tbps of soy sauce, an extra tablespoon of brown sugar because we like our meat sweet, and used squeeze tubes of garlic and ginger which gave the sauce a thicker consistancy and made it super easy to cook & thicken, it was finished in minutes! Also, I added a chopped sauteed vidalia onion, so good with the sauce! Served over rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kieria",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3163713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-28T22:55:46.477Z",
                "reviewBody": "Delicious, easy, and quick dinner. In addition to suggestions from other reviewers, I use low-sodium soy sauce and lots of vegetables. I also like to top the final dish with chopped toasted cashews.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MissyMoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2777260/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-21T17:38:04.147Z",
                "reviewBody": "I try lots of new recipes and this is the best one I've tried in a long time.  It scored a huge homerun with hubby and all three kids (5, 8, 11).  It is a rare feat to find something that everyone raves about.  Just the right mix of sweet and spicy. So quick, simple and made with ingredients I always have on hand.  I'll be making this over and over again. FYI:  I doubled the sauce and dredged the chicken in flour, salt and pepper before frying.  I cooked the chicken in two batches, cooked it until completely done, then added 1/2 of the sauce. It \"stickied\" up quickly and I didn't need to cook it the extra 8 minutes the recipe calls for.  I think it might have burnt if I had done that.  My 11-year old couldn't stop raving - \"Mom, this is like the stuff you get at the Chinese restaurant only 10 times better!\" Give this one a try!  UPDATE:  My kids asked for this a second time this week and I obliged!  I tripled the sauce this time thinking I'd like some extra sauce to serve over rice.  BIG MISTAKE - it thickened up too much and wasn't saucy enough to serve over rice.  AND it also completely changed the taste and texture - the sauce was overwhelming and the chicken was \"goopy\" rather than \"sticky\" like the last time I made it.  We were all disappointed with the way it turned out tonight. I will stick with the way I made it the first time.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TheBaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1409413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-22T18:19:10.213Z",
                "reviewBody": "With a few tweaks this could be a staple in the dinner rotation.  I had to use powdered ginger because when unpacking the groceries they had forgotten to pack the fresh ginger...and how many times has THAT happened?  A lot!  I also doubled the sauce amount and it turned out to be too much/too intense.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melinda Kemppainen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/979983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-26T18:42:00.843Z",
                "reviewBody": "Exactly what I have been looking for in a asian type recipe.  My 12 year old son loved it - as did all of us.  After reading the other reviews I did tweak the recipe and it turned out perfect.  We like a lot of sauce, so I doubled the sauce and cut the amount of chicken in half.  I did put the chicken in flour first like other readers suggested.  Also, since so many had problems with the sauce thickening, I made up the sauce in a bowl and then added about 1/2 tbls of corn starch mixed in with about 1/4 cup water.  I mixed this into the sauce before I cooked it.  It turned out perfect.  I also adjusted the amount of hot sauce (used asian chilie sauce), garlic and ginger to our taste.  I also cooked up a frozen bag of asian type (stir fry) vegtables and added them to the chicken and sauce at the end.  Added water chestnuts too, which were so good in the sauce.  Can't wait to make this again!  My son is so picky, so when he eats a whole bowl of anything, you know it is good!  Someone said the soy sauce taste is very strong, and it is, but we like salty and soy sauce.  However, next time I might cut back on the soy sauce a bit.   Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhonda Grisak",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3579271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-28T22:02:18.36Z",
                "reviewBody": "It was neither sweet nor sticky but had an overwhelming soysauce flavor. Won't make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LynnInHK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/422932/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Sweet, Sticky and Spicy Chicken",
            "description": "Strips of chicken breast simmer in a sweet, spicy, gingery sauce.",
            "uploadDate": "2013-12-03T20:39:04.131Z",
            "duration": "PT2M46.784S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F84577f91-eb3a-448c-9c39-25d51293cca4%2F4b6d5d22-a33b-4904-9adf-0e922a44d1df%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2890070475001"
        }
    }
]