[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17472/trusted-brands-recipes-and-tips/mazola/",
                    "name": "Mazola&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/153606/pork-carnitas-with-cilantro-tomatillo-sauce/",
        "name": "Pork Carnitas with Cilantro Tomatillo Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3163112.jpg",
            "width": 4032,
            "height": 3024
        },
        "datePublished": "2007-11-08T20:31:02.000Z",
        "description": "Slow cooking blends the flavors.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT1H20M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 pound pork shoulder",
            "2 tablespoons Mazola® Corn Oil",
            "¼ cup chopped onions",
            "½ teaspoon Spice Islands® Garlic Powder",
            "1 tablespoon Spice Islands® Chili Powder",
            "¼ teaspoon Spice Islands® Chipotle Chile Powder",
            "2 tomatillos, finely chopped",
            "½ cup finely chopped tomatoes",
            "¼ cup coarsely chopped fresh cilantro",
            "4 corn tortillas"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cut pork into 1 inch cubes; season with salt and pepper. Heat oil in large skillet or Dutch oven. Add pork, onions, garlic powder, chili powder and chipotle chile powder; saute 3 to 5 minutes to brown the meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add enough water to barely cover pork. Bring to a boil; cover, reduce heat and simmer 30 minutes. Remove lid and continue to simmer an additional 45 minutes or until liquid has evaporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine chopped tomatillos, tomatoes and cilantro in a small bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place an equal amount of pork on each tortilla. Top with tomatillo salsa.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "Mazola&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Mazola"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.484848484848484,
            "ratingCount": 99,
            "itemReviewed": "Pork Carnitas with Cilantro Tomatillo Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "261.7 calories",
            "carbohydrateContent": "16 g",
            "cholesterolContent": "56.4 mg",
            "fatContent": "14.4 g",
            "fiberContent": "3.3 g",
            "proteinContent": "18.3 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "87 mg",
            "sugarContent": "2.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-11-10T14:42:57.85Z",
                "reviewBody": "This recipe was EASY and the most delicious pork carnitas I've ever tasted! I started by browning the pork on the stove as recommended but then instead of simmering on the stove we popped it in the crock pot for 4 hours on high. I didn't have Chipotle chili powder so I just used a little extra regular chili powder. I also couldn't find pork shoulder so we used pork tenderloin instead (it was on sale!). I used our small food processor to make the tomatillo sauce and it worked really well. We will definitely make this recipe again soon!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bujiating",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3272877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-10T22:06:15.133Z",
                "reviewBody": "Due to all the reviews I'd seen so far I halved this recipe. One half was made exactly as written - I'd give it a 3. It was delicious but not enough flavor for our family (referring to both the salsa and the meat.) The other half I tweaked to our liking. I'd rate that a 5 as there were no complaints however my rating here will reflect 'as is':) After browning the meat as written my changes were: we added more of each seasoning it called for (to taste) and finished the meat in our slow cooker. Instead of covering it in water I used Herdez Pasilla sauce for extra flavor. We topped it with tomatoes green onions tomatillos shredded cheddar cheese and a small squeeze of ranch dressing for the kids. So tender and great flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Faith N",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/faithn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-01T12:32:37.157Z",
                "reviewBody": "Made this for New Years Eve dinner it was a BIG hit!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "lowie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3389687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-09T17:41:42.003Z",
                "reviewBody": "Delicious! The pork comes out moist, tender, and full of flavor - plus it was easy to make. I used pork tenderloin (on sale) and combined all the spices in a ziploc bag then tossed in the pork so it was evenly coated. After browning, I cooked it in the crock pot for 4 hours on high with a minimal amount of water. The last hour I tossed in the onion. The tomatillo salsa needed just a little more flavor so like others I added in some garlic, red onion, a pinch of salt and a little fresh lime juice. I served these over white corn tortillas that I warmed in the oven topped with salsa, avacado slices, sour cream and a splash of fresh lime. Great with a side of Spanish rice and a margarita on the rocks! Thanks for a great recipe Mazola!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-02T17:41:24.813Z",
                "reviewBody": "My family loved the tender pork. I live at high altitude and the meat did take longer to cook then stated in the directions. I used 2 pounds of pork shoulder and removed the fat. I found some chipolte powder online and use it in a lot of Mexican dishes. My family loves carnitas with flour tortillas so I prepared my own flour tortillas recipe and it was great. The tomatillo sauce was very mild so my husband added onion jalapeno peppers garlic salt and lime juice to give it a kick.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lela",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lela/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-15T23:50:09.877Z",
                "reviewBody": "I followed the recipe exactly and it was amazing!!! The salsa has such a vibrant taste and the pork came out SO tender!!! Unless you want to wait longer to eat there is absolutely NO need to use a slow cooker!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "thedailygourmet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thedailygourmet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-06-30T02:44:27.847Z",
                "reviewBody": "SCRUMPTIOUS!!! I have to admit I was a little skeptical of this recipe, because this isn't really a traditional \"carnitas\" recipe where the meat is roasted/braised and then shredded.  Nobody messes with my carnitas! But I thought i'd give this a chance and am I ever glad I did! This is a lot quicker than making traditional carnitas and the meat is packed with flavor. Whatever you do, PLEASE make sure you buy pork shoulder (or boneless Country Style Ribs cut from pork shoulder).  This is a well-marbled cut of meat and the fat renders down and gives the meat such a tender, buttery flavor that can't be matched by leaner cuts like tenderloin or loin.  Very few ingredients are needed in this recipe. I made it exactly as is and can see myself making it over and over. I almost ate the whole thing to myself! You don't need anything else but the meat and the tomatillo salsa (it's not really a sauce!).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "France C",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/francecevallos/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-08T21:26:03.87Z",
                "reviewBody": "This was a little too hot for my tastes. However it was quite easy to make and the overall flavor was pretty descent. I followed the meat recipe except I used pork tenderloin. That is what my grocery store had. I think cutting up the pork was the most time consuming part. I thought I had the chipotle powder or something similar. When I realized that was not the case I used 1 Tblsp. of minced chipotle peppers in adobe sauce. So that may have contributed to the heat not sure. I wanted so badly to tweak the topping by adding avocado and avocado sauce or some type of white spicy sauce to give a creamy like topping to the tacos they needed In my opinion. I did like the flavor of the base salsa though. I don't typically make salsas or sauces with tomatillos. I suggest playing with the toppings though as almost anything can be added and would go nicely with the pork and tomatillo salsa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-14T19:14:25.913Z",
                "reviewBody": "I made this while my parents brother and grandmother were visiting so I doubled the recipe and it was a big hit with everyone other than my picky little boys. I was out of regular chili powder and I didn't want it to be too spicy for the kids so I just used a little more of the chipotle powder than called for in the recipe. It did take about 45 minutes longer than stated in the recipe for it to thicken up. The cilantro tomatillo sauce is definitely more like a pico. It seemed a little bland to me so I added the juice of one lime and some salt and pepper to taste and it was great. I also fried the corn tortillas so that they were slightly crispy and added cheese and avocados to our carnitas and served with rice and black beans. I will definitely be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Alana Kadas",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/alanakadas/"
                }
            }
        ]
    }
]