[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/153615/poached-eggs-caprese/",
        "name": "Poached Eggs Caprese",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4513899.jpg",
            "width": 2787,
            "height": 2787
        },
        "datePublished": "2007-11-08T22:54:38.000Z",
        "description": "A delicious dish inspired by eggs Benedict with mozzarella, tomatoes, and pesto.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H20M",
        "recipeYield": "2 servings",
        "recipeIngredient": [
            "1 tablespoon distilled white vinegar",
            "2 teaspoons salt",
            "4 eggs",
            "2 English muffin, split",
            "4 (1 ounce) slices mozzarella cheese",
            "1 tomato, thickly sliced",
            "4 teaspoons pesto",
            "salt to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Fill a large saucepan with 2 to 3 inches of water and bring to a boil over high heat. Reduce the heat to medium-low, pour in the vinegar and 2 teaspoons of salt, and keep the water at a gentle simmer.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While waiting for the water to simmer, place a slice of mozzarella cheese and a thick slice of tomato onto each English muffin half, and toast in a toaster oven until the cheese softens and the English muffin has toasted, about 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Crack an egg into a small bowl.  Holding the bowl just above the surface of the water, gently slip the egg into the simmering water. Repeat with the remaining eggs. Poach the eggs until the whites are firm and the yolks have thickened but are not hard, 2 1/2 to 3 minutes. Remove the eggs from the water with a slotted spoon, and dab on a kitchen towel to remove excess water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To assemble, place a poached egg on top of each English muffin. Spoon a teaspoon of pesto sauce onto each egg and sprinkle with salt to taste.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Yoojin K"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.717391304347826,
            "ratingCount": 92,
            "itemReviewed": "Poached Eggs Caprese",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "482.1 calories",
            "carbohydrateContent": "31.7 g",
            "cholesterolContent": "411.6 mg",
            "fatContent": "24.9 g",
            "fiberContent": "1.2 g",
            "proteinContent": "33.3 g",
            "saturatedFatContent": "10.3 g",
            "servingSize": null,
            "sodiumContent": "3092.7 mg",
            "sugarContent": "3.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-03-20T00:09:32.563Z",
                "reviewBody": "I've made this three times. The first time I followed the recipe exactly, using skim milk/pre-sliced mozzarella, fresh homemade pesto, and the best off-season tomato I could find. I had a little trouble poaching the eggs in the simmering water but I finally got it right. ============ Overall, I thought the results were somewhat lackluster. Maybe it was my expectations: this recipe may have been \"inspired by eggs Benedict\" but despite the English muffin, this isn't even close. This is really a just a caprese salad on a poached egg. =========== The second time, I made a trip to the specialty store and bought a ball of real, whole milk mozzarella. Wow! What a difference that makes! I poached my eggs in my handy little poaching cups, and I topped the whole thing off with some easy, cheesy Bechamel sauce. This was awesome. All the different flavors really complemented each other and teased my taste buds with delight! ============ Last night, I made it a third time, using real Hollandaise. Now I think I've found the almost perfect dish. In a couple of months, when I can get a home grown tomato, then it will be perfect! A wonderful vegetarian alternative to eggs Benedict, and with some fresh fruit on the side and a mimosa to sip, the best brunch ever to treat guests or just yourself.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "January",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3348190/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-19T18:35:56.087Z",
                "reviewBody": "Nice Italian twist on Eggs Benedict!  This was perfect for Sunday breakfast.  I toasted my English muffins and then added the rest of the ingredients, not bothering to heat antyhing in the toaster oven.  I used plum tomatoes that I sliced less than thick and opted for fresh basil vs. pesto.  I sprinkled everything with a bit of sea salt and fresh cracked black pepper - delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T21:31:34.05Z",
                "reviewBody": "I think we have a winner here. I made this for a Brunch. We had 10 people over for Brunch  so I made 14 servings. I knew the taste of some of our guests and so I knew I was going to have to offer more toppings other than just the pesto. Also, 4 of them I left the tomato off, just in case and it's a good thing I did. I made the muffins and placed them on a heated platter. I did everything except put on the psto sauce. I made 6 sauces to go with them. The pesto sauce, a hollendaise sauce, a cheese sauce, a Italian flavored sauce, a cream sauce, and a salsa. Those I put into my old fashioned Lazy Susan with dipping spoons so each could top theirs with what ever they liked. Most of the guests took small servings of several sauces. The ones without the tomato, I put sausage/bacon patty. The guests ended up using the sauces almost as dipping sauces. Taking a piece of muffin and dipping it in a different sauce each bite. The muffins/cheese/eggs were a hit. The ones with the sausage and no tomato were a hit. The sauces were a hit. Gotta' tell you, it was one of my better offerings. If you want a winner, this is it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kitten",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kitten/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T19:19:42.38Z",
                "reviewBody": "I have been making something similar to this for years.  I made this exactly as written.  I got an egg poacher that you use in the microwave that is fabulous.  You can have a poached egg in 35 seconds and no dirty pan!  I think the pesto sauce is to overpowering for the delicate egg moz and tomato combo.  I think a fresh leaf of basil is all you need.  With some modifications this could be a real winner- without the pesto.  Thanks for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SWEETJAM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/745460/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-14T17:46:38.01Z",
                "reviewBody": "I just used this recipe for the correct technique for poaching an egg and it worked perfectly! I poached 2 eggs beautifully the first time I've ever tried.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "footballgrl16",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4002607/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-25T16:44:14.463Z",
                "reviewBody": "Absolutely delicious! I made my own fabulous fresh pesto to top the poached egg. The egg poached nicely although it did take several extra minutes of simmering & a gentle dunking to cook the egg white on top of the yolk. I will make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhianna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3509016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-18T21:37:42.68Z",
                "reviewBody": "This is the first time I've made poached eggs. I was surprised that the egg was actually pretty good since I've never had one. But the tomato being thickly sliced that is all I could taste. I liked the pesto on it but I think the tomato should be thinner. And I had problems poaching the eggs in simmering water so I put it at a full boil and that worked much better. Sorry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-29T23:40:17.827Z",
                "reviewBody": "Poached is my favorite way of eating an egg so I was all about this recipe. As much as I love eggs benedict this was a delicious change not to mention healthier too. Thanks so much Yogin!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-18T12:14:16.677Z",
                "reviewBody": "I made the poaching process a little easier by turning off the water when it began to boil. After that I added the vinegar and salt and then slipped the eggs in gently as described by the recipe. I covered and let the eggs cook without simmering. Because they are not moving at all they are much more \"together\" and I removed them after 10 minutes. I followed the rest of the recipe and the combination of pesto with the eggs and mozza was divine! Loved it - thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mommysnagpants",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7332605/"
                }
            }
        ]
    }
]