[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
                    "name": "Fish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/417/seafood/fish/tilapia/",
                    "name": "Tilapia",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/160042/crispy-chipotle-lime-tilapia-with-cool-avocado-sauce/",
        "name": "Crispy Chipotle Lime Tilapia with Cool Avocado Sauce",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F955829.jpg",
            "width": 2611,
            "height": 2621
        },
        "datePublished": "2008-01-29T23:35:06.000Z",
        "description": "My husband loves this zesty Southwestern-style fish. You can make it with any of firm whitefish--like cod or halibut--if tilapia isn't available. You can even use boneless, skinless chicken breasts. I usually make a package of red or black beans with rice to serve with it while the fish cooks. If you have any leftovers, they make great fish tacos.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 canned chipotle pepper in adobo sauce",
            "2 tablespoons adobo sauce from the can",
            "¼ cup salsa",
            "1 tablespoon lime juice",
            "4 tilapia fillets",
            "½ (8 ounce) package tortilla chips, crushed",
            "1 small avocado - peeled, pitted, and cut into large chunks",
            "¼ cup sour cream",
            "1 tablespoon lime juice",
            "3 tablespoons milk",
            "salt and pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375  degrees F (190 degrees C). Grease a baking sheet with cooking spray.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the chipotle pepper, adobo sauce, salsa, and 1 tablespoon lime juice in a blender and blend until smooth; brush the mixture over both sides of each tilapia fillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the crushed tortilla chips into the bottom of a deep dish; dredge the coated fillets in the chips to coat. Arrange the fillets on the prepared baking pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake the fillets 15 minutes; turn and lightly spray with cooking spray. Continue to bake until golden brown, another 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the fish bakes, place the avocado, sour cream, and 1 tablespoon lime juice and blend until smooth. Stir in the milk 1 tablespoon at a time until the consistency is similar to ranch dressing. Season with salt and pepper. Spoon the sauce over the baked fillets to serve.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Fish",
            "Tilapia"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LARANEFF"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.268041237113402,
            "ratingCount": 97,
            "itemReviewed": "Crispy Chipotle Lime Tilapia with Cool Avocado Sauce",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "367.1 calories",
            "carbohydrateContent": "25.8 g",
            "cholesterolContent": "48.7 mg",
            "fatContent": "17.8 g",
            "fiberContent": "5 g",
            "proteinContent": "27.1 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "354.8 mg",
            "sugarContent": "1.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-06-26T21:12:33.747Z",
                "reviewBody": "It's my recipe so of course I love it. If you can find the chipotle in adobo in the store I really suggest using that. I usually take the whole can peppers & sauce & grind it in the mini chopper. Then I drop tablespoons of it onto a cookie sheet lined with non-stick foil. Pop in the freezer until they are set & you can pop off the tray into a ziploc & store in the freezer & use as needed. I usually use 2 tablespoons for each chipotle a recipe calls for. You can also stir into into Chili or soups or enchilada sauce for some extra kick. Also be sure to salt the avocado sauce well if you think it is bland adjust the salt. If it is not salted it is just green goo. If you want it spicier add some of the ground chipotle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LARANEFF",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/469956/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-13T16:02:56.57Z",
                "reviewBody": "OK, I made this several times since my first try and I still love it; and you have to try it.  But just have to tell you a funny stroy - the first time I made it I read the directions wrong and used the whole can of peppers - no wonder it was so hot.  But now I did as some one else recommended and freeze them in two tablespoon increments and then when I make it the peppers are ready.  ORIGINAL RATING:  I saw this recipe and really liked ihow it looked;  and then went home last night and made it and am in love.  The sauce its GREAT and is not suppose to be like guacamole its a wonderful dressing that really goes nice with the 'hot' spices; a great complement to the dish.  The only thing I did different was to add cilantro to the dressing and its great.  I have told several people about it already this morning.  I WILL make it again.  Thanks a lot.  PS - I also cooked up the rice from Chipotle's to go with it.  Great dinner, if you like spicy you will love it.  Just sorry I forgot to make Margarita's it was late when I got home and totally forgot.  Its quick and easy to make after a long day at work.  : - }",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Cash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2591768/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-06-19T11:31:28.473Z",
                "reviewBody": "This was quite good! I was skeptical about the avocado sauce after blending it and taking a taste but with the fish it's really good! I doubled the whole recipe which made LOTS of sauce but its okay it doubles as a sort of dip:) I couldn't find the pepper and adobo sauce so I followed other's suggestions and substituted Chipotle hot/tabasco sauce. It smelled so good! And I used \"Hint of Lime\" Tostitos for the breading for some extra flavor. The only thing i'd say is make a little extra of the salsa blend to drizzle lightly over the fish before the avocado just for a little extra punch.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bito",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1937296/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T03:02:30.537Z",
                "reviewBody": "Made it for the first time tonight.. Worked out real well...my family liked it a lot! Next time I may try using Chipotle Tabasco sauce instead of the canned pepper as it's a little easier to come by.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/spicymike/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-21T21:07:23.443Z",
                "reviewBody": "This meal was easy to prepare. I liked the crunch and flavor provided by the corn torilla crust lime and chipotle peppers. My husband and daughter did not like the avocado sauce. If I make this again I will make guacomole or an avocado salsa instead. Overall this meal was healthy easy to prepare and tasted pretty good. Thank you for new way to prepare tilapia.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BONSTEAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1295372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-14T20:54:42.14Z",
                "reviewBody": "This was delicious especially for someone who likes spicy. I paid attention to a couple of reviews and made some small changes accordingly. I doubled the ingredients for the sour cream sauce as it doesn't make much. I added cilantro to the sour cream sauce (did it in my food processor and turned the sauce a lovely light green. I had leftover red chipotle pepper sauce after coating the fish so I put some of that on the baked fish first before serving it then a dollop of the sour cream/avocado sauce on top of that. It was beautiful as well as tasty. I will definitely make this again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GwenFlorida",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4079291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-10-14T23:08:51.81Z",
                "reviewBody": "Absolutely perfect. My wife baked this on a cookie sheet in the barbeque grill. Served with corn relish and tortilla chips; drizzled some of the sauce on the chips. A light dinner. Very nice. Thank you LARANEFF for posting it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ibilintuc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4079549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-12T22:07:28.167Z",
                "reviewBody": "Very tasty dish. Enjoyed the avocado sauce as it helped to cool down the spiciness of the fish. I did however add as suggested by other reviewers some cilantro to the avocado sauce; giving it just a tad more favor. I also liked that the dish was light and not fishy tasting.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Marie Hall",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1245324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-02-04T16:52:20.097Z",
                "reviewBody": "love it... a little work intensive with the blender and crushing chips... but if you clean as you cook... not hard to prepare at all. truly delicious flavorful and different from everyday grilled fish",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "daninia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4483951/"
                }
            }
        ]
    }
]