[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17527/desserts/fruit-desserts/banana-desserts/",
                    "name": "Banana Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/166611/alexs-raw-chocolate-pudding/",
        "name": "Alex's Raw Chocolate Pudding",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1020714.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "2008-05-05T22:26:21.000Z",
        "description": "It may seem odd to have a banana and avocado in the same recipe, but the banana completely hides any taste of the avocado.  The avocado is there simply for texture and nutritional value. Even my kids love this recipe! You can use any unsweetened milk in this recipe - almond, soy, rice, or coconut - and for a little crunch, use raw cocoa nibs instead of the cocoa powder.",
        "prepTime": "P0DT0H10M",
        "cookTime": null,
        "totalTime": "P0DT1H10M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "1 avocado - peeled, pitted, and cut into chunks",
            "1 banana, peeled and cut into chunks",
            "1 cup unsweetened soy milk",
            "¼ cup raw cocoa powder",
            "2 tablespoons agave nectar",
            "1 teaspoon lemon juice",
            "¼ cup shredded unsweetened coconut"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place avocado, banana, soy milk, cocoa powder, agave nectar, lemon juice, and coconut into a blender. Cover, and puree until smooth. Divide into small containers, and store in the refrigerator 1 hour until set.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Banana Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Alex"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.48695652173913,
            "ratingCount": 115,
            "itemReviewed": "Alex's Raw Chocolate Pudding",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "271 calories",
            "carbohydrateContent": "29.8 g",
            "cholesterolContent": null,
            "fatContent": "16.6 g",
            "fiberContent": "9.5 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "48.7 mg",
            "sugarContent": "15.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-07-25T23:28:05.767Z",
                "reviewBody": "Awesome recipe, Alex! I just happened to have a banana and an avacado that needed to get used so I whipped this up and yum! Subbed honey for the agave and added a little vanilla but that's it. I will be making this again for sure.   Have been making this about twice a week and have found that adding a tablespoon or 2 of peanut butter makes it like a PB cup pudding. Yum! *******UPDATE***** I added a little extra soy milk and ran it through my ice cream machine with great results. Kind of like a Frosty but nicer. Also makes killer pudding pops. Sometimes I add granola to the pudding for breakfast, too. I love this recipe.\n*new update*\nDidn't have a banana so I used just the avocado, honey, some nestle's quick (it's what I had), and milk. Better than anything out of a plastic cup. Yum. Next time I'm adding some malt. Thanks, Alex. This is one of the best recipes ever.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dulce lovin'mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2739007/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-19T23:54:34.813Z",
                "reviewBody": "Update 1/19/12 -- i have been making this fir such a long time and i have my own variation now thta i thinks beats the original. Use one large very ripe avocado, and one barely ripe banana. Note the distinction! Omit the coconut completely. Substitute 1/4 c honey for the agave. Substitute 1 cup vanilla coconut milk for the soy milk. Add 1/2 tsp vanilla extract. You wont be sorry!!!!\n\n5 stars for the sheer genius of this recipe! It's healthy and tasty - a true guilt free dessert. A couple things to mention - this is best served very cold. Otherwise the avocado taste comes through a little. Also, if you don't like banana, you may not care for this. The banana flavor is unmistakable. In fact this really should be called chocolate-banana pudding. But really, there are no complaints from me. I liked my bowl clean :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leigh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2157414/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-01T23:42:28.313Z",
                "reviewBody": "OUTSTANDING! My kids never knew the difference and we were astounded at how yummy it was... Very surprising, excellent.  A word to the wise:  DO NOT TRY TO SUBSTITUTE OTHER INGREDIENTS. The only people to give lousy reviews are those without the proper ingredients - substitutions with 'raw food' recipes usually don't work as well, so please try it with what it calls for - especially the raw cocoa - this is NOT the cocoa you get from hershey's which is bitter and WILL RUIN this delicious recipe... Rice milk or other nut milk can be safely substituted - but not dairy - defeats the point of raw anyhow... =)  Enjoy, loved it and will be making it many, many more times... =D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MARHATTAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/863828/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-07T18:04:54.18Z",
                "reviewBody": "I loved this recipe! However I changed a few things to make it my own. I don't use soy milk so I didn't use that. I had a young thai coconut so I cracked that open and poured the water off then I scraped the coconut meat out. I used the coconut meat avocados organic unsweetened coconut flakes Carob powder agave nector for sweetener and a dash of organic vanilla extract. I am licking the bowl as I speak....Wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Starlamotivates",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2172926/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-23T22:07:21.563Z",
                "reviewBody": "All right...clearly tastes like a health food. i used honey and skim milk and added vanilla extract to make it a little more desert-y. good for breakfast though.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LizK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3630596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-20T19:20:48.723Z",
                "reviewBody": "I got this recipe through the \"Daily Dish\" email. I read it and realised that I had pretty much everything on hand so curiousity got the better of me and I gave it a try. I struggled with how to rate this recipe because I'm not a vegan or a complete naturalist I had to do some substituting which I hate doing when trying a recipe for the first time. I don't even know what agave nectar is so I used honey like others suggested. I used 1% milk since that's what was in my fridge. I also only had sweetened coconut to work with and I assume that raw cocoa powder and Hershey or Fry's cocoa powder is the same thing. The texture was perfect. Nobody will ever mistake the flavour for Jello Chocolate pudding but it was pleasant. Not too sweet but it definitely qualifies to fill a sweet craving. My 2 yr old thought it was the bee's knees. I suppose I could try making this with chocolate milk or adding more honey or more banana... But in the grand scheme of things this recipe acomplishes what it was set out to do be a healthier alternative.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "A & R's Mommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2953283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-03T23:48:24.08Z",
                "reviewBody": "Wow! Anyone who comes across this recipe must try it it's so unusually flavorful! I love it and would have never thought of adding an avocado in this recipe. My husband says it tastes like Spring. I used rice milk instead of soy milk and I only used a little under 3 tablespoons of cocoa powder and that seemed to be more than enough (keep in mind I've been eating healthy for almost half a year). Thanks so much for sharing this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beyker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3418522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-04T02:19:51.183Z",
                "reviewBody": "this recipe was amazing! such a tasty and healthy treat. i used unsweetened almond milk instead of soy milk honey instead of agave nectar 2 tablespoons of shredded coconut and added 1/4 teaspoon of cinnamon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2942725/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-04-24T16:05:43.62Z",
                "reviewBody": "This was excellent! It was slightly thinner than expected but my friends and I nearly licked our bowls if THAT says anything! I used coconut milk because I hate the taste of soy (and soy is bad for you plus I figured it would be a bit thicker. While I love banana I wonder if one could tone down the banana flavor by using a still-green banana. I think I'm going to try it with 2 avocados and 1/2 banana to make it a little thicker and a little less banana-y.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "¡Kate!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3414066/"
                }
            }
        ]
    }
]