[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16348/drinks/slushies/",
                    "name": "Slushie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/19163/luscious-slush-punch/",
        "name": "Luscious Slush Punch",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F957607.jpg",
            "width": 2803,
            "height": 2803
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This is without a doubt the best punch I've ever had! Makes enough for 2 punch bowls. This is our Christmas Eve punch tradition, and there is never a drop left!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H5M",
        "totalTime": "P0DT8H20M",
        "recipeYield": "50 (4 ounce) servings",
        "recipeIngredient": [
            "2 ½ cups white sugar",
            "6 cups water",
            "2 (3 ounce) packages strawberry flavored Jell-O® mix",
            "1 (46 fluid ounce) can pineapple juice",
            "⅔ cup lemon juice",
            "1 quart orange juice",
            "2 (2 liter) bottles lemon-lime flavored carbonated beverage"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring the sugar, water, and strawberry flavored gelatin to a boil in a large saucepan; boil for 3 minutes. Stir in the pineapple juice, lemon juice, and orange juice. Divide mixture into 2 separate containers and freeze.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the contents of 1 container with 1 bottle of the lemon-lime flavored carbonated beverage in a punch bowl; stir until slushy. Repeat with remaining portions as needed.\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes",
            "Slushie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Valerie Cain Cuff"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.841919548341567,
            "ratingCount": 1417,
            "itemReviewed": "Luscious Slush Punch",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "108.2 calories",
            "carbohydrateContent": "27.4 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.6 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "24.5 mg",
            "sugarContent": "17.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-10-23T18:19:36.953Z",
                "reviewBody": "This had a lovely red color, and tasted great!  I found it definitely takes pre-planning, though, you'll need at least an hour for the punch to cool enough to pour into containers and then into the freezer.  I've found one batch fits perfectly into 2 1-gallon Ziploc freezer bags.  Just one night's freezing left it at the perfect slushy consistency, more than that and you have a solid, unpourable block o' frozen liquid.  I suspect if we take the second bag out and put it in the fridge overnight, it should again be the perfect consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSYKENDER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/538444/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-30T21:17:35.843Z",
                "reviewBody": "I followed some of the reviews and used only 1 cup sugar.  I'm glad I did, it was perfect!  2 1/2 would have been WAY too sweet.  1 cup was sweet and just a little tart.  I froze each half in gallon ziplock bags.  I pulled out one bag 2 hours before the party, and the next about 30 mins before the party so it would start defrosting while the first was being drank, and be ready to go by the time it was empty.  Everybody loved it and it was a beautiful pink color. UPDATE:  I've taken this to 4 parties now and it's always commented on.  YUM.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILVERISNOW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/641152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-19T02:04:59.373Z",
                "reviewBody": "I make this with Splenda, sugar-free jello and Diet Squirt.  It's perfect for those who can't have sugar and those of us who are watching our carbs and calories.  When I do make it with sugar, I only use 1- 1 1/2 cups, or it's too sweet for our taste.  It's become an instant family favorite and gets requested by my kids for their birthdays even.  This is a great punch, just allow extra time for freezing.  I follow the suggestion of dividing the punch into 2- 1 gallon freezer Ziploc bags that I place on a sheetcake pan in my freezer until frozen.  I have never had to wait for the punch to cool before pouring it, by doing it this way.  I take 1 bag of punch out of the freezer an hour or so before serving and with it in my punch bowl, I scrape it with a metal spatula to make a consistent slush when the 2 liter is added.  I've also sat it in my sink for an hour and let it thaw a bit on its own and/or microwaved it for a minute or so to get it to the consistency I wanted.  If you forget to get it out beforehand or have unexpected company, just throw it in the microwave and it'll be ready in no time.  This is very good with Gingerale as well.  Feel free to change up the jello flavors, I tried Wild Strawberry and Cherry combined for an extra treat.  I have made this for over 5 years now (updated 7/18/08) and everyone loves and requests it for all holidays and my Christmas cookie exchange. If I could give it more than 5 stars, I would!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/559983/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T21:26:41Z",
                "reviewBody": "I made this punch for my daughter's wedding and it was fabulous!  I made it a couple of weeks before the wedding and froze it in freezer bags as another reviewer had suggested, & layed the bags on their sides on a cookie sheet to freeze so the frozen liquid would not be very thick.  Mixing it was a breeze.  We placed a bag of the frozen punch in a roaster pan, gradually added the lemon lime soda and used a potato masher to mix it into a slushy icy mixture. We then poured it into the punch bowl to serve.  Everyone loved it and many many compliments were received.  I will definately make this punch again.  It is so easy to make and so convenient to make it ahead of time and have it frozen and ready to go at any given moment....just add lemon lime soda and you have instant punch!  I froze half of one of the batches I made in ice cube trays in case I needed to add it to the punch when it began to melt & get warm but it never had the chance to loose it's slush!  I had some of the cubes left and they have been great to use to mix up a cup or two of punch at a time.  Adding a shot of Vodka to a cup of punch is also pretty tasty!  \r\nYou can't go wrong with this punch!\r\nThanks Valerie for sharing it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lucy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/864437/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-29T14:49:55.31Z",
                "reviewBody": "Only used 1 cup of sugar which was perfect. Can't even begin to imagine how sweet this would be if you used 2 1/2 cups. Didn't have strawberry gelatin so I subbed using the tropical fusion gelatin mix of cherry pineapple and orange. Added watermelon vodka shots to each glass of punch served and WOW was it ever fabulous!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Crystal S",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3469461/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-05T22:36:52.437Z",
                "reviewBody": "I submitted this recipe and it makes me smile to see so many people enjoying it.  Thank you for your kind words.  However, I have noticed that many of you have problems getting your \"slush\" right. I have one word for you, \"MICROWAVE.\"  Recently I went to my great niece's 2nd birthday and her Mom was panicked because there was no \"slush\" in her punch.  I placed it in the microwave for a few minutes, then took a knife and broke it up until I knew that when the 7-UP hit, it would be perfectly slushy.  Once again, there wasn't a drop left.  The plastic containers make this easy to make ahead and then place in the microwave, however I haven't used the freezer bags as many of you have suggested and that seems to be a useful hint.  I hope you continue to enjoy and be sure to share!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Cain Cuff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8020/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-09T21:09:05.36Z",
                "reviewBody": "This recipe is EXCELLENT! In all honesty I have been searching for the 'perfect' punch to make 'Jungle Juice' with. This is definitely it! I made the recipe mostly as specified except I cut the sugar (like others suggested) down to a little over a cup. Trust me you WON'T miss the extra sugar. I also used one strawberry jell-o packet and one cherry jell-o packet and used 1 litre of lemon-lime soda and one liter of ginger ale. I added a liter and a half of Cruzan brand Mango flavored rum and WOW! That is all I can say. It was soooo good! Everyone at the party wanted to drink it! This is definitely worth the time. The rum was masked by the punch but it still did it's job; I can't wait to make this again! Hopefully this helps others with figuring out how much alcohol can be added.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KyLEE mAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1950325/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-27T20:45:18.983Z",
                "reviewBody": "I made this punch today for a tenure reception party I was catering and everyone LOVED it!! I have made a less exspensive Kool Aid version before but this is so much better and worth the extra money and prep time. I made a double batch and froze it in 4 Ziploc bags for two days. I took it out of the freezer about 2 1/2 hours before the party and mashed each bag seperately before adding to the punch bowl. I used ginger ale instead of lemon-lime soda too and the taste was wonderful! This will be my basic punch for catering orders from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hollys Taylor Made Treats",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1260958/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-12T15:59:35.06Z",
                "reviewBody": "This is a great recipe to tweak. I reduce the sugar to 1 cup (we don't care for sugary sweet punch) and use ginger ale instead of Sprite or 7Up. I've also used different colors of gelatin to coordinate with baby shower (I've used blue gelatin for green punch-when the baby's gender is a surprise). Very good for parties!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-02-23T22:57:53.25Z",
                "reviewBody": "My cousins loved this (kids) but I found it too sweet. Next time I will probably use sugar-free jello and cut the amount of sugar called for in half.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Juliet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/imetjuliet/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Luscious Slush Punch",
            "description": "See how to make a refreshing alcohol-free punch.",
            "uploadDate": "2012-07-27T17:00:17.130Z",
            "duration": "PT2M50.003S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3ed92228-d1c0-4095-abc0-ad46488474ed%2Fd02735f9-3d96-4745-a2a1-4f39b5aab8ed%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1757910182001"
        }
    }
]