[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/208/side-dish/sauces-and-condiments/croutons/",
                    "name": "Crouton Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/14230/garlic-croutons/",
        "name": "Garlic Croutons",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F28481.jpg",
            "width": 2832,
            "height": 2128
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "A very simple recipe, these croutons are good for a Caesar's Salad or any tossed green salad.",
        "prepTime": "P0DT0H5M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "1 1/2 cups croutons",
        "recipeIngredient": [
            "4 tablespoons butter",
            "1 clove garlic, minced",
            "3 (3/4 inch thick) slices French bread, cut into cubes"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large saute pan, melt butter over medium heat. Stir in garlic; cook and stir for 1 minute. Add bread cubes, and toss to coat.  Spread on a baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 15 minutes, or until crisp and dry.  Check frequently to prevent burning.  Cool.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Crouton Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cathy Hofmann"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.808510638297872,
            "ratingCount": 611,
            "itemReviewed": "Garlic Croutons",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "89.1 calories",
            "carbohydrateContent": "4.2 g",
            "cholesterolContent": "20.4 mg",
            "fatContent": "7.8 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.9 g",
            "saturatedFatContent": "4.9 g",
            "servingSize": null,
            "sodiumContent": "100.8 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-07T04:12:28.873Z",
                "reviewBody": "WOW!!  I certainly agree with everyone else but I wanted to share my creative finds with everyone who follows.  I had several loaves of French bread in the freezer so I decided to experiment with the recipe. First, to make all batches I cubed the bread, put it in a large, glass measuring bowl with a lid, melted butter in the microwave, mixed in the dry ingredients (except parm cheese), then poured it over the cubes in the bowl.  After shaking mixture, I put it on the jelly roll pan, sprinkled on parsely, for color, and baked them. (Be sure to bake until browned.  Mine took longer.) I tried a SMALL batch with olive oil, for the heart healthy attempt. I recommend splurging on the saturated fats in butter or ICBINB butter flavored margerine, as I use.  The olive oil isn't bad, but the butter is much better.  (I also used garlic powder for both garlic batches, mixing it in the melted butter).  I put Parmesan cheese on one butter batch and the olive oil batch.  I liked the butter batches both ways. The other way I tried it was by mixing in dry, ranch flavored salad dressing, after I poured the butter on the bread cubes.  I had to experiment with the quanitity by tasting it often but liked approximately 1/2 pkg Hidden Valley Ranch dry mix to a 3\" x 18\" loaf of bread. (Sample it first, don't just dump in the quantities I suggest; it may not be to your liking.)I can't wait to find some day old pumpernickle or rye bread to throw in the mix.  Sorry for the lengthy review.  Thanks for s",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ESKMom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/178504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-12T20:25:59.343Z",
                "reviewBody": "I've been making homemade croutons for a couple of years (haven't used this exact recipe), and I just thought I'd throw in a couple of tips.  I find that the best croutons are made from large, bakery-type kaiser rolls (plain ones, of course, not ones with poppy seeds or whatever). . . I just buy a bag of 6 or 8 rolls, use some of them for lunch sandwiches in the first couple of days while they're still soft, and then throw them into the fridge until I'm ready to make croutons.  (Croutons are okay if made from fresh bread/rolls but better when the rolls are stale/firm.)  I use garlic powder instead of garlic -- the taste ends up evenly distributed . . . just garlic powder and enough butter to coat (although you could add herbs if you wanted as well).  Bake on a jelly roll pan lined with foil -- then clean-up is super-easy.  And here's the best secret of all (I never would have believed this before I started making my own croutons):  once the croutons are done baking, spread them on paper towels to cool . . . and then, once thoroughly cooled, put in a ziploc bag -- your croutons will keep JUST FINE in the cupboard for up to a couple of weeks.  You'd think they would mold or do something else gross, but not at all -- so really, throw some croutons in the oven every week and a half or so while you're preparing something else in the kitchen, and you're good-to-go all the time!  (My husband became a huge salad fan when I started making croutons a couple of years ago...)  :-)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill Schilz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1602520/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-22T18:45:11.463Z",
                "reviewBody": "No french bread on hand, I used day old Dave's Killer Bread. I also doubled the garlic. Nice and simple for what I needed, but this could be easily modified for a snootier salad. WAY better than the store bought by a mile. NOTE: You can also use extra virgin olive oil in place of the butter.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-09-28T00:17:31.083Z",
                "reviewBody": "Irresistable is definitely the word to describe these! I'll NEVER ever go back to store bought again! I had some bread that was going stale and this recipe was just what I was looking for.... I melted the butter in the microwave and added just a bit of EVOO. I also added some italian seasoning and oregano along with the minced garlic. I watched them carefully so they didn't burn. I turned them once during cooking. I think you can mix up just about any combination of herbs spices and add in some grated cheese and these will turn out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-10T09:56:15.303Z",
                "reviewBody": "I read this recipe at 4PM...it is now 4:27 and the croutons are done!  I can't believe I never made croutons befor, it is SOOOO easy!  The \"melt the butter in a LARGE Glass bowl in the microwave\" is the hot tip.  I used stale sourdough that I was just about to toss to the birds. I always have a jar of chopped/minced garlic in the fridge and tossed in a teaspoon of that.  I sprinkled on some grated parmesian and italian herb seasoning...added some extra garlic powder (not garlic salt!) Used a non stick pan and in 15 minutes the aroma was a delight.  They are cooling right now as I type...you have to try this one it is a winner.  I will never toss out stale bread ever agains!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EZDUZIT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/858370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-24T22:44:38.827Z",
                "reviewBody": "Wow these are GOOD!! I didn't have the french bread so I used regular loaf bread. I melted my butter in the microwave and used garlic powder along with a dash of onion powder parmesan cheese and ground black pepper. I cut my baking time down to about 20 minutes and they were perfect! I made these to go along with my Caesar Salad Supreme also from this site. I just put my bread cubes in a large plastic container and poured the butter mixture over and tossed well. No need to dirty up a skillet.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-15T18:44:01.31Z",
                "reviewBody": "These are wonderful, except they are definitely not good for you. :) I will have to limit how many of these I make for myself. I make the following changes: I use 1 tablespoon butter and 3 tablespoon olive oil, add 4 teaspoon parmesan cheese and add 1 teaspoon italian seasoning. I will be sure to add these to my regular rotation.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "RogueOnion8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-07T04:12:40.793Z",
                "reviewBody": "These are super! Once they're out of the oven I like to put them in a zip lok bag and add some seasonings along with some parm cheese.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA MCLEAN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/268713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-18T14:30:08.477Z",
                "reviewBody": "Great Recipe.  Turns out much better sautung them first rather than simply baking them.  I did as another posted - used a stick and a half of butter, a whole loaf of frech bread and sauteed.  I also added Oregano, which I loved.  This is an excellent base recioe that you can use to flavvor any way you like.  Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jenlima",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/384760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-01T13:18:21.83Z",
                "reviewBody": "I can't say we cared for these. They had very little flavor. I think next time I'll try adding some italian seasoning and garlic powder to them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "breggae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3603106/"
                }
            }
        ]
    }
]