[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2258/side-dish/sauces-and-condiments/marinades/",
                    "name": "Marinade Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/21033/korean-bbq-chicken-marinade/",
        "name": "Korean BBQ Chicken Marinade",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5515380.jpg",
            "width": 3024,
            "height": 4032
        },
        "datePublished": "2008-06-30T23:10:59.000Z",
        "description": "This sauce is from the very popular 'chicken bowls' in my hometown. It's very tasty! Use it as a marinade for chicken, or to baste chicken while grilling. Increase the hot chile paste as desired. Four tablespoons is usually as much as anyone can take!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H25M",
        "recipeYield": "3 cups",
        "recipeIngredient": [
            "1 cup white sugar",
            "1 cup soy sauce",
            "1 cup water",
            "1 teaspoon onion powder",
            "1 teaspoon ground ginger",
            "1 tablespoon lemon juice",
            "4 teaspoons hot chile paste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over high heat, whisk together the sugar, soy sauce, water, onion powder, and ground ginger. Bring to a boil. Reduce heat to low, and simmer 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the mixture from heat, cool, and whisk in lemon juice and hot chile paste. Place chicken in the mixture. Cover, and marinate in the refrigerator at least 4 hours before preparing chicken as desired.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Marinade Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SASEIGEL"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.619389587073608,
            "ratingCount": 557,
            "itemReviewed": "Korean BBQ Chicken Marinade",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "20.3 calories",
            "carbohydrateContent": "4.9 g",
            "cholesterolContent": null,
            "fatContent": "0.1 g",
            "fiberContent": "0.1 g",
            "proteinContent": "0.3 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "304.3 mg",
            "sugarContent": "4.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-26T13:47:08.32Z",
                "reviewBody": "This was awesome. I tweaked it a bit by adding 1 tsp minced garlic and I subst. red pepper flakes (1 heaping tsp)for the paste. I found this recipe at the last minute so I didnt marinate. I used 10 chicken tenderloins, removed the tendons, fat, etc, and cut into bite sized pieces. I then put the chicken in a 9x13 pan and poured enough of the marinade to cover chicken. I covered with foil and baked at 350 for 35 min. stirring halfway through to make sure chicken was covered evenly with sauce. I reduced the remaining marinade in a saucepan, added a bit more water and thickened with cornstarch. When Chicken was done, I added some steamed broccoli florets and the thickened sauce right to the 9x13 pan and tossed to coat, served over jasmine rice. NO leftovers in my house, My husband ate 3 helpings! Even my 2 and 3 year olds ate it up! Definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "hcraley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2016099/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-11T13:37:08.95Z",
                "reviewBody": "I served chicken with this marinade to my Korean parents for dinner.  My mom, who said she wasn't hungry before we started eating, ended up going back for seconds and exclaimed that it was delicious.  The only changes I made was to decrease the sugar by 1/3 C(trying to make it healthier), and add minced garlic and a touch of sesame oil.  Gotta have garlic when you're making Korean!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chibi chef",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1133670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:51:00.28Z",
                "reviewBody": "This is a keeper in my house--especially for my picky husband who loves to BBQ.  I took the advice of others and used red pepper flakes since they are handy, added crushed garlic and sesame seeds sprinked on top, and reserved some of the marinade (thickened with cornstarch) to pour over the chicken and the other side dishes.  Thinking ahead the next time, I doubled the marinade.  I used half of the marinade for that nights dinner and put the other half of the marinade with a few pieces of raw chicken in a ziplock for a second dinner.  I put that bag of marinading chicken in the freezer.  It marinaded while it froze, then 2 weeks later it marinaded while it defrosted for about 48 hours in my fridge.  It made for an easy dinner--we threw it on the BBQ and made some rice and veggies.  Thanks for the great marinade!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Beth Packer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/635413/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-02-21T20:27:36.5Z",
                "reviewBody": "This is awesome!! If I could give it 10 stars I would!  Use as a marinade, over noodles with or without veggies, hot or at room temp (like cold sesame noodles) or in a stir fry thickened with a little cornstarch!!  Definately add the lemon juice - it adds a very nice tone.  I usually add some sesame oil and garlic (either powder or minced) as well.  YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ROBBIN818",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/923025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-09T08:08:29.443Z",
                "reviewBody": "I like this recipe, but it needed some sesame seeds, sesame oil, and green onions.  With those ingredients added, this recipe is perfect!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ybonics",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2310080/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-07T21:45:48.89Z",
                "reviewBody": "I didn't have any Korean chile paste and I don't often use enough of it to buy a jar. So I substituted half the amount in crushed dried red chile pepper powder a clove of garlic (it isn't Korean without garlic) a bit of white pepper and a few drops of toasted sesame seed oil. I put the chicken in the marinade one morning but couldn't get to it until the next night 48 hours later. I was afraid it would be too salty but after I broiled it in the oven my husband announced \"it's a keeper!\" Served over steamed rice with coleslaw on the side.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNTHIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395185/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-31T18:22:14.87Z",
                "reviewBody": "Full circle! I'm an American living in Korea and I have shared this recipe with Koreans who absolutely love it! Locally chicken sticks are more popular than teriyaki (Japanese) bowls. These are milder and meatier than yakitori in Japan. They are made with thigh meat and they taste great already. My marinade has made the stand I shared it with MUCH more successful. This is certainly sufficient research for a commercial venture. If the pattern of American's here is any indication such a stand at a ball park a street corner an airport or a campus would be fantastically successful. So Il-Byung means private first class So in Korean. One can only assume that this guy (or maybe a gal) studied Korean in the Army or lived over here and pickled up the culture. But the chicken bowls mentioned are a U.S. phenomenon. Scott",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SASEIGEL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655998/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:21:44.217Z",
                "reviewBody": "Delicious, Delicious, Delicious.  I cut up some chicken tenderloins and stir-fried them in this sauce and ate it over rice.  I occasionally use this in place of soy sauce when I stir-fry veggies as well.  I usually keep a batch of this in my fridge to use on the asain dishes I make.  Don't know how this works on other cuts of meat, but the chicken seems to dance with this on it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:50:57.513Z",
                "reviewBody": "Very easy to prepare and loved by my 1 year old up to my 19 year old. (kid friendly) I used Schezuan sauce for the chile paste since I couldn't find that and it wasn't too hot for the kids. I stir fried it instead of grilling it-the sauce made so much I marinaded the chicken for several hours in most of the sauce but I reserved 1 cup. To this I added 2 Tbsp. cornstarch and set aside. I stir fried vegetables and poured the remaining marinade over cooked vegetables and served this with the chicken. It had a wonderful flavor and my kids ate all their vegetables (as well as their chicken) Can't wait to try this grilled!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vicky Gunkel",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/727164/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T12:50:58.903Z",
                "reviewBody": "I wasn't crazy about this one I just can't put my finger on what needs improvement. Try the Japanese Chicken Wings recipe on this site as a marinade/rice bowl sauce.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "JACKIEAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/678476/"
                }
            }
        ]
    }
]