[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/387/desserts/cakes/cheesecake/",
                    "name": "Cheesecake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14683/desserts/cakes/cheesecake/new-york-cheesecake/",
                    "name": "New York Cheesecake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7533/new-york-cheesecake-ii/",
        "name": "New York Cheesecake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F359980.jpg",
            "width": 1656,
            "height": 1242
        },
        "datePublished": "1998-05-24T00:39:06.000Z",
        "description": "This is a great cheesecake.  I get a lot of requests for the recipe.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT4H0M",
        "recipeYield": "1 - 9 or 10 inch springform pan",
        "recipeIngredient": [
            "2 pounds cream cheese",
            "¾ cup white sugar",
            "2 eggs",
            "1 teaspoon vanilla extract",
            "2 tablespoons cornstarch",
            "1 cup sour cream",
            "1 ½ cups graham cracker crumbs",
            "6 tablespoons melted butter",
            "¼ cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (205 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix graham cracker crumbs, melted butter, and 1/4 cup sugar together. Press mixture onto the bottom of one 9 or 10 inch springform pan. Place in freezer for 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream 3/4 cup of the sugar and cream cheese until smooth. Beat in eggs, vanilla, and cornstarch until just mixed. Stir in sour cream until blended. Pour into prepared crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 400 degrees F (205 degrees C) for 45 minutes. Turn oven off and leave cake in oven with the door ajar for 3 hours. Serve with your favorite topping.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cheesecake Recipes",
            "New York Cheesecake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "MHARMAN486"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.656716417910448,
            "ratingCount": 268,
            "itemReviewed": "New York Cheesecake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "362.2 calories",
            "carbohydrateContent": "21.7 g",
            "cholesterolContent": "103.4 mg",
            "fatContent": "28.5 g",
            "fiberContent": "0.2 g",
            "proteinContent": "6.1 g",
            "saturatedFatContent": "17.4 g",
            "servingSize": null,
            "sodiumContent": "262.8 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-12-07T19:28:02.687Z",
                "reviewBody": "Perfect cheesecake. Now I have made a lot of cheesecakes but this is not only simple but probably one of the creamiest I've ever made. This is my suggestion for baking because 400 is going to give you a burned cake... No water bath as water baths often end up with a soggy crust and soggy crust is worse than a crack any day... Just simply bake the cake at 400 for 10min, then without opening the oven door reduce the temp to 200 than continue to bake for about 45 min, until it's almost completely set. Then I turn the oven off and just let it set in there til the oven is cool. Usually about an hour and a half to two hours. Then refrigerate it overnight. I'm telling you this is the best way to do it. There will be no crack and it will look a creamy off white. There ya have it. Oh and I also beat my ingredients with a mixer for close to 10 min. I have found it also makes a difference. Thanks.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CDPEFFER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1215056/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-06T19:13:03.53Z",
                "reviewBody": "Not a bad recipe.  I've been making cheese cakes for years.  However a good cheese cake must be silky smooth and creamy all the way through.  NOT lightly brown around the sides!  The only way this can be done is in a water bath.  Don't worry about soggy crust.  Double wrap your pan with 18\" heavy foil and I guarantee your crust will not get soggy.  When center wobbles, turn oven off, crack the door open and let cool for about an hour.  Also do not over mix (10 min. is far to long as suggested by another reviewer)  Generally, after adding each primary ingredient, mix for only a min. on mid. high and then scrape down the bowl.  This usually means only a total of 4 to 5 min.  It should be smooth NOT whipped for a perfect cheese cake.  Follow these rules and your cheese cakes will be soft, creamy through and through and will always be crack free.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "onlythebest",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1659259/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-03T21:47:31.66Z",
                "reviewBody": "My future daughter-in-law wanted me to make cheesecake for her wedding cake.  After trying several recipes - this one was the unanimous winner.  I ended up making 7 total for the reception.  Two months later I'm still receiving compliments about how it was the best they've ever had and how creamy it was.  The only thing I did different was to adjust the baking time and temperature as was suggested by others.  Actually - I ended up doubling the recipe to have a taller cheesecake.  **Once you put the cheesecake in the oven - DO NOT OPEN OVEN DOOR UNTIL COMPLETELY COOLED** I baked them at 400 degrees for 15 minutes, then dropped the temperature to 200 degrees for 45 minutes, then turned off the oven let it set for approximately 5 hours.  You must also let it refrigerate overnight to set.  Every single cheesecake came out perfect.  I tied sheer ribbon around the cheesecakes for the presentation and sprinkled rose petals on top.  Thanks Mary for posting this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Genee'",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1474628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-15T13:51:28.42Z",
                "reviewBody": "This recipe is ok, but not the best. The best New York Cheesecake recipe I've every made is from Cook's Illustrated Magazine. They baked over 200 cheesecakes to find the perfect formula. New York Cheesecake is supposed to have a deep nut brown crust on the top, no pale cheesecakes qualify for the New Yorker, and you can't get the brown crust in a water bath. The best baking temp and time according to Cook's Ilustrated is: 500 degrees for 10 minutes then 200 degrees for at least 90 minutes, until the center of the cheesecake reaches 150 degrees (yes, use a themometer for this). If it goes beyond 160, it will be overcooked and it will crack. A brown crust on top is what you want on a New York Cheesecake",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "rokzane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1607976/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-15T14:41:23.343Z",
                "reviewBody": "This is MY LATE MOTHERS ReCIPE AND POST. I was so honored to find it here 3 months after her passing. I am incredibly thankful for all of you that are taking this recipe and bringing it into your life in your own ways. This would make her incredibly happy and humbled and delights me as it makes me feel that part of her is still with this world, still extending her love and generosity. She was and is a great person and mother and always put us well before herself sadly. She was my favorite cook of course. I've noted that many use a water bath and I know my mom would support this. She told me if I was ever worried about cracks to use a bath and let it cool gently. It may make a difference in the door ajar or not in that she was using an older electric oven that was definitely not as good as what they make now in any way. She was amazing with what she could do with that thing though. So times may have changed the recipe a bit due to differences in equipment since the 60's. She always told me she dreamed of a gas oven/ stove. :) I think that she would love to know all the different things, variations, and events you are making our little family cheesecake for. I was so happy when someone used to at a wedding wow!! Thank you. \n\n\nPrior post(I just wanted to say that this is my Mom's recipe and I didn't know she was posting on here. She is an excellent cook as every one says and it means even more than I just found this RANDOMLY as she has just recently past away unexpectedly.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Harman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lisacakebaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-04T22:40:29.033Z",
                "reviewBody": "1st time and PERFECT! I made an 8 inch cake so I changed the bake time to 400 degrees for 10 minutes then 200 degrees for 45 minutes. No cracks perfect looking and dreamy tasting. Thank YOU!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SAMKHERM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/982318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T20:14:50.013Z",
                "reviewBody": "I made this recipe for my husband's birthday and the guests went crazy! It was the best cheesecake I've ever made. We couldn't get enough of it. I made a strawberry glaze for the top and served it with fresh strawberries and cream but any berry would be great! I am definitely making it for the next birthday!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "A MROWIEC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/289071/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-22T19:04:22.013Z",
                "reviewBody": "Very easy. Very very good! No heavenly! I made and baked it exactly the first time. Delicious moist and set throughout but sides and surface were very dark. Second time I baked at 350 for 1 hour and left in closed oven for 3 more hours. This resulted a much more blonde color.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MZOJIBWAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/839685/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-20T02:34:40.353Z",
                "reviewBody": "This cheesecake was great to make! I made a cheesecake for the first time using this recipe as the basis for my food finals project. I made two just incase and they both came out perfectly! No crack on any of them. I followed the advice that CDPEFFER gave as well. All my classmates and the taste testers ate all the cheesecake before i was able to have a piece for myself. They were all raving about it so i guess that means that it tasted great: Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Basketball :)",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2255746/"
                }
            }
        ]
    }
]