[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15930/side-dish/sauces-and-condiments/canning-and-preserving/",
                    "name": "Canning and Preserving Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/175547/rockin-salsa/",
        "name": "Rockin' Salsa",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1037324.jpg",
            "width": null,
            "height": null,
            "caption": "Rockin' Salsa"
        },
        "datePublished": "2008-09-06T18:49:17.000Z",
        "description": "This is a recipe I came up with by combining two of my favorite recipes into one awesome recipe.  You can make this salsa as hot as you want by adding more peppers.",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT3H20M",
        "totalTime": "P0DT6H5M",
        "recipeYield": "8 pints",
        "recipeIngredient": [
            "1 red onion, chopped",
            "1 white onion, chopped",
            "1 yellow onion, chopped",
            "6 pounds fresh tomatoes, peeled and chopped",
            "2 banana peppers, chopped",
            "3 green bell peppers, chopped",
            "3 (6 ounce) cans tomato paste",
            "½ cup white vinegar",
            "2 tablespoons garlic powder",
            "1 ½ tablespoons salt",
            "1 tablespoon cayenne pepper",
            "1 ½ teaspoons ground cumin",
            "¼ cup brown sugar",
            "¼ cup white sugar",
            "8 pint canning jars with lids and rings"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine red onion, white onion, yellow onion, tomatoes, banana peppers, green peppers, tomato paste, white vinegar, garlic powder, salt, cayenne pepper, cumin, brown sugar, and white sugar in a large pot. Simmer until thick, about 3 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the salsa into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 to 15 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Refrigerate after opening.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Canning and Preserving Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Tami"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.633047210300429,
            "ratingCount": 466,
            "itemReviewed": "Rockin' Salsa",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "25.4 calories",
            "carbohydrateContent": "5.9 g",
            "cholesterolContent": null,
            "fatContent": "0.2 g",
            "fiberContent": "1.1 g",
            "proteinContent": "0.9 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "229.6 mg",
            "sugarContent": "4.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-08-26T20:39:19.507Z",
                "reviewBody": "3 stars as written, 5 stars with minor alterations.  I took the advice of others, and cut the sugar in half, and it was still too tad sweet for my taste. Tried to remedy with about 3 T. bottled lime juice, but still a bit sweet. Sugar should be omitted, but the lime is a nice addition. The heat of the salsa (somewhere between mild and medium) is good, but I like a little more  kick.  In subsequent batches, I adjusted the ingredients more to my liking, being mindful of the acid / non-acid ingredient ratios for safety reasons. The addition of the lime juice allowed me to use 5-6 cloves of fresh minced garlic (instead of garlic powder) and 2 T. of freshly minced cilantro. I stuck with the 3 cups of mixed onions, but played with the peppers. Keeping the total amount at about 2 1/2 cups, I used 4 jalapenos, 2 banana peppers, and then 2 green bells. I also upped the cumin to 2 tsp.  Cooking for 3 hours is ridiculous... to do so would leave you with no texture to your salsa at all! After chopping all the veg, I placed them in a colander over a bowl for an hour to drain excess moisture. When I mixed all the ingredients in the pot, I boiled for about 15-20 minutes, which is plenty long enough for safety issues.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMA GIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/506534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-31T18:08:02.81Z",
                "reviewBody": "Taste is fantastic. family wondered why in the world I was spending 10 hrs on my feet to make something we can get at walmart for a few dollars. Cause it's ROCKIN! They agreed- it turned out great and we ate a lot fresh. This was a fun way to use up extra produce from the garden. I'm completely new to canning but it wasn't hard. Instead of cooking off the water I ladled it out carefully so as not to pick up the chunks. Worked like a charm. But (I'm very frugal) I saved the juice and made \"taco soup\" with it later. To the salsa I also added chopped fresh oregano & parsley from the garden, and more cumin b/c we like that flavor. Tomato paste is essential- makes it thick and rich. I had no idea what \"6 lbs\" of tomatoes was b/c we had no scale... I \"guesstemated\" But later discovered this to be a dangerous thing in canning. Tomatoes provide the acid that kills Clostridium botulinum (the little anaerobic buggers that make the tasteless toxin responsible for deadly Botulism) thus having the right proportion to the low-acid onions and peppers is ESSENTIAL. Learning after the fact, I had a mild freak-out b/c I had added extra onions (we grew A LOT) & extra peppers to my batch. I ended up throwing out all my hard work which, as a frugal woman was EXTREMELY painful. But...this was NOT the recipes fault, this was MY fault. I had to write this in the review to save my fellow newbies from a similar mistake. FOLLOW THE RECIPE! Or use a pressure canner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cookinlikewild",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3727258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-05T15:56:09.793Z",
                "reviewBody": "We love salsa to eat and share with friends and neighbors so we went to a farm and bought three cases of tomatoes. We made this recipe four times over a week, with adjustments as we sampled and evaluated. Our conclusion was that this is an excellent recipe that offers you a pleasantly sweet upfront taste followed by gentle or more heat as you choose. You can make adjustments within bounds that won't alter the acidic balance necessary for preservation. You can use three cups of onion, any kind. Two and a half cups of peppers, hot or mild or any mixture, with seeds or not, depending on your heat preference. We liked lemon juice instead of vinegar for flavor and an additional boost of acidity just in case. We added a teaspoon and a half of oregano, a standard in a former recipe. We reduced the sugar to a tabespoon of each white and brown sugars and it was still plenty sweet. Plus, we found that using roma tomatoes for half of the tomatoes yielded a thicker, less watery salsa that we preferred. We also used one of those choppers that allows you to push vegetables through a sharp grid. We used the smaller grid instead of the coarser one because that too seemed to contribute to a better consistency. From here on, this is our go-to salsa recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bamaboy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5058397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-08-05T02:29:04.95Z",
                "reviewBody": "Ok here is my only warning, I changed a few things and after 6 batches here is my current, onions same, tomatoes same, I have used sweet peppers and banana same amount little difference, 1 8 oz can paste, 2T apple cider vinegar, adds sweet to allow for less sugar, and it also keeps levels ok for canning, 5 cloves chopped garlic, salt same, sub red crushed pepper for cayenne, 1/2t cumin, 3T brown sugar,  2T white, now the big changer is yellow bell peppers they are sweeter and to me less dirty tasting,(all peppers =around 2 1/2 cups) and 1 T lemon juice.  I add jalapeno peppers 2 omit the seeds for milder, buy pickled for milder yet. We also like 1t cilantro. Here is the thing I have found.... The type of tomato changes the salsa more than anything. I made my 1st batch with sweeter tomatoes (I exclude some sugar 1T of each I think is what I used with sweeter tomatoes), and my last with late season seconds they are from one end of the spectrum of sweet to the other overly tomato tasting... Keep this in mind. Also there is no need to cook for 3 hours, I cook anywhere from 20 min to 1 hour based on what I am doing (2 little children distract me) remember your hot bath cooks this too. And if you grind with a hand held mixer there is no need to simmer flavor away. The longer it cooks the more it changes taste to me. As a previous person commented it only takes a hot bath 10 min to process, but some stoves it takes 20 to 45 min to get to a good boil, so remember this also!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kiti",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8400851/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-10T20:07:50.92Z",
                "reviewBody": "I come from a long line of salsa makers and have made various salsas for years.  This salsa recipie is the best I've ever tried.  I added two jalepenos for a little fire and doubled the recipie so I could get rid of some tomatoes I'd grown.  Only warning I can give any of you is if you double the recipe, make sure you have a BIG pot!  Love it, wouldn't change a thing.  Hopefully I can get some more tomatoes of of my garden again before it freezes so I can make another double batch.  A+  Thanks for the delish recipie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "packratpatty",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3639857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-07-14T17:57:12.03Z",
                "reviewBody": "omg, this is the best salsa i have tasted.husband said it was very good but to sweet. everybody loves it. will not change a thing. it a 10 or more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "darlene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3008624/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-28T01:36:47.013Z",
                "reviewBody": "This recipe is PERFECT as is!! A little sweet and a little spice. When I try recipe, I like to try it the way the recipe is written. If I don't like it, then I make changes. I don't like when people change 2, 3, 4 and so on of the ingredients and then rate it bad when they altered the recipe. I don't think thats fair to the creator either. I'm going to make a couple more batch AS IS and a couple of batches, but add  corn and black beans. Thank You for sharing this AWESOME recipe. It will for sure be the go to salsa recipe in our house. Once you eat this, you will never want to buy store bought salsa again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "osubuckeyesrock1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5055994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-16T19:50:29.907Z",
                "reviewBody": "I fed this to a bunch of cowboys, our boss and an executive chef. They all loved it. I was told to \"keep track of that recipe\".The chef said if you didn't want it quite so sweet, to add just a touch more salt. Great canning recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kim Snyder",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/petey/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-10T18:25:28.65Z",
                "reviewBody": "This is by far the best salsa I have ever made.  I really love the amount of heat it has.  I can't stand sweet salsa and this has just the right amount.  I made it exactly as the recipe called for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "L.Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1684288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-08-31T16:51:41.047Z",
                "reviewBody": "Personally I though this salsa was too sweet. I would make it again but I would cut the sugar back at least by half. I also added larger amounts of spices than what was called for and I used extra jalapenos to add more heat.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CarlD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3959529/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "How to Make Rockin' Salsa",
            "description": "See how to make amazing homemade tomato and hot pepper salsa.",
            "uploadDate": "2013-05-30T21:21:28.723Z",
            "duration": "PT2M57.302S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F0e486c49-5a29-495d-a3d6-a6236b4a8497%2F3f2306a0-6c09-486d-a4da-9e5c4a59ba30%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2421701160001"
        }
    }
]