[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/372/desserts/candy/",
                    "name": "Candy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/756/desserts/candy/mints/",
                    "name": "Mints",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/185194/5-ingredient-peppermint-bark/",
        "name": "5-Ingredient Peppermint Bark",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F11%2F09%2F304913-5-ingredient-peppermint-bark-photo-by-kat-g.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "2008-12-21T01:32:59.000Z",
        "description": "This layered peppermint bark is a delectable blend of semisweet chocolate, white chocolate, and peppermint. Semisweet, milk chocolate, or dark chocolate can be used.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "1 1/4 pounds",
        "recipeIngredient": [
            "8 ounces high-quality semisweet chocolate, broken into pieces",
            "2 teaspoons canola oil, divided ",
            "½ teaspoon peppermint extract, divided",
            "8 ounces high-quality white chocolate, broken into pieces",
            "25 peppermint candies, crushed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Lightly grease a 9x9 inch pan and line with waxed paper, smoothing out wrinkles; set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the semisweet chocolate and 1 teaspoon of the canola oil in the top of a double boiler over just barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. When the chocolate is melted, stir in 1/4 teaspoon of the peppermint extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the melted chocolate into the prepared pan, and spread evenly over the bottom of the pan. Sprinkle half of the crushed peppermints over the chocolate layer. Refrigerate until completely hardened, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the white chocolate and the remaining 1 teaspoon canola oil in the top of a double boiler over just barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. When the chocolate is melted, stir in the remaining 1/4 teaspoon peppermint extract.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the white chocolate directly over the semisweet chocolate layer; spread evenly. Sprinkle the remaining crushed candy over the top and gently press in. Refrigerate until completely hardened. Remove from pan; break into small pieces to serve.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Candy Recipes",
            "Mints"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Andrea"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.655940594059406,
            "ratingCount": 404,
            "itemReviewed": "5-Ingredient Peppermint Bark",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "190.4 calories",
            "carbohydrateContent": "30.3 g",
            "cholesterolContent": "2.4 mg",
            "fatContent": "7.7 g",
            "fiberContent": "0.8 g",
            "proteinContent": "1.5 g",
            "saturatedFatContent": "4.2 g",
            "servingSize": null,
            "sodiumContent": "17.2 mg",
            "sugarContent": "23.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-12-21T21:22:59.81Z",
                "reviewBody": "I tried this one, but find my old recipe easier and works better.  My changes - no oil necessary, use 10 candy canes instead and do not allow the first layer of chocolate to set before adding the white layer - this is what causes them to separate! I use about 12 oz of each chocolate and melt in the mirco in glass dishes.  First, melt the dark or milk chocolate, add extract if desired and pour into a foil lined pan, sprinkle with 1/3 of the crushed candy canes.  Refrigerate about 5 minutes while you melt the white chocolate, also in the micro but only half power for about 3 minutes. Pour the white choc over the top and then add the rest of the candy canes.  Be careful when spreading the white choc or you will end up swirling the 2 chocs together a bit and not have the pretty all-white top.Refrigerate for 2+ hours.  Turn upside down onto a towel and peel off the foil and break into pieces.  By breaking it from the back, you will not break as many of the candy canes on top.  Also, don't crush the candy canes too much or you will end up with powder instead of nice pieces.  Store in fridge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "wombat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3249996/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-10T17:17:31.957Z",
                "reviewBody": "This was so easy and fun to make! It tastes great and looks pretty.   I did do a few easy cheats. I used a bag of whilte chocolate chips and a bag of chocolate chips. I microwaved the chocolate. I put the oil and the chocolate in a microwave safe bowl and cooked them for 1 minute on 50% power. Took it out and stirred it and put it in again for another 30 second or so on 50% power again. It came out really nice and smooth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JENZEP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/732603/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-11T16:56:27.097Z",
                "reviewBody": "very easy to make, very yummy and a very good gift to give... I did do this as directed the first time but found a few changes couldn't hurt. I found that using candy canes gave it a much better look. it crushes more to the red side verses the round are more to the white. I also added in 1/4 teaspoon peppermint extract to give it a kick to the white chocolate mix after I had melted the chocolate. I also freeze it until I am ready to eat or give out as gifts and it tastes great! This is very simple, very easy to make. the price to make this is so much better then buying it to give out as gifts. When coming from your kitchen how can anyone not like it? Thank you for sharing this is a kepper that I will not use every holiday season.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "motherofthree",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3621073/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-16T23:37:13.247Z",
                "reviewBody": "YUMMY!!! I didn't have any mint extract, so when I crushed the candies, I sifted them and took all the crumbs that fell through and melted them with the white chocolate. Then I sprinkled the rest on top and it was delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mintiefresh33133",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3670813/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-08T23:50:42.787Z",
                "reviewBody": "Delish! The only word of advice I would offer is that if you put peppermint pieces in between the layers don't put many. I put a good amount in between the layers and when I went to break up the pieces the white chocolate layer came off from the semisweet layer. They still taste fabulous but aren't all together liked planned. I can't wait to try it with milk chocolate as well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cctaylor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2315036/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T05:11:20.517Z",
                "reviewBody": "I made this with 1/4 tsp peppermint extract only in the chocolate layer and I thought that much extract alone is entirely too much. I tried a similar recipe with no extract and it was perfect. If you don't really like peppermint (or the flavor of peppermint extract for that matter) I STRONGLY recommend omitting the extract altogether. I do like the flavor of the semi-sweet chocolate with the white chocolate. I would give this five stars but the peppermint extract flavor nearly ruined it for me. Definately five without the extract but three is being generous for the recipe as written. Another helpful hint it doesn't specify but you need to either use the peppermint on the first layer sparingly or really press it into the semi-sweet chocolate layer. When I cut these the two layers separated on several which was pretty aggravating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "lchoward",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lchoward/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-15T23:12:54.563Z",
                "reviewBody": "Yummy and easy to make!! It's also much cheaper than the kind made my Williams S!!!! Tip: Spread the melted chocolate into a diposable aluminum pan. There will be no need to grease the pan and the bark will be easy to remove by slightly bending the pan. Also use a pizza cutter to cut when the bark is not completely cooled solid. Thank you for the great recipe idea!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LucyDelRey",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1349933/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-13T18:50:59.157Z",
                "reviewBody": "Great recipe! I used candy canes instead. I also halved the peppermint extract based on other reviews and I wish I hadn't. Next time I will use all of the peppermint extract and put it in the white chocolate layer only. Also I only put the semisweet layer in the freezer while I melted the white chocolate and I didn't have any problems with them separating when I broke it apart. I will make this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lane",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2988522/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-15T16:28:30.79Z",
                "reviewBody": "I altered this recipe slightly as it was the basic recipe that I use to make homemade fudge every year during the holidays. I melted the first batch of semi-sweet chocolate added a can of sweetened condensed milk and some peppermint extract. I allowed it to see for about a half an hour to fourty minutes and worked on the second layer made of white chocolate. I prepared it the same way I did with the semi sweet and gently covered the first layer. The last or top layer was made with milk chocolate prepared the same way and spread gently over the white chocolate. I then chopped up a small box of candy canes and sprinkled them over the top. My husband loved it! By far this was the best fudge recipe I have ever made though it is extremely rich. I will definatly be making this again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Erin Haussler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3489712/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "5-Ingredient Peppermint Bark",
            "description": "These 5-star Christmas candies are layered with chocolate and peppermint.",
            "uploadDate": "2012-11-29T23:54:38.016Z",
            "duration": "PT3M38.76S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb0c76152-cde8-4bcf-95c5-66ff6f453cf8%2F5c2c67eb-5c24-4f5b-81ee-2b123b5fc232%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1998443763001"
        }
    }
]