[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16369/soups-stews-and-chili/soup/",
                    "name": "Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/184/soups-stews-and-chili/soup/vegetable-soup/",
                    "name": "Vegetable Soup Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14735/soups-stews-and-chili/soup/vegetable-soup/broccoli-soup/",
                    "name": "Broccoli Soup Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235874/copycat-panera-broccoli-cheddar-soup/",
        "name": "Copycat Panera&reg; Broccoli Cheddar Soup",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F31%2F4488560.jpg",
            "width": 1000,
            "height": 1000
        },
        "datePublished": "2008-12-09T03:55:44.000Z",
        "description": "My husband loves Panera&reg; broccoli cheddar soup but it went up in price and therefore we set out on a hunt to create the perfect broccoli cheddar soup. Here is what we came up with. There are tons of variations and options to make this soup your own. You can add extra veggies, different cheeses, garlic to your onions, a little nutmeg to the finished soup, green onions, sour cream, etc. The list goes on and on. Make it your own! Serve topped with cheese!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 tablespoon butter",
            "½ onion, chopped",
            "¼ cup melted butter",
            "¼ cup flour",
            "2 cups milk",
            "2 cups chicken stock",
            "1 ½ cups coarsely chopped broccoli florets",
            "1 cup matchstick-cut carrots",
            "1 stalk celery, thinly sliced",
            "2 ½ cups shredded sharp Cheddar cheese",
            "salt and ground black pepper to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Melt 1 tablespoon butter in a skillet over medium-high heat. Saute onion in hot butter until translucent, about 5 minutes. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk 1/4 cup melted butter and flour together in a large saucepan over medium-low heat. Continue to whisk and cook , adding 1 to 2 tablespoons of milk if necessary to keep the flour from burning, 3 to 4 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gradually pour milk into flour mixture while whisking constantly. Stir chicken stock into milk mixture. Bring to a simmer; cook until mixture is thickened, about 20 minutes. Add broccoli, carrots, sauteed onion, and celery; simmer until vegetables are tender, about 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir Cheddar cheese into vegetable mixture until cheese melts. Season with salt and pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Soup Recipes",
            "Vegetable Soup Recipes",
            "Broccoli Soup Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "gildawen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5221027479092,
            "ratingCount": 1674,
            "itemReviewed": "Copycat Panera&reg; Broccoli Cheddar Soup",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "304.4 calories",
            "carbohydrateContent": "10.7 g",
            "cholesterolContent": "70.5 mg",
            "fatContent": "23 g",
            "fiberContent": "1.3 g",
            "proteinContent": "14.3 g",
            "saturatedFatContent": "14.4 g",
            "servingSize": null,
            "sodiumContent": "624 mg",
            "sugarContent": "5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-01-10T13:40:42.73Z",
                "reviewBody": "This has the potential to be a really great broccoli cheese soup.  As is, it’s just o.k.   To me it tasted like broccoli with cheese sauce.  It was bland and seemed to be lacking something.   I’m thinking it’s the cooking process.  It seems backwards.  Typically, milk products are added last because simmering can cause curdling, especially if simmered for a long period of time.  It works out o.k. for this recipe because it’s so thick from the cheese that you don’t really notice.   What I found odd was that half of the cooking time is dedicated to just simmering the milk with plain stock, absent of any vegetables or seasonings of any kind.  It’s only in the latter stage when you add the vegetables and those are only cooked just long enough until tender.   Onions, celery, and carrots are essential when it comes to adding flavor to any soup broth and it takes time to develop that flavor.  I would suggest adding those 3 ingredients to the chicken broth at the beginning so they have more cook time.  The other change I would make is when to add the milk.  I would start by adding the broth to the flour first and then the milk, but that’s just me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "DIZ&#9829;",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/diz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-25T15:27:54.213Z",
                "reviewBody": "Three stars because it actually tasted good, but the whole cooking process was just strange. In all my years of cooking, I have never seen instructions like that. All you really gotta do is brown your butter, add the other veggies along with the broth, simmer til the vegetables are done. Then add your thickener - in this case, flour and melted butter. Then you add the milk and the cheese. It turned out great this way, and only took me and my daughter about a half hour to make it. Simmering the already thickened broth/milk for 20 minutes? Then adding the vegetables and cooking them for another 20 minutes? Seems to me that the recipe instructions are actually written in reverse!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Valerie Gray Smith",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1929391/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-28T22:48:26.69Z",
                "reviewBody": "I made this soup and my husband (who is not a really big soup fan) could not get enough of it.  Only difference I made to the recipe was using 1 cup milk and 1 cup cream (since I had it on hand), rather than 2 cups 2%.  Also, I didn't have the full amount of cheddar, so I threw in maybe 1/3 cup slab of veleeta to make up the difference.  But I almost never have velveeta, and would recommend sticking with the cheddar just out of principle's sake.  I used the stock to make the flour thickener rather than the milk/cream (just a preference).  Then I added the milk and cream at the end with the cheese.  It was definitely a delicious and thick soup, just like Panera's.  Yum! Thanks a bunch, gildawen!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4149988/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-09T23:16:05.86Z",
                "reviewBody": "I hate to leave a 2-star, unfavorable review.  However, to be fair to those who want to try this in the future, I want to give my opinion: it was bland and utterly tasteless. I was so disappointed that I didn't care how close it was to Panera's recipe -- I just wanted flavor!  I ended up adding a tablespoon of garlic powder and 2 tablespoons of powdered chicken broth base (2 chicken bouillon cubes would work too), and this did the trick! We ended up with a very tasty soup for dinner, and I will make this regularly throughout the winter, WITH my additions. Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "CookTo$ave",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10459484/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-22T01:24:54.623Z",
                "reviewBody": "The family loved this soup. The only changes I made was to thin the roux with chicken broth instead of milk and added the broth instead of milk. Then I added all the veggies and simmered it, then added the milk at the end. Wonderful soup!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly Kotz Walls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1861515/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-14T22:55:38.64Z",
                "reviewBody": "I've made this soup before using a different recipe, couldn't find the old recipe so I decided to give this a try. I used the exact measurements and ingredients listed except celery, the only other difference I made was instead of simmering the milk/flour/butter to thicken I used chicken broth as the liquid, let it simmer a little (around 7 minutes) added all my veggies and 1/2 cup of water (my burners are too strong and I feared all the liquid evaporating and becoming a pudding instead of a soup) and let it simmer until veggies were tender. Last step I added milk, cheese and served. WOW. BIG HIT with me and my husband who doesn't like soup. The flavor was all there, just be careful with adding salt as most chicken stocks already have sodium and cheese adds a lot.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "zoya",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9092832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-01T10:19:39.89Z",
                "reviewBody": "*arthur fist* Like many of the other reviewers, I had to tweak the recipe. The instructions didn’t read well to me so I took some suggestions and now I think I have a good system to get things the way I’d like.\n\n I used 1.5 cups of sharp cheddar, 4 cups of chicken broth, 1 cup of heavy cream, 1 cup of thin carrots, 4 table spoons of butter, ¼ cup of flour,  2 cloves minced garlic, ½ onion, salt, pepper, garlic powder, 1 tsp of nutmeg 10 oz of broccoli. Steam broccoli until soft and easy to cut (It took forever to get soft simmering with everything else) In another pot sautee onions, carrots (if you don’t have a blender I’d make the pieces even smaller) in butter until tender, then add flour and cook for a minute. Add 2 cups of broth to onions, carrots, and flour mixture. Add in your cup of heavy cream and bring to a boil then lower the temp, remove from heat and add cheese gradually while stirring (if you throw in all the cheese at once it'll get clumpy). Your mixture should be thick at this point, add the last 2 cups of broth to thin it out, and add in your broccoli. Add seasonings to taste. Let simmer for awhile and it should be good to go.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Cine Bean",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/20492233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-14T02:22:06.787Z",
                "reviewBody": "As the submitter said it's open to what you like to make your changes to fit your taste. I found two copycat Panera bread broccoli-cheese soup recipes - here & food.com. They are very very very similar. Food.com adds nutmeg. I like the almost invisible taste of nutmeg in creamy soups. I am not a nutmeg fan (always halve it in baked goods) but in this soup: Mmmm! I changed the directions because they seemed really odd/off the order of things. This one says 1 1/2c broccoli; the other 1/2#. 'Pretty sure the answer is in between those two. I went with close to 1/2#. Daughter said it had too much broccoli or not enough cheese - didn't know which.:) Anywayyyy I microsteamed it three minutes then allowed to cool. I sauteed 2 medium sized cut-bigger-than-matchstick carrots in 1/4c butter 5 minutes; then added 1 pc celery diced sauteed 2 minutes; then about half cup onion (half onion) five minutes. 'Meant to do the sprinkling of 1/4c flour next but got ancy & added 2c homemade chicken broth next. Put that in a blender (daughter request) along with the broccoli then back in the pot & thickened once it got hot. After thickening added 1/4t salt & nutmeg; & 1/8t black pepper; 1c 2% milk; 1c half&half.(Probably go for all half&half next time or more thickener with milk). I chopped up an 8oz block Kraft sharp cheddar but it wasn't sharp enough enough cheese or both. Simmered 15 minutes. Good soup.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BOOKMARKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bookmarker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-02-17T22:04:12.74Z",
                "reviewBody": "I'm rating it 3 because I have to rate it. But for a suggestion since I've made the Panera copycat before. First is to blend the ingredients, minus the cheese, in a blender. Second, the secret ingredient is a pinch of nutmeg to the final product. And btw making a roux before adding the liquids gives it more depth.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "alde",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15380626/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Copycat Panera® Broccoli Cheddar Soup",
            "description": "Find out how to make the soup from your favorite cafe right in your own kitchen.",
            "uploadDate": "2015-07-30T15:31:25.402Z",
            "duration": "PT1M45.505S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc684be5a-bc84-425b-8f61-875e236b6ee0%2Fccbfcb44-f69f-421a-9b76-17388a68d528%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4387116251001"
        }
    }
]