[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/230/world-cuisine/latin-american/caribbean/",
                    "name": "Caribbean",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/214541/mahi-mahi-with-coconut-rice-and-mango-salsa/",
        "name": "Mahi Mahi with Coconut Rice and Mango Salsa",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F820135.jpg",
            "width": 3072,
            "height": 2304
        },
        "datePublished": "2009-02-02T01:34:45.000Z",
        "description": "A Caribbean-inspired dish with dimensions of sweet, spice and tanginess. Delicious!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "2 tablespoons olive oil",
            "1 ½ teaspoons soy sauce",
            "2 teaspoons lemon juice",
            "1 clove garlic, crushed",
            "2 teaspoons red pepper flakes",
            "1 teaspoon fresh ground black pepper ",
            "½ teaspoon minced fresh ginger root",
            "2 tablespoons chopped green onion",
            "salt to taste",
            "4 (4 ounce) mahi mahi fillets",
            "2 cups uncooked jasmine rice",
            "2 cups water",
            "1 cube chicken bouillon",
            "1 tablespoon butter",
            "¾ (14 ounce) can coconut milk",
            "2 tablespoons white sugar",
            "1 ½ teaspoons butter",
            "1 ½ tablespoons white sugar",
            "1 ½ cups fresh mango, cubed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Whisk together the olive oil, soy sauce, lemon juice, garlic, red pepper flakes, black pepper, ginger, green onion, and salt in a bowl. Add the mahi mahi and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven's broiler and set the oven rack in the middle of the oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring the rice, water, chicken bouillon, and 1 tablespoon butter to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the liquid has been absorbed, about 20 minutes. Pour in the coconut milk and 2 tablespoons of sugar. Stir, and simmer uncovered until the rice has absorbed most of the coconut milk.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the rice is cooking, remove the mahi mahi from the marinade, and shake off excess. Discard the remaining marinade. Place fish in a large baking dish in a single layer. Broil in the preheated oven until the fish flakes easily with a fork, 10 to 15 minutes. If the fish browns too quickly, cover the baking dish with a sheet of aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt 1 1/2 teaspoons butter and 1 1/2 tablespoons of sugar in a skillet over medium-high heat. When the mixture begins to bubble, stir in mango cubes. Cook and stir until mango is tender, about 5 minutes. Serve by placing a mahi mahi fillet over a scoop of hot rice and top with the mango salsa.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Caribbean"
        ],
        "recipeCuisine": [
            "Latin American",
            "Caribbean"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "SYRAH4689"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7447698744769875,
            "ratingCount": 239,
            "itemReviewed": "Mahi Mahi with Coconut Rice and Mango Salsa",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "807.9 calories",
            "carbohydrateContent": "107 g",
            "cholesterolContent": "93.8 mg",
            "fatContent": "28.9 g",
            "fiberContent": "3.8 g",
            "proteinContent": "30.9 g",
            "saturatedFatContent": "18.2 g",
            "servingSize": null,
            "sodiumContent": "548.6 mg",
            "sugarContent": "20.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-10-20T17:33:57.167Z",
                "reviewBody": "This dish was amazing!  I made a few changes to the original recipe, though.  In the marinade, I added a tbsp or so of spiced rum.  I used half as much rice since 2 cups of uncooked rice expands into an amount that I can't eat by myself (even 1 cup of dry is still a little too much for 4 servings).  I made the biggest changes in the salsa: I cooked the mango following the recipe but then I put it in the refrigerator.  I chopped up half a medium red onion, 1 avocado, 1 banana, and a little bit of fresh cilantro.  I tossed that with the mango.  On the side I wilted some fresh spinach in a little bit of chicken broth seasoned with garlic and red pepper flakes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jsmall85",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5597770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-10-26T15:49:08.11Z",
                "reviewBody": "This recipe was excellent. I made it two ways (One with Mahi and one with Extra Firm Tofu), the tofu was excellent vegetarian alternative.  Just make sure you press it and broil it for an addition 10-15 minutes.   Otherwise prepare exactly the same.  I substituted long grain brown rice and light coconut milk to lighten it up a bit, it was very good, but I imagine it would be better with the regular coconut milk.   I cut back on the red peppers a bit and it was still pretty spicy, so be careful with this… you can always ad more; the coconut rice and mango do help to balance out the heat.   Also I took the advice of one of the other reviewers and made a salsa to go along with it, a combination of avocado, cilantro, lime and salt…. YUM!  I made a batch of the marinade and used it to sauté veggies for the side (Red bell peppers, mushroom, broccoli and red onion). It was very good and complimented the dish nicely.   This recipe is a keeper! I think I will also try it with tilapia next time as recommended by another reviewer.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LilTJones",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5641122/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-22T16:55:06.47Z",
                "reviewBody": "this pic is not the right one to go with this recipe, does someone know what the correct ingred. are for this one, seems to be some red peppers and maybe cilantro or parsley in the mango salsa",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynn Gagnon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6814228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-08-23T17:25:35.227Z",
                "reviewBody": "If I could give this receipe 10 stars I would. This is the best recipe I have found on this site. I did not change a thing I just cut everything in half because I only made this recipe for 2 not 4. I see some people have been cutting back on the red pepper but I wouldn't and didn't. If you eat the fish on it own it would be too hot but plated the way the recipe tells you to it is perfect. All of the flavors go very well together and makes this recipe a true winner!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Arizona Girl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3013968/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-22T19:07:36.23Z",
                "reviewBody": "This was AMAZING, honestly one of the best Mahi Mahi dishes I have ever had let alone cooked.  It was very easy to make and the flavors complimented each other well.  The fish is slightly spicy, it would be wonderful served as is without the rice and Mango salsa but it really completes the dish when served together.  The only thing I changed is that I grilled the fish instead of broiling it.  I don't think it would have been nearly as good broiled.  I will be making this again, thanks for the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DEARYABBY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1368054/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-17T16:55:28.123Z",
                "reviewBody": "Absolutely Wonderful!!! Followed the recipe with the exception of changing the number of servings to 6 and adding a couple TBS of diced red and orange bell pepper to the finished mango salsa and sprinkling of cilantro before serving. My rice had absorbed all the water in a shorter period of time than listed (approx 12 min) so I added approx. 1/4 cup of water and cooked for a few min before adding the coconut milk and sugar. The rice was delicious as instructed but next time I will add more coconut milk/water and cook a little longer (personal pref). We are already looking forward to adding this to the rotation for our big Sunday dinners and when we have company. Thanks for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "abapplez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/abapplez/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-06-30T21:48:53.903Z",
                "reviewBody": "an amazing meal! i did a few changes though on how i cooked my rice...i cooked it in a rice cooker...basically i just put all the ingredients in the rice cooker stir it..and instead of using 2 cups of water and a cube of bouillon i used 2 cups of chicken broth and a dash of salt because i only have the 25% less sodium broth and yah it turned out great...the fish i did marinate and cooked as is...and yah my entire family loved it...no leftovers at all! very yummy! will definitely make this again and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Armalyn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1871880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-23T19:22:43.657Z",
                "reviewBody": "This was by far one of the simplest and best tasting Mahi recipes I've found. I served it for guests who all asked for the recipe, which I took as a good sign! Visually I like the look of salsa on top of the fish, so I chopped the mango much smaller than in the photo and added some cilantro and finely chopped green onion to it as well.  I was skeptical about the method of cooking the rice, worrried it may come out sticky but it was perfect and I've made it again since as a side dish to other meals.  This is definitely a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mistress Vee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5965488/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-02T18:45:14.083Z",
                "reviewBody": "Unbelievable good!  My kids said it was the best fish they've ever had!  I made the rice & mango salsa too and added grilled zucchini as a side dish.  Only thing I changed was I added more fresh garlic to the marinade.  I couldn't find a ripe fresh mango so I had to use Doles jarred mango & it was wonderful.  Would recommend fresh if you can get it though.   Yummy!  Thank you!  I added a photo of our meal because she didn't have one on this recipe page.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole Cole",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4728903/"
                }
            }
        ]
    }
]