[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/218028/easy-slow-cooker-chicken-tetrazzini/",
        "name": "Easy Slow Cooker Chicken Tetrazzini",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3193691.jpg",
            "width": 1545,
            "height": 960
        },
        "datePublished": "2009-10-06T19:05:07.000Z",
        "description": "Creamy, cheesy and easy!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT4H20M",
        "totalTime": "P0DT4H35M",
        "recipeYield": "4 servings",
        "recipeIngredient": [
            "4 skinless, boneless chicken breast halves - cut into 1/2 inch strips",
            "1 cup chicken broth",
            "½ cup dry white wine",
            "1 onion, finely chopped",
            "½ teaspoon salt",
            "¼ teaspoon dried thyme",
            "¼ teaspoon ground black pepper",
            "2 tablespoons dried parsley flakes",
            "6 large fresh mushrooms, thinly sliced",
            "3 tablespoons cornstarch",
            "¼ cup water",
            "1 (8 ounce) package uncooked spaghetti",
            "½ cup half-and-half cream",
            "½ cup grated Parmesan cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place the chicken strips, chicken broth, white wine, onion, salt, thyme, black pepper, and parsley into a slow cooker, and set the cooker on Low. Cover, and cook for about 5 hours, then raise setting to High. Stir in the mushrooms; mix the cornstarch and water together in a small bowl, and stir the mixture into the slow cooker. Recover, and cook until sauce is thickened, about 20 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spaghetti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix the cooked spaghetti, half-and-half, and half the Parmesan cheese into the slow cooker. Sprinkle with remaining Parmesan cheese, and serve.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "JENNG7"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.6774193548387095,
            "ratingCount": 31,
            "itemReviewed": "Easy Slow Cooker Chicken Tetrazzini",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "479 calories",
            "carbohydrateContent": "54 g",
            "cholesterolContent": "80.8 mg",
            "fatContent": "9.8 g",
            "fiberContent": "2.9 g",
            "proteinContent": "36.5 g",
            "saturatedFatContent": "4.8 g",
            "servingSize": null,
            "sodiumContent": "517.7 mg",
            "sugarContent": "3.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-06-27T03:27:19.277Z",
                "reviewBody": "This was rather decent. As the 1st review said that the recipe wouldn't thicken..is correct. But I got it to. My chicken was pre-seasoned so I didn't add the thyme(but I would have if it was plain-just noting that for others). My chicken was also 8oz a piece...so note to self...I will only use 3 because they were so huge I had a lot of meat in mine. I also used fresh minced parsley verses dried baby bella mushrooms as well. So when it came to the step with adding mushrooms corn starch and water I turned the slow cooker up to high for at least 30 minutes and notice it was thickening but still liquidy. So I made a quick change when it came to the half and half. I used heavy whipping cream in it's place and ended putting all the parmesan in it at the cooking point for the step that requires mixing the noodles half & half and Parmesan. I also used Ronzoni Garden Vegetable noodles verses plain noodles(for color & taste & no 8oz pkg of noodles were sold in my store so I used the 12oz size) It still was liquidy but not much. But as I mixed it all together in the crock..all my family wasn't home when dinner was \"I thought\" was ready and had to sit another 30 minutes in the crock until they arrived...by then. It was nice and thick. No runniness what so ever. I topped each plate with a little extra parm mixed with a little bread crumbs. And my hubby and children went back for 2nds and said how wonderful it was. I will make again with my modifications and use less chicken.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-16T21:48:43.21Z",
                "reviewBody": "Made a few changes and it came out delicious...it was a little soupy at 1st but I just kept adding flour til it thickened I added the noodles into the crockpot after they cooked then turned off the crockpot n let it sit for 15 min. After that it wasn't soupy at all! I also added garlic it was wonderful. I'll be tripling the recipe for a party.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AslJwGirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5465137/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-31T14:20:10.37Z",
                "reviewBody": "Loved this dish! Tweaked it a bit as follows: Used 3 very large chicken breasts used a pinot grigio added garlic powder at end (will add fresh garlic in the beginning next time) due to time I did high for 1 hour low for 2 and back to high when adding cornstarch and mushrooms. Added 1 extra teaspoon of cornstarch and left on high for another hour before adding spinach fettuccini (12 oz bag). The chicken broke up and was so tender! The flavor was wonderful!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ceree",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7831152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-17T17:14:56.527Z",
                "reviewBody": "I may remake this but only after serious changes. I found it to be extremely soupy - even after the 3 Tbsp of cornstarch I'm not a novice cook by any means either. I ended up needing to add another Tbsp of cornstarch and it still was rather soupy. I used baby bella mushrooms which gave it more depth and used Gallo Family Pinot Grigio - I was a bit shocked at the amount of parsley flakes and reduced it to 2 tsp. I finished cooking this in the oven - to allow the parmesan to form a topping. I think that if there is a next time that I'll reduce both the chicken broth & white wine. I like the concept of this recipe but it needs improvement.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "thedailygourmet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/thedailygourmet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-12T16:33:46.443Z",
                "reviewBody": "I have made this meal a couple of times. It turns out delicious. My husband does not like any type of cream sauce but he will go for seconds on this. We also add veggies other than the mushrooms & onions like 1 green and red pepper and possibly some asparagus. I also doubled the white wine broth and half and half for more juices ends up coming out very creamy in the end and you always have enough juices to make sure it is not dry. If you get sick of the chicken possibly try shrimp instead it is very good either way. Delicious recipe from the start!:) Very pleased!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "armywife8911",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9276666/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-15T23:18:57.897Z",
                "reviewBody": "The recipe shows 4 hours 20 minutes but in the body of the recipes it shows 5. So since I was short on time. I did as one other did and cooked on high for 1 hour low for 2 and then back on high for the 20 minutes. I let the noodles cheese and 1/2 & 1/2 cook longer then the recipe called and it got nice and thick for me. It was good but it tasted like there was something missing so I will probably add some other spices to get the taste i'm looking for. Will probably make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "codyzmommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2567302/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-09-01T18:42:24.347Z",
                "reviewBody": "Definitely needs to be thickened more my kids called it soup. I also think it needs more seasoning. It was a little bland. I thought it was okay but my family didn't like it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-02T03:10:45.753Z",
                "reviewBody": "Turned out dry However that may have been my fault.. it might have been more juicy if I hadn't had to serve dinner a bit late and keep it warm in the slow cooker too long.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly Reber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8632400/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-24T14:42:10.263Z",
                "reviewBody": "My boyfriend and I absolutely loved this recipe!!!  Based on the reviews, and him accidentally changing the time, it turned out perfect!  Here is what I changed.  First, I cooked it for 4 hours on low, then added the mushrooms, and I also added a bag of frozen peas.  I cooked it on high for another 2 hours.  To thicken it more, I added an extra tbsp of cornstarch, and some Wondra.  As far as the pasta, I didn't feel like saving 4oz of my 12oz box, so just cooked the whole box, added it to the crockpot, and it was FANTASTIC!  I will definitely make it again very soon!  I used pinot grigio for the white wine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "karen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5652581/"
                }
            }
        ]
    }
]