[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1530/desserts/cakes/wedding-cakes/",
                    "name": "Wedding Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7574/white-wedding-cake/",
        "name": "White Wedding Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F631899.jpg",
            "width": 1200,
            "height": 1200
        },
        "datePublished": "1998-05-30T18:56:27.000Z",
        "description": "This is a great white wedding cake for those of you who like it plain.  When I was a child, one of my neighbors who was elderly made a lot of wedding cakes for family and other people, and she took great pride in her work.  She used fancy staircases you get in cake decorating stores, and even crocheted certain decorations.  All is in your imagination.  No professional baker did what she did.  Be creative.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 3-tiered wedding cake",
        "recipeIngredient": [
            "5 ¼ cups sifted cake flour",
            "6 teaspoons baking powder",
            "2 teaspoons salt",
            "2 cups white sugar",
            "8 egg whites",
            "1 cup white sugar",
            "1 cup shortening",
            "2 cups milk",
            "1 ½ teaspoons orange extract",
            "1 teaspoon almond extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Beat egg whites until foamy with sturdy egg beater, or at high speed of electric mixer.  Then add 1 cup sugar gradually, beating only until meringue will hold up in soft peaks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, stir shortening just to soften. In another bowl, sift together flour, baking powder, salt, and 2 cups sugar; sift into shortening.  Add 1 1/2 cups milk and the extracts, and mix until all flour is dampened.  Beat 2 minutes at a low speed of electric mixer.  Add remaining milk and the meringue mixture; beat for 1 minute more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line the bottoms of one 10 inch square pan and two 8 inch square pans with parchment paper.  Pour batter to equal depth in each pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 325 degrees F (165 degrees C) for about 45 minutes, or until done.  Cool layers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Trim one of the 8 inch square cakes to make a 5 inch square cake.  Place the 10 inch cake on a large flat tray or plate.  Frost top and sides with thin layer of Ornamental Icing. Cover top of cake smoothly with more frosting.  Center 8 inch cake on top of 10 inch cake, and frost as above.  Center 5 inch cake on 8 inch cake, and frost.  Spread frosting over entire cake to give a flat, even base for decorating.  Decorate as desired.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Wedding Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 3.326923076923077,
            "ratingCount": 52,
            "itemReviewed": "White Wedding Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "145.4 calories",
            "carbohydrateContent": "24.4 g",
            "cholesterolContent": "0.8 mg",
            "fatContent": "4.4 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.1 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "164.7 mg",
            "sugarContent": "12.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-09-18T01:37:02.17Z",
                "reviewBody": "Thanks Carol for this wonderful recipe. I made this wedding cake recipe for a wedding celebration for one of my co-workers. Everyone raved about it. They liked that it was a very traditional wedding cake. If you are old enough to have gotten white wedding cake in a cardboard box to take home from a wedding then you know what I am talking about. The cake is dense yet moist. It was very easy to cut to create the tiers. I used non-melting wax paper instead of parchment paper since I couldn't find parchment paper - it worked fine. I wouldn't call this cake \"plain\" but rather elegant and simple it has a very slight fruity taste to it. I recommend you buy the shortening (Crisco) that is not butter flavored to keep the cake very white. I also made the ornamental icing but did have to add a bit more cream to get it smooth enough. You definitely need to use a large mixer rather than a hand-held to mix the frosting. The ornamental icing recipe frosted the cake decorated it and still plenty was left over. My friend decorated it and the cake looked gorgeous.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEB1CA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/125672/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-18T01:14:16.5Z",
                "reviewBody": "I thought that from all the fairly positive reviews that this was going to be a pretty good cake.  I made it twice and the cakes fell both times. (silly me, I thought it would turn out better the second time)  The texture was that of a dry, crumbly angel food cake. Not the kind of cake to slice and fill.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "NOODLEO1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1422041/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-22T13:56:36.39Z",
                "reviewBody": "OK I have baked for over 30 years and this is simply the most delicious wedding cake! Yes it is more like a pound cake but most folks like that. We live in China and I had to bake it in an impossible tiny oven and it still was moist and delicious!!! Only one problem-there is no way that 3 tiers of 5 8 and 10 inches add up to 150 servings. DO the math! Most cake pages will tell you that at the most an 8 and a 10 inch put togther will give you 30 servings add the 5 inch layer and I am mystified that you get to 150 servings. Perhaps if you make 4 of them! I used the 150 serving recipe to make 2 9x13s with 32 servings each (about a 2x2) but you could stretch that to 48 each for a total of 96 servings-max! And that would be a very tiny serving. Why would you want to serve a postage stamp slice of this delicious cake? I read the other reviews but was puzzled that no one else commented on the portions being wrong. Would love to see how anyone got 150 servings out of this. Liz May",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LIZMAY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/811228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-06-08T01:00:21.077Z",
                "reviewBody": "Recipe servings have been modified from 150 servings to 50 servings.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "the allrecipes staff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/28649/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-15T22:49:55.11Z",
                "reviewBody": "I tried this and it came out GREAT!!! Nice recipe Carol!! Nice dense texture. I made this cake as a request for Valentine's day. I marbled my cake and the white/chocolate blend was just right. there was enough batter to make 2 full 8\" cakes and the 10\" as the recipe says. We tried some of it the day it was baked and it was a bit dry and bland. The following day we tried it again and what a difference!!! The extra time allows the full flavor to come through. The cake was layered with chocolate ganache. Then topped with another layer of ganache striped with white chocolate and trimed with almond buttercream roses. ABSOUTELY MARVELOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Reneessweetshoppe",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1541741/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T19:16:52.553Z",
                "reviewBody": "I made this cake for my parents' 25th wedding anniversary party and everyone loved it. I didn't have orange extract on hand so I used almond and vanilla instead; it was wonderful. I will be using this recipe a lot!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "H2OMELON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/98546/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-21T17:51:13.59Z",
                "reviewBody": "Made this for my brother's wedding. Changed one thing. Instead of orange extract added a little vanilla extract and added less quantities of the extracts than called for. I used a buttercream icing for the top and sides of the cake and nutella in between the layers and decorated with ferrero rocher chocolates. THE BEST CAKE EVER!!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mercury4000",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1992877/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-26T22:44:45.363Z",
                "reviewBody": "I got so many compliments with this cake! I used vanilla extract instead of the orange. I also didn't make a tier cake. I used one batch to make a dozen cupcakes one character pan and one double layer 6\" cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lanny B",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2185805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-03-25T00:14:22.56Z",
                "reviewBody": "I used this recipe for my best friend's wedding after trying two others. It is WONDERFUL! Maybe those that said it was dry over whipped their egg whites because I did not find that to be the case with my cake. I did have to double the recipe to produce thick enough layers with a 12\" 8\" and 5\" round pans. We did fill the layers with strawberry and lemon fillings and that did help with the moistness. Great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CSYJNAMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/793379/"
                }
            }
        ]
    }
]