[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/94/soups-stews-and-chili/",
                    "name": "Soups, Stews and Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/173/soups-stews-and-chili/chili/",
                    "name": "Chili Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14729/soups-stews-and-chili/chili/beef-chili/",
                    "name": "Beef Chili Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/212397/spicy-pumpkin-chili/",
        "name": "Spicy Pumpkin Chili",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F744009.jpg",
            "width": 1587,
            "height": 1206
        },
        "datePublished": "2009-10-30T17:37:56.000Z",
        "description": "The pumpkin is a great surprise in this chili! It makes the whole house smell good and tastes great! Garnish with cheese and jalapenos if desired. This recipe can be made on stovetop too. Cooking time would be reduced to 30-45 minutes for chili to simmer.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H15M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 pound ground beef",
            "½ teaspoon crushed red pepper flakes, or to taste",
            "1 teaspoon minced garlic",
            "½ large onion, diced",
            "1 green bell pepper, chopped",
            "1 red bell pepper, chopped",
            "1 (15 ounce) can kidney beans, rinsed and drained",
            "1 (15 ounce) can black beans, rinsed and drained",
            "1 (15 ounce) can Great Northern beans, drained and rinsed",
            "1 (8 ounce) can tomato sauce",
            "1 (4 ounce) can tomato sauce with garlic and onions",
            "2 (14.5 ounce) cans petite diced tomatoes ",
            "1 (14.5 ounce) can fire roasted diced tomatoes",
            "1 (15 ounce) can pumpkin puree",
            "2 teaspoons pumpkin pie spice",
            "2 teaspoons chili powder",
            "1 teaspoon ground cumin",
            "1 teaspoon salt, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over medium-high heat; cook and stir the beef in the skillet until crumbly and no longer pink, about 5 minutes. Stir in the red pepper flakes, garlic, and onion; continue cooking until the beef has browned and the onion has softened and turned translucent. Add the green and red bell pepper and cook 5 minutes more.\n"
            },
            {
                "@type": "HowToStep",
                "text": "While the beef is cooking, combine the kidney beans, black beans, Great Northern beans, tomato sauce, tomato sauce with garlic and onions, petite diced tomatoes, fire roasted diced tomatoes, and pumpkin puree in a large slow cooker. Season with pumpkin pie spice, chili powder, cumin, and salt. Stir in the ground beef mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cook on Low until the chili is hot, 1 to 2 hours.\n"
            }
        ],
        "recipeCategory": [
            "Soups, Stews and Chili Recipes",
            "Chili Recipes",
            "Beef Chili Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Dac Kennedy"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.397321428571429,
            "ratingCount": 224,
            "itemReviewed": "Spicy Pumpkin Chili",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "271.4 calories",
            "carbohydrateContent": "36 g",
            "cholesterolContent": "28.4 mg",
            "fatContent": "6.4 g",
            "fiberContent": "11.2 g",
            "proteinContent": "18 g",
            "saturatedFatContent": "2.4 g",
            "servingSize": null,
            "sodiumContent": "1040.7 mg",
            "sugarContent": "6.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-09-14T21:25:46.8Z",
                "reviewBody": "Great recipe however I think there is a typo in the ingredient list: the 1 4-ounce can of tomato sauce with garlic and onions I am convinced that was supposed to read tomato PASTE (and that is what I used) since I don t think tomato sauce comes in 4-ounce cans (the tomato paste to my knowledge only comes in 6-oz. cans). Ok I made a few changes instead of a green pepper I used a drained and rinsed can of diced green chilies. I didn t have fired roasted diced tomatoes so I used 3 regular cans of diced tomatoes and added 1 tsp. of smoked paprika. I also added 2 tbsp. of brown sugar. On the preparation front I cooked the pepper flakes onion red pepper and garlic in a saucepan and added a bottle of beer. Once those were soft I used a slotted spoon to transfer them to the slow cooker then cooked my pound of ground bison in the remaining beer liquid. Once that was browned completely all the liquid was gone made for added layers of flavor! Thanks for the great recipe!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Menwith Hill'er Back Home !!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/938152/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-20T18:27:40.907Z",
                "reviewBody": "This was very good but I think there are a couple of things that improve it: 1) use fresh garlic and press it rather than using minced from a jar 2) don't drain the beans! It made for a soupier chili. 3) Add a dash or two of Tabasco at the end. This chili is rather sweet and that helped to counter act. This was great with Vegan Agave Cornbread Muffins!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Jones Hollis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2334366/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-19T18:48:46.63Z",
                "reviewBody": "I made this chili as suggested it was very good when I came across this recipe I new I had to try it just because I never thought of putting pumkin into chili all my friends love chili and thought this one was very good When I was cooking this the house had a lite pumkin smell it was nice and will make this again in the future thanks",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "maccordeiro",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/maccordeiro/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-03T17:46:36.837Z",
                "reviewBody": "Overall this was pretty darn good! I haven't had a chance to try pumpkin chili yet so I was surprised by what a delcious flavor this added to the chili. It made it taste earthy and just slightly sweeter. I did make a few changes based on other reviews. I did not drain my beans which helped make the chili soupier. Also I used fresh garlic. And I used ground turkey instead of ground beef. The one thing I would have liked is for it to be a little spicier. I would recommend added diced green chilies/jalapenos/something to add a little more heat which I will experiment with next time around. Thanks for the fun fall recipe Daisy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DarcieA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5463374/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-05T18:47:47.907Z",
                "reviewBody": "I love this chili! I did make a few slight changes to the recipe by using turkey instead of beef and doubling the chili powder and adding cayenne pepper. I shared it with friends and everyone loved it! I will definitely make this every fall from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Stefanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2277381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-11-24T17:41:51.457Z",
                "reviewBody": "This was really good! I made one minor change to ensure my family would eat it. I only used great white northern beans and black beans since my kids don't care for kidney. I drained the beans and while the pumpkin pure thickens it nicely it wasn't to thick. Also I ended up doubling the ground beef and the seasoning as a result. I didn't find this to be sweet at all. Wonderful chili for something a little different!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs_Mike",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/copperskillet/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-20T11:42:25.39Z",
                "reviewBody": "Finally I had cool enough weather to try this chili recipe last night. I pretty much made just as written my changes were to use garden fresh chili pepper and two jalapeño peppers in lieu of the green pepper. I did add some yellow and red bells though. I also used whole 15oz. can of tomato sauce instead of the two different cans of tomato sauces the cook recommends I think that may be a typo. I did add a bit more cumin and chili powder since we like spicy. I always add a dash of cinnamon to my own chili and this one certainly was no exception. I loved the creamy thick texture the pumpkin gave to the soup only giving a delicate nutty sweetness to the normal hearty southwest chili dish. With the fall coloring the pumpkin adds along with the variety of beans and vegetables plus the added health benefit of the pumpkin make this a dish I will regularly rotate in the cooler months. You could even make this healthier by adding ground turkey instead of beef or use an extra can of beans and no meat at all. Thanks Daisy K for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*Sherri*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2129429/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-16T20:31:20.333Z",
                "reviewBody": "WOW this was so good the smell really reminded me of a crisp fall day. I did halve the pumpkin puree the pie spice chili and cumin to be on the safe side (fussy hubby).well into his second bowl i told him the ingredients he actually give it 5 thumbs up. I am so glad i tried this and will be making it again..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "faye",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4608194/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-19T00:54:06.67Z",
                "reviewBody": "This really wasn't very spicy but worked for me as I was making this for a daycare chili cookoff. I chose this because it sounded different from the norm. I did use about 1.75 pounds of ground beef. This was a nice thick hearty chili and not too spicy for small children. I actually ended up winning the chili cookoff with this recipe! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Junebug's Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3146954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-11T00:43:11.45Z",
                "reviewBody": "I was disappointed with this recipe. I didn't taste the pumpkin at all and the flavor was bland. I used the amount of spice indicated in the recipe (and yes my spices are fresh and have not been sitting around forever) but I thought it just tasted like tomatoes and that was it. It was edible but not enjoyable.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "LompocCook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6243562/"
                }
            }
        ]
    }
]