[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219174/easy-butternut-squash-ravioli/",
        "name": "Easy Butternut Squash Ravioli",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5789457.jpg",
            "width": 1465,
            "height": 1101
        },
        "datePublished": "2011-10-12T22:42:36.000Z",
        "description": "These easy butternut squash ravioli are a terrific way to use up leftover roasted butternut squash. They can stand in equally well as either the ideal appetizer or as an elegant main dish for dinner. The secret? Wonton wrappers instead of pasta make these ravioli incredibly easy.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 cup mashed, cooked butternut squash",
            "½ teaspoon salt",
            "½ teaspoon freshly ground black pepper",
            "1 pinch cayenne pepper",
            "½ cup mascarpone cheese",
            "1 egg yolk",
            "⅓ cup grated Parmesan cheese",
            "1 (16 ounce) package round wonton wrappers",
            "2 tablespoons butter",
            "1 clove garlic, unpeeled",
            "chopped fresh sage to taste",
            "1 tablespoon grated Parmesan cheese, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Place cooked squash into a mixing bowl. Add salt, black pepper, and cayenne pepper. Stir in mascarpone cheese, egg yolk, and 1/3 cup Parmesan cheese, mixing until the filling is smoothly combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a wonton wrapper onto a working surface. Wet the tip of a finger in water, and run it all along the outer edge of the wonton skin to moisten. Place about 1 teaspoon of filling in the center of the wonton. Fold the wonton in half to make a half-moon shape, and press the edges to seal. Repeat with the remaining wonton wrappers.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place a deep skillet over medium-low heat. Stir in butter and unpeeled clove of garlic. Meanwhile, bring a saucepan of lightly salted water to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drop the filled raviolis into the boiling water, a few at a time, and cook until they float to the top, about 2 minutes. Drain the raviolis, and transfer them to the skillet. Turn the heat under the skillet up to medium-high, and cook just until the raviolis are infused with garlic flavor, about 2 or 3 more minutes. Sprinkle with chopped sage, more black pepper, and extra Parmesan cheese to taste.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.420454545454546,
            "ratingCount": 176,
            "itemReviewed": "Easy Butternut Squash Ravioli",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "377.7 calories",
            "carbohydrateContent": "47.4 g",
            "cholesterolContent": "79 mg",
            "fatContent": "15.9 g",
            "fiberContent": "2.4 g",
            "proteinContent": "11.5 g",
            "saturatedFatContent": "8.5 g",
            "servingSize": null,
            "sodiumContent": "741.7 mg",
            "sugarContent": "0.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-01-25T19:20:33.057Z",
                "reviewBody": "These were super delicious! This will definitely be a regular item on my family's dinner menu. My only gripe about this recipe is the delicacy of the won ton wrapper. It took several tries to prevent tearing and to sufficently seal the edges together. Once mastered though, this recipe rocked!  I followed another reviewer's advice and used a generous amount of cayenne pepper which gave the ravioli a nice kick. In case anyone else doesn't have mascarpone cheese stocked in their fridge, a mixture of 8 oz. cream cheese, 2 1/2 tbs sour cream, and 1/4 c. heavy whipping cream in lieu of the mascarpone cheese works perfectly.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nikki",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5589237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-28T21:36:24.417Z",
                "reviewBody": "I LOVED this recipe.  It is finally the ravioli I crave from my favorite Italian restaurant.  The brown butter sage sauce is perfect.  I did use acorn squash instead of butternut because that is what I had.  I also made some changes that made this a little healthier.  I used 2 oz. of Neufatel cheese (a lower fat cream cheese) and two tablespoons of Parmesan instead of the cheese suggested.  I also used a teaspoon of maple syrup in the mixture.  Lastly, I topped the ravioli with roasted walnuts and served it with a spinach salad and roasted brussel sprouts.  This takes a little longer than implied, but so worth the time investment.  I great vegetarian dish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Grizzly27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2034811/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-06T16:21:19.427Z",
                "reviewBody": "delicious! the cayenne pepper doesn't really do much in terms of heat or flavor so i either add a big pinch of it or a big pinch of crushed red pepper flakes. didn't do the sage butter sauce but rather just tossed in butter and topped with freshly grated parmesan. also i hate wasting egg whites so i added a little bit of water to it and beat that to make a \"glue\" to seal the raviolis. they come out delicate and subtle with a comforting butternut squash taste. SO good. will definitely make again and again. oh also this recipe made a lot so i froze a bunch (laid out on a baking sheet to freeze then threw them all in a bag) and cooked about 3 min until the raviolis floated to the top.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EZLEEAMYOOZED",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1458941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-02T17:06:35.977Z",
                "reviewBody": "This recipe was delicious. The first time you cook something like this is always a learning curve. So hopefully this will help your first time be perfect. First less is more. Putting more than the teaspoon recommended makes the ravioli too rich. We all preferred the raviolis with less butternut squash mixture. Secondly when you cook the raviolis in butter do only one layer at a time. Otherwise the raviolis stick. I would do two batches with half of the butter in each. Lastly I substituted the mascarpone cheese for light cream cheese and it was delicious! Thanks for a recipe that we will surely make again - for simple family dinners and important guests alike.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Janelle Fosler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7246016/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-26T23:14:26.277Z",
                "reviewBody": "Great recipe!  1 large butternut squash yielded 2 cups and therefore I doubled the filling recipe.  I did not use an egg yolk, but it did not matter.  Added a little extra cayenne just to give it a slight kick.  I was unable to purchase wonton wrappers and instead purchased a 16 oz package of egg roll wrappers.  Cut into quarters and made triangle shaped ravioli.  The doubled filling was perfect for the amount of wrappers I had.  Used about 3/4 of a teaspoon of filling in each wrapper.  The fresh snipped sage and fresh peppered parmesan were elegant.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joanne Worobec",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1491157/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-10T17:27:13.88Z",
                "reviewBody": "I tried this out this weekend on my hubby and very picky teenage daughter. This is the first recipe I have rated online; I just HAD to say how fabulous it was and super easy. My daughter had two servings (which she rarely does especially with new dishes) I made the ravioli as is but varied the sauce a bit. Browned the butter added garlic then a couple dashes of white wine hot pepper flakes and cream. Reduced and served on ravioli. WONDERFUL!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pldoyle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9398582/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-21T23:35:52.78Z",
                "reviewBody": "More cheesy tasting than I expected but certainly not a detriment. If you can't find mascarpone cheese I think cream cheese would be an okay sub. The taste is a little different but not a deal breaker. The raviolis I'd had of this type before were more sweet so I sprinkled the top with cinnamon in addition to the parmesan and I added pears cooked with brown sugar as a garnish made it extra tasty. I froze a lot of them to save for later they still taste great. I just placed them on a cookie sheet in the freezer until they were hard enough to transfer to a freezer bag. Easy. You don't have to fry them up in butter if you're looking to save calories (it's just that butter makes everything taste good)--I did it both with and without. The wonton wrappers are a perfect substitute. It's definitely a recipe you must try!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-30T11:09:50.313Z",
                "reviewBody": "Yum yum yum!!! Fantastic flavors and very easy to make. I too omitted the egg yolk and added extra cayenne pepper. Wonton wrappers are key! I actually have a dumpling press so that little guy made making this dish super easy. My boyfriend LOVED this. It's a perfect seasonal homey recipe. Thanks Chef John!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cherissa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5023381/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-04T00:26:34.477Z",
                "reviewBody": "This was delicious! The only thing I changed was a little more cayenne pepper (as a spice-junkie I couldn't help myself) and I diced the garlic clove and threw it in with the butter/sage combination.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "krebhamp",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8272486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-22T01:02:34.3Z",
                "reviewBody": "I really didn't care for the texture of the wonton wrappers after they were boiled. I also found the sage to over power the squash and parmesan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "NICOLENS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8194550/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Easy Butternut Squash Ravioli",
            "description": "See how to make surprisingly simple squash ravioli.",
            "uploadDate": "2012-07-17T20:11:05.176Z",
            "duration": "PT4M40.792S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F58de29cb-488e-4d3b-a15c-c6f7dfbd5bad%2Fd046a15d-6710-43ed-9e91-b4fa6e720161%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1739950337001"
        }
    }
]