[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/351/bread/yeast-bread/rolls-and-buns/",
                    "name": "Rolls and Buns",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6758/unbelievable-rolls/",
        "name": "Unbelievable Rolls",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5279606.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1998-06-08T22:32:00.000Z",
        "description": "Simple dinner rolls that are easy to make. Dough is also a great base for cinnamon rolls.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "16 rolls",
        "recipeIngredient": [
            "¾ cup milk",
            "¾ cup water",
            "½ cup white sugar",
            "1 teaspoon salt",
            "2 eggs",
            "5 teaspoons active dry yeast",
            "5 cups all-purpose flour",
            "½ cup margarine, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan over medium heat, warm milk, water, sugar and salt.   Remove from heat, and mix in the eggs and yeast.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Measure flour into a large bowl. Make a well in the flour, and pour milk mixture into it. Do not stir. Cover with a lid, and let stand for 20 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour melted margarine into flour, and mix well. Add more flour if too sticky.  Knead lightly. Cover, and let rise for 20 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Shape the dough into rolls, and place on a baking sheet. Let rise again for 20 to 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake rolls in a preheated 400 degrees F (205 degrees C) oven for 15 minutes, or until done.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "Rolls and Buns"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SHERLIE"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.446611909650924,
            "ratingCount": 974,
            "itemReviewed": "Unbelievable Rolls",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "234.8 calories",
            "carbohydrateContent": "37.2 g",
            "cholesterolContent": "24.2 mg",
            "fatContent": "6.9 g",
            "fiberContent": "1.3 g",
            "proteinContent": "5.7 g",
            "saturatedFatContent": "1.4 g",
            "servingSize": null,
            "sodiumContent": "225.9 mg",
            "sugarContent": "7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-09-18T00:35:27.277Z",
                "reviewBody": "i've used this recipe to make dinner rolls for several years now and have always been foolproof.  the directions may be a bit strange but it works.  After working with this recipe for a long time, i've done some tweaking: i add the salt only after i've added the flour.  Salt retards yeast growth.  Also, when the dough is way too sticky to knead, just add flour a little at a time til it's workable.  To this basic recipe, I sometimes add in 1/2 cup grated cheddar cheese together with the margarine to make cheese flavored rolls. Yumm! Also, i avoid making the dough rise in a too warm place (i don't know with other bakers but the too warm environment just makes the \"yeasty\" taste stronger.  you definetely don't want that).  When shaping them into buns/rolls, pound out all the air bubbles that have formed during rising (and when we say pound, i mean POUND!).  This makes for a much milder tasting roll.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "topmom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2070487/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-16T01:19:50.657Z",
                "reviewBody": "Great recipe- nice and fluffy rolls.   After reading the reviews on this recipe, and seeing that many had trouble getting them to rise; I decided to try this recipe changing a couple of the methods used. 1st I proofed my yeast using the 3/4 cup water called for in the recipe- get it hot out of the tap- if it feels too warm to take a shower in then it's too hot  and will kill the yeast.  Put 1 tpblspn of the 1/2cup sugar  and the 5tsp of yeast into the warm water, and give it 5 minutes.  The yeast is ready when it's foamy if it doesn't get foamy try again, and if it doesn't get foamy a 2nd time- your yeast is probably too old.  I never use the stove to heat ingredients for bread recipes- it's too hard to control the heat.  Heat the milk in the microwave, 30 to 50 seconds- again if you stick your pinky in it and it feels too hot to take a shower in- it's too hot.  I then mixed my milk, yeast water and sugar and eggs.  I put the salt in with the flour, and followed the recipe exactly after that.  I made my rolls quite a bit smaller, and got 36 nice sized perfect rolls.  The whole family agrees this is one of the best roll recipe they've ever eaten.\n\n Note to  Bowie 112- most roll or bread dough can be frozen before the last rising. Shape as desired, put on wax paper on baking sheet,spray the wax paper with cooking spray to make frozen rolls easier to lift, when frozen put into zip locked freezer bag. Pull out the number you wish to use in the morning,  put on baking sheet, ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dazeedoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2599407/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-07T00:06:50.84Z",
                "reviewBody": "This recipe is the answer to my love/hate relationship with making bread.  Love the taste, hate the work!  This is a great recipe.  If anyone's results were biscuit like, then you did something wrong.  Here's the thing with bread recipes...don't worry about the recipe's rise times.  Use your judgment because invironment, yeast age, etc. plays a huge role in how long it will take.  I added less than half a cup of flour at the end, during the light kneading...yes, it was still sticky, but my rolls turned out beautiful, light, and airy.  I alse brushed the rolls with egg wash prior to baking to create a lovely shiny top.  I made 24 small rolls and 5 large sandwich rolls with this recipe.  If it didn't work for you, try again.  It's a great roll...just be patient with the rise times...sometimes it takes longer than suggested.  Also let the dough be a little sticky...it allows lighter rolls.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHELBYLYNN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/693224/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T21:45:05.42Z",
                "reviewBody": "For JOYCEMOSER - you questioned why your rolls turned out hard - you might have killed the yeast with your heated mixture being too hot when combined with the yeast.  When heating liquid for a recipe - make sure it is not hotter than 105-115 degrees F.  The other thing to check is the expiration date of your yeast - old yeast will not rise.  (I've even found old yeast on grocery store shelves - so check it before you buy it.)  HOpe this helps!\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KathyLP",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/272380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T19:34:22.853Z",
                "reviewBody": "Unbelieveable? Yes, ma'am! I used my Kitchen Aid mixer to make these rolls. I proofed the yeast (two packages, for those who wonder how much yeast to actually use) with the warm water and sugar for ten minutes, then added the milk (I used lowfat buttermilk), melted butter, eggs and all the dry ingredients. I did need just a touch more flour than the recipe stated to get it to form into a ball and jump on the bread hook. I kneaded it in the Kitchen Aid with the dough hook for about five minutes or more, adding more flour when the dough would stick to the bottom of the mixer bowl. I set it to rise in a greased bowl on my heating pad for an hour, then formed them into rolls and plopped them into greased muffin tins (about a heaping 1/4 cup for each roll?), covered them and set them to rise on my heating pad until they doubled. Right before baking, I lightly brushed them with a little melted butter. 400* for 15 minutes was absolutely perfect. HUGE dinner rolls that were soft, fluffy and absolutely wonderful. Bakery quality. What a wonderful recipe! NOTE: Watch these in the oven, they do have quick minute or two where they could burn. I almost had that happen but I caught it just in time.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-29T01:52:27.967Z",
                "reviewBody": "These live up to their name! They are tender, buttery, melt-in-your-mouth balls of heaven. As for people who can't seem to make them \"fluffy\", I have a couple of tips (as a former pastry chef). First, yeast is VERY Sensitive to High Heat. Make sure that you heat up the liquid and sugar 'til it's \"Very warm\" but not HOT! Otherwise, you'll kill the yeast. Also, add the yeast and mix it completely. Then add the eggs. Also, I substituted butter for margarine",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMNICHO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/631284/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T21:45:02.247Z",
                "reviewBody": "I have never made rolls before so I tried this recipe because of so many glowing reviews.  I tried this recipe twice, and was disappointed both times.  My rolls really didn't rise, and they were coarse and heavy.  I suspect the problem is with me, not the recipe. Can someone tell me what I did wrong?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Adopt-K9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/575387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-03-30T18:23:36.13Z",
                "reviewBody": "I hope that this will help some of you out there making my roll recipe.  I think the basic problem with making these is the temperture of the water and milk recipe.  Do not let it exceed 105 to 110 degrees. I also add the sugar and salt and stir to disolve before I add the yeast and the eggs.  I do use heated water from my hot water dispenser and then add the milk to it and it always seems to be the right temperature.  Also perhaps the eggs should be at room temp as they can cool down the milk/water liquid too much and the yeast wont work as well.  Another hint is to stir well so that the flour is incorperated almost to the point of kneading after you add the butter and then sprinkle with a bit of flour so it doesnt stick to the bowl.  I knead as little as possible and only when I turn it out on the board to make the rolls.  Let it rest a bit if you think you knead too much so it can relax again.  To make cinnamon rolls, I spread with 1/2 cup of really soft butter, sprinkle with 1/2 to 3/4 cup brown sugar mixed with 1 an 1/2 teaspoons cinnamon and then add chopped nuts. I hope this helps those of you who are having problems.  It is a fun dough to work with for making many different things.  Please check out the photo of the cinnamon roll made in the mini bundt pan and you will see what you can make.  These turned out delicious and crusty all the way around. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHERLIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24531/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-08T21:44:04.577Z",
                "reviewBody": "I just finished baking these rolls and my house smells wonderful. They look and taste great too.\r\nI read thru the reviews and I'd like to offer a little help to those who had difficulty with this recipe: you MUST use margarine NOT butter, & add more flour while you knead this dough a bit. This is not a Baking 101 recipe, if it was, there'd be more detail. These were delicious and I hope you give them another try, as my family really liked them. They are a \"keeper\" - thank you Sherlie.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LINDA528",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/702431/"
                }
            }
        ]
    }
]