[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/840/desserts/cookies/chocolate-cookies/",
                    "name": "Chocolate Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9971/chocolate-mint-filled-cookies/",
        "name": "Chocolate Mint-Filled Cookies",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F756319.jpg",
            "width": 1056,
            "height": 963
        },
        "datePublished": "1997-09-02T23:15:54.000Z",
        "description": "Chocolate cookies wrapped around mint candies.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "4 dozen",
        "recipeIngredient": [
            "1 cup semisweet chocolate chips",
            "2 cups all-purpose flour",
            "⅔ cup butter, softened",
            "¼ cup light corn syrup",
            "2 teaspoons baking soda",
            "¼ teaspoon salt",
            "1 egg",
            "½ cup white sugar",
            "48 small peppermint patties",
            "⅓ cup white sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In heavy small saucepan over low heat, heat chocolate chips, stirring occasionally, until melted and smooth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour melted chocolate into bowl and add flour, butter, corn syrup, baking soda, salt, egg and 1/2 cup sugar.  Mix with electric mixer at low speed until blended.  Increase speed to medium; beat until well mixed, scraping bowl frequently with rubber spatula.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Wrap dough with plastic wrap and refrigerate until easy to handle, about 2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (180 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Measure 1/3 cup sugar into small bowl.  Shape dough into 96 balls; roll balls in sugar to coat.  Place in even number of balls, about 2 inches apart, on ungreased large cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cookies 12 to 15 minutes until set.  Immediately remove half of cookies from cookie sheet and invert onto work surface.  While still hot, place chocolate-covered mint patties on remaining cookies, top side up.  Press cookies together slightly so mint patty spreads out to cookie edges as it melts.  With pancake turner, remove cookies to wire racks to cool.  Repeat with remaining dough and mints.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Chocolate Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Deborah"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.090909090909091,
            "ratingCount": 11,
            "itemReviewed": "Chocolate Mint-Filled Cookies",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "289.8 calories",
            "carbohydrateContent": "49.2 g",
            "cholesterolContent": "21.6 mg",
            "fatContent": "9.9 g",
            "fiberContent": "1.4 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "179.6 mg",
            "sugarContent": "11.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-12-21T19:51:50.16Z",
                "reviewBody": "I don't know how it is possible to make 96 dough balls from this recipe but it is still delicious! Mine made about 76. Also 12-15 minutes is way too long to bake for. I did about 7-8 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jamie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2694442/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-12T19:57:57.987Z",
                "reviewBody": "Whenever I make these everyone thinks I'm so clever but they are so easy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ETAINL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/687835/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-19T21:31:36.95Z",
                "reviewBody": "I does make 96 cookies. You just have to make small balls. I used my smallest cookie scoop and then cut them in half. They bake up to the perfect size to put the peppermint patty in and then press down a little bit. So Yummy! But DON\"T bake them 12-15 minutes. I baked mine 10 minutes and that was perfect.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "dlhainsworth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8402855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-28T19:59:09.91Z",
                "reviewBody": "These are amazing holiday sandwich cookies! The cookies are a delightful combination of crisp chocolatey soft and gooey. Baking these is a bit harder than I expected. I ruined about a dozen before I figured out what to do. I added 1 tsp vanilla (for extra minty cookies I think I will add peppermint next time). I chilled two hours in the fridge but the dough was still too wet to work with. 15 minutes more or so in the freezer fixed that problem. I worked with sections of the dough while storing the rest in the fridge. If you follow the recipe you are going to be making TINY balls of dough. Trust me when I say this is what you want. They spread out a LOT when baking. Leave plenty of room on the cookie sheet between each one no matter how small they look -- at least 2 inches. 12 minutes was MUCH too long in my oven. 9 minutes was perfect. The tricky part is making the cookie sandwiches without mauling the cookies. Assemble the cookies IMMEDIATELY on a warm surface (i.e. the pan itself or the stovetop) -- do not let them cool at all or they won't stick together properly and will be hard to work with. I used a very thin edged spatula to separate the hot cookies from the parchment paper I baked them on then quickly flipped half of them over slapped the mint on and put a right-side-up cookie on top pressing down with the spatula to melt the mint. Then I moved them to the cooling rack. These were more work than I anticipated but well worth it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Ciantarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/824209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-18T18:31:40.32Z",
                "reviewBody": "I only got 32 cookies (that's 64 halves) out of this recipe. Perhaps I'm using the wrong size of mints? I was using the York peppermint patties in the Christmas wrapping about 1.5\" in diameter. The candy's pretty thick and when you press the two halves together to make the \"sandwich \" what happens is that the warm cookie kind of smooshes around the candy. These make big cookies and not a lot of them. However it's a great recipe to make with kids; my 4-year-old son loved \"helping\" me make them. And I do like the cookies by themselves without the candy. They're light and dome-shaped. With a bit of peppermint vanilla or orange extract they'd be pretty good all by themselves. The dough was too wet to form balls and roll into sugar; I just dropped it by spoonfuls onto the pan. But you could sprinkle a bit of sugar on top for that sparkly effect easily enough. I probably won't do this recipe again as written. I'll try to chill the mints and slice them across (like a bagel) to make the finished cookies thinner. Happy holidays!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MAMAGOTCHA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1331503/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-23T18:56:40.34Z",
                "reviewBody": "excellent cookie! i used a small cookie scoop to measure each cookie. after spooning out cookies i cut each ball in half the rolled in sugar. this made the cookie just the right size for the peppermint candy. i stacked them in a wrapped pringles can for a cookie exchange. they were a perfect fit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-16T00:50:17.583Z",
                "reviewBody": "These are only ok. The only mint peppermint patties I found are in my opinion too thick. So I made some mint cream cheese frosting & put that in the middle instead which was better but not great. The third thing I tried was the best - a mint truffle Hershey kiss but you have to flip half the cookies over & leave them on the cookie sheet & put the kiss on bottom cookie & let it melt. Once it is \"gushy\" put the top cookie on & let cool.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/386866/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-08T22:31:04.583Z",
                "reviewBody": "I only made a half of a batch after reading the others reviews and wish I made a whole batch. They looked just like the picture! I wonder if that whole egg made a difference instead of a half? Anyhow I only made 22 whole cookies. If the ball is too small the mint oozes out of the side. I took a small cookie scoop and then halved that amount.I added 1 tsp. hazelnut extract to mine. They are messy to make. I wonder if adding flour to ones hands while handling the dough would help like I do when I shape bread dough? Or my grandma used to take wax paper and center the dough in a long tube and refrigerate. Then you slice off the the cookie like a coin after unwrapping the paper. A great holiday cookie unless you are like me and love chocolate mint. I will make again and if I discover an easier way I'll let you know. Yummy recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan M&M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6369023/"
                }
            }
        ]
    }
]