[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7682/cassata-cake/",
        "name": "Cassata Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F496506.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-06-09T18:00:55.000Z",
        "description": "Cassata cake is like a cannoli but more gooey. You need 2 - 9 inch sponge cake layers for this recipe. The instructions are given for to make them, or you can use your own recipe.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -9 Inch cake",
        "recipeIngredient": [
            "1 ½ cups cake flour",
            "½ teaspoon baking powder",
            "¼ teaspoon salt",
            "5 eggs",
            "½ cup cold water",
            "1 ¼ cups white sugar",
            "1 teaspoon vanilla extract",
            "½ teaspoon cream of tartar",
            "2 pounds whole milk ricotta cheese",
            "2 ¼ cups confectioners' sugar",
            "½ teaspoon ground cinnamon",
            "1 ½ teaspoons vanilla extract",
            "2 (1 ounce) squares semi-sweet chocolate",
            "½ cup candied lemon peel",
            "⅓ cup white sugar",
            "¼ cup water",
            "2 tablespoons light rum",
            "6 (1 ounce) squares bittersweet chocolate, chopped",
            "⅓ cup heavy whipping cream",
            "3 tablespoons unsalted butter, cubed"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Grease and line with parchment paper 2 nine inch round layer pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sift the flour, baking powder, and salt together.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Separate the eggs and set the egg whites aside. Beat the egg yolks together on medium-high speed until very thick, about 4 minutes. Gradually add the cold water. Add 1- 1/4 cups of the white sugar, slowly, and beat well for about 3 more minutes. Add 1 teaspoon of the vanilla. Sift the flour mixture over the egg yolk mixture and fold in.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat the egg whites and cream of tartar together until stiff peaks form. Fold this into the yolk mixture. Divide batter between the pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 325 degrees F (165 degrees C) for 25 minutes. Cool on rack for 10 minutes and then invert and cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut each cake layer in half. Place one of the 4 halves on a cake board or plate and sprinkle with a little of the Rum Syrup. Spread about 1-1/2 cups of the Filling over this layer. Add a second layer of cake and repeat this procedure. Top the cake with the last layer of cake. Chill at least 4 hours. Spread Chocolate Glaze over top of cake.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Ricotta Cheese Filling: Beat the ricotta cheese well and add the confectioner's sugar and cinnamon. Add 1-1/2 teaspoons of  the vanilla and grate 2 ounces of the chocolate in using the coarse side of a grater. Stir in the candied lemon peel and mix. Chill until ready to use.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make The Rum Syrup: Place 1/3 cup of the sugar and the water in a small saucepan. Bring to a boil over medium heat, stirring to dissolve sugar. Boil 1 minute and then remove from heat and add the rum. Cool to room temperature.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make The Chocolate Glaze: Melt 6 ounces of the chocolate and the cream in the microwave, whisk smooth. Add the butter and whisk until dissolved. Cool mixture until spreadable. Spread over the top of the cake.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kevin Ryan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.026315789473684,
            "ratingCount": 38,
            "itemReviewed": "Cassata Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "601 calories",
            "carbohydrateContent": "84.1 g",
            "cholesterolContent": "133.4 mg",
            "fatContent": "23.6 g",
            "fiberContent": "2.4 g",
            "proteinContent": "14.1 g",
            "saturatedFatContent": "14 g",
            "servingSize": null,
            "sodiumContent": "174.2 mg",
            "sugarContent": "63.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-10-23T14:45:17.293Z",
                "reviewBody": "This recipe is GREAT as I said in my first review. Perfect cassata cake that is even better than any NYC Italian bakery I have ever tasted because it is not sickly sweet and made with fresh filling rather than bagged pre-made filling. BUT DO NOT use the chocolate glaze for the top...I always use the whipped cream frosting (made with a teaspoon of gelatin) from this website. I have never seen nor have I had Cassata cake with chocolate glaze. The combination of this cake with that frosting is PERFECT!!! =)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUCYMARILYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/334003/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-07-04T15:16:27.14Z",
                "reviewBody": "This was a fantastic cake. Every year I purchase a cassata cake from a local italian bakery for my dad for father's day. This year I decided to give it a try on my own. He absolutely loved it. I did make a few substitutions based on the cassata cakes that we have enjoyed in the past. I substituted mini chocolate chips instead of the grated chocolate & I omitted the candied lemon peel. I also left off the chocolate glaze (I have never seen this on a cassata cake) and instead substituted a whipped cream frosting also from this website. I also used a vanilla flavored light rum for the filling. My entire family loved this one I'll definitely make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicole Besancon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/495248/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-22T16:13:18.91Z",
                "reviewBody": "If you put a circle of icing around the edge of the cake before you add the filling it will not ooze out. I usually fill a freezer zip bag and clip one of the ends. Run a big enough edge to prevent the filling from coming out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Aunt Jello",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3343772/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T08:35:32.403Z",
                "reviewBody": "this is an excellent recipe. i've used it at least five times since i found it. the cassata cake turns out better than the ones i had from the italian bakery when i was little and those were pretty good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUCYD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/183989/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-20T02:03:01.877Z",
                "reviewBody": "I make this all the time for my 100% Italian In-laws. Its a great recipe! I make the filling and cake a day ahead and drain the filling so its not so \"gooey\". I also use a whipped cream frosting all over the cake and top it with dark chocolate shavings. Its really incredible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNTHIA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1682832/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-14T00:29:44.61Z",
                "reviewBody": "This cake was a huge hit! though i gave it 4 out of 5 stars because i was upset before i had a peice. it took me about 5 hours to make this cake. I only had one cake pan and one mixer going and made three instead of 2 layers regurdless its very time consuming but very worth it. now the reason i was upset was because the filling is so gewy it does not stay between the layers very well especially since this is a pretty heavy cake. and i was prepared to do some very nice cake decorating but the filling kept oozing out and mixing in with the frosting witch by the way i used cheesecake frosting instead of what this recipe required...and it was a big hit im sure especially because the filling and the cheescake frosting mixed a bit on the outside as well...yumm...also due to the three layers witch i decided to do because two didnt look enough...the cake was tipping a little bit i think if the filling wasnt so slippery and alittle more solid it would have worked better but hey it taste good...sooo...i am definetly going to make this cake again...however i am going to use two layers and make each layer with an extra 1/2 the amount to make them alittle bigger...before i put the filling in im gonna hallow the cake alittle bit so the filling will stay in better...and im still gonna use the cheesecake frosting because is was such a big hit...also im gonna buy another cake pan hahaha...",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Spritegal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2319692/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-23T17:28:49.967Z",
                "reviewBody": "anyone making this recipe should be aware when you buy ricotta cheese there are two types one specifically for baking and one not! the baking variety has less water content therefore will not be as runny. The brands sold in most grocery stores have a high water content especially Tre Sella brand. you could let it sit over a colander overnight to help release water or just buy different brand. I like Salerno from the grocery stores if i cannot get to the specialty store. Good cake everyone enjoyed it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "deepries",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1827610/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T23:28:00.443Z",
                "reviewBody": "YUCK! This was awful and didnt taste like any canolli I've ever tasted in my 27 years(and I'm from Philly and now live in NYC where there are awesome italian bakeries and restaurants). Using semi-sweet chocolate on the top was not a good idea because the filling wasnt sweet enough to offset the bitterness of the chocolate. Also I found that the filling didnt thicken enough it was way too runny. I wouldnt recommend this to anyone.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "CMDKQB",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/638358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-23T23:50:46.267Z",
                "reviewBody": "The cake was excellent. I made it for a family birthday and everyone wanted seconds even those who aren't fans of ricotta cheese. I followed all instructions as directed for the spongy cake. But made a few variations in the filling and final assembly. Instead of chocolate squares I used mini chips to save time. I also omitted the candied lemon peel and the rum (personal preference). And instead of a chocolate glaze I used a plain whipped cream for the frosting and pressed sliced almonds on the outside. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MAIF17",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/440512/"
                }
            }
        ]
    }
]