[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/148/breakfast-and-brunch/eggs/",
                    "name": "Eggs",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/217335/donnas-nest-eggs/",
        "name": "Donna's Nest Eggs",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1084005.jpg",
            "width": 3100,
            "height": 3100
        },
        "datePublished": "2011-12-15T20:53:50.000Z",
        "description": "Easter morning tradition in our family. Also great brunch item. Serve with cocktail sauce and/or ketchup. Use spicy sausage if you like it.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT0H50M",
        "recipeYield": "6 sausage eggs",
        "recipeIngredient": [
            "½ cup milk",
            "1 (3 ounce) package seasoned coating mix (such as SHAKE-N-BAKE®)",
            "1 pound bulk pork sausage",
            "6 hard-boiled eggs, peeled"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour milk into a shallow dish; empty the packet of seasoned coating into a large plastic zipper bag. Divide the pork sausage into 6 equal portions, and cover each egg completely with a layer of sausage. Roll the sausage and egg balls in the milk, and place in the plastic bag. Seal the bag, and gently shake until balls are covered with seasoned coating. Place the coated sausage and egg balls onto a rack over a baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until golden brown and slightly crisp, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Eggs"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "CARMOMOF4"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.4,
            "ratingCount": 20,
            "itemReviewed": "Donna's Nest Eggs",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "336.8 calories",
            "carbohydrateContent": "12 g",
            "cholesterolContent": "256.9 mg",
            "fatContent": "23.4 g",
            "fiberContent": null,
            "proteinContent": "18.6 g",
            "saturatedFatContent": "7.5 g",
            "servingSize": null,
            "sodiumContent": "1057 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-02-26T18:01:43.703Z",
                "reviewBody": "Scotch eggs - baked not fried!  These will be great for Easter morning.  I had just under 1 lb of sausage and it cover 4 large eggs.  For Easter I will buy small eggs.  (make sure to age them so they peel easily)  I used Shake n Bake for pork and it was perfect.  The baking time was spot on.  I did use a beaten egg to dip the sausage egg balls instead of milk.   Tip:  When forming the sausage into patties - use a bit of flour on your hands, it keeps the sausage from sticking to your hands and makes forming the sausage around the egg easier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baking Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bakingnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-04-25T13:11:26.387Z",
                "reviewBody": "I haven't tried it yet but I certainly intend to. This sounds like a great way to simulate 'scotch eggs' that I can find only at our local renaissance fair. And no deep frying necessary! BTW they serve them with a country gravy or cheese sauce. I like mine with whole seed mustard.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Pat Weiser",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3424011/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-20T23:19:46.763Z",
                "reviewBody": "We've never had anything like this before but we all LOVED them! I used a 1# roll of Italian sausage and had no problem covering 6 large eggs. I cut the sausage into 6 pcs. and flattened each piece between waxed paper which worked perfectly. Everyone was really surprised at how good these were...I wasn't sure hoe the little guy was gonna like them but he ende up eating the most lol...A definite repeat recipe YUM! Thanks for sharing.:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-26T17:45:58.277Z",
                "reviewBody": "What a wonderful discovery. I have had Scotch eggs in pubs but the idea of frying these in oil left me hesitant to make these as a rgular treat at home. This recipe is terrific and I have made it three times in the last couple of weeks. Here are a few tips.....make sure your hard boiled eggs are cold and dry before you try to wrap them in sausage. Wet your hands to keep the sausage from sticking to your hands. I put about 1/4 lb of sausage in my damp palm and make a little nest to put my egg in and then form the sausage around the rest of the egg. I think 1 lb. of sausage is just right for 4 large eggs as Baking Nana mentioned in her review....so 2 lbs sausage for 8 eggs. The last time I made these I forgot to dip the sausage wrapped eggs in milk before crumbs and we could not tell the difference without the milk step. In the future I will skip that step entirely. I used chicken breakfast sausage to cut the fat too. I do not buy shake and bake but I used this recipe and reduced to 1/4 of the amount to make my own shake & bake with AR's recipe: Homemade Shake and Bake Mixture. (I used 1/2 cup Panko & 1/2 cup dry bread crumbs in my shake and bake for a crispier crust) Thanks for sharing this wonderful recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mauigirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mauigirl1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-01T00:04:25.243Z",
                "reviewBody": "These were delicious prepared and cooked exactly as written. I also made them using egg/water and then seasoned bread crumbs. Both ways were fantastic. I served them over wilted spinach and topped with a homemade chicken gravy for dinner. I just wish people would not rate until they've made the recipe. These are great and very easy to make. One pound bulk sausage and 1 cup bread crumbs were perfect for 4 extra large eggs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lorrie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1642465/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-05T13:55:59.26Z",
                "reviewBody": "Used \"hot\" sausage and mixed up some Shake and Bake Mixture from this site. These were not even remotely bland rather loaded with flavor. Been a long time since I've made scotch eggs and this was a treat. Served with Mustard Cream Sauce from AR's site as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-19T14:44:49.08Z",
                "reviewBody": "Stumbled upon this wonderful recipe; just like the scotch eggs hubby and I used to order in a local \"British\" pub that has since closed. By accident I had the ingredients on had this morning for a hearty Saturday morning brunch...or so I thought. I had purchased Jimmy Dean hot pork sausage to make sausage balls next weekend for an adult Halloween party but at a gathering last night I overheard the hostess saying she was making meatballs so \"Scotch Eggs\" was a good use of pork sausage that I rarely buy. I don't typically buy Shake and Bake either but had seen a recipe here for homemade then discovered I had no breadcrumbs or celery salt and nearly no Panko. I toasted some sliced sourdough bread combined it with the little bit of Panko crumbs I had seasoned it following the Shake and Bake recipe and added some ground red pepper ground coriander poultry seasoning and extra garlic powder for more flavor. I used 4 left-over extra large hard-boiled eggs I had cooked earlier in the week for deviled eggs and the whole pound of sausage. I had no problems molding the sausage to the eggs but I did make sure the eggs were dry as another reviewer suggested and I used an egg to dip into instead of milk. The baking time was perfect and my husband must have said how much he loved these six times during the meal and again while doing dishes. I over-did the red pepper for my taste but he loves spicy-hot food so he said not to change a thing and to make them again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Zhu Zhu",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12153615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-03-28T18:04:43.05Z",
                "reviewBody": "I followed the recipe to the letter. I thought they must be mistaken that a whole pound of sausage only covers 6 eggs but that was right on! My husband loved these and even my two year old ate the sausage covering off an egg. It might be too much to ask that he eat the egg too. Very well explained and easy to make.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "E Fritz",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2675149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-30T17:52:02.783Z",
                "reviewBody": "This is just an overly simplified version of Scotch Eggs. The main difference is that this recipe is much less flavourful. Add more seasoning chopped onions and put through flour then egg and milk and then roll in breadcrumbs. Deep fry or simply bake. Now that's a lot tastier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "brannan007",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10287508/"
                }
            }
        ]
    }
]