[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/731/world-cuisine/european/greek/",
                    "name": "Greek",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/235270/yia-yias-baklava/",
        "name": "Yia Yia's Baklava",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2436025.jpg",
            "width": 1872,
            "height": 2808
        },
        "datePublished": "2011-12-22T19:18:38.000Z",
        "description": "This recipe was passed from my Yia Yia to her daughter-in-law (my mother) to me. People love this as a Christmas gift. It has gained a big reputation among our friends. One time, my mother donated a small tin of baklava to a church charity auction. It was very competitive, but the price was driven up to $40!",
        "prepTime": "P0DT0H45M",
        "cookTime": "P0DT0H50M",
        "totalTime": "P1DT1H35M",
        "recipeYield": "20 servings",
        "recipeIngredient": [
            "2 cups water",
            "2 cups white sugar",
            "4 whole cloves",
            "½ cinnamon stick",
            "1 lemon, juiced, divided",
            "1 pound finely chopped walnuts",
            "1 cup white sugar",
            "2 tablespoons ground cinnamon",
            "½ teaspoon ground nutmeg",
            "¾ cup unsalted butter, melted, or more as needed",
            "20 sheets phyllo dough"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Stir together water, 2 cups sugar, cloves, cinnamon stick, and 1/2 the lemon juice together in a saucepan. Bring to a boil, reduce heat to low, and simmer until flavor blends and syrup consistency is reached, about 15 minutes. Stir remaining 1/2 the lemon juice into syrup. Strain and refrigerate until cool, at least 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir walnuts, 1 cup sugar, ground cinnamon, and nutmeg together in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Brush butter on the bottom and sides of a 9x13-inch glass baking dish.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lay the phyllo dough out on a clean, dry surface and cover it with plastic wrap. Cover the plastic wrap with a damp towel.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Lay 1 sheet of phyllo dough in prepared baking dish and lightly brush with butter. Lay another 1 sheet of phyllo dough on top, brush with butter. Repeat layering and brushing with butter with 4 more sheets of phyllo dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently spread 1/3 the walnut mixture in an even layer over the phyllo dough in the baking dish. Place a sheet of phyllo dough over the walnut mixture and brush it with butter. Repeat layering and buttering with 3 more sheets of dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread another 1/3 the walnut mixture in an even layer over the phyllo dough in the baking dish. Place a sheet of phyllo dough over the walnut mixture and brush it with butter. Repeat layering and buttering with 3 more sheets of dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread the remaining 1/3 walnut mixture in an even layer over the phyllo dough in the baking dish. Place a sheet of phyllo dough over the walnut mixture and brush it with butter. Repeat layering and buttering with the remaining 5 sheets of dough. Cut baklava into 1-inch diamonds.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until lightly golden brown, 35 to 45 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour cooled syrup over baked baklava and cool for 1 day to absorb syrup.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Greek"
        ],
        "recipeCuisine": [
            "European",
            "Greek"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Jacolyn "
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7272727272727275,
            "ratingCount": 11,
            "itemReviewed": "Yia Yia's Baklava",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "385.8 calories",
            "carbohydrateContent": "44 g",
            "cholesterolContent": "18.3 mg",
            "fatContent": "22.9 g",
            "fiberContent": "2.4 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "6.1 g",
            "servingSize": null,
            "sodiumContent": "94.5 mg",
            "sugarContent": "30.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-09-03T13:35:09.333Z",
                "reviewBody": "Hi everyone, I submitted this recipe and have a quick note for anyone who saw this featured in the AR magazine:  They said they halved the syrup and only let it sit for 2 hours.  Though this is possible to do in a pinch, the baklava really does need the full 8 hours to soak up the syrup in order to have the optimal moist texture. I have tried it both ways, and the traditional 8 hours is much preferable to people I serve this to.  Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jacolyn ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jacolyn/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-25T04:29:45.3Z",
                "reviewBody": "Just made this for a xmas eve dinner party, and it received rave reviews from some very savvy baklava lovers. I did make a couple of tweak, as I grew up with baklava (am half Greek) and had some Nana memories to work from. I added honey to the syrup. Can't really say how much, as I was making a double batch, and doing things to taste. Also, I didn't add cloves to the syrup (didn't have any whole) so instead added ground cloves and a tablespoon of allspice to the walnuts, decreasing the cinnamon and omitting the nutmeg (the later wasn't a flavor I remembered in Nana's delicious baklava). those were my only changes, I  followed the ratios of phyllo to walnuts mixture religiously, and let the syrup soak in for about 12 hours ( in the fridge). The results were moist, syrup soaked pastries that were still crisp and fabulous. As I said, rave reviews!! People went out of their way to tell me how perfect they were. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christyl Everleigh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/17113047/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-15T03:00:50.913Z",
                "reviewBody": "I made this today for a Valentine's Day treat for my family who loves baklava. I only used 10 ounces of walnuts and felt that was more than enough. After brushing butter on each piece of phyllo and putting together the pan of baklava there was still about a cup of butter left. Since I have made baklava before with a Turkish girlfriend I remembered that she just poured about a cup of melted butter over her layers of nuts and dough so that's what I did with the rest and it turned out great. Next time I make this I'll use a lot less cinnamon--it's just not a taste I associate with baklava although it wasn't bad. I'll definitely use this recipe again but with a few tweaks. I also used the suggestions in the All Recipes magazine of cutting down the syrup to 1 1/4 cups water and 1 1/2 cups of sugar with 2 tablespoons of lemon juice and only let the syrup soak in for 2 hours before eating.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "chailover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13158687/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-03-21T19:12:25.033Z",
                "reviewBody": "Im still working on this its in the oven but wanted to note that my syrup is way watery. I've tried boiling the snot out of it. I don't know what to do since this is my first time I'm not sure how thick its suppose to be or if I should go ahead and pour it on still or start over with the syrup///anybody there to help? Maybe I should add honey to it to firm it up some. I've read other reviews that say \"The syrup should be hot when poured over the cooled pastry. There s one rule for adding sugar syrup to baklava: The temperature of the pastry must be opposite that of the syrup. I had always been advised to pour cold syrup over hot-from-the-oven pastry. But the baklava was never quite as crisp as I wanted; the hot pastry absorbed the syrup readily and softened quickly. So I decided to try pouring hot syrup over cooled pastry which worked beautifully. Letting the pastry cool and settle kept the layers separate and crisp even after adding the syrup.\" It has a very distinct cinnamon flavor but that's ok with me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pineappleupsidedown",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8415228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-07-24T06:03:54.71Z",
                "reviewBody": "I followed this recipe exactly as written, I wouldn’t change a thing. It was very simple and delicious",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Annemarie Paglia",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4376674/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-12-16T01:47:57.12Z",
                "reviewBody": "I followed the basic overall recipe. Subbed in pecans for walnuts though and added 2 extra layers of phyllo to the bottom. Boyfriend said it was the best baklava he's ever had. Even with an incident with my pan leaking some of the syrup out it was still a success. I tried it myself to see how it was (I'm not really a baklava fan) and was surprised at how good it was. I will make it again. Very happy with this recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "C. Lee",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15623653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-06-27T04:20:39.73Z",
                "reviewBody": "Did not change a thing for this fabulous dessert! All of our dinner club loved it. A little time consuming but nothing difficult about it. I made it early in the morning and let it sit uncovered until 8 pm or so. Refrigerated the leftovers and they stayed fresh tasting for the two additional days that they stayed around!!! My new favorite special dessert to make. I did let the syrup cook a little long so that it was pretty hard as it cooled. I just added a little water and reheated it until it liquified again. Was still a wonderful syrup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MDill",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1642113/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-12-27T10:23:42.49Z",
                "reviewBody": "This was the first time that I used lemon juice and no honey or orange in the syrup. I modified the syrup a bit and added some honey but not sure that I would do that again with the lemon. I will try it again as is. It was very good though. I recommend doubling the recipe and making two pans because everyone wants a few pieces give away as little gifts.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jeannie Kontis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6174134/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2019-01-04T00:44:31.03Z",
                "reviewBody": "I have never made a more incredible dessert in my life- honestly. This stuff is dangerous! Followed the recipe to the letter with the exception of using pecans for 2oz of the nuts because I was little short on walnuts. INCREDIBLE!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyDaysNora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/greengirl24/"
                }
            }
        ]
    }
]