[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/223/side-dish/grains/",
                    "name": "Grain Side Dish Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15899/side-dish/grains/grits/",
                    "name": "Grits",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/220895/old-charleston-style-shrimp-and-grits/",
        "name": "Old Charleston Style Shrimp and Grits",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2015%2F03%2F1046567_Old-Charleston-Style-Shrimp-and-Grits_220895_Photo-by-naples34102.jpg",
            "width": 650,
            "height": 465,
            "caption": "Old Charleston Style Shrimp and Grits | Photo by naples34102"
        },
        "datePublished": "2011-12-17T15:15:17.000Z",
        "description": "Great recipe for shrimp and grits.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "3 cups water",
            "2 teaspoons salt",
            "1 cup coarsely ground grits",
            "2 cups half-and-half",
            "2 pounds uncooked shrimp, peeled and deveined",
            "salt to taste",
            "1 pinch cayenne pepper, or to taste",
            "1 lemon, juiced",
            "1 pound andouille sausage, cut into 1/4-inch slices",
            "5 slices bacon",
            "1 medium green bell pepper, chopped",
            "1 medium red bell pepper, chopped",
            "1 medium yellow bell pepper, chopped",
            "1 cup chopped onion",
            "1 teaspoon minced garlic",
            "¼ cup butter",
            "¼ cup all-purpose flour",
            "1 cup chicken broth",
            "1 tablespoon Worcestershire sauce",
            "1 cup shredded sharp Cheddar cheese"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bring water and 2 teaspoons salt to a boil in a heavy saucepan over medium-high heat. Whisk grits into the boiling water, and then whisk in half-and-half. Reduce heat to medium-low and simmer, stirring occasionally, until grits are thickened and tender, 15 to 20 minutes. Set aside and keep warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Sprinkle shrimp with salt and cayenne pepper to taste. Add lemon juice, toss to combine, and set aside to marinate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place sausage slices in a large skillet over medium-high heat. Cook, stirring occasionally, until browned, 5 to 8 minutes. Remove sausage from the skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add bacon to the same skillet and increase heat to medium-high. Cook until evenly browned, about 5 minutes per side. Transfer bacon to paper towels to drain, then chop or crumble when cool enough to handle. Leave bacon drippings in the skillet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Add bell peppers, onion, and garlic to the bacon drippings; cook and stir until onion is translucent, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir cooked sausage and marinated shrimp into the skillet with the cooked vegetables. Turn off the heat and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter in a small saucepan over medium heat. Whisk in flour, stirring to create a smooth roux. Turn heat to low and cook, stirring constantly, until mixture is golden brown in color, 8 to 10 minutes. Watch carefully, mixture burns easily.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour the roux over the sausage, shrimp, and vegetables. Place the skillet over medium heat, add chicken broth, bacon, and Worcestershire sauce, and stir to combine. Cook until sauce thickens up and shrimp turn opaque and bright pink, about 8 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Just before serving, mix sharp Cheddar cheese into grits until melted and grits are creamy and light yellow. Serve shrimp mixture over cheese grits.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Grain Side Dish Recipes",
            "Grits"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "berskine"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.87787610619469,
            "ratingCount": 1130,
            "itemReviewed": "Old Charleston Style Shrimp and Grits",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "617.7 calories",
            "carbohydrateContent": "16.2 g",
            "cholesterolContent": "269.8 mg",
            "fatContent": "43.7 g",
            "fiberContent": "1.2 g",
            "proteinContent": "38.6 g",
            "saturatedFatContent": "19.5 g",
            "servingSize": null,
            "sodiumContent": "1634.8 mg",
            "sugarContent": "2.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-09-24T02:38:10.41Z",
                "reviewBody": "Shrimp and Grits - a dish that has been nagging me for years to try it. Last week, while in Memphis, I finally tried it and fell in lust.  But the dish was VERY spicy and on the greasy side and I knew I could do better.  I researched Shrimp and Grits on my flight home and learned a lot, not the least of which was that it was originally a breakfast dish.  I also learned there are as many ways to make it as Mama makes her meatballs, and everyone thinks theirs  is the true and only way  to make it.  I say bah!  Make what appeals to you - wine, no wine, tomatoes  or not, okra, no okra, cream or no.  The variations seemed endless.  Make what appeals to you - and this recipe appealed to me.  It ran circles around the dish I had at a popular restaurant in Memphis (clearly they do much better with barbecue!) and both Hubs and I thought this was \"lick-your-plate-clean good.\"  Because it is my preference I  used polenta rather than grits, but the difference, really, is marginal.  I used chicken broth in the  polenta/grits rather  than the water simply so as not to waste what I had left.  It just contributed a richer flavor anyway!  The recipe itself is perfect in my mind.  I can't say enough how blown away Hubs and I both were over this.  It is traditionally a humble dish, but it is also quite elegant - something I will be sure to keep in mind when I want to impress.  Once again, this version of Shrimp and Grits is a real \"beaut\" and I would suggest following it to the letter.  A+",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-16T23:03:22.54Z",
                "reviewBody": "This was freaking AHHHMAZING!!!! Possibly my BEST dinner ever. YUM",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anonymous",
                    "image": null,
                    "sameAs": null
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-05T01:23:07.39Z",
                "reviewBody": "If you want to cut some of the fat (and calories) without compromising taste, here are a couple suggestions:\n\n- Add 1 cup of 2% milk to the grits when you would have added the half-and-half, and keep on low heat while you make everything else. Every few minutes as it thickens, add a little more lowfat milk, so you end up using 2 C lowfat milk instead of 2 C half-and-half. Add cheese per recipe.\n- Chop up your bacon and cook it in the skillet/pan until browned, then remove with a slotted spoon. Add your sausages and brown them a little, and remove them with a slotted spoon. Then add your 1/4 C flour to the pan you cooked the meat in, whisking so that you have a thick roux. (If your bacon was really lean you might add 1 TBL of butter.) Cook and stir over med-low until it's medium brown, then increase heat to med-high & add all your vegetables into the roux, stirring for 5-8 minutes until they're soft. Add the chicken broth and Worcestershire, cooking veggies a few minutes while the sauce thickens and they cook a little more, then add back the sausage, bacon and the shrimp and cook until shrimp are done. \n\nYou will cut out 70 grams of fat and 475 calories by making these small changes, without compromising taste at all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tracy_V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4707862/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-24T23:03:44.48Z",
                "reviewBody": "Absolutely the BEST Shrimp and Grits I have ever made!  My son does not like Shrimp and Grits but after trying this, his response was \"This is how Shrimp and Grits should be made\".  All smiles in this household!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHMAMA1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1179357/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-09-18T20:17:11.007Z",
                "reviewBody": "Being born and raised in Charleston, South Carolina, means I have a very high standard for shrimp and grits. It was, after all, invented hereabouts. This recipe definitely passed the test. I used locally stone ground grits (which are so good that you will be ruined for the cheap stuff at the grocery store) and fresh local shrimp from right down the road (the best shrimp I can get, in other words). I was doubtful about the andouille sausage; I thought it would be gilding the lily at first, but I shrugged my shoulders and added it in anyway. With the first bite, my doubts were layed to rest. The sausage added a wonderful smoky, meaty note to the dish that's not usually found in classic shrimp and grits. I, of course, added garlic powder and butter to the grits, because it's better that way, and sprinkled a little paprika over the whole thing, and it was perfection. Definitely a new staple recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mirkit1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10447974/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-05-18T23:48:12.507Z",
                "reviewBody": "Can you say YUMMMMEEEEEEEE? This was fantastic. only thing I did different was omit the bacon since I forgot to buy it and I used queso cheese instead. Other than that the directions were right on the button and the flavors, well, YUMMMMEEEEEEEE!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DawnSig",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4390136/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-07-01T02:34:03.213Z",
                "reviewBody": "I saw another recipe for shrimp and grits on this site and it made me explore the other shrimp and grit recipes. This one is fabulous! I made a few minor adjustments for my taste and they worked out just fine. I used chicken Andouille sausage from Trader Joes,green, red and orange peppers, added fresh asparagus and canned diced tomatoes ( would have preferred fresh but didn't have any). I added a bit more cayenne because my family likes a little more heat and kept everything else the same. As far as the grits go I added garlic powder, but I also put a couple of shakes of ground red pepper to the mix. It definitely kicked it up a notch and married well with the shrimp mixture. The shrimp combo on top of the cheese grits was a taste explosion in my mouth! When my daughter and cousin came in the next day they immediately wanted to know what the wonderful smell was and both sat down and had a bowl. The flavors were even more electrifying the next day. The beauty in this is you can tweak this recipe to your liking. I chose to add more veggies. Keep in mind if you add more veggies they create more liquid. If you like a thicker gravy adjust your flour mixture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Hunt-Reynolds",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6095299/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-01T04:40:22.897Z",
                "reviewBody": "wish i could give it more than 5 stars. I omitted bacon and salt. I used 2 cups of chicken broth and 1 cup of  water instead of 3 cups of water. i saved shrimp from sausage mixture and added it to flour butter roux. I cooked the shrimp just until barely done. This is the best meal on the planetl.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Suzanne Flores",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9526555/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-15T14:20:33.18Z",
                "reviewBody": "My doctor would have a fit about all that's bad about this recipe, and I honestly wouldn't make it often, but I sure will make it again - as I shake my fist at death.  I made it very nearly as written, and it was marvelous.  The flavors were well-balanced.  Next time, I think I will try to reduce the fat somewhat, but do try the recipe as written once, at the very least. Thanks to the author for a spendid recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "greaterexp3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3739706/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-07T14:24:25.87Z",
                "reviewBody": "This was my first time having shrimp and grits of any kind. Although it wasn't bad it wasn't the best recipe I've ever made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "itsprecious",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6336234/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Old Charleston Style Shrimp and Grits",
            "description": "Tender shrimp and sausage with peppers over cheese-flavored grits.",
            "uploadDate": "2014-03-05T00:40:24.364Z",
            "duration": "PT3M50.797S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F2790c647-6c60-450e-b072-1611ba161f61%2F4712525f-24e4-4b4a-8ad4-c90bd1847b62%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=3293339091001"
        }
    }
]