[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/219912/my-moms-raised-doughnuts/",
        "name": "My Mom's Raised Doughnuts",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3586620.jpg",
            "width": 1961,
            "height": 1961
        },
        "datePublished": "2012-01-24T18:21:39.000Z",
        "description": "I used to make these with Mom as a little girl. She would make dozens a week and give to neighborhood kids. I would coat them with that ooey good frosting. I recently won a blue ribbon with this recipe. It was also featured and put in newspapers all over the U.S. Then it was voted as 1 of 100 top recipes to be put in the 2011 Members Choice cookbook. They are like eating a flavored cloud. So light and fluffy. Hope you enjoy them as much as we do.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H0M",
        "recipeYield": "2 dozen doughnuts",
        "recipeIngredient": [
            "½ cup warm water (100 to 110 degrees F/40 to 45 degrees C)",
            "2 (.25 ounce) packages active dry yeast",
            "1 teaspoon white sugar",
            "¾ cup milk, lukewarm",
            "⅓ cup vegetable shortening",
            "¼ cup white sugar",
            "1 teaspoon salt",
            "2 eggs",
            "4 cups sifted all-purpose flour",
            "2 quarts vegetable oil for frying",
            "1 tablespoon warm water",
            "½ teaspoon vanilla extract",
            "1 cup confectioners' sugar, sifted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour 1/2 cup of warm water into a small bowl, and stir in the yeast and 1 teaspoon of sugar. Allow the yeast mixture to stand until it forms a creamy foam layer on top, 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place milk and vegetable shortening into a small saucepan over medium-low heat and cook until the shortening has melted and the milk has tiny bubbles around the edge. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place 1/4 cup of sugar and the salt into the work bowl of a large stand mixer and pour the milk and shortening into the bowl. Mix on low speed just to dissolve sugar; and allow mixture to stand until warm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Beat in the yeast mixture, eggs, and 1 cup of flour on low speed until smooth. Gradually beat in remaining flour to make a soft dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Continue beating the dough on low speed until dough leaves the sides of the bowl, 2 to 3 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn the dough out onto a well-floured work surface and knead until smooth and elastic, 2 or 3 more minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Form the dough into a ball and place into a large greased bowl. Grease the top of the dough, and cover the bowl with waxed paper. Set the bowl into a warm place; let the dough rise until doubled in size, 1 to 1 1/2 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down the dough and roll out on a floured work surface to 1/2 inch thick. Cut doughnuts out of the dough with a 3 1/2-inch round doughnut cutter with a 1-inch smaller cutter in the center. Let the doughnuts rise on the work surface until very light and fluffy, 40 minutes to 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently pick up and drop the doughnuts into the hot oil, working in small batches of 2 or 3 at a time, and cook until the doughnuts are light golden brown, turning once, about 2 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Drain the doughnuts on paper towels to absorb oil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a bowl, mix 1 tablespoon of warm water and vanilla extract, and stir in the confectioners' sugar to make a glaze. Spread a thin layer of glaze over the warm doughnuts.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Peggianne "
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.770562770562771,
            "ratingCount": 231,
            "itemReviewed": "My Mom's Raised Doughnuts",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "206.6 calories",
            "carbohydrateContent": "24 g",
            "cholesterolContent": "16.1 mg",
            "fatContent": "11 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "1.9 g",
            "servingSize": null,
            "sodiumContent": "106.8 mg",
            "sugarContent": "7.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-09-02T13:07:37.887Z",
                "reviewBody": "If these don't rise for you like they should, either your yeast is bad or something else you are doing wrong. Please don't blame the recipe & rate it down because of your errors! Also, if the bread dough was super sweet like some are wanting, when you put the glaze on, it would be so sweet, you couldn't eat it. Try a store bought doughnut without icing. No difference. And just because you grew up in a bakery, doesn't mean YOU can bake. I grew up with my father as a rock mason, but I can't lay rock!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Peggianne ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/peggianne/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-06-14T03:30:24.723Z",
                "reviewBody": "Very tasty! My kids told me, \"Mom, these are better than Dunkin'. Your the best cook in the whole wide world!\" After a comment like that I will make again and again. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Love2CookMommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/love2cookmommy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-04-18T19:02:14.713Z",
                "reviewBody": "This recipe is absolutely amazing! They do take time, but they are SO worth it! They are light and airy, with just a touch of crisp on the outside. They are bakery quality for sure! I made maple and chocolate glazes for them, and they are to die for! We will probably not get store donuts again! I fried them in mostly veggie oil with about a cup of shortening added in (something I saw on here somewhere). I don't know if it made a difference, but that's what I'll do from now on!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "sandyt627",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9166558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-09-10T12:44:45.98Z",
                "reviewBody": "I'm a doughnut connoisseur... This is the best recipe I have ever found for doughnuts! Made 3 batches in 4 days. It can be a little tricky on step 8, because it doesn't say to knead dough after you punch down, but it's a must. I learned this on 1st batch, I followed recipe exactly as called for, but noticed the 1st doughnuts didn't rise near as well as the trimmings I kneaded back into a ball and rolled out again...even made a chocolate glaze to add a little variety.  2nd batch, I mixed in ground cinnamon in step #8 the kneaded & rolled out then cut dough into 1 inch strips and folded to make cinnamon twists then coated with glaze (I doubled the glaze mixture) and /or with cinnamon sugar... Phenomenal!!! All gone before I could take a pic(not kidding). 3rd batch, followed steps 1-7 then at 8 after punching dough I added 3 TBS powdered cinnamon and 2 chopped apples and kneaded as recipe calls for & separated & pressed out fritters. Follow steps 9-11, I had to triple step 12 to have enough glaze but it turned out great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Smoken T's",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10404189/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-17T12:18:54.297Z",
                "reviewBody": "Love these! For my first attempt I think I over-mixed the dough and ended up with donuts that were more cake-like (as stated in other reviews). I'm not a fan of the cake texture and really wanted a Dunkin-raised donut so when I was finished around 10 pm, I started again...this time mixing everything by hand (really don't need the mixer) and trying to mix as little as possible. For my do-over batch, I also used rapid rise yeast and did not sift the flour to speed things up. Also increased sugar to 1/3 to sweeten the dough. I let the dough rise in a slightly warm oven for about 50 min. (I tested a tip to pour 3-4 C of boiling water into a pan and leave it on the bottom of the oven to warm it perfectly...worked great!) I cut the dough into strips instead of donut rings to save time and eliminate scraps. (Re-rolling the scraps made tough donuts.) Then I left the dough on the counter under loosely draped plastic wrap for 45 min. Everything turned out perfect. Kids all said this morning that they taste like Dunkin! I second another reviewer's suggestion to use the Easy Chocolate Bundt Cake Glaze found on this site. It's delicious...tastes like Dunkin!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kitkates",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6650978/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-28T23:19:28.35Z",
                "reviewBody": "Delicious.  Who needs Krispy Kreme with this recipe?\nTo the poster who wrote that her's didn't rise properly. Depends on the yeast being fresh.  All packets of yeast have expiration dates. Plus the temperature of the water.  Temperature is not to be guessed at, but, instead the use of an instant read thermometer is crucial.  Too hot and it kills the yeast.  Not warm enough will never activate yeast.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "traynorandprice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8601841/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-12T22:08:58.877Z",
                "reviewBody": "Great recipe! What I did was made them whole & when we cooled I put jam into icing bag, made a hole into the side right into the center & filled it. then dusted with icing sugar. I also filled them one day with whipped cream & then dipped in melted dark chocolate. The donut holes when they are still warm roll in cinnimion, sugar, melted chocolate. It's endless what you can fill them with or cover them with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "three little dogs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9030009/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-06-21T22:43:10.673Z",
                "reviewBody": "Perfecto! This is my third time trying recipes for doughnut - 1st epic fail, 2nd-average to almost fail, this time is so perfect..\nI left the dough to raise in the fridge overnight and did the second proof as directed. I also used butter not shortening as I did not have one. It turned out very good.\nThis is definitely a must try recipe..",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Vonny",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11573156/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-01-01T16:05:16.663Z",
                "reviewBody": "I've never made doughnuts before, and these turned out great, especially for a first try. DS and I made them together. We let the bread machine make the dough; it rose beautifully. I then rolled them out, and DS cut them out. I put them on cookie sheets and let rise in the oven with the light on for 30 minutes. We didn't try the glaze but frosted instead with buttercream icing and sprinkles. Fun morning, and now my tummy hurts a bit from eating too many. ;)  *Update- have made these several times now. My kids love them. I don't have a donut cutter, so per the cook's notes, I use a can and pill bottle. It works great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tammy Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3084624/"
                }
            }
        ]
    }
]