[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7793/strawberry-dream-cake-i/",
        "name": "Strawberry Dream Cake I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F712158.jpg",
            "width": 3997,
            "height": 2724
        },
        "datePublished": "1998-06-17T12:20:13.000Z",
        "description": "Pudding like strawberry cake with a decadent white chocolate frosting.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "2 -9 inch round layers",
        "recipeIngredient": [
            "1 (18.25 ounce) package white cake mix",
            "1 ½ cups frozen sweetened strawberries, pureed",
            "12 ounces cream cheese",
            "8 (1 ounce) squares white chocolate",
            "1 cup heavy whipping cream",
            "1 (8 ounce) container frozen whipped topping, thawed",
            "½ pint sliced fresh strawberries"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9 inch round cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Make cake per directions except substitute the 1 1/2 cups of strawberries for the water and add 1 extra egg, (if cake mix calls for 2 eggs add 3), and 8 ounces of the cream cheese at room temperature. Beat well and pour into the prepared pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for about 20 to 25 minutes or until golden brown. A toothpick inserted in the center will not come out clean when this cake is done since it is so moist. Let cake cool fully before frosting.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Frosting: Heat the heavy cream until just beginning to boil. Pour it over the white chocolate (chopped) and the remaining 4 ounces cream cheese. Mix well and let cool. Once cool fold into the whipped topping. Use to frost cooled cake and garnish with sliced fresh strawberries.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Beth Lemieux"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.2809917355371905,
            "ratingCount": 363,
            "itemReviewed": "Strawberry Dream Cake I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "272.1 calories",
            "carbohydrateContent": "29.6 g",
            "cholesterolContent": "31.1 mg",
            "fatContent": "16.3 g",
            "fiberContent": "0.7 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "198.4 mg",
            "sugarContent": "23.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-29T01:40:55.103Z",
                "reviewBody": "I have made this recipe twice now. Both times it was very good. However the second time I used a cake mix that called for three eggs so I added a forth as the recipe said. (add an extra egg!) Don't do that. Three eggs is enough the forth makes it just too heavy. It was still good but comparing it to the first cake it was not as good. For best results use the strawberry cream cheese, there is something about it that just makes a difference. I used the regular cream cheese the second time and just added a tablespoon of strawberry preserves and it tasted very good but was not as good as when I used the strawberry cream cheese. As for the icing I did the icing that was suggested the first time and it was good but all the things the other reviewers said I found to be true. Just realize that it will be a little difficult to work with. The second cake I used the icing recipe that I found on here several years ago and it has been my stand by since. 1 cup of whipping cream whipped with 1 box of instant pudding(I use cream cheese flavor) and then fold it into a 8 oz tub of cool whip. It is nice and stiff and tastes great. It compliments this cake well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Grandma Lizzy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2537790/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-13T20:31:51.83Z",
                "reviewBody": "This cake is my husbands new favorite cake!  I've made it several times already. Several reviewers mentioned that the strawberry flavor was not strong enough. I've found that this is easily remedied by using strawberry cream cheese in the cake and making it a day in advance and storing in the fridge. The flavor is much stronger (and tastier) the next day.  Also an easy way to make sure you have no clumps in your frosting; let the cream cheese come to room temperature, dice up into cubes and put in a blender, finely chop the white chocolate and once the cream is warmed melt the chocolate in it then pour the warm chocolate/cream mixture over cream cheese, cover and blend until smooth. I've made the frosting with both cool whip and fresh whipping cream it is much better with heavy whipping cream. This is my go to recipe whenever we have company for dinner.***update*** I just made this with raspberries instead of strawberries and it was AMAZING! I just used raspberry cream cheese and sweetened pureed raspberries that i put through a siv(sp?) to get out all the seeds.*** The possibilities are endless, made it again with pineapple cream cheese and pureed canned pineapple and hubby loved it! Maybe even more than the strawberry***",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BPRWATSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1270558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-04-09T15:35:26.48Z",
                "reviewBody": "Everybody loved this.  I made it in a 13X9 sheet pan for easy transport.  I also used strawberry cream cheese in the cake, and unsweetened strawberries (measured before I pureed them) with 2.5 T sugar added.  Everything mixed up fine in my mixer after a few minutes.  The cake baked in about 32 minutes, and was moist but not soggy.  The frosting was also delicious- make sure the cream cheese is at room temp. and the whipped topping is thawed for it to mix well.  If assembling a layer cake, the frosting would definitely need to be refrigerated in order to hold, as well as after the cake is made or it will fall apart.  Otherwise, this was easy and just delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sally Stall",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1596507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-06-13T16:51:08.68Z",
                "reviewBody": "This is a great cake but lousy instructions. The reason everyone is having such a difficult time with frosting is the whipping cream should be chilled after you melt the chocolate in it. Then when cold it should be beaten until stiff peaks form. Then beat in the cream cheese. Stir in the cool whip last.I only used half of a 8 oz tub. Was plenty of frosting. The second problem withe recipe was mixing the cake. The order is all wrong! Beat the cream cheese first until smooth then add eggs one at a time (do not add but 3 eggs)Then add the cake mix. Batter will be thick. The third problem is bake time. It is more like 30-35 minutes. That is why some are having problems with it being wet and soggy. Other than poor directions this cake is awesome! Done right that frosting is great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Vic",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5313535/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-05T18:15:10.267Z",
                "reviewBody": "Everyone loved this cake!  One tip for the frosting, though...it didn't get thick enough to use even after cooling, so I beat it with an electric mixer for a couple of minutes.  The heavy cream helped it get firm, but still light and creamy, after mixing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mmattso3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2447502/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T01:29:17.84Z",
                "reviewBody": "This cake is fantastic have made it 5 times. It's one of the few never-fail recipes! Didnt' have store-bought cake mix so I used the Cake Mix from Scratch recipe from this site. Strawberry taste isn't strong enough for my liking rectified somewhat using extra 1 tbs strawberry extract. Tastes MUCH better when cold like a light cheesecake. Potential candidate for the small cake business I'm setting up! Also bake in the lower HALF not the lower THIRD of the oven to prevent the top cracking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Li Yung",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/958514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T14:42:23.123Z",
                "reviewBody": "Hands down one of the best cakes I have ever made. At first I thought I did something wrong because the batter was very thick and dense and I thought it wouldnt rise well. But it ended up great and only lasted a few hours. The BEST strawberry cake. If you're having trouble deciding on a recipe definately try this one first! It is a very moist creamy cake. The only thing I changed was the frosting because I wanted something simple. I used the frosting from the Strawberry Cream Cake recipe. It is very light and not too sweet. Perfect for this cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSIE3121",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/46116/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-09T16:49:39.263Z",
                "reviewBody": "Made this cake today for my daughters birthday. Wow!!! I did it in a bundt pan (baked for 55 min)split it in half put some of the frosting and sliced strawberries in the middle then frosted. I covered some strawberries in milk chocolate and drizzled the rest over the white frosting --- very impressive. This is sure a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAT L",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/683746/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-08-30T01:46:33.593Z",
                "reviewBody": "I made this cake for a little girl's birthday party. The cake part is EXCELLENT; I used a white cake mix and used egg whites instead of the extra egg. Nice dense moist rich cake; I'd definitely make it again. I layered it with the frosting and a homemade strawberry-almond filling. The frosting was pretty good. I found that if I stored the cake in the fridge the frosting got very grainy. If the frosting was room-temp it was perfectly smooth and creamy. So as long as you don't chill the frosting this is a wonderfully delicious cake.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "campagnes",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1484452/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-07-07T16:12:01.363Z",
                "reviewBody": "So I didn't have all the problems other people were having with the cake being soggy in the middle I tried this as a cupcake recipe. They didn't really have a strong strawberry flavor I even used strawberry cream cheese as suggested by other reviewers. The recipe itself was pretty simple so I'll probably stick with this one only modify it a bit since this was only the test run. Next time I'll add a couple teaspoons of strawberry extract. Also because of the bad reviews I didn't even try the icing. Instead I used the one suggested by Grandma Lizzy. 1 cup whipping cream mixed with 1 box instant pudding (she suggested cream cheese flavor but I used white chocolate) then fold into 8 oz. cool whip. It was exactly what I was looking for light like whipped cream yet stiff enough to use as cupcake incing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Jsierschula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4820690/"
                }
            }
        ]
    }
]