[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/224/side-dish/rice/",
                    "name": "Rice Side Dish Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14364/side-dish/rice/pilaf/",
                    "name": "Pilaf",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228044/classic-rice-pilaf/",
        "name": "Classic Rice Pilaf",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3552084.jpg",
            "width": 3332,
            "height": 3332
        },
        "datePublished": "2012-07-16T23:00:59.000Z",
        "description": "Cooking a perfect batch of white rice without a rice cooker can be a challenge. That's why we are going for forget about cooking rice on the stove and show you the incredibly delicious and absolutely foolproof world of pilaf!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "2 tablespoons butter",
            "2 tablespoons olive oil",
            "½ onion, chopped",
            "2 cups long-grain white rice",
            "3 cups chicken stock",
            "1 ½ teaspoons salt",
            "1 pinch saffron",
            "¼ teaspoon cayenne pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Melt butter and olive oil in a large saucepan over medium heat. Add onion; cook and stir until onion is lightly browned, 7 to 8 minutes. Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine rice and onion mixture in a 9x13-inch casserole dish placed on a baking sheet. Stir thoroughly to coat the rice.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine chicken stock, salt, saffron, and cayenne pepper in a saucepan. Bring to a boil, reduce heat to low, and simmer for 5 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour chicken stock mixture over rice in the casserole dish and stir to combine. Spread mixture evenly along the bottom of the pan. Cover tightly with heavy-duty aluminum foil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven for 35 minutes. Remove from oven and allow to rest, covered, for 10 minutes. Remove foil and fluff with a fork to separate the grains of rice.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Rice Side Dish Recipes",
            "Pilaf"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.74904214559387,
            "ratingCount": 522,
            "itemReviewed": "Classic Rice Pilaf",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "312.4 calories",
            "carbohydrateContent": "51.7 g",
            "cholesterolContent": "10.6 mg",
            "fatContent": "9.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "3.3 g",
            "servingSize": null,
            "sodiumContent": "955.6 mg",
            "sugarContent": "1.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-08-07T21:49:25.213Z",
                "reviewBody": "YUM!!!! I halved the recipe (except fot the onion) and baked it in an 8x8 baking dish. This came out PERFECT! I didn't have the saffron, so I omitted that. I can't believe the flavor that came out of just those few ingredients...sooo good! I will def be making this delicious rice again! Thanks for sharing. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Christina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/christina/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-05-16T01:47:36.61Z",
                "reviewBody": "You know, I was making such a small amount of this recipe for Hubs and me that I immediately decided the oven method wasn’t practical for me and decided to just use the traditional stovetop method instead.  But I must say, after reading through the recipe thoroughly I wasn’t impressed, and wondered, truly, what the real advantage was of preparing the rice this way rather than the stovetop method regardless of the number of servings.  This recipe’s method requires more steps and more pans.  The stovetop method is a “one stop shop.”  Also, I’m not sure I like the ratio of rice to liquid either - in my mind, it should always be one part rice to (at least) two parts cooking liquid, be it water or stock.  I like the addition of saffron and onion, but neither is anything special.  And the cayenne isn’t necessary at all.  Frankly, the bottom line is that this is a basic, simple rice with an unnecessarily complicated way of cooking it.  In addition to simply cooking it on the stove top I made it a little more colorful and festive by adding a medley of colorful finely chopped bell peppers, fresh minced garlic and a good handful of frozen peas. Prepared as directed, this requires unnecessary steps that don’t benefit the final result.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-03-17T22:20:06.31Z",
                "reviewBody": "I followed the recipe exactly (except omitted the saffron) and had no problems whatsoever. No more Rice-A-Roni for us! I am eager to experiment with other flavor profiles. I find it very annoying that the review tagged as the \"Most Helpful Critical Review\" didn't even bother to make the recipe as written. But used the stove-top method. I for one, welcome a good rice recipe that will free up stove space. It widens my options for dinner. Thank you Chef John!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennygurl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5595048/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-28T01:38:57.09Z",
                "reviewBody": "I loved loved the texture of this rice. It was so easy to make too. I sprayed the pan with some PAM and none of it stuck. When I saw the amount of salt and the cayenne, I was a little worried. It was a tad too salty for me and there was a kickback from the cayenne. I made it a second time and cut the salt back to 1 tsp. and the cayenne by half. That time I got the cayenne amount right, but still working on the salt amount. I will have to keep working on the right salt amount. Though, thanks Chef John for teaching me a new method to cook rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-16T02:37:06.457Z",
                "reviewBody": "I am giving it 5 stars even though I made a couple changes  and will make more changes the next time I prepare this.  I am giving it 5 stars because I LOVE the technique and the flavor is amazing!  My twin toddlers gobbled it down and my husband couldn't stop smiling as he complimented my cooking over and over and over.\r\n\r\nFirst, I read a review complaining about the amount of pots used.  You can use the same pot for both stovetop steps.  Not complicated.\r\n\r\nSecond, changes I made.  I added broken up vermicelli to create a box-rice effect.  It was an amazing addition.  I sautéed that with the onions.  I used bouillon in lieu of stock as that was what I had on hand.  Accordingly, I cut down on the salt, which I would have also done since I was using salted butter.\r\n\r\nThird, what I would change next time.  1) use 3.5 cups of stock.  The ratio I know is always 2 parts liquid for 1 part rice.  While the rice was amazing, it was a teeny bit crunchy.  I think 4 cups of rice would mean soggy rice so I don't feel the normal ratio is warranted.  Sealing with foil really keeps the steam in and I think that helps.  Still, a little more liquid would have made a difference. 2) only use 1/8 tsp of cayenne.  The kick from the cayenne was a little much for what I was after with this dish.  With that said, it's not overwhelming as is.  Just family preference there. \r\n\r\nThis is an amazing, surprisingly simple, and most definitely a go-to dish for us going forward!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2394066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-28T05:37:36.55Z",
                "reviewBody": "This was really easy to make and it came out great.  I normally shy away from cooking rice because it always comes out either sticky or undercooked.  This recipe was fantastic.  I used a whole small onion instead of half because I love onions.  I used water instead of the chicken stock and added chicken bouillon because I ran out of chicken stock.  I left out the salt because the bouillon is already salty.  I also added about a tablespoon of garlic to the last two minutes of simmering the liquid.  The rice came out wonderful.  Perfectly cooked, fluffy and yummy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ssingh",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10114141/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-04T15:15:27.633Z",
                "reviewBody": "Hands down the go to side for a dinner group when you need rice and don't want to have to cook as guests arrive.  Made recipe and a half (3 cups rice) as directed sofetning the onions in the pan and then added the seasonings and broth to that before stirring into jasmine rice (all I had on hand). Didn't really get any kick from the cayenne.  Turned out perfect, but will maybe add garlic or seasoned salt next time with some other herbs for extra flavor. Seems very versatile, could probably even add a little tomato sauce and cumin for a spanish rice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "angelfood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1598821/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-26T23:14:22.917Z",
                "reviewBody": "This is really tasty. I skipped the saffron and omitted the salt. Otherwise, I followed this recipe exactly. Next time I may cut back on the cayenne just a smidge. It took everything I had not to up the broth. 3 cups of liquid for 2 cups of rice goes against everything I know. I stuck with the 3 cups expecting to have to add more and cook longer. I was pleasantly surprised to see that 3 cups was enough. Rice was fluffy and in individual grains.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "iceemama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/iceemama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-24T01:48:34.757Z",
                "reviewBody": "Yay! Finally, my rice turned out!! I'm always going to prepare it this way. I used brown rice and it takes a bit longer than 35 minutes -- I cooked mine for 45 minutes and it was still a little hard. An hour probably would have been best. Foolproof recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LashGal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3149609/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Classic Rice Pilaf",
            "description": "Never make sticky, mushy rice again!",
            "uploadDate": "2012-07-09T17:00:39.579Z",
            "duration": "PT4M36.61S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Febd42fa5-deb1-4627-964b-08c1fb06961b%2Fc347bdc2-037c-4be6-b815-f6cad5dc8a4c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1727359600001"
        }
    }
]