[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/93/seafood/",
                    "name": "Seafood",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/411/seafood/fish/",
                    "name": "Fish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/417/seafood/fish/tilapia/",
                    "name": "Tilapia",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/237125/orange-tilapia/",
        "name": "Orange Tilapia",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1381001.jpg",
            "width": 7056,
            "height": 7056
        },
        "datePublished": "2012-08-01T06:49:27.000Z",
        "description": "Tilapia baked in orange juice with a garlic basil topping.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT3H30M",
        "recipeYield": "4 fillets",
        "recipeIngredient": [
            "4 tilapia fillets",
            "1 ½ cups orange juice",
            "6 tablespoons butter, softened",
            "¾ cup panko bread crumbs",
            "3 tablespoons orange juice",
            "2 cloves garlic, minced",
            "1 tablespoon minced fresh basil",
            "½ cup orange juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Pour 1 1/2 cups orange juice into a resealable plastic bag. Add tilapia fillets, coat with the juice, squeeze bag to remove excess air, and seal the bag. Marinate in the refrigerator 3 hours to overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Whisk butter, panko bread crumbs, 3 tablespoons orange juice, garlic, and basil together in a bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove tilapia from the orange juice and shake to remove excess liquid; arrange fillets in a 13x9-inch baking dish. Discard marinade.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour 1/2 cup orange juice over the tilapia fillets. Spread butter mixture over the top of the filets to cover each completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until the liquid is bubbling and the fish flakes easily with a fork, about 15 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Seafood",
            "Fish",
            "Tilapia"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "SuperN"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.109090909090909,
            "ratingCount": 110,
            "itemReviewed": "Orange Tilapia",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "379.2 calories",
            "carbohydrateContent": "28.7 g",
            "cholesterolContent": "86.8 mg",
            "fatContent": "19.7 g",
            "fiberContent": "0.3 g",
            "proteinContent": "26.3 g",
            "saturatedFatContent": "11.5 g",
            "servingSize": null,
            "sodiumContent": "273.1 mg",
            "sugarContent": "11.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-11-23T13:26:39.3Z",
                "reviewBody": "Let the fish marinate in the orange juice about 4 hours, with a few sprinkles of pepper and other seasonings, then reduced the marinade in a pan on the stovetop and used that concentrated OJ for the topping and baking the fish. Used regular bread crumbs and a reduced amount of dried basil for the topping. 15 minutes in the oven was just about right.  Delicious and great flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARNKITTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/177428/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-20T19:42:59.743Z",
                "reviewBody": "I just wanted to add a note here for everyone that you can substitute the butter for 1 tbsp of extra virgin olive oil and it tastes great! Or you can do This classic sauce of sauteed butter, parsley and lemon juice is fantastic. Definitely saute the garlic or else it will taste too raw, even after it's baked. I have used this sauce for almost all types of fish- true cod, halibut, basa, tilapia, sole, trout, and salmon. All tasted superb. ALWAYS increase the garlic. For 4 filets, I use 3 large cloves, 3-4 tablespoons butter and 2 tablespoon lemon juice. Just make sure you always have less lemon juice than butter or else it will taste too lemony -even when doubling/tripling it. For a large filet of salmon, I triple the amount. Lightly salt and pepper the fish for more flavor and I sometimes add 2-3 tablespoon of buttered bread crumbs or finely crushed (buttered) ritz crackers for an extra crunch. And of course, fresh parsley is better than dried and use real butter, never margarine. 3 stars for original recipe, 5 stars for slight alterations. Simple and flavorful marinade that still lets the flavor of the fish shine through. TIP- do NOT bake for 30 min, especially tilapia, which is so thin. High temperature, quick cooking time is a rule of thumb for all fish. For this, I did 400*f., for 10-12 min (at most!). If filets are super thin, try 8-10 min. I like it thank's for the recipe to play with. Grpa",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "grpa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6033386/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-01-25T02:09:42.217Z",
                "reviewBody": "Excellent recipe, just make sure to put it under the broiler to get a nice crunch on top. I also used freshly squeezed orange juice and some zest for extra orange flavor. It was delicious paired with some orange glazed carrots and rice with orange zest, cranberries and pistachios. Yum.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jason Nelson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1119549/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-27T00:36:12.957Z",
                "reviewBody": "First of all -- Don't discard the mainade!   Pour it in  pan, boil it and reduce it slighly for a few minutes before adding a pinch of cornstarch to thicken it up to a glaze.   I drizzled this over my end product and voila!   Amazing.   And it adds the mildest flavor or orange.   I'm not sure you'd taste any orange otherwise and I marinated it over night.  (Would I even bother wth that step next time?   Hmmmm...)  The grocery store did not have tilapia at the tme, so I picked up a pound of filet of sole.   Worked great.   Sole is super thin, so I broiled it start to finish for about 5 minutes.   Toasts the crust up nicely as well.    If you're a garlic lover -- triple it.   If you're a salt person, this will need a sprinkling of that as well at the end.  A really wonderful and light fish dinner.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lynn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7155517/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-25T22:21:20.64Z",
                "reviewBody": "Tilapia is such a mild fish that unless you top it with something that s a bit bold it can end up bland and unfortunately I think that s what happened here. I marinated the fish for 4 hours poured additional OJ over the fish before the topping went on and it went into the oven and I found there was no orange flavor at all...real disappointment. If I were to make this again I wouldn t mix the chopped basil into the topping rather sprinkle it on after the fish came out of the oven which I think will ramp up the flavor a bit. Also I baked for 15 minutes the topping hadn t browned at all so I put it under the broiler briefly to get some color and give it some eye appeal. Of course I then ended up overcooking the fish. If I were to make this again I d probably cook the fish for about 12 minutes allowing for some time under broiler to brown the topping and then not overcooking the fish. It wasn t bad it simply didn t have much flavor and it wasn t really good either.. SuperN sorry wish I d been able to give your recipe a better review.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-07T03:07:10.947Z",
                "reviewBody": "I'm 33 attended culinary school in college and always hated fish. I hate the smell the taste and the texture. Finally my husband of 5 years talked me into trying talapia. I followed this recipe. Turned out delishious! I love",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Gina T",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15349669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-22T01:43:21.133Z",
                "reviewBody": "I used 1 pound of Tilapia (6 pieces). The butter seemed like too much, so I substituted aro9und 3 Tbsp of olive oil. I followed another reviewers suggestion, and reduced the orange juice form the marinade to around a half cup on the stove, then poured it over the fillets. The bread crumbs on the top were nicely browned with out using the broiler at around 13 minutes. The fish was moist, flavorful, and delicious. We served it with rice and broccoli. (ANd a nice bottle of wine :) )",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Palmquist Bixler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1401994/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-03-08T20:21:10.18Z",
                "reviewBody": "This was really good. I'm not big on seafood but my fiancee is. We loved it. I used Italian seasoning instead of Basil and Orange/Pineapple/Banana juice instead of straight OJ and Italian flavored Panko crumbs instead of plain...but followed the measurements and cooking times...very good.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "William Hood",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15126014/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-06T23:40:42.217Z",
                "reviewBody": "Just OK Quick and usually have ingredients on hand. Thought there was to much butter in the topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "snowyval",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7563587/"
                }
            }
        ]
    }
]