[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/76/appetizers-and-snacks/",
                    "name": "Appetizers and Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17146/appetizers-and-snacks/snacks/",
                    "name": "Snacks",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16429/appetizers-and-snacks/snacks/party-mix/",
                    "name": "Party Mix Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228417/addictive-texas-trash/",
        "name": "Addictive Texas Trash",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2611905.jpg",
            "width": 1280,
            "height": 960
        },
        "datePublished": "2012-08-10T19:36:47.000Z",
        "description": "I make this as yearly tradition at holiday time in my home. I also make a batch of this to send to my brother for his care package that I send him when he is deployed. I will warn you, it is very spicy and addictive. There should be a 12 step recovery program for this stuff.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT3H30M",
        "recipeYield": "48 servings",
        "recipeIngredient": [
            "1 (14 ounce) package bite-size corn square cereal (such as Corn Chex®)",
            "1 (14 ounce) package crispy rice cereal squares (such as Rice Chex ®)",
            "1 (14 ounce) package bite-size wheat square cereal (such as Wheat Chex®)",
            "1 (8.9 ounce) box toasted oat cereal rings (such as Cheerios®)",
            "3 cups salted mixed nuts",
            "1 (15 ounce) package mini pretzel twists",
            "2 (6 ounce) packages goldfish crackers",
            "1 (12 ounce) package sesame snack sticks",
            "1 cup warm (liquid) bacon drippings",
            "1 cup unsalted butter, melted",
            "¼ cup Worcestershire sauce",
            "2 tablespoons monosodium glutamate (MSG)",
            "2 tablespoons liquid smoke flavoring",
            "1 tablespoon cayenne pepper",
            "4 teaspoons seasoned salt",
            "4 teaspoons chili powder",
            "4 teaspoons garlic powder",
            "4 teaspoons hot pepper sauce (such as Tabasco®)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 250 degrees F (120 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gently mix corn, rice, and wheat squares, oat rings, mixed nuts, mini pretzels, goldfish crackers, and sesame snacks in two 13x24-inch aluminum roasting pans, taking care not to break cereal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir bacon drippings, unsalted butter, Worcestershire sauce, MSG, liquid smoke, cayenne pepper, seasoned salt, chili powder, garlic powder, and hot pepper sauce together in a microwave-safe bowl. Cook on high in microwave for 3 or 4 30-second intervals, stirring each time, until mixture is warm, liquid, and fully combined.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Stir seasoning sauce continuously as you pour half over the cereal mixture in each pan. Gently stir the snack mix and seasonings with a slotted spoon until thoroughly coated; do not crush cereal.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until sauce is completely absorbed and the snack mix is crisp, about 2 hours; stir gently every 15 minutes. Cool completely and store in airtight containers. The snack mix stores well in freezer in airtight freezer bags, if it makes it that long.\n"
            }
        ],
        "recipeCategory": [
            "Appetizers and Snacks",
            "Snacks",
            "Party Mix Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "N2family"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.823529411764706,
            "ratingCount": 17,
            "itemReviewed": "Addictive Texas Trash",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "354.9 calories",
            "carbohydrateContent": "42.3 g",
            "cholesterolContent": "14.9 mg",
            "fatContent": "18.6 g",
            "fiberContent": "3.5 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "5.8 g",
            "servingSize": null,
            "sodiumContent": "790.4 mg",
            "sugarContent": "3.3 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-10-29T11:20:49.843Z",
                "reviewBody": "I cut this recipe back by half. I had to make two small substitutions--I used all Rice Chex only because that was what I had on hand. Also I did not have sesame sticks but I did have pretzel sticks, I switched them out in equal amounts. I also did not use MSG only because my family is sensitive to it. I kept everything else the same. I think using the bacon drippings is brilliant, I would have never thought to use it for Chex Mix which is one of our favorite snack mixes in the whole world. This was a little salty but that can be adjusted accordingly for next time. And there will be a next time. NOTE: For those of you who don't eat Chex Mix in bulk like my family does, you might want to use vegetable oil instead of butter. I have learned from experiance that butter can turn if not refrigerated (come on, who really remembers to refrigerate Chex Mix?) which makes for unfavorable tasting Chex Mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-19T05:21:57.12Z",
                "reviewBody": "Totally loved this recipe. Great flavor, not to spicy on our end, with my kids being raised & from Texas...it is rather good. But for the love of Pete, hahahaha one needs to know, look at the size of the recipe, it's as huge as Texas too ;-) I never laughed soo hard because I saw the ingredients, went and bought ths stuff, not even looking at how big, each ingredient was...It was the funniest thing with my family, watching me go from one size bowl to a bigger one, then a bigger one then that and finally trying to find a pot or pan big enough to get all the ingredients in, in order to mix it all together. Glad no one snapped photos of me, standing on top of a dining room chair, over the Turkey Roaster, mixing it all by hand and saying the heck with it(funny way) and using the roaster to bake the whole batch in, all together verses, dividing it out in foil pans and clogging up the use of my oven...if you have a Nesco Roaster, it's perfect size and the recipe came out excellent!!! We will make this again and again. My husband thanks you. One thing I think I'll do next time, which is not a biggy, is leave out the Cheerios, those were a little tender soft, but it's not that big of a deal to give the recipe a 4 star, We sooo likey!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Melissa Goff",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mis7up/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-12-29T15:17:09.21Z",
                "reviewBody": "Definatily addictive!! None of us could stop eating it! Substituted some of the crunchy things but followed the sauce part that gets poured over it all. I will definitely make it again next year for the holidays. It's way too bad for us to have on a regular basis.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tamara",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2318246/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-09-22T03:56:42.473Z",
                "reviewBody": "Wow - this is some good stuff. As many time as I've made a snack like this I've never made it with bacon fryings. It puts a totally delicious spin on this recipe. I made a half-batch minus the MSG and added garlic Melba toast in place of the pretzels as that is what I had on hand. Definitely a keeper that I will be making again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Molly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6145350/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-11-23T22:11:56.737Z",
                "reviewBody": "I made this for our police department. I followed directions to a T except...I got up this morning and tried it. Made it last night. Amazing...a friend said Add M&Ms and a 12 step program wouldn t work!. So I am adding them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "David A Braun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/24618010/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2020-12-16T12:15:14.573Z",
                "reviewBody": "I made this and it was amazing. We like spicy food so the next time I made it I added a little extra Tabasco,  spicy peanuts and spicy cheese its. So good. Thank you for sharing",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Leslie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/22017947/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-03-24T01:02:01.713Z",
                "reviewBody": "I'm making this recipe for the 3rd time since Christmas! The only redeeming factor since it definitely is not a healthy snack is that this batch is for a church movie night. I divide it between 2 large roasting pans but will try my Nesco roasted next time. I use Bugles instead of Cheerios and garlic rye chips instead of sesame sticks but you can change all of those things according to your taste. What makes this snack mix a standout IMHO is the sauce. The use of bacon drippings is absolutely brilliant -- I've been cooking with them all my life but never thought of using them this way. I do omit the Tabasco and cayenne because we aren't fans and also add 2 teaspoons onion powder but that's the beauty of a recipe like this. We absolutely love it and it truly is addictive!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mary Fran Lund-Overcash",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7606291/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2018-12-19T08:39:06.633Z",
                "reviewBody": "This was delicious!! I only left out the msg because I didn't have it. My mother used to make something similar during the holidays but is now in a nursing facility and unable to make it. When I saw this recipe the memories flooded back in and I just had to try it. Only made half the amount but will make the rest later. I intend on sharing with my mother tomorrow at the nursing home!! I know she will love it too. Thanks for a wonderful recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MrsH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4474571/"
                }
            }
        ]
    }
]