[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15949/trusted-brands-recipes-and-tips/argo-karo-fleischmanns/",
                    "name": "ARGO&reg;, KARO&reg;, FLEISCHMANN'S&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/228951/spooky-homemade-marshmallows/",
        "name": "Spooky Homemade Marshmallows",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2095676.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "2012-09-06T18:48:59.000Z",
        "description": "Homemade marshmallows that you can customize with different flavors and spices make any occasion special.",
        "prepTime": "P0DT0H45M",
        "cookTime": null,
        "totalTime": "P0DT4H45M",
        "recipeYield": "36 large marshmallows",
        "recipeIngredient": [
            "1 cup water, room temperature, divided",
            "⅛ teaspoon salt",
            "3 (1 ounce) packages unflavored gelatin",
            "2 ¼ cups sugar",
            "1 cup Karo® Light Corn Syrup",
            "2 teaspoons Spice Islands® Pure Vanilla Extract",
            "1 cup powdered sugar",
            "1 ½ teaspoons Argo® Corn Starch"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine 1/2 cup water, salt and gelatin in large bowl of a stand mixer. Stir and set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine remaining 1/2 cup water, sugar and corn syrup in a large saucepan over medium heat. Bring to a boil, stirring frequently. Using a candy thermometer, cook until mixture reaches 240 degrees F or soft ball stage.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Gradually pour the hot syrup over the gelatin mixture with the mixer on low. Turn the mixer on its highest speed and beat for 8 minutes. Add vanilla and beat an additional 2 minutes. The mixing bowl will get very full. The marshmallows will become very thick, white and shiny. Spread mixture onto greased baking sheet with sides. For thicker marshmallows, use a 13 x 9-inch pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Let marshmallows cool at least 4 hours or overnight. Combine powdered sugar and corn starch in a shallow pan. Cut the marshmallows into bite-size pieces with a sharp knife or scissors, dropping one at a time into the powdered sugar. Toss to coat well. Store marshmallows in an airtight container in a cool place. Best used within 1 month.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "ARGO&reg;, KARO&reg;, FLEISCHMANN'S&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "ARGO®,  KARO®  and FLEISCHMANN'S®"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.592592592592593,
            "ratingCount": 27,
            "itemReviewed": "Spooky Homemade Marshmallows",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "177 calories",
            "carbohydrateContent": "41 g",
            "cholesterolContent": null,
            "fatContent": null,
            "fiberContent": null,
            "proteinContent": "4 g",
            "saturatedFatContent": null,
            "servingSize": null,
            "sodiumContent": "61.4 mg",
            "sugarContent": "34.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-10-10T23:21:43.917Z",
                "reviewBody": "I can't believe I just made marshmallows.  These are sweet billowy clouds of puffy goodness!  Unlike any store-bought marshmallow I've ever had, these tasted delicate and were softer.  My kids think I'm a superstar!  Be sure to grease the pan very well or the mixture will stick--this makes it more difficult to remove from the pan when they're dry enough.  Since I made bones for Halloween, I dipped my cutter into the powdered sugar/Argo cornstarch mixture before making each cut, pressed down hard, and wiggled slightly to ensure it went all the way through.  These are truly a delight--yumm!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-14T15:50:42.787Z",
                "reviewBody": "I thought these were neat to make. They were kind of fun too. I didn't have any major problems. I greased the pan with pan spray and wiped out the excess and had no sticking. I read the reviews and went heavy on the powdered sugar to make cutting easy also. I even spread some all over the top and continuously while cutting the marshmallow with cookie cutters or into square ones with a knife. Do also coat the cutters and knife well with the powdered sugar too. Before cutting, I cooled them on the counter for about 7-8 hours with plastic wrap over the top of the pan. I can't imagine doing this without a stand mixer. It made it super easy. A very reliable thermometer is also neccessary. With the right tools, it is nearly fool proof. I thought they tasted kind of like a bagged marshmallows, but so much better with the soft fluffy texture. To top, they were excellent in homemade cocoa.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holiday Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/holidaybaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-23T02:50:54.38Z",
                "reviewBody": "Just right not to sweet!!  Came out nice and fluffy and soft like yummy pillows!!! A++++++",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy Bass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4588984/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-20T19:32:23.513Z",
                "reviewBody": "Try these and you'll never buy marshmallows in a bag at the grocery store again.  For several years, I've made homemade marshmallows from a different recipe.  I tried this one, it is the winner.  These marshmallows are fluffy and delicious.  The texture and flavor are heavenly.  I followed the instructions exactly as written, and I could not be more pleased with the result.  Here are a few tips I've learned over the years:  after buttering your pan, sprinkle lightly with powdered sugar.  I turn out the entire pan of dried, uncut marshmallows onto cutting board dusted with powdered sugar.  Then, I use a large pizza cutting wheel to cut the marshmallows into squares.  The blade will need to be dusted often with powdered sugar.  I use powdered sugar sparingly if I'll be dipping the cut marshmallows into melted chocolate.  I have also used finely chopped toasted coconut as a coating instead of powdered sugar for an old-fashioned treat.  One last tip, I use the wire whip beater on the Kitchen Aid stand mixer.  I think that contributes to the fluffy, light texture.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8798450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-30T22:54:35.297Z",
                "reviewBody": "Made 3 versions of this for Halloween. Purple-cherry green-banana and orange-coconut. Wanted to \"Trick\" people with this \"Treat\" by making the colors not match the flavors. I goofed the recipe once by trying to use flavored gelatin instead of unflavored - not a good idea. In the end I used flavored extracts for the flavors I wanted. Had to make 4 batches to get 3 good ones but not the recipe's fault just me trying to be a smartie pants lol. This is a delicious recipe but a little more complicated than it's worth. I don't think I'll make it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Cheryl King",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mommasangelbaby/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-30T03:21:11.077Z",
                "reviewBody": "Who knew marshmallows would be so easy to make? These are tasty and have a great texture. I cut them into pumpkin shapes. It took me a minute to figure out the best way to get the cut shapes out of the marshmallow sheet. I found that if I used a metal spatula to pry a section of the marshmallow up before cutting the shapes they just popped right out. And tons of powdered sugar on your cutters is a definite must. My kids think I'm Super Mom because I made homemade marshmallows!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rae",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/rae/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-06T23:04:27.313Z",
                "reviewBody": "These were delicious! And so much more delicate than store-bought marshmallows. The key to not losing your mind when cutting these is powdered sugar- lots and lots of powdered sugar. Before cutting the marshmallows coat the whole block with powdered sugar. Before cutting coat the knife with powdered sugar and reapply any time the knife starts to stick. Any extra sugar can easily be shaken off of the finished product.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SunnyDaysNora",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/greengirl24/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-03T20:05:20.007Z",
                "reviewBody": "This recipe is Madeline approved. My picky 4 year old Granddaughter thought they were better then the ones in the bag. My husband says they make the best S'mores ever.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joey Joan",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/joeyk/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-10-23T13:13:39.71Z",
                "reviewBody": "I loved trying to make my own marshmallows! They are delicious--much better than store-bought! The only thing I didn't like was the mess I had from making it. I must admit that I made only half a batch so my Kitchen Aid didn't do a very good job of mixing it up so I'd recommend making the full batch. I wouldn't be at all surprised if I end up making these again at Christmas time for my granddaughters' hot chocolate! I'm glad I tried these!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Marianne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/marianne1/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-22T04:56:58.163Z",
                "reviewBody": "While I give the texture and ease of making this recipe 5 stars I did not like the flavor and neither did my marshmallow loving 3year old. I personally think the flavoring needs to be increased by another 2 tsps. I am going to try it again with the additional flavoring as suggested in another recipe and see how it turns out! They were much easier to work with than expected which was a plus! Made some really cute hearts I plan to see if they taste better dipped in chocolate.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Phlee330",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10705950/"
                }
            }
        ]
    }
]