[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17031/side-dish/sauces-and-condiments/",
                    "name": "Sauces and Condiments",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/916/side-dish/sauces-and-condiments/gravy/",
                    "name": "Gravy Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16857/side-dish/sauces-and-condiments/gravy/turkey-gravy/",
                    "name": "Turkey Gravy Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/230049/chef-johns-make-ahead-turkey-gravy/",
        "name": "Chef John's Make-Ahead Turkey Gravy",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4222637.jpg",
            "width": 3254,
            "height": 3254
        },
        "datePublished": "2012-11-08T00:16:39.000Z",
        "description": "This make-ahead turkey gravy frees up valuable kitchen time for Thanksgiving, plus it will look and taste even better than those frantic, last-minute versions.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT3H55M",
        "totalTime": "P0DT4H15M",
        "recipeYield": "8 servings",
        "recipeIngredient": [
            "1 large onion, chopped",
            "2 carrots, chopped",
            "2 ribs celery, chopped",
            "2 teaspoons vegetable oil",
            "2 large turkey wings",
            "2 tablespoons cold water",
            "10 cups cold water",
            "4 sprigs fresh thyme",
            "2 cloves garlic",
            "3 tablespoons butter",
            "½ cup all-purpose flour",
            "salt and ground black pepper to taste",
            "1 pinch cayenne pepper"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine onion, carrots, celery, and vegetable oil in a large roasting pan and toss to coat. Place turkey wings on top of vegetables\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place roasting pan in the preheated oven and cook until the turkey wings are browned and vegetables are caramelized and softened, 45 to 60 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Transfer turkey wings and vegetables to a large stockpot. Place the roasting pan over a stovetop burner on medium heat. Pour 2 tablespoons cold water into the pan and bring to a boil, scraping up any browned bits. Transfer mixture to the stockpot and add 10 cups cold water, thyme, and garlic.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring turkey wing mixture to a boil. Reduce heat to low and simmer, uncovered, until meat falls off the bone, about 3 hours. Skim off turkey fat throughout the process and set aside 2 tablespoons.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain turkey stock and reserve 6 cups of stock; discard all the solids.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat butter and 2 tablespoons reserved turkey fat in a large saucepan over medium heat. Sprinkle in flour and cook, whisking continuously, until it begins to smell like cooked pie crust, 2 to 3 minutes. Slowly pour in turkey stock, whisking continuously. Increase heat to high and simmer until thick and warmed through, about 5 minutes. Season with salt, black pepper, and cayenne pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Sauces and Condiments",
            "Gravy Recipes",
            "Turkey Gravy Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.539112050739957,
            "ratingCount": 473,
            "itemReviewed": "Chef John's Make-Ahead Turkey Gravy",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "115.4 calories",
            "carbohydrateContent": "10.2 g",
            "cholesterolContent": "22.5 mg",
            "fatContent": "6.6 g",
            "fiberContent": "1.3 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "92.4 mg",
            "sugarContent": "1.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2012-11-24T18:19:41.853Z",
                "reviewBody": "Made this for Thanksgiving dinner.  Took the advise of some previous reviews and tweaked the recipe a little.  I felt that 10 cups of water was too much for a couple of turkey wings and adjusted to 31/2 cups of water and 3 1/2 cups of canned chicken stock.  I added a little celery salt to taste and ended up with a recipe that I will be using every Thanksgiving.  What I really loved about this recipe is that I made my gravy on Tuesday, put it in a quart jar and put in the refrigerator, all I did on Thanksgiving was heat it up in a saucepan, saved me a lot of time and work during those last minutes of crunch time.  Thanks for a great recipe and great technique.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Patricia Canerdy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/patriciacanerdy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-27T12:46:14.993Z",
                "reviewBody": "First word: Wow! We can have gravy in the freezer for everyday cooking all year now! But I must say I was astonished that CJ tells us to throw away veggies - and the meat? Having been raised by parents who grew up in the depression, I couldn't do that of course. So I followed the recipe, but changed the method a bit. First, I sliced the onion in very thin half-slices and a finer slice of carrots and diced celery. My store had 3 large wings per pack, which I thought was perfect. Roasted in cast-iron skillet for the full hour, flipping wings once. Then into my old standard-size crock pot; filled w. water + 1 small can chicken broth, 3 big pinches dried thyme (1 per wing) and 3 large cloves garlic minced fine. Set on low, covered, all night, about 12 hrs. total. Let cool awhile, removed skin, fatty bits and bones, and had a platter of tender meat for an easy start to dinner or to save for post-holiday soup. There was so little fat floating on top that I didn't bother to skim. Just pureed broth/veggies in blender (in 4 batches) and strained. Set aside 1-1/2 c. to replace half the water in my dressing, leaving 4+ c. for gravy. This was already silky from having the fat already incorporated, so for the roux I just used 3T salted butter and 1/3 c. flour. Whisked over heat until it was the same lovely caramel color as the broth and whisked together. Velvet! Planned to add the drippings from the bird for final seasonings, but it doesn't even need it - I could just drink this stuff!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "robinjay",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8565993/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-11T17:05:25.823Z",
                "reviewBody": "I have made ths recipe for years. The only difference is that I use 6 or 8 turkey wings because there isn't much fat on a wing, and I use chicken or turkey broth instead of the water. I also add some white wine as part of the liquid. I usually make the gravy about a month ahead of the holidays because it freezes well. When it comes time use it, I put it in a crockpot, thaw it out and heat it up, saving stove space. It's my favorite gravy recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Hope",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4942130/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-16T12:57:03.457Z",
                "reviewBody": "First I must say that I don't think make-ahead gravy ever tastes as good as making it from the pan drippings but it's a tremendous time saver for that time-consuming Thanksgiving meal. Maybe my turkey wings weren't \"large\" enough I don't know but the broth did not have a lot of flavor even though I used a box (quart) of turkey stock as part of the 10 cups of liquid. Something I rarely do when making a recipe is modify it too much first time but I found it necessary here. I added some Better Than Bouillon Turkey Base some poultry seasoning finely chopped wing meat and some of the roasted veggies which I'd pureed in the blender. It all came together well and I ended up with a flavorful gravy. I made another recipe last year from this site but with these modifications I think this is a better recipe. I have to wonder if 2 turkey wings is enough to flavor 10 cups of water and in the future I will use more wings and some necks if I can get them. Don't like changing a recipe this much but after tasting the gravy it was necessary. All was good in the end and this 4-star rating is based on the tweaks I made.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "lutzflcat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/lutzflcat/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-31T00:49:42.327Z",
                "reviewBody": "I'm going to rate Chef John's recipe because it is virtually what I have done every year for many years other than also roast the neck with all the veggies too before simmering them for hours. I agree that two wings would not seem to add enough flavor. I save about 2 cups of my turkey stock for basting my turkey in the oven on the big day and make my gravy a bit thicker so I can pour some the pan drippings into it and into my dressing before placing that dish in the oven. No one would guess my dressing is not cooked in the bird! I don't mind a bit having my gravy done ahead of time either. Great time saver when you really need it in the last hour trying to get this 'labor of love' meal on the table!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "aunt tilly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5621952/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-13T20:24:20.637Z",
                "reviewBody": "This gravy is amazing.  A little time consuming but worth having that extra gravy on Thanksgiving.  I ended up with 7 cups of gravy at the end because I used 14 cups of water at the broth-making stage.  That's how much it took to completely cover the wings and veg.  That's the only change I made.  Definitely a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jeniferken",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2910239/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-17T00:18:46.32Z",
                "reviewBody": "I just finished making this.  Last year I decided to try a new gravy recipe on Thanksgiving and for the first time ever, I had to toss everything and depend on jarred gravy.  Not fun and most embarrassing!!  Well, it took a few hours, but no rush since Thanksgiving is a couple weeks away.  The only thing I changed was used 4 carrots and 4 celery stalks and used 8 cups of chicken stock and 2 cups of water per other reviewers.  After simmering for the 3 hours, I only ended up with 4 cups of stock, not 6.  I just added 2 more cups of water with 2 tsps. of chicken bouillon.  It came out smooth as silk and my husband's eyes actually sparkled when he tasted it. He was very impressed and I think it beat every gravy we've made for 31 years of marriage.  Hubby said it probably won't last until Thanksgiving.  I plan on freezing it and thawing that day to save the craziness trying to make gravy with the entire family watching and waiting for dinner to be ready.  I highly recommend trying this!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Paula",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4919903/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-11T17:32:31.187Z",
                "reviewBody": "I've been doing this for several years but it's not the only gravy for the meal; it's a supplement to the gravy I make when the turkey comes out of the oven. We love hot turkey sandwiches here so need gravy to go a long way. If you're going to use this as your only gravy, you have to either up the turkey wings to four, or cut back on the cold water to about 6 cups in order to achieve a full-flavoured gravy.  Downside to reducing the water is that you will end up with much less gravy.  And, to the person who commented about frozen gravy being separated upon thawing, simply add a couple of tablespoons of water, heat, and whisk it well to recombine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Shuggles",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2895743/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-12-07T04:24:56.32Z",
                "reviewBody": "Hey, Chef John! Thanks! Made this for Thanksgiving & was so pleased. Followed the recipe exactly & liked it BUT then cheated by adding more flour and butter (might sub some corn starch next time). I wanted a thicker 'gravy base' in order for the gravy to be 'just right' when ALL the pan juices were added at dinner time! Made it thicker than I meant to, but the results are worth repeating. Why? I placed just some of the 'gravy base' from this recipe into a medium sized, lined slow cooker a couple hours before dinner. When the turkey came out of the oven & was removed from the pan, the pan juices went into the slow cooker w/the 'gravy base.' After whisking the gravy mixture, it was just the perfect amount of thickness for my taste! If it hadn't been, I'd have had a touch of easy juggling to do: add more 'gravy base' if it was too thin, or add some chicken stock if it was too thick. Easy fixes! Added touch of balsamic & garlic. Later crocked the turkey bones; pulled the bones out in the morning; ran out of time & crocked the broth a whole day more. The next morning after that, added onions, parsnips, carrots - especially carrots O Best Beloved, etc. In the evening, I added the rest of the 'gravy base', whisked it, stirred in some frozen peas\u0000\u0000 & heated it through. Finally added a bit of turkey to the pot just before serving (just enough time to warm it through so it wouldn't dry out). Best turkey soup I've ever had. That after making the easiest turkey-day gravy ever! Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rani Ness",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5912271/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-10T16:37:51.343Z",
                "reviewBody": "I was excited to do a make-ahead gravy for Thanksgiving but this ended up being a lot of trouble. I lost so much volume while simmering that I ended up going to the store to buy turkey stock. As other reviewers suggested two turkey wings didn't seem to be enough for a decent stock.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Jonah's Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1267235/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Chef John's Make-Ahead Gravy",
            "description": "Save your Thanksgiving Day sanity by making rich turkey gravy in advance!",
            "uploadDate": "2012-11-05T22:58:30.945Z",
            "duration": "PT5M36.96S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa532a753-2c39-4b54-b3fb-8de0231931ef%2F66d79edb-0b7e-49cb-b859-cdc6d9a1611c%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1949141467001"
        }
    }
]