[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/237/world-cuisine/latin-american/",
                    "name": "Latin American",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/728/world-cuisine/latin-american/mexican/",
                    "name": "Mexican",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/231514/vegetarian-mexican-inspired-stuffed-peppers/",
        "name": "Vegetarian Mexican Inspired Stuffed Peppers",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2019%2F02%2F972823.jpg",
            "width": 650,
            "height": 465,
            "caption": "Photo by donnam"
        },
        "datePublished": "2013-01-21T03:52:15.000Z",
        "description": "I created this so it's not too spicy, but is packed with flavor. My kids loved it! For variety, add corn or other vegetables or switch to other chopped tomato varieties (chiles, jalapenos, etc.). Follow the boiling method prior to baking if you don't want a crispy bell pepper. If you have small peppers, use more of them for this recipe. They taste great with a dollop of sour cream on top.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT0H55M",
        "recipeYield": "4 stuffed peppers",
        "recipeIngredient": [
            "1 tablespoon salt",
            "4 large green bell peppers - tops, seeds, and membranes removed",
            "1 tablespoon olive oil",
            "½ cup chopped onion",
            "2 cups cooked rice",
            "1 (15 ounce) can black beans, drained and rinsed",
            "1 (14.5 ounce) can chili-style diced tomatoes",
            "1 teaspoon chili powder",
            "1 teaspoon garlic salt",
            "½ teaspoon ground cumin",
            "½ teaspoon salt",
            "1 (8 ounce) package shredded Mexican cheese blend (such as Sargento® Authentic Mexican)"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bring a large pot of water and 1 tablespoon salt to a boil; cook green bell peppers in the boiling water until slightly softened, 3 to 4 minutes. Drain.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat olive oil in a skillet over medium heat; cook and stir onion in the hot oil until softened and transparent, 5 to 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix rice, black beans, tomatoes, and cooked onion in a large bowl. Add chili powder, garlic salt, cumin, 1/2 teaspoon salt; stir until evenly mixed. Fold 1 1/2 cups Mexican cheese blend into rice mixture. Spoon rice mixture into each bell pepper; arrange peppers in 9x9-inch baking dish. Sprinkle peppers with remaining Mexican cheese blend.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in the preheated oven until cheese is melted and bubbling, about 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Latin American",
            "Mexican"
        ],
        "recipeCuisine": [
            "Latin American",
            "Mexican"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "donnam"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.724199288256227,
            "ratingCount": 562,
            "itemReviewed": "Vegetarian Mexican Inspired Stuffed Peppers",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "508.7 calories",
            "carbohydrateContent": "55.5 g",
            "cholesterolContent": "54.9 mg",
            "fatContent": "22.8 g",
            "fiberContent": "12 g",
            "proteinContent": "23.8 g",
            "saturatedFatContent": "13.6 g",
            "servingSize": null,
            "sodiumContent": "3755.9 mg",
            "sugarContent": "4.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-05-17T02:27:28.353Z",
                "reviewBody": "So...I went a little rogue on this recipe.  I did the peppers as instructed,  but then I sautéed the beans, onions, cumin, actual garlic (3 cloves), a serrano pepper and got those flavors married while the (brown) rice was cooking.  I took off the bean mixture after 10 min or so/when the onions were translucent, added some frozen corn and some shredded cheese (habanero cheddar) and waited on the rice.  Had a beer.  Waited on the rice to finish  Mixed it all up, topped it with the cheese and threw it in the oven.  DELICIOUS",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Christen52",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/11021486/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-10T04:26:32.31Z",
                "reviewBody": "SOOO good!!! I did as another reviewer suggested and baked the green bell peppers (I used 8 peppers) for 10 minutes at 250 instead of boiling, as I didn't want them to lose their flavor. They were still pretty crunchy, so I wouldn't go that way if you want softer peppers, but I liked them just fine - and they still had that lovely bell pepper taste. I also used quinoa instead of rice - DEFINITELY the way to go. The texture was wonderful. I also followed a different reviewer's suggestion to improve the flavor profile by sautéing the onion with fresh garlic (always use fresh!!) for 10ish minutes, then adding the beans, cumin, and chili powder for another 10 min of sautéing, then setting aside until the quinoa was finished. Tossed those together with the tomatoes and cheese, and stuffed them into the peppers. The stuffing is DELICIOUS.\n\nGreat recipe overall. Healthy and delightful - and, even better, looks really pretty and fancy for dinner guests. Will definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Amy4235",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3484087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-02T16:16:33.643Z",
                "reviewBody": "This was great! I added quorn grounds that I sauteed with the onion and some South African smoke seasoning blend because I have to pacify my husband with faux meat on vegetarian nights but otherwise made the recipe as written and we both loved it. I had small bell peppers so there was a lot of filling left over so I used to rest of the filling to make \"enchiladas\" (wrapped the filling in tortillas, sprinkled cheese over the top, and baked them in the oven) and it was delicious that way as well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tara Stevenson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2522426/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-15T01:46:40.05Z",
                "reviewBody": "Tasty and Easy!  I made a few of substitutions, but stuck with the same basic recipe.  1) Instead of boiling, after cutting the peppers, I put them in the toaster oven on 'bake' at 250ish degrees for 10 minutes.  They turned out so perfect. 2) I didn't have chili-style tomatoes, so I diced up some cherry tomatoes and added a little salsa 3) instead of garlic salt, used granulated garlic and added a little extra salt 4) used Yellow peppers which gave a wonderful sweet taste.  I don't really like green peppers so this was a great substitution.  5) instead of rice, used Quinoa for extra protein.  Some of the quinoa actually tasted like ground beef after baking.  My Husband was impressed with this recipe and I've tried several other stuffed pepper recipes where he would shrug and say \"it's, okay\" but this was he said, \"Wow, this is actually good!\"  Thanks for the recipe!  Will definitely do again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sriyani",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/sriyani/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2021-09-22T09:03:59.107Z",
                "reviewBody": "This my favorite recipe from Allrecipes, bar none! Sometimes I cut the green peppers into squares and sauté with the onions and then mix them with the rice, beans, etc. Put in a casserole dish and top with cheese. Easier than stuffing the peppers and just as  tasty!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Trixie T.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1517724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-29T23:33:29.68Z",
                "reviewBody": "My husband and I recently started eating almost exclusively vegetarian meals, and this was first on our list. It was very good. We love spicy, but the kids wouldn't eat it, because the Mexican cheese I added also had peppers in it. Otherwise I followed the directions (except I used red peppers) and it was delicious. My husband said we should use the filling to make burritos so we are going to try those next. We will make this again for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "leapinlambchop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7155197/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-13T17:04:39.37Z",
                "reviewBody": "Excellent base recipe. Have made it as is and great but have also used it without the beans (try to reduce the protein due to kidney problems) and have also added corn used homemade salsa instead of tomatoes added jalapenos and added toasted walnuts for crunch. All versions are good. My husband likes the peppers more cooked so if you don't like them crunchy boil longer use thinner skinned peppers or bake much longer. Overall a definite keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AEMAZA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/634564/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-10-26T12:19:13.48Z",
                "reviewBody": "Made it just as directed (as everyone should if they are rating a recipe!) and it was absolutely delicious and divine!! This is a saver, and I think I found my new stuffed pepper recipe! As a vegetarian, I truly enjoyed these marvelous stuffed peppers. Thank you for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Jombus",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12328729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2016-04-04T22:49:33.693Z",
                "reviewBody": "I went way off script but it came out absolutely amazing. Started by cutting the tops off 6 fresh red bell peppers. Cut out the guts and diced the red part of the tops. Set the bottoms aside. Sautéed the diced red parts with 1.5 cups of diced onion (pre-diced from Kroger- I refuse to cut onions) in olive oil. Added my spices here- eyeballed quantities of chopped garlic garlic salt lemon pepper seasoning (Kroger brand) cumin and chili powder. Added 1 lb of lean ground beef to the pot and cooked thoroughly. Plot twist: then I added 2 cups of water and a box of Zataran's dirty rice mix to the same pot with the meat and veggies still in it. Followed the cooking directions on the box. Removed from heat and mixed in the (drained not rinsed) can of black beans and (drained not rinsed) can of diced tomatoes. Added 2 cups of shredded Mexican blend cheese. Mix mix mix. Tasted to check spice levels. Died and went to heaven. Filled my bell pepper bottoms with the mixture and topped with a pinch of extra cheese. Baked the stuffed peppers on a foil-covered cookie sheet for 30 minutes at 350F. I ended up with way more filling than I needed for 6 peppers but I will either freeze it for future peppers or serve it another way. It's so good I could eat it with a spoon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allison",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/16679716/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-19T01:23:57.56Z",
                "reviewBody": "The flavor was good but the stuffing came out a little dry. Next time I'll be adding a can of tomato soup and maybe some corn.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "mariecb1969",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10734729/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Mexican Stuffed Peppers",
            "description": "The classic stuffed bell pepper hot dish.",
            "uploadDate": "2016-09-06T17:13:27.011Z",
            "duration": "PT1M22.149S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F052dab69-362b-4cdb-9bce-74dbb4db166f%2Fb163a1de-80f8-43d6-8651-4f8b598f502b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5114383155001"
        }
    }
]