[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/227/world-cuisine/asian/",
                    "name": "Asian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232359/slow-cooker-red-curry-beef-pot-roast/",
        "name": "Slow Cooker Red Curry Beef Pot Roast",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6645583.jpg",
            "width": 1773,
            "height": 1773
        },
        "datePublished": "2013-04-16T23:45:04.000Z",
        "description": "When you cross Southeast Asia and Midwest America, you get comfort food on the exotic side.",
        "prepTime": "P0DT0H15M",
        "cookTime": null,
        "totalTime": "P0DT8H0M",
        "recipeYield": "6 servings",
        "recipeIngredient": [
            "1 (2 1/2 pound) boneless beef chuck roast",
            "salt and ground black pepper to taste",
            "2 teaspoons vegetable oil",
            "1 onion, chopped",
            "1 teaspoon red curry paste, or to taste ",
            "2 teaspoons ground cumin",
            "1 teaspoon ground coriander",
            "2 cups chicken broth",
            "1 (14 ounce) can coconut milk",
            "1 (10 ounce) can diced tomatoes and green chiles",
            "3 tablespoons Asian fish sauce, or to taste",
            "¼ cup brown sugar",
            "4 cloves garlic, minced",
            "1 tablespoon tomato paste",
            "1 (3 inch) piece fresh ginger root, peeled and sliced",
            "1 lime, juiced",
            "2 bay leaves",
            "1 ½ pounds small potatoes, halved",
            "4 small heads baby bok choy, sliced in 2-inch sections, green leaves intact",
            "1 ½ teaspoons cornstarch",
            "1 tablespoon water",
            "¼ cup chopped roasted peanuts, or to taste",
            "¼ cup chopped fresh cilantro, or to taste"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Generously season beef chuck roast with salt and pepper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat a large skillet over high heat; add vegetable oil. When oil is hot, brown roast on all sides, about 2 minutes per side. Remove pan from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spread chopped onions in slow cooker; place browned roast on top of onions.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Spoon red chili paste into the hot skillet. Add cumin and coriander. Rub mixture into hot oil with the back of a spoon to blend. Place skillet over medium heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour in chicken stock. Return heat to high. Stir in coconut milk. Add diced tomatoes with green chiles, fish sauce, brown sugar, minced garlic, tomato paste, and sliced ginger; stir in lime juice. Bring to a boil.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour mixture over pot roast; add bay leaves. Stir to distribute ingredients in the slow cooker.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover slow cooker and set to Low. Cook until fork tender, 7 to 8 hours.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Remove meat from the broth. If desired, skim some fat from the surface of the broth.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place potatoes and bok choy into the broth; stir. Cover and turn heat to high. Cook until potatoes are tender, about 12 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Blend cornstarch and water in a small dish until dissolved. Stir into broth mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut meat into large chunks and add to the slow cooker; stir. Cover slow cooker and cook on high until meat is heated through and broth is slightly thickened, about 12 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Ladle into serving bowls and garnish with chopped peanuts and cilantro.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "Asian"
        ],
        "recipeCuisine": [
            "Asian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Chef John"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.493827160493828,
            "ratingCount": 162,
            "itemReviewed": "Slow Cooker Red Curry Beef Pot Roast",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "625.4 calories",
            "carbohydrateContent": "42.2 g",
            "cholesterolContent": "86.1 mg",
            "fatContent": "39 g",
            "fiberContent": "5.9 g",
            "proteinContent": "30.1 g",
            "saturatedFatContent": "21 g",
            "servingSize": null,
            "sodiumContent": "960.1 mg",
            "sugarContent": "13.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-10-25T14:36:52.593Z",
                "reviewBody": "This recipe is great and very versatile.  I've been making a version of this for years, only I use beef cut into stew-sized chunks.  Also, I add some peanut butter to taste towards the end.  There are many \"authentic\" Thai variations on red curry, including Panang beef curry.  The Panang uses Panang curry paste (Frequently available right next to the tubs or cans of red curry) and peanut butter is part of that curry.  Mussuman curry is another variant and it uses potatoes.  While Thai beef curries typically don't stew the meat (usually sliced thin and added towards the end) my favorite Thai restaurant from about 25 years ago made their version with beef chunks that were stewed and that's how I've been making it for years.  Experiment with any of the 3 red curry pastes: Red, Panang, or Mussuman, and change up the additions to suit your tastes and you can dial this recipe in to suit your exact tastes.  Keep in mind that the pre-made curry pastes of any color are concentrated and typically very hot, so plan accordingly.  Also, serving this with steamed jasmine rice and making a little extra sauce can really stretch this meal.  One last thing, the fish sauce by itself smells and tastes terrible.  But it adds a required (and wonderful) flavor to Thai curries and it mellows significantly when cooked.  Just don't over do it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bennybbc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2731615/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-24T23:57:56.87Z",
                "reviewBody": "I made this once before and it was just ok. Then I read the reviews and made some adjustments and it was sooooo good. I used a grass fed roast. I tripled the red curry paste (Thai kitchen brand), I added one jalapeño that had been seeded and sliced on top of onions. REDUCED THE CHICKEN STOCK\nTO JUST ONE CUP. Followed directions to cook in slow cooker on low for 7 he's. Added 2  sweet potatoes cut into 2\" chunks for the last 45 min.  OMIT THE BOK CHOY. It just gets too mushy. Cook it another way if you want. Remove the potatoes and strain the sauce into a saucepan. Bring to a boil. Mix 2 tbsp softened butter with 2 tbsp flour to form a paste. Whisk into sauce and simmer for a few minutes until it thickens. Voila!! Now it's a 5 star recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tammy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10813558/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-30T03:54:37.533Z",
                "reviewBody": "Absolutely fabulous. TBH, some people shun Americanized \"hybrid\" dishes like this in favor of authentic ethnic entrees with established history and tradition behind them. I admit to having been one of those snobs, probably from having gone to one too many really bad Americanized Chinese restaurants (even one is too many). But this dish had me pleasantly surprised and has gone some way in reforming my antiquated mindset. I'd always wondered how the fantastic sweet and spicy flavor from the Thai curry coconut milk soup staples could translate to other dishes. Here is a well executed example by Chef John on how that happens, taking a dish as American as pot roast in a slow cooker and spicing it up with the all essential red curry and coconut milk ingredients signature to Thai.\n\nMy only changes were to use the more nutritious protein based chickpeas (dry stock) that I added at the start of the slow cook instead of carbs like potatoes. As personal preference and higher tolerance I also tripled the amount of curry and used gluten free quinoa flour instead of cornstarch. I'm very pleased with how delicious it turned out. I'll be returning to this recipe again in the future. Thanks John, I'm very happy about being able to have this in my repertoire.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Arias Hung",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6614354/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-05T13:30:51.787Z",
                "reviewBody": "I followed the recipe almost to the letter except I did not have Rotel tomatoes on hand so I used a can of regular diced tomaotes, and I used a 1T of red curry paste. Otherwise, I followed the recipe.  I didn't cook the roast as long, maybe 5 hrs on low and the vegetables cooked for  45 mins to 1 hour on high. At the end I transferred the sauce to a stove top pot to reduce the sauce (my attempt to concentrate the sauce).  That helped, but the sauce did not taste as rich and flavorful. My concern at the outset was the amount of liquid called for in a slow cooker recipe.  Experience has taught me that less liquid is better for most slow cooker recipes.  This recipe was no exception.  The sauce had a fabulous flavor initially, but  the extended cooking in the slow cooker made the sauce too watery and as a result flavor was lost.  The next time I will try this recipe in the oven as I think the sauce won't break down as much, and the richness in flavor will not be sacrificed.  I also think this sauce / gravy would pair well with chicken or fish.  I would have given this recipe a higher mark, but for the loss in flavor due to too much liquid. I would reduce the chicken stock by at least 1 cup.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Shamrock",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10908370/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-22T06:08:46.867Z",
                "reviewBody": "Very flavorful! My son who ate a lot of Thai food loved it. I followed the recipe exactly as written. Maybe it's my slow cooker, but \"cooking the potatoes in the slow cooker for about 12 minutes\" was definitely not enough. Next time, I will cook it for at least an hour, or put it in a stock pot and cook it on the cooktop on a higher temperature. Can't wait to do it again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "seagulldove",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4670855/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-01-17T01:50:49.6Z",
                "reviewBody": "The family I cook for are from India. I make this exactly as is except I use bones less skinless chicken breast. This is what they request when family and friends are invited. I personally love the beef but the chicken is great too. This is my favorite receipt of 2013.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rhonda Bartone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6220029/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-24T22:25:10.05Z",
                "reviewBody": "Awesome recipe. I used a top shoulder roast and substituted chick peas for the potatoes. I also used 1 tsp ground ginger instead of fresh. Really tasty. Highly recommend.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Ammons",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/6449910/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-02-27T00:30:26.487Z",
                "reviewBody": "Very flavorful. I made it exactly like the recipe. I did not however have enough potatoes and by happy accident used a sweet potato which IMHO is much better! Next time I make this I will use more spices and definitely par-boil the potatoes. The white ones took about an hour the sweet about 45 minutes in the slow cooker. The meat was tender and there was a lot of fat to be skimmed off. I will definitely make this again..maybe try chicken thighs.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SarahG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/13228493/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-02T20:57:30.22Z",
                "reviewBody": "I made this yesterday and everyone loved it. Made a few changes because I didn't have ingredients; first I used chicken soup base dissolved in 1/2 cup apple juice and mixed with 2 T of honey in place of the chicken stock and brown sugar. I omitted the bok choy. I also added 2 peeled chopped sweet potatoes. I used 1 full tablespoon of red curry paste but found it wasn't \"curry\" enough for me so I added a tablespoon of curry powder. And I added about 1/2 tsp of cinnamon 1/4 to 1/2 tsp cloves and 1 tablespoon of peanut butter. The potatoes thickened the sauce sufficiently so that I didn't have to use any cornstarch. I didn't chop the meat after cooking but I did shred it into bite sized chunks which were wonderfully flavorful. Thanks for this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "llthomas43",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7073249/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Slow Cooker Red Curry Beef Pot Roast",
            "description": "See how to make a red curry pot roast in your slow cooker.",
            "uploadDate": "2013-02-28T21:04:11.075Z",
            "duration": "PT6M24.875S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb04cd347-7007-4a48-8ace-cca07ba6ce4f%2F1d53b19e-050e-41e9-a4d1-fa1194790499%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2196073055001"
        }
    }
]