[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
                    "name": "Fruit Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12952/desserts/pies/fruit-pies/raspberry-pie/",
                    "name": "Raspberry Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12235/raspberry-pie-i/",
        "name": "Raspberry Pie I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F100496.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-06-29T22:15:14.000Z",
        "description": "With black raspberries being fresh, I have made 2 of these pies this week.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "1 quart fresh raspberries",
            "1 ¼ cups white sugar",
            "8 teaspoons cornstarch",
            "2 tablespoons quick-cooking tapioca",
            "6 tablespoons water",
            "4 tablespoons butter",
            "1 recipe pastry for a 9 inch double crust pie"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix together raspberries, sugar, cornstarch, minute tapioca and water.  Mix and let sit while you make your pie crust.  (See double crust recipes on this site if you do not have a recipe).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Put berries in bottom crust, and put 4 - 1 tablespoon pats of butter on top.  Put on top crust and crimp edges.  Make slits in the crust to allow the steam to escape.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 425 degrees F (220 degrees C)  for 15 minutes.  Reduce heat to 350 degrees F (175 degrees C) and bake for 45 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Fruit Pies",
            "Raspberry Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Susan"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.633540372670807,
            "ratingCount": 161,
            "itemReviewed": "Raspberry Pie I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "448.9 calories",
            "carbohydrateContent": "63.7 g",
            "cholesterolContent": "15.3 mg",
            "fatContent": "21.1 g",
            "fiberContent": "6.2 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "7.4 g",
            "servingSize": null,
            "sodiumContent": "275.2 mg",
            "sugarContent": "34.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-08-23T19:05:21.09Z",
                "reviewBody": "Okay, here's the deal.  One of the best, most simple raspberry pie recipes I've come across.  A couple of things to share with you. First, I've read about \"watery\" pies. One thing that contributes to that, would be the ripeness of the raspberries (more moisture). Another thing, would be the amount of water that might be left upon washing them.  If they are not thoroughly dry, that moisture (along with additional water used in the recipe), might make for a more \"watery\" pie.  I used 4 tabelspoons of water (instead of 6) because my berries were still wet from washing. I also added an additional tablespoon of tapioca. As far as tartness, that I've seen people mentione...again, it's the ripeness of the berries and it's hard to tell if you're buying them in the store and can't taste them.  So try a berry before making the pie at home.  If it's too tart for your liking, add more sugar than the recipe requires.  I added an additional 1/4 cup (total 1-1/2 cups).  I also brushed the crust with egg white ~ yummm....a perfectly golden crust!  This was awesome ~ the whole pie gone in two days (with just two people ~ yikes!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tammy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1573540/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-16T08:51:17.483Z",
                "reviewBody": "This pie was a big hit!! Ate while still hot in the middle, and not at all runny. I followed the directions pretty close. I used 2 bags of thawed raspberries and thawed deep dish double crust pie shells. I used 2 heeping Tbl sp of the tapioca and mixed it with 4 Tbl sp of the juice from the berries. Drainded the berries and added to the tapioca. I mixed 1 and 1/8 C sugar with the corn startch and cut in the butter until crumbly. Gradually folded in with the berries and poured into a the bottom pie plate that I already prepped in the oven for a few min. Put the other crust on top cut out some holes and brushed with egg whites. I poured some of the remaining sugar over the crust and stuck it in the oven. Cook time was great followed to the second. Will make this pie again and again. No mess no hassle. Keeper!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mariah Long",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1488109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-04T21:07:22.39Z",
                "reviewBody": "I have been baking for 33 years and on numerous occassions have sold my baking at Christmas and other special events.  I have NEVER heard of adding water to a fruit pie, but I thought I should follow the recipe as others rated it very high. Made this last night with fresh raspberries and it turned out to be a soupy mess!  Husband and the kids ate it but I couldn't.  Don't know if I'll make again or not.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ckjj",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2174954/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-10-26T05:15:45.41Z",
                "reviewBody": "I made this pie last night for my husbands' birthday--and he really loved it. I thought it tasted a little like jam but it was still pretty good. The only thing was that I used frozen raspberries completely thawed and drained and there was A LOT of water. I didn't add any (the recipe calls for 6 tablespoons) and it was still a tad runny. So remember that if you make this with frozen raspberries!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "AnitaMarie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2221506/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-24T22:26:50.623Z",
                "reviewBody": "I liked this recipe because the pie was not runny at all. I made a raspberry pie the week before with flour instead of the cornstarch and tapioca and it was very runny which make the crust soggy. This one was very good with the berries staying in the pie and the crust stayed crisp.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lois Lee Peterson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/292435/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-05T05:16:16.917Z",
                "reviewBody": "This is my go-to pie. I am an avid pie baker, and this pie by far receives the most compliments. Personally I enjoy the tart yet still sweet flavor of this pie, and my recipients have complimented me on it as well. Its sweet, yet still retains the natural tartness from the raspberries, without being too tart or overly sweet.  I have made this pie several times, using both frozen, fresh or 50/50 fresh/frozen raspberries. Never have I had a pie turn out runny or even juicy. My favorite way to eat this pie is cold out of the fridge, perfect for a summer day when berries are ripe and the temps are high! If you like raspberries or pie (or if you're like me and LOVE both) then this is the best recipe to use! \n\nIts very important if you are experiencing a runny pie, that there are adequate slits for steam to escape. I prefer a lattice top, as it hides imperfections in your crust, and is less likely to break, as well as lets l plenty of steam escape.\n\nFurthermore its importants to let the raspberry, tapioca, cornstarch, sugar mix sit for a bit. I make my crust during this time, so my raspberries usually sit for 30-45 min. I also use less butter. 4 tablespoons is a bit much for my liking, so I usually use around 2 and dice the butter up and spread onto the top crust. It will give the crust a nice color, and the excess with drip into berries while baking.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tiffany Peeken",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3317338/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-12T16:59:11.03Z",
                "reviewBody": "Very nice pie. I added a bit of lemon zest to the filling to bring out the raspberry flavour and brushed the top with milk and sprinkled it with sugar. Came out beautifully. Make sure you leave it to rest and cool completely before cutting as it will be runny as other reviewers have mentioned.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "britishcolumbiagirl",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1747622/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-07-27T02:16:47.427Z",
                "reviewBody": "This was sooo good! My berries were tart so I added an extra 1/4 cup sugar. Used frozen pie crusts but it was still so fresh and wonderful tasting. My husband said to throw all other recipes out and only use this one!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cindy T.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2098724/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-01T14:42:05.03Z",
                "reviewBody": "Very tasty recipe but next time I'll add less sugar and more cornstarch. Tasted like jam almost sooo good but a little runny. Thanks for the recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MRSGOOGS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/396485/"
                }
            }
        ]
    }
]