[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6779/cinnamon-raisin-bread-i/",
        "name": "Cinnamon Raisin Bread I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6280546.jpg",
            "width": 1960,
            "height": 4032
        },
        "datePublished": "1998-07-01T01:39:08.000Z",
        "description": "This was my dad's recipe.  A yummy moist bread loaded with raisins and cinnamon.  The best raisin cinnamon bread I've ever had!  Great plain, toasted, or with a light glaze of buttercream frosting!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "3 loaves",
        "recipeIngredient": [
            "1 ½ cups milk",
            "1 cup warm water (110 degrees F/45 degrees C)",
            "2 (.25 ounce) packages active dry yeast",
            "3 eggs",
            "½ cup white sugar",
            "1 teaspoon salt",
            "½ cup margarine, softened",
            "1 cup raisins",
            "8 cups all-purpose flour",
            "2 tablespoons milk",
            "¾ cup white sugar",
            "2 tablespoons ground cinnamon",
            "2 tablespoons butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Warm the milk in a small saucepan until it bubbles, then remove from heat.  Let cool until lukewarm.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Dissolve yeast in warm water, and set aside until yeast is frothy.  Mix in eggs, sugar, butter or margarine, salt, and raisins.  Stir in cooled milk.  Add the flour gradually to make a stiff dough.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Knead dough on a lightly floured surface for a few minutes.  Place in a large, greased, mixing bowl, and turn to grease the surface of the dough.  Cover with a damp cloth.  Allow to rise until doubled.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roll out on a lightly floured surface into a large rectangle 1/2 inch thick.  Moisten dough with 2 tablespoons milk.  Mix together 3/4 cup sugar and 2 tablespoons cinnamon, and sprinkle mixture on top of the moistened dough.  Roll up tightly; the roll should be about 3 inches in diameter.  Cut into thirds, and tuck under ends.  Place loaves into well greased 9 x 5 inch pans.  Lightly grease tops of loaves.  Let rise again for 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 45 minutes, or until loaves are lightly browned and sound hollow when knocked.  Remove loaves from pans, and brush with melted butter or margarine.  Let cool before slicing.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Faye Salisbury"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.633949191685912,
            "ratingCount": 866,
            "itemReviewed": "Cinnamon Raisin Bread I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "181.8 calories",
            "carbohydrateContent": "32.4 g",
            "cholesterolContent": "18.1 mg",
            "fatContent": "4.1 g",
            "fiberContent": "1.2 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "1.2 g",
            "servingSize": null,
            "sodiumContent": "114.9 mg",
            "sugarContent": "10 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-16T04:38:56.38Z",
                "reviewBody": "I would love to be able to give this recipe 4 1/2 stars- it is very good.  It is simple to make, tastes really good, and makes plenty.  I won't give it 5 stars because it took considerably less time to bake for me than the recipe called for, which for a less experienced baker could have resulted in burnt bread, and the rolled dough size was too vague. (I rolled it 1/2\" thick and it was probably about 24\" long.)\r\n\r\nI left out the raisins (don't care for them in baked goods), let it rise in the fridge overnight (for more developed flavor),rolled it in a mix a flour and 10x sugar to make the crust more tender and left the melted butter out. It turned out nicely, and the large amount allowed for one baked loaf today, one baked loaf to freeze, and one roll of dough to freeze for another day. FYI, this is similar to the recipe I used to use comercially to bake sticky buns- it would work well as rolls.  Oh, and the milk doesn't really need to be heated. I used water and milk powder and it wasn't warm- it turned out fine.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DANDK1997",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/598787/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-25T16:38:37.787Z",
                "reviewBody": "This is the best bread in the universe!  My whole family and all my friends have become addicted to it since the first time that I made it, and now I have to bake it by the dozen!  It's moist and very flavourful!  The cinnamon swirl is the highlight, so don't skip that step!  I love it toasted with peanut butter!  It's delicious!  When I make it, I use two cups of raisins and add a bunch of cinnamon to the dough.  I also make it with half whole wheat flour.  It's the best this way.  To enhance your eating pleasure, I reccomend unrolling it as you eat it!  Aaaaaah, irresistable!  I also tried a funky variation!  Instead of putting in raisins, I used three chopped up Granny Smith apples!  It tasted great!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MIKAILEE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/679356/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-28T03:18:40.263Z",
                "reviewBody": "Oh my word is this bread simple to make and DELICIOUS!  I've already made two batches this week.  Just for any one who wants to know, this recipe can be halved and still get two hearty loaves out of it.  When halving the recipe I altered it a bit though:  I kept 1 c. water for the yeast, I kept the 1/2 c. white sugar (with dry ingredients), I added 3/4 c. raisins, not quite 4 c. flour, almost all of the 3/4 c. sugar  and all 2 tsp. cinnamon (mix to be sprinkled inside of bread).  Also, my oven runs hot so I set it for just over 300º baked for 30 minutes, lightly buttered the tops and shut off the oven and let both loaves sit in there for like 10-15 more.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FAIR_LADY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/625802/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-14T19:19:11.797Z",
                "reviewBody": "This was the closest I have come to making my \"dream\" cinnamon-raisin swirl bread that I used to eat at an Amish restaurant I where I waited tables.  I used my Bosch mixer to make it, and I substituted dried cranberries for the raisins.  \r\n  Several things:  the dough does not get \"stiff,\" but remains very sticky--the stickier the dough, the moister you final product will be, so don't panic if you have hands full of sticky dough.  (If you keep adding flour to make a \"stiff\" dough, your bread will be dry.)  Also, to save time, I warmed the milk in the microwave.  The baking time is also a little deceptive, I think.  I was worried about it getting done in the center, so I baked it the full time, but then the crust was burned (unless you like a really hard, thick, brown crust--I don't.)  Next time I make it, I will try a little shorter time in the oven.  \r\n  The end result is great toasted; I like it with butter, plain or with pumpkin butter (a new recipe I just tried today.)  Have fun trying variations, and thanks for the great basic recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cottonista",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1522318/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-13T21:49:29.087Z",
                "reviewBody": "This recipe is a hit!  This was my first time baking raisin bread and it turned out beautiful and delicious (I have posted pictures).  \n\nWhat I suggest is to use BREAD FLOUR and NOT all-purpose flour.  My bread rose so easily and the size of each loaf was huge.  I am not a fan of all-purpose flours for bread.  I also doubled the amount of raisins and mixed them into the dough instead - this way they are evenly distributed throughout the dough and you can ensure in having some raisins in every bit!\n\nI also increased the amount of cinnamon by a couple of tablespoons.  Also, MAKE sure to cook it for 30 minutes max, I have a strong oven and 45 min would have killed it.\n\nGreat recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Yasmine",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2537490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-21T00:38:04.943Z",
                "reviewBody": "Oh my heck this is delicious! Two of the loaves were devoured by my son and husband within 24 hours! It is heavenly with some real butter melting on a warm toasted slice. I see myself making this bread a lot for the holidays etc. One caveat if you make this in a kitchenaid mixer (or similar stand mixer): Unless you have the mixer withthe largest bowl (the one you need the crank to lift up) the dough will come up over the top of the dough hook. I just kept pushing the dough back down. NOT a reflection on the recipe; it's just a lot of dough for a stand mixer!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSHAVERILLINOIS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/561091/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-20T19:19:06.897Z",
                "reviewBody": "Hands down the best bread I've ever made! I wanted to use my bread machine so I made 1/3 of the recipe. Here is the conversion:\n1/2 c. milk, 1/3 c. water, 1-1/2 t. bread machine yeast, 1 egg, 3 T. sugar, 1/4 t. salt, 3 T. butter or margarine, 1/2 c. raisins, 2-1/2 c. + 1/8 c. flour, 2 t. milk, 1/4 c. sugar, 2 t. cinnamon, 2 t. butter. Disregard dissolving the yeast/waiting 10 minutes. Add the ingredients according to your bread machine mfr. instructions. Use the dough setting, adding the raisins when 5 minutes remain in the kneading process. At the end of the cycle, proceed with step 4, making 1 loaf. Bake 30-45 minutes. Enjoy!\nUpdate: I made this again and substituted 1/3 c. oats for 1/3 c. flour and packed brown sugar instead of white sugar. I also added 1/2 t. cinnamon along with the salt. Last of all, I made the original recipe of the cinnamon sugar mixture and sprinkled this very generously over the rolled out dough. I saved the remaining cinnamon sugar for another use. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Debbie Hammond",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1849982/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-05-02T17:46:56.997Z",
                "reviewBody": "Delicious and so easy!  I made mine in a Bundt pan and loaf pan, it made the bread easy to slice and carry to work! Definitely a tried and true recipe! Thanks so much for sharing!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pattie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/33941/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-07T05:46:54.04Z",
                "reviewBody": "I don't really like raisins so I decided not to add them.  I also used ~1 T of sugar in the yeast mixture to ensure proofing.   Buttering the top of the dough (I used butter flavored PAM) before baking will ensure a soft crust.  I added 1 T of eggs to my 2 T milk called for in the recipe.  Monitoing my fat intake, I used fat free milk and Egg Beaters.  It turned out great.  The basic bread can be used to make other swirl breads like purple yam or use cocoa powder and sugar for a chocolate bread.  ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Johnny V",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2526075/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cinnamon Raisin Bread I",
            "description": "Get your swirl on inside this tasty bread!",
            "uploadDate": "2017-06-15T16:55:46.903Z",
            "duration": "PT1M52.112S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F7601fe19-ffa7-44b7-8b7d-1ad330b90f2e%2F05b27746-8b3a-4a7d-8f08-ce106c95ff59%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=5472602320001"
        }
    }
]