[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/82/trusted-brands-recipes-and-tips/",
                    "name": "Trusted Brands: Recipes and Tips",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/482/trusted-brands-recipes-and-tips/eagle-brand/",
                    "name": "EAGLE BRAND&reg;",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/232893/chocolate-flan-cake/",
        "name": "Chocolate Flan Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1017814.jpg",
            "width": 300,
            "height": 300
        },
        "datePublished": "2013-05-28T22:05:46.000Z",
        "description": "This flan, when inverted, rests on a rich chocolate cake layer and is topped with melted caramel.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT2H0M",
        "totalTime": "P0DT2H20M",
        "recipeYield": "18 servings",
        "recipeIngredient": [
            "Crisco® Original No-Stick Cooking Spray",
            "½ cup SMUCKER'S® Caramel Flavored Topping",
            "1 (18.25 ounce) box Pillsbury® Moist Supreme® Devils Food Premium Cake Mix",
            "1 cup water",
            "½ cup Crisco® Pure Vegetable Oil",
            "3 large eggs",
            "4 ounces cream cheese, softened",
            "4 large eggs, at room temperature",
            "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk",
            "1 (12 ounce) can PET® Evaporated Milk",
            "1 teaspoon vanilla extract"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Heat oven to 350 degrees F.  Coat 12-cup fluted tube pan with no-stick cooking spray. Place piece of rolled up foil in tube of pan to prevent cake from baking over top. Pour caramel topping into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Prepare cake mix according to package directions using the water, oil and eggs. Pour evenly over caramel topping.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine cream cheese, eggs, sweetened condensed milk, evaporated milk and vanilla in blender container. Process until blended. Pour slowly over cake batter. NOTE: While baking, the cake rises and the milk mixture goes to the bottom.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Coat piece of foil with no-stick cooking spray. Cover pan, coated side down, tightly with foil. Place pan in large roasting pan. Pour hot water into roasting pan to a depth of 2 inches.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake 2 hours or until toothpick in center still has a few moist crumbs. Place cake on cooling rack. Cool 15 minutes. Remove foil and invert onto serving plate. Cool 1 hour at room temperature. Chill 4 hours or overnight.\n"
            }
        ],
        "recipeCategory": [
            "Trusted Brands: Recipes and Tips",
            "EAGLE BRAND&reg;"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Eagle brand"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.770370370370371,
            "ratingCount": 135,
            "itemReviewed": "Chocolate Flan Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "364.6 calories",
            "carbohydrateContent": "35.1 g",
            "cholesterolContent": "93.3 mg",
            "fatContent": "15.6 g",
            "fiberContent": "0.8 g",
            "proteinContent": "6.4 g",
            "saturatedFatContent": "6 g",
            "servingSize": null,
            "sodiumContent": "323.8 mg",
            "sugarContent": "23.5 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2013-09-27T05:20:40.537Z",
                "reviewBody": "Seriously...this flan turned out great! I've never made a flan, ever , much less one sitting on top of a chocolate cake. I didn't even have a pan for it, so I picked one up at Kroger's for like $8. It worked out great. I cooked it for 1 hour 30 minutes, and like Kathy F. Suggested, I left the flan in the roasting pan 10 minutes 1st and then put it on a wire rack to cool an additional 15 minutes before transferring it to a plate. It's going to work out nicely for my dinner party tomorrow night. ;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Texas gal",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12096260/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-08-31T17:22:47.09Z",
                "reviewBody": "This cake is sooooooooo good !!! Made it exactly as written. Used a rose pattern bunt cake pan. Only had to bake it for 1 hour and 25 min, I let it sit in the hot water after I took it out of oven for another 10 min like I do when making regular flan. I then transferred the bunt pan to a wire rack let cool for about 15 min then inverted. I made this for a picnic we were having the next day so letting it cool and sit overnight worked perfect for me. I bought a foil roasting pan to hold the water and the bunt pan worked out perfect. You wont be disappointed in this flan cake !!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kathy F.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/kathyf/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-10-09T17:12:01.927Z",
                "reviewBody": "Wonderful! Did as the others suggested,left it in pan with water for 10 min and had no trouble taking it out.\n\nFamily and friends loved it; will be making again very soon.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jessita27",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/9304596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-08-29T18:02:54.38Z",
                "reviewBody": "I'd been questing after a good chocolate flan cake recipe after we had it had a party my family and I LOVED it but the person who made it was all secretive about the recipe and wouldn't give it up! (Party-pooper! A good recipe is MEANT to be shared!) The reviews on this recipe here looked outstanding so I gave it a whirl! I must admit initially I thought two hours (is that possibly a typo on the recipe-provider's part? Two hours???) seemed like a really long time to back a cake and not over-bake it so I monitored it closely while I was baking mine. I don't know if different oven heating/bake times can vary THAT much that everyone here seems to have such differing results...but after one hour mine was done toothpick came out with just a few crumbs on it and I can't imagine letting the cake go another 30 minutes let alone another hour without ruining the whole thing! So my only caution would be for you to watch your cake closely the first time you make it to see what your oven's bake time will be on it. On hour was perfect for mine. I also did the 10 minutes continued sitting in the hot water after taking out of the oven and an additional 15 minutes on a wire rack as others suggested here before inverting the cake onto a plate. Then I immediately put it int he fridge to chill. The caramel absorbs into the cake and voila! The cake was perfection! Took it to a gathering and it was a total hit!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Carol Ochs",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14167385/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-07-10T13:38:05.15Z",
                "reviewBody": "This cake is fantastic almost exactly how the directions say to do it. People that are saying it's done in an hour...I just don't see how they're getting the flan cooked through at 350?  Maybe they don't realize their flan isn't cooked like it should be. Bake it for 2 hours exactly like the recipe says to do! The key is that water at 2\". Get your ruler out! If you put your cake pan in a roasting pan (I used the roasting pan we use for our turkey during Thanksgiving) 2\" of water will actually be enough, so that the cake pan floats in the water. It's almost impossible to burn something at 350 when it's floating in water. That nice slow bake makes everything turn out PERFECT in texture. Don't skimp on the time!\n\nOne other key is to make sure you pour everything slow into the cake pan and evenly distribute it. If you pour to fast or everything in one spot it won't settle like it should to get that nice separation.\n\nThe only change I made to the recipe was I used Cajeta instead of Caramel sauce. It's like a Mexican caramel made from goats milk that can usually be found at most major grocery stores. I highly recommend it instead of the smuckers for that legitimate Mexican feel!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrew Geiss",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15983729/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-05-04T19:12:31.1Z",
                "reviewBody": "This cake is delicious! Very moist and the flan gives it the perfect sweetness. Perfect the way it is. I didn't change a thing in this recipe. I feel that people who rate and then change ingredients are not being accurate or fair to the cook who sends it in.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Rose",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3642273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-10-31T18:49:10.137Z",
                "reviewBody": "Easy Recipe with Amazing Results! I combined this recipe with the Cola Cake recipe on this website. It requires less ingredients and the cake mix floats a lot quicker due to carbonation. I also recommend liquifying the cream cheese. That way you don't have to deal with a chunky flan mix. Lastly put aside that American Caramel and replace it with Dulce de Leche. You'll be glad you did.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cali Fun",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14552570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-06-12T00:29:54.503Z",
                "reviewBody": "If you ever hope to bring anything else to any potluck or event EVER, do not make this cake!  It is so easy, and so good, you will be asked for every event to make this cake.  That being said, it is VERY good, and I always get comments and requests for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MaryEllen Barber",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5535634/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-12-23T02:53:09.227Z",
                "reviewBody": "I did leave it for 2 hours as the recipe said and the flan did not go to bottom and cake mixture did not rise... Also cake mixture did not cook or set it was still batter. And I have a relatively new oven that normally cooks things rather fast I also have made several cheese flans in my lifetime.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Mamma2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14974930/"
                }
            }
        ]
    }
]