[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/788/desserts/pies/apple-pie/",
                    "name": "Apple Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12298/apple-crumble-pie/",
        "name": "Apple Crumble Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F486512.jpg",
            "width": 1701,
            "height": 1701
        },
        "datePublished": "1998-07-17T22:48:42.000Z",
        "description": "Yummy variety of apple pie that is quick and easy. It was a hit with my boyfriend's pals in university whenever I made this favorite!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "1 deep dish 9-inch pie",
        "recipeIngredient": [
            "1 (9 inch) deep dish pie crust",
            "5 cups apples - peeled, cored and thinly sliced",
            "½ cup white sugar",
            "¾ teaspoon ground cinnamon",
            "⅓ cup white sugar",
            "¾ cup all-purpose flour",
            "6 tablespoons butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C.)\n"
            },
            {
                "@type": "HowToStep",
                "text": "Arrange apple slices in unbaked pie shell. Mix 1/2 cup sugar and cinnamon; sprinkle over apples.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix 1/3 cup sugar with flour; cut in butter until crumbly. Spoon mixture over apples.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until apples are soft and top is lightly browned, about 40 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Apple Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LEHOUX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.704446381865736,
            "ratingCount": 1147,
            "itemReviewed": "Apple Crumble Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "357.7 calories",
            "carbohydrateContent": "52 g",
            "cholesterolContent": "22.9 mg",
            "fatContent": "16.4 g",
            "fiberContent": "2.5 g",
            "proteinContent": "2.5 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "209.6 mg",
            "sugarContent": "29.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-01-05T21:44:45.623Z",
                "reviewBody": "OH MY GOD is this pie DELICIOUS!!!  I followed the suggestions of others, and did the following:  (1) added about 1/4 cup of flour to the apple mixture to absorb apple juices; (2) instead of mixing apples with 1/2 cup white sugar, I used 1/4 white sugar and 1/4 brown sugar; (3) in a bowl, mix the apples and sugars and cinnamin before putting it in the pie (as opposed to sprinkling the sugar on top of the apples in the pie crust); (4) I used the basic flaky pie crust also on this website which was great; (5) i sprinkled some flavored walnuts on top of the pie with the crumb mixture; and (6) I cooked it at a lower temperature for an hour and 15 minutes.  This pie was so delicious that i cannot wait to make it again.  Everyone raved about it.  ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BUONICONTO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/940053/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-11T23:49:55.59Z",
                "reviewBody": "This is the best apple pie I have ever made!! I started making it in September and by Thanksgiving I had family demanding it.  This is not a pie that you'll have leftovers of (some people were even complaining because they didn't get a slice).  These are a few things I have changed:  I coat my apple slices in flour first.  It makes the filling more jelly then runny (you will notice the flour will make a doughy type flim on the apples before you put them in the pie crust). Then I put a layer of apples, then coat them in sugar, then put another layer and coat, then one more layer (my apples are usually heaping by now) and last layer.  I am VERY generous with my sugar.  It makes it a bit sweeter but not too sweet.  I don't change much, just I found if I don't coat my apple slices, the filling is really runny when it's finished, and if I don't put the extra sugar, the pie is a bit more tart.  Enjoy the best apple pie around!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DarkestStar",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/285810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-18T19:54:27.123Z",
                "reviewBody": "I made 2 of these pies with home grown granny smith apples.  They turned out delicious and were SUPER easy!  I took them to a dinner party and they were both gone in about 5 minutes!!  It was a huge hit!  People even told me it was the best apple pie they had ever had...  Instead of layering the sugar on the apples, I mixed sugar, cinammon, nutmeg, lemon juice, and a little flour with the apple slices in a large bowl, coating the apples with the mixture.  The combination made a good consistancy of filling.  And be sure to cut the apple slices pretty thin--not more than 1/2 inch or so--it will help them get soft.  Good luck!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TINAKITTY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/700401/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-02T14:24:48.03Z",
                "reviewBody": "SOO YUMMY!!  I have been trying out all diff apple crisps and pies this apple picking season and this was a great recipe to use the apples on.  I used a mix of fresh empire and gala apples from the orchard.  For the sugar mix for the apples I did use 1/4 cup brown and 1/4 cup white sugar and 2 tbs flour then the cinnamon.  I mixed the apples in that in a bowl before pouring into the crust.  I did put a few pats of butter on top of the crust first and then on top of the apples once I poured them in.  I also gave the apples a few squirts of vanilla as well.\nThe crumbs I did 2/3 cup flour, 1/2 cup brown sugar, 1/2 cup white sugar, 1 tsp cinnamon, and 1 stick butter softened and mix with hand and made large crumbs to sprinkle all over-it makes the ultimate crumbs-I LOVE CRUMBS!  I did bake at 400 for 30 min and noticed the crumbs were getting brown fast so I turned down to 350 and baked another 30 minutes placing a piece of foil over the top.  I kept testing with my fork to make sure my apples were nice and soft inside.  AND let me tell you with a scoop of vanilla bean ice cream on top-I was in heaven eating this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cookiequeen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1479023/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-11-09T05:06:40.457Z",
                "reviewBody": "This is a great base recipe! But for the apple filling I added 1/4 cup flour, used 1/4 cup brown and 1/4 cup white sugar and added a dash of nutmeg.  I mixed the dry ingredients with the apples before placing the filling in the pie crust.  This made for a EXCELLENT \"creamier\" pie filling. Wonderful crumble top.  Used \"I can't believe its not butter\" on the crumble top and it turned out great.  Thank you so much! I have made this 5 times (modified) and people I serve it to can't believe its not professionally made! Thank you thank you thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Arnessa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1180154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-05T05:06:02.467Z",
                "reviewBody": "Delicious!!!!  I did make a few changes...I mixed the apples into the sugar and cinnamon mixture instead of just sprinkling mixture over apples.  I used a pie crust recipe called \"Mom's Pie Crust\" also found at Allrecipes.  I used half of this crust to make top crust over pie, then sprinkled the top with cinnamon.  Most of all I did NOT bake at 400 but rather at 325 which took about an hour but the crust was not burnt and the apples were cooked through out.  The result.....a fabulous pie that my husband said was the best apple pie he'd ever tasted!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHAWNTELL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/234298/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-15T21:57:16.187Z",
                "reviewBody": "This is more of a 4.0 to 4.5 star recipe because it needs additional spices to make it work for me. I have made it twice now and this time I sliced the apple wedges much thinner (1/4 inch or less) and used 4 green tart apples. When baking for only 35 to 40 minutes the apple slices really need to be thin to be soft. I added 1 tsp cinnamon 1/4 tsp nutmeg 1/4 tsp allspice and one sprinkle of cloves into the sugar and flour (2 Tbsp) mixture which I tossed with the apples. I was worried it would be too much spice when I sniffed it but after baking it was the perfect amount of spices. My husband said the spices added a lot of depth to the flavor and really liked it. I also dotted the apples with a paste of brown sugar cinnamon and butter before putting the recipe's crumble topping on it. (The paste was a failed attempt at making the crumble with brown sugar and white sugar mixed). It turned out that the pie had pockets of brown sugar taste to it and my husband really liked those parts. He said if I could have mixed that throughout it would have been a really great pie. So next time I will mix melted butter with brown sugar in with the apples and spices before layering them in the pie crust. A friend came over and gave the pie an enthusiastic thumbs up. Wolfed down a slice in a couple minutes. Said she tasted the pockets of brown sugar and really liked it that way. I sent her home with another slice. Overall a good recipe to start with.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Loladear",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/383920/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-03T16:24:08.67Z",
                "reviewBody": "Try this recipe with pears! It tastes even better than with apples because they are not as sweet, and so the sugar is not overwhelming.. i love the crumble topping.. and do add flour or cornstarch to the fruit before cooking so that the liquid makes a nice syrup and do add the sugar-cinnamon mixture in two installments instead of one on top.. mmmm :) ENJOY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKNZFUN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/491336/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-23T22:33:00.91Z",
                "reviewBody": "Amazing stuff....yummy yummy yummy",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "John Chandler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/177901/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-04-23T15:45:40.310Z",
                "reviewBody": "Flavor is great, consistency is a runny mess!  Come to find out that I should have used flour to coat the apples.  I do not like recipes that cannot stand on their own without having to read a lot of the reviews first.  Wish the author would have put in a note to coat apples with flour first.  I'll probably still try to find a way to eat this, because the flavor is good.  But I could never serve it to company as-is.  I'll try one more time with the flour to see if that improves the consistency.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4811545/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Apple Crumble Pie",
            "description": "This fresh apple crumble pie is delicious and as easy as pie.",
            "uploadDate": "2013-01-03T22:40:11.598Z",
            "duration": "PT2M54.674S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3cf0735c-5d84-4b42-b5fa-f3b38418764c%2F6485dcae-0494-49a1-a959-90c711464d21%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2071398615001"
        }
    }
]