[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/283/desserts/pies/vintage-pies/",
                    "name": "Vintage Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12301/sugar-cream-pie-i/",
        "name": "Sugar Cream Pie I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2284057.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1998-07-20T05:23:00.000Z",
        "description": "This is a delicious lighter cream pie for which the filling is cooked prior to being put in the baked shell. Real butter and half and half are must-haves for this to be at its best. People always ask for the recipe.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H30M",
        "totalTime": "P0DT2H0M",
        "recipeYield": "1 9-inch pie",
        "recipeIngredient": [
            "1 (9 inch) pie crust, baked",
            "4 tablespoons cornstarch",
            "¾ cup white sugar",
            "4 tablespoons butter, melted",
            "2 ¼ cups half-and-half cream",
            "1 teaspoon vanilla extract",
            "2 tablespoons butter, melted",
            "½ teaspoon ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Mix cornstarch and sugar. Add 4 tablespoons butter and half and half. Cook over medium heat, stirring constantly, until mixture boils and becomes thick and creamy. Remove from heat and stir in the vanilla.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven broiler to high.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour mixture into pie crust. Drizzle 2 tablespoons butter over top and sprinkle with cinnamon. Put under broiler until butter bubbles--watch it carefully as it doesn't take long. Refrigerate for at least 1 hour before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Vintage Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "C. Banes"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.647668393782383,
            "ratingCount": 193,
            "itemReviewed": "Sugar Cream Pie I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "335.5 calories",
            "carbohydrateContent": "33.3 g",
            "cholesterolContent": "48.1 mg",
            "fatContent": "21.6 g",
            "fiberContent": "0.3 g",
            "proteinContent": "2.8 g",
            "saturatedFatContent": "12 g",
            "servingSize": null,
            "sodiumContent": "191.6 mg",
            "sugarContent": "19.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-06-29T00:40:02.64Z",
                "reviewBody": "I am a Hoosier who grew up with greatest Sugar Cream pies thanks to Mrs. Wick's in Winchester, IN, as well.  \n\nThis is a wonderful recipe.  I lessened the sugar to 2/3 a cup and it tastes great!\n\nSome words to the wise:  Cook sugar/half&half mixture on medium to medium high, but don't let it burn and don't stop stirring!  For those of you who couldn't get it to turn, keep stirring and be patient, as it takes a little time to happen, but when it does, it's magic!  \n\nAnd when they say \"Watch Carefully when it's under Broiler\", they mean it!  It could take as little as twenty or thirty seconds to bubble.  (I left mine in for one minute and it burned the butter covering so I had to fix it.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Veronica",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1946123/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-01-04T22:00:18.47Z",
                "reviewBody": "Funny story.  So, while I'm reading the reviews, preparing to make this for our New Years Day dinner, I saw that someone mentioned wanting to try adding bananas next time....and yet another person mentioned drizzling with chocolate syrup and it would taste like an eclair!  So I thought to myself, \"Hey!  Why not add BOTH banana AND chocolate syrup and end up with a sundae pie!\"  Right?  So I send my poor hubby to the store for a banana, since now I don't have all the ingredients!  He was hijacked or something at the local market and ended up taking an HOUR to get back with the banana!  In the meantime, I had started cooking this mixture and it (very suddenly!) became the right consistency!  Shoot!  Still no banana!  Poured it into the GRAHAM crust and remembered that I hadn't added the vanilla!  (\"Where's that BANANA?\", I'm thinking!)  So while I was waiting (argh!) I put the vanilla into a little kitchen spray bottle that I have and gently misted the top of the pie!  (by this time you're probably thinking I have never cooked a thing in my life, right?)  LOL  When he (finally) got home, I sliced the banana (resisted rapping him up-side the head with it!) and arranged slices on top of the vanilla misted pie!  Dab of whipped cream, drizzle of syrup and a cherry on top.  Even after ALL of this, the pie was AWESOME!  So I gave 5 stars because I KNOW that if it wasn't for this recipe, it COULD NOT have been possible!  Note to self:  Make hubby take kids along next time!  :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "T Perry",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3979453/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-15T05:36:41.593Z",
                "reviewBody": "We loved it! They were not kidding when they said that the mixture needed to be cooked at a high temperature. At first, I cooked it at a mid temperature and it never got to that consistency needed. When I turned the temperature up, it thickened quickly. Thanks for the advice.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mindaann",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2094456/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-11-24T23:35:36.79Z",
                "reviewBody": "I'm from Indiana and my grandmother was famous for her sugar cream pie. Here are some tips to make it turn out. Substitute flour for the cornstarch-it will thicken up no matter how long you stir it-and let it boil and thicken up on the burner (while you stir it) until it thickens and is creamy. Grandma never used the cinnamon or the vanilla (it evaporates anyways) and she used 2 1/2 cups of cream or evaporated milk. Bake at 325 for about 30 minutes on a cookie sheet and be careful to watch it the last five minutes so it doesn't start boiling over and ruining the pie. Once it starts to boil, take it out, it's done. Cool completely before cutting and enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "karensue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4511626/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-05-07T01:23:56.31Z",
                "reviewBody": "My husband made this for me and we both loved it, though I though it was a bit too sweet. Next time, we'll add only 2/3 cup sugar. We didnt have half-and-half cream, so we used half heavy cream and half milk (which is what half-and-half is anyway). I'd eat the filling as a pudding by itself if I could! As for the 1-star rating below, if you cook a mixture with corn starch too long or over too high heat, the thickening agents will no longer work.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Robbie Rice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/257438/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-13T19:57:07.59Z",
                "reviewBody": "5 stars for the recipe, but 3 stars for directions.  Luckily, other reviewers left tips and advice which helped immensely.  I used the ingredients listed, except I used brown sugar in place of the cinnamon on the top.  I cooked the filling on medium until it began to bubble throughout and it thickened up to the consistency of pie filling (thicker than pudding), about 15 minutes total.  I poured it into the baked pie shell, scattered tiny pats/shavings of butter across and then spread a thin layer of brown sugar across the entire top.  I baked it for 25 minutes @ 325 like another reviewer suggested, then I placed a pie shield over the crust and put it under the broiler on the 2nd rack from the top (DO NOT use the top rack!! I learned the hard way that this pie scorches in SECONDS).  It only takes 20-60 seconds to brown the top so it's bubbly and browned, yet not burned. Definitely keep an eye on it while it's broiling and be sure to cover the crust to prevent burning.  You could skip the broiling altogether, but I wanted the brown sugar to caramelize and give a crunchiness.  Once it was sizzling all across the top I took it out, & once cool enough I covered & refrigerated to take to a dinner the next day.  It was served @ room temp and when sliced held its shape perfectly.  It tasted somewhat custard-like, minus the egginess, & had a rich vanilla cream taste, like a firm vanilla pudding.  I'll make this again for sure, sometimes just as a pudding, the filling is SO tasty warm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Maggie-Cat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/7772758/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T20:25:46.967Z",
                "reviewBody": "I have never had sugar cream pie but I have relatives from Marion Oh that speak of it often. I decided to try this recipe and while I have no idea if this is how sugar cream pie is supposed to look and taste I do know that it was delicious. Light creamy and custard like it has a wonderfully comfort flavor to it. Really enjoyable. I cookedi it to a pudding consistency and it only needed about a minute under broiler. Chilled for a few hours and set to a custard consistency. Will make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mommyluvsnoah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/253942/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-21T14:55:26.58Z",
                "reviewBody": "I'm not allowed to show up for Thanksgiving anymore without this pie since I started making it from this recipe in 2009.\n\nNo matter what the other dessert selections, from my own oven or otherwise, this is the one that goes and goes fast. I know to make two, because one is just a tease.\n\nI had never heard of Sugar Cream Pie, until a friend from Indiana mentioned it as being as much a staple at dessert as coffee and tea. The first time I made it (and I could NOT believe the simplicity) I had also spent hours and hours on a hundred ingredients and a thousand steps, making the infamous Momofuku Milk Bar Crack Pie. As delicious as that concoction was, there were leftovers because people went back for seconds and thirds of the Sugar Cream.\n\nOn behalf of my foodie Italian family (and we're New Yorkers -- we'll tell you when you displease us) THANK YOU.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cas in NYC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5887611/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-04T00:40:18.34Z",
                "reviewBody": "Again another Hoosier here. I loved my grandmother's sugar cream pie and never could find a recipe close to hers till now. Thanks even my New Yorker husband loved it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ali",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2190917/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-01-01T23:44:03.570Z",
                "reviewBody": "Being an Indiana native I had really high hopes that this could compete with Mrs. Wick's. Unforturnately it just wasn't the same. It was more like a custard less the egg. I probably won't make this again. I had a recipe that I used years ago and lost...didn't think it would be difficult to find another recipe close to what I had but it's proving to be a challenge.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "livingrn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2775676/"
                }
            }
        ]
    }
]