[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14760/bread/yeast-bread/white-bread/",
                    "name": "White Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6788/amish-white-bread/",
        "name": "Amish White Bread",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F07%2F22%2F731540.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1998-07-23T18:43:06.000Z",
        "description": "I got this recipe from a friend. It is very easy, and doesn't take long to make.",
        "prepTime": "P0DT0H20M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT2H30M",
        "recipeYield": "2 - 9x5 inch loaves",
        "recipeIngredient": [
            "2 cups warm water (110 degrees F/45 degrees C)",
            "⅔ cup white sugar",
            "1 ½ tablespoons active dry yeast",
            "1 ½ teaspoons salt",
            "¼ cup vegetable oil",
            "6 cups bread flour"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large bowl, dissolve the sugar in warm water, and then stir in yeast. Allow to proof until yeast resembles a creamy foam.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix salt and oil into the yeast. Mix in flour one cup at a time. Knead dough on a lightly floured surface until smooth. Place in a well oiled bowl, and turn dough to coat. Cover with a damp cloth. Allow to rise until doubled in bulk, about 1 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch dough down. Knead for a few minutes, and divide in half. Shape into loaves, and place into two well oiled 9x5 inch loaf pans. Allow to rise for 30 minutes, or until dough has risen 1 inch above pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 30 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "White Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Peg"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.794774346793349,
            "ratingCount": 6315,
            "itemReviewed": "Amish White Bread",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "167.6 calories",
            "carbohydrateContent": "30.7 g",
            "cholesterolContent": null,
            "fatContent": "2.9 g",
            "fiberContent": "1 g",
            "proteinContent": "4.4 g",
            "saturatedFatContent": "0.4 g",
            "servingSize": null,
            "sodiumContent": "147 mg",
            "sugarContent": "5.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-02-19T19:27:02.913Z",
                "reviewBody": "This is a foolproof recipe provided you just follow the steps, watch your measurements of flour, have good yeast, and keep the temp at least 65 degrees. For those who have had failures try weighing out your flour instead of measuring. NOTES FOR KITHEN AID MIXER USERS: Proof your yeast in the mixing bowl then add the oil/salt, the add the flour approx. 1 cup at a time with the dough hook on low speed. Once all the dry ingredients are in come up to medium speed for 5 minutes. Then take the dough out, fold it over on itself to redistribute the yeast, make a ball, and place it back in the same bowl after you drizzle a tablespoon of oil (veggie or olive) and turn the dough to coat evenly. Cover tightly with plastic wrap and then a kitchen towel. There are a number of tricks if you think your kitchen is too cool. Turn your over on for 20 seconds and then right off. Put the dough in to rise. I set mine about 4 feet from the woodstove and turn it once. However, get it over 115 degrees and you'll kill the yeast. Just kneading it in the KA will increase the temp of the dough. And by the way, I have cut the sugar down to 2 tablespoons and it is a classic farmhouse white bread. Hope this helps the few that are having trouble.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "breadguy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1017554/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-09T16:57:09.293Z",
                "reviewBody": "I love this bread! It's a bit dense, sweet and tastes good with butter. However, I am one of the few people who experienced difficulty with the recipe. It took me three tries to get it right. My yeast did not proof at all. Not having seen how yeast should react, I simply threw the loaf tin into the oven. The bread came out heavy and flat. The second time round, I experimented with warmer water, but after leaving it for an hour, it did not double in bulk at all. Concluding that it was the problem with the brand of yeast I used, I went out to get SAF-INSTANT and was rewarded! For novices who, like me, do not know what to look out for, the creamy white foam should resemble this: small tiny mini fireworks should sprout out in your mixing bowl. Leave it till you see foam protruding higher than the liquid level. The process should take about 10 minutes. And since I read that quite a few reviewers lessened the amount of sugar, I did not use the recommened amount of sugar. The elderly in the family appreciated the bread even more because of this.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SILKYBABY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/723199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-31T21:06:50.42Z",
                "reviewBody": "I love this recipe and make it all the time.  If you follow directions, you will get a somewhat dense loaf that tastes a lot like Hawaiian sweet bread.  To make bread that tastes a lot more like regular white bread, I reduce the sugar to 1/4 cup.  This makes it much fluffier and less sweet.  Thanks again for the great recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EDNKIRSTIN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/199087/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-30T00:58:42.95Z",
                "reviewBody": "If I could give this recipe more stars I would!  This is by far the best white bread recipe I have ever tried.  Because it is a little sweet, I usually make one loaf of bread and do a round cake pan with cinnamon rolls with the other half of dough. Also, I always roll out my bread dough, whether I am making loaves or rolls to help get rid of excess air-bubbles, and this really helps.  To make the cinnamon buns just roll out, spread generously with butter and then sprinkle, (generously again - c'mon folks, no point in counting calories if you're making cinnamon buns! ;-) ), roll up and, using the string method, cut into about 9 rounds. Also, when making this recipe I use my Kitchen Aid - just follow basic directions except don't add all the flour at first, just add about 2/3 of what the recipe calls for and with the dough hook beat for about 2 minutes on speed 2.  Then continue adding flour, 1/2 cup at a time until mixture forms a ball on the hook and cleans the side of bowl. (about 2 more minutes.)  Then, continuing on speed 2 beat for another 2 mintues.  Turn into greased bowl and rise as directed in recipe.  Ta-da!  No kneading!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUVZ2BAKE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1305209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-03T02:56:02.377Z",
                "reviewBody": "Great Versatile Bread\nI've been making this for months.  Even my finnicky 2 yr old loves this 'toast' and it contains no preservatives.\nGREAT WHITE BREAD:  I usually use 1/4 cup of sugar and 1.5 T of oil per loaf.  This is a very forgiving recipe. Always start out with a clean dry bowl. \nIf you let it rise a bit more, the bread is very fluffy.   Since I let the dough rise more, I have too much dough for the loaf pan.  When I've finished the 2nd knead, I shape the loaf and cut off the two small ends of the dough and make 6 small dinner rolls (20 min baking).   \nAfter baking, immediately remove from pan to prevent sogginess. \nDINNER ROLLS:  Shape into golf size balls, let rise and freeze individually,ziploc when frozen.   \nCINNAMON ROLLS:  Great dough base, the other cinnamon roll doughs are FULL of butter.  Use the full amount of sugar.  Be sure to spray between rolls. For the filling, I use the clone of a cinnabun.  \nECONOMICAL:  I buy a pkg of 10lb bread flour from Smart and Final for $5.50.  That's 34 cups of flour.  I buy yeast from costco, a 2lb bag is around $3.50.  I give my mom half the bag.  Always be sure the yeast is fresh and refrigerated. \nSTORAGE:  Storage and slicing is a negative aspect about homemade bread.  However, this bread keeps soft for 3-4 days. My hubbie got me a`breadstorage/slice guide for christmas from kingarthurflour.com and so far it's worked out well. \nThank you for the recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Shirley",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/485358/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-31T21:05:55.45Z",
                "reviewBody": "I HAVE TWO WORDS TO DESCRIBE THIS BREAD... SIMPLY DELICIOUS.  THIS IS THE BEST BREAD I HAVE EVER TASTED. I'VE BEEN BAKING BREAD FOR 8 YEARS NOW AND NONE OF THE BREADS I'VE MADE EVEN COMPARE TO THIS BREAD.  I READ MANY OF THE REVIEWS BEFORE BAKING THIS BREAD AND DECIDED TO CUT DOWN ON THE SUGAR AND I'M GLAD I DID BECAUSE IT WOULD HAVE BEEN TOO SWEET.  I USED 1/3 OF A CUP OF SUGAR AND IT CAME OUT PERFECTLY. I CAN'T WAIT TO GIVE THIS BREAD AWAY AS GIFTS, THANKS SO MUCH PEG. ALSO THIS BREAD CAME OUT JUST FINE WITH ALL PURPOSE FLOUR.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DISHDISH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/775033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-02-04T18:04:56.14Z",
                "reviewBody": "OMG this bread is WRONG. I want to marry it and have a million of its babies. It's not often I make something exactly according to the recipe (I usually follow tips from other reviewers), but I followed this one exactly, and holy heck, I cannot stop eating it. And neither can my husband. Somebody go ahead and tape this bread to my rear end because that is exactly where it is going, and I don't even care because it is THAT GOOD.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Betsy Veach Swenson",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2284324/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T02:07:02.217Z",
                "reviewBody": "Very easy to make. I was always so intimidated by bread recipies; not now! I roll the bread dough flat and sprinkle it with raisins, brown sugar and cinnamon, or asiago cheese. Then I roll it up and bake it. Wonderfull! Anyone can make this!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KITKA714",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/689258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-21T17:40:50.373Z",
                "reviewBody": "Arguably the best white bread recipe on the entire planet, and I should know. I've probably tried every last one! No faint praise, as I've been making bread for more than 35 years. I have made it exactly as written, and although it's very tasty with the full measure of sugar, we prefer cutting it slightly. I cut the recipe in half for my bread machine, and instead of 1/3 cup of sugar, I use 1/4 (which is to say 1 tablespoon plus 1 teaspoon less per loaf.) There's still a hint of sweetness, but it's perfect for sandwiches and for mopping up gravy with savory entrees. I could tell even before it was baked that this was something wonderful; the dough was absolutely perfectly silken and smooth. The crust is just right with a nice delicate crispiness and the inside is light and moist. As long as you know your yeast is active (purchased recently or stored in the freezer/fridge and used before expiration) there is no need to proof. People seem to think that proofing makes the bread better. There is no magic in proofing. It won't improve your product. That step merely provides \"proof\" that the yeast is active, so that you don't waste good ingredients by adding them to dead yeast. In days gone by, when refrigeration was not all that common (or delivered by the ice man) it was necessary. Not so if you know you've handled the product correctly by storing in the fridge or freezer. Kudos for this superlative recipe! Update: Have made this about 7 times so far. Consistently wonderful resul",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Baricat",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/34237/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-07T01:22:47.577Z",
                "reviewBody": "This did not live up to the hype or my expectations. It was too dense and too sweet.  Not a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/276377/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Amish White Bread",
            "description": "See how to make delicious oven-baked sandwich bread.",
            "uploadDate": "2012-07-31T22:24:43.026Z",
            "duration": "PT3M33.547S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Ffe2bab4f-a6d2-4087-88ce-f70c89824dd5%2F0512f5d6-d53c-4f79-b0c7-c0c40b71b843%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1764444024001"
        }
    }
]