[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17528/desserts/fruit-desserts/cherry-desserts/",
                    "name": "Cherry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7900/thirty-day-friendship-cake/",
        "name": "Thirty Day Friendship Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1042293.jpg",
            "width": 2048,
            "height": 1536
        },
        "datePublished": "1998-07-25T19:57:51.000Z",
        "description": "This takes 30 days to prepare the fruit for the cake but it's worth it.  It's delicious. If you are lucky a 'friend' will give you 2 cups of starter along with a piece of cake so you won't have to go to all the trouble of preparing a starter. If you have the starter, begin with step 1. If you don't have the starter, follow the link to Friendship Fruit Starter. It will actually take 50 days total, if you need to make the starter.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P19DT19H2M",
        "recipeYield": "2 9x13-inch cakes",
        "recipeIngredient": [
            "2 cups Friendship Fruit Starter",
            "1 (15 ounce) can sliced peaches with juice",
            "2 ½ cups white sugar",
            "1 (15 ounce) can pineapple chunks with juice",
            "½ cup white sugar",
            "2 (10 ounce) jars maraschino cherries",
            "2 ½ cups white sugar",
            "2 (18.25 ounce) packages yellow cake mix",
            "2 (3.4 ounce) packages instant vanilla pudding mix",
            "1 ⅓ cups vegetable oil",
            "8 eggs",
            "2 cups golden raisins",
            "2 cups chopped walnuts",
            "2 cups flaked coconut"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Day One: In a large glass jar or bowl, combine 2 cups of the starter with 1 can of the sliced peaches and their juice (each slice chopped into 4 pieces). Add 2 1/2 cups of the white sugar and stir once every day for 10 days. When  not stirring mixture, keep it covered with a paper towel, foil, or a loose lid. Let sit at room temperature. Don't refrigerate it or cover it airtight. A pan of water underneath the jar or bowl will keep the ants out.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Day Ten: Add 1 can of chunk pineapple and its juice. Cut each chunk of pineapple in half. Stir in 1/2 cup of white sugar. Stir once everyday for 10 days. The color should change, and the mixture should foam when stirred.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Day Twenty:  Slice each cherry in half, and stir in. Add 2 1/2 cups of the white sugar. Stir once every day for the final 10 days. The cherries will give the juice back its pinkish color.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Day Thirty: Drain fruit and reserve it and the liquid. The fruit will be used in the cake. Pour the liquid into 3 glass or ceramic pint jars. One for you to start your next cake, and two for friends. Cake must be started within 3 days after receiving the starter, or you should freeze the starter to use at a later date. Do not use plastic or metal containers to store liquid!\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour two 9x13-inch baking pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "It's best to mix the two cakes separately. Combine 1 box of the cake mix, 1 box of the instant vanilla pudding, 2/3 cup of the vegetable oil, and 4 of the eggs. Stir, then add 1/2 of the drained reserved fruit from the starter. Stir, then add 1 cup of the golden raisins, 1 cup of the chopped nuts and 1 cup of the coconut. Stir until all ingredients are combined. The batter will be stiff. Pour batter into the prepared cake pan. Repeat for cake number two.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cakes at in the preheated oven for 55 to 65 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Cherry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Yvonne"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.557142857142857,
            "ratingCount": 70,
            "itemReviewed": "Thirty Day Friendship Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "346.3 calories",
            "carbohydrateContent": "55.5 g",
            "cholesterolContent": "31.4 mg",
            "fatContent": "13.6 g",
            "fiberContent": "1.3 g",
            "proteinContent": "3.1 g",
            "saturatedFatContent": "2.7 g",
            "servingSize": null,
            "sodiumContent": "220.2 mg",
            "sugarContent": "38.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-03-28T15:42:00.43Z",
                "reviewBody": "I've been making this cake for years and several times haven't had starter. I just started with the first batch of sugar and fruit and trust me, by the second week it's fermented and bubbling. The starter is helpful but not vital or worth the extra time it takes?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dylan's Nana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/dylansnana/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-22T13:05:19.107Z",
                "reviewBody": "This is an old family recipe given to me by an aunt 20 years ago.  I was pleased\r\nto find that this version of the recipe tells how to \"start\" the starter.\r\nMy additional comments are that I just  put in sliced peaches-- by the time they\r\nhave been fermented and stirred for 30 days - there isn't really a need to cut them into\r\npieces on the front end.\r\nI took a friendship cake to work & even the finikiest guy loved it. One hubby took some\r\nhome to his wife and she wants the recipe now.\r\nMixing up the batter when you're ready to bake is really quick, but I had to\r\ngive it a 3 in \"Quickness Rating\" because of the obvious fruit making time.\r\nThe process gives parents a chance to teach about chemical reaction and how\r\nthe sugar is used as \"energy\" teaching wise.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "FELITA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/14232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-27T07:43:52.123Z",
                "reviewBody": "OOOOOh! I was SO excited to find this recipe. I was given a friendship starter years ago and I loved the whole process. I have long since moved away from the area and thought I would never see or taste the recipe again I was shocked to find the exact same one here FIRST TRY! Yes this is time consuming but it's exciting and fun to watch the changes over time. The first time I ever made and ate it I was afraid! (I was still pretty young and the whole fermentation process seemed kind of weird to me) Well it was delicious and I baked so many of those cakes that people began to run when they saw me coming...(just kidding) anyhow I'm so happy to find this wonderful recipe again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kimberly Strain",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1570694/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-16T13:20:32.623Z",
                "reviewBody": "I have searched through countless Friendship Cake recipes to find this one. I received starter for this from a friend 10 years ago and I remember this being the moistest most delicious cake that I had ever had. I was worried that it would actually taste like the holiday fruitcakes that I really don't like but instead I felt like I was in Hawaii enjoying a tropical delight. Thanks for posting this. The coconutwas a key ingredient that is not included in many recipes. I had to make the starter first this time so now it's off to Mom's group with the final product. They've been waiting 8 weeks for this... I hope they like it as much as I do!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Dawn Eberly",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/luvinlif2k/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-31T20:26:04.937Z",
                "reviewBody": "Perfect! My family and friends enjoyed it very much! I made one cake in a 13inch pan as noted in the recipe and one in a bundt pan. I would recommend using a bundt pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Deanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1654109/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-01-08T14:36:27.093Z",
                "reviewBody": "Help! I made the starter over a month ago and then got to Day Ten (adding the pineapple). The mixture is on my counter in a glass bowl with foil on top. I am not sure what happened but yesterday when I went to stir it there were lil mold spores on top. I can't imagine that this is okay? I am a month and a half into this recipe and now I have to throw my cake out. Does anyone know what I may have done wrong? I am willing to give this cake another shot but I don't want to make the same mistake again. My dad has talked about this cake for years (his grandmother use to make it) so I am trying to make him one. I'm so sad that my first attempt was ruined and I have no idea what went wrong. The only thing I can think of is that I used canned pineapple in heavy syrup and not canned pineapple in juice. Does anyone have some advice?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Dimpl1129",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/10706565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-13T03:37:16.46Z",
                "reviewBody": "Here we go working on batch #4. I almost thought I had KILLED the starter it wouldn't 'foam up' after adding the pineapple. The addition of 1/2 cup sugar cured that problem! I am adding additional cherries so to arrange on the top of the batter before baking to add a nice touch. I also put a used bean can in the middle of an 8\" spring form pan after baking it is much easier to serve and using 3 cups batter instead of 4 (so I can create more little ones to share). This is a winner all around!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDELANG",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/840509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-30T21:20:23.76Z",
                "reviewBody": "I am in the 2nd phase of this cake. I made the starter and then started the cake process. I am in the add pineapple 2nd 10 day phase. It has been 4 days and I see no foam. Is all lost? Is there a way to save my efforts?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HurricaneWindy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3399646/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-12-24T02:48:58.873Z",
                "reviewBody": "The cake was wonderful the second time... The first time i made it with the rum and no one would eat it.. so I through away the starter for that and made it without the rum and it was a HIT!!! Thank you so much....",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Ozzyzmommy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/23755/"
                }
            }
        ]
    }
]