[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/350/bread/quick-bread/muffins/",
                    "name": "Muffin Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/2003/bread/quick-bread/muffins/blueberry-muffins/",
                    "name": "Blueberry Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6865/to-die-for-blueberry-muffins/",
        "name": "To Die For Blueberry Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F03%2F31%2F662790.jpg",
            "width": 960,
            "height": 960
        },
        "datePublished": "1998-08-05T15:16:22.000Z",
        "description": "These muffins are extra large and yummy with the sugary-cinnamon crumb topping. I usually double the recipe and fill the muffin cups just to the top edge for a wonderful extra-generously-sized deli style muffin.  Add extra blueberries too, if you want!",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT0H40M",
        "recipeYield": "8 large muffins",
        "recipeIngredient": [
            "1 ½ cups all-purpose flour",
            "¾ cup white sugar",
            "½ teaspoon salt",
            "2 teaspoons baking powder",
            "⅓ cup vegetable oil",
            "1 egg",
            "⅓ cup milk, or more as needed",
            "1 cup fresh blueberries",
            "½ cup white sugar",
            "⅓ cup all-purpose flour",
            "¼ cup butter, cubed",
            "1 ½ teaspoons ground cinnamon"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and add enough milk to reach the 1-cup mark. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 20 to 25 minutes in the preheated oven, or until done.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Muffin Recipes",
            "Blueberry Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Colleen"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.640308051983772,
            "ratingCount": 14543,
            "itemReviewed": "To Die For Blueberry Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "383.1 calories",
            "carbohydrateContent": "56.9 g",
            "cholesterolContent": "39.3 mg",
            "fatContent": "16.1 g",
            "fiberContent": "1.4 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "5.2 g",
            "servingSize": null,
            "sodiumContent": "321.8 mg",
            "sugarContent": "33.6 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2009-10-20T16:06:18.96Z",
                "reviewBody": "HELPFUL TIPS: Vanilla isn't needed for this recipe (as some have suggested).  Makes no difference ,and i put a heaping overflowing tsp. Neither my husband or friends can tell a difference, & I've made this 50+ times.  Other than that, this recipe makes my husband a hero at his office!  They say BETTER than any bakery! I use BROWN SUGAR instead of white for the topping.  When I have buttermilk, i use that in place of milk. It's important to use butter at room temp (to a point that if you put a fork through it, it would smush).  This makes it a lot easier to put on top.  You can substitute blueberries with any fruit & it turns out great! Be sure to use PAM on the pan or they may stick.  Also, frozen blueberries do not turn out the same.  Fresh Fresh! Regular size tins make 12 at 18 min. Giant tins as recommended make 5-6 so double recipe! (Update 7/08): I noticed a lot of people had trouble w/their muffins sinking. You're over mixing or it's from adding TOO MUCH topping to 1 muffin using the given one. If you must drown yourself in topping, try this fail proof one I use that has less butter (perfect amount if doubling recipe): 2/3C brown sugar, 1/4C flour, 1/4 tsp cinnamon, 2T butter.  Use fork to mix and has nice coarse texture. Just as crunchy & delicious w/the perfect muffin EXCEPT it doesn't cause the muffins to sink!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Chef Joy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/chefjoy/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-20T15:37:38.77Z",
                "reviewBody": "I took a look at many of the recipe reviews for these muffins and incorporated their suggestions.  In summary, I made the recipe as printed, but I added 1/2 t. vanilla, replaced all of the milk with buttermilk and then added a few more tablespoons of buttermilk to the recipe, replaced the white sugar in the streusel topping with brown sugar, filled 12 regular-size muffin tins about 2/3 full and lightly placed the streusel on top.  I then baked them in a 400F oven for 18 minutes.  They were excellent!  This recipe would be great with other types of fruit added (other berries, diced peaches, etc.) or with chocolate or white chocolate chips, etc.  This is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AMORAMOR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/521490/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-03T05:45:30.31Z",
                "reviewBody": "Wow!! My search for perfect blueberry muffins ends here. They came out like you would expect from a gourmet bakery. I've tried many blueberry muffin recipes only to be disappointed by the berries sinking to the bottom before it cooked all the way. This batter is like glue and really holds the blueberries in place. I made a couple of small modifications only because I was working with what I had on hand. I ground cinnamon sticks to make fresh cinnamon. I used strawberry milk instead of regular. I doubled the blueberries,and turned down the heat to 325 because the blueberries were frozen. The only things I'd suggest doing is to double the recipe (only made 6 jumbo muffins), but make only a single recipe of streusel (I was heaping on streusel topping until it was falling off, and there was still alot of streusel left over). Over all, Colleen, your muffins deserve to be at a luxury hotel or B&B. Thanks for sharing this with all of us to enjoy. This is definitely a keeper. :-)\r\nI am adding to my review because I've been reading the other reviews, and keep seeing the same 2 complaints about this recipe. \r\n\"They were a mess getting them out of the pan.\" \r\n(If you use a non-stick spray and spray the entire pan including the top, they should fall out easily) \"Not sweet enough\" (The quality of the recipe is only as good as the quality of the ingredients--were your blueberries already bitter?)I think this is an awesome recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CINDERW",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/873052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-28T14:19:03.613Z",
                "reviewBody": "These are delicious.  The batter is extremely thick and a pleasure to work with. I made these and \"The best of the best blueberry muffins\" on the same day and almost identical in flavour.  However, the \"to die for blueberry muffins\" recipe had a thicker batter resulting in rounded muffin tops.  Due to the thinness of the other recipe, as it was rising the batter spread out more so the muffin tops were flatter. Vanilla is a nice addition to either recipe.  For beginner muffin makers it is crucial to know not to mix the batter too long or else you will end up with tough, poorly risen muffins. Combine wet and dry with the fewest strokes possible, there should still be some lumps and perhaps even light streaks of flour.  Also, for a really professional looking muffin sprinkle some coarse sugar crystals on top of your muffins rather than the crumb mixture (I actually like doing a batch of each).  This will give your muffin a sparkling finish.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nonsuchbaker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2409480/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-21T01:02:45.647Z",
                "reviewBody": "I HAD to compliment the chef on this recipe!  I have gone through AT LEAST a dozen muffin recipes just to throw them away, when the results were only so so.  I wanted a muffin that was like something you could get in a coffee shop, and HERE IT IS!  \r\n\r\n  THESE turn out great, I doubled the batch, and used 1/2 brn. sugar.  I didn't have to double the crumb topping.  My batter didn't turn blue w/blueberries, and I have decided this is ALWAYS going to be my 'base' for muffins. Today we made strawberry, and they were just as good. thank you thank you, a KEEPER, FINALLY!  \r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PAMPCHEFCLAUDINE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/609151/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-17T22:53:32.7Z",
                "reviewBody": "Very delicate,moist and delicious. I,too, added a tsp of vanilla to batter and increased the sugar a bit. I added cranberries with the blueberries. You could use any fruit. I made another batch with dried apricots and walnuts..turned out great!Highly recommend this recipe. A real keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jan Gordon Peo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/675032/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-04T03:49:19.45Z",
                "reviewBody": "5 ***** STARS FOR THIS RECIPE!\r\n\r\nTips: \r\n> Sift flour after measuring.\r\n> Spray cooking spray on the top of the muffin pan as well as inside the muffin cups -so muffins don't stick to the top when they overflow during baking.\r\n> Add 2 T. Sour Cream to the egg, oil, milk mixture bringing it to the 1c measure as instructed.\r\n> Add 1/4t Lemon Extract along with the vanilla extract to \"brighten \" the flavor.\r\n>Use Dried Blueberries (available at C**TCO -very inexpensive). They do not turn the batter blue & have an intense blueberry flavor! (You can also mix fresh blueberries in with dried if you prefer).\r\n> To get a big \"Crown\" on your muffins, fill pan almost to the top, bake at 350* for 15min to \"set\" the batter then turn the oven up to 400* to finish baking. This pushes the batter up through the muffin and makes the desirable \"crown\" effect everyone wants! -I learned this from a professional baker.\r\n> let cool at least 5-10 min before removing from the pan to avoid tearing them.\r\n\r\nMakes 10 regular size muffins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Elizabeth Kessler",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2484876/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-18T19:41:33.317Z",
                "reviewBody": "I have a blueberry muffin recipe which produces a perfectly fat muffin, with great flavor throughout, that I always use. But since this recipe has so many reviews, and because of its title, I decided to try it. Unfortunately, the flavor of this muffin depends on the sugary topping, not the muffin itself. I cut way back on the butter for the topping, and it still was too much ... the butter part of the streusel topping fell into the muffin itself, creating greasy sink holes, and continued on into the muffin itself, leaving even more grease on the paper muffin cup. If I had followed the directions and filled the muffin cups to the top, it would have been even worse than it was ... the muffins didn't rise very high (were quite flat, in fact) and the tops spread out onto the muffin pan, so they had to be carved out. Then there was the unappetizing color ... which I know can be a problem when baking with blueberries, but it doesn't happen with my other blueberry muffin recipe ... or cakes, either, for that matter. The taste itself wasn't bad ... but again, the taste is really all about the sugary topping, not a fresh-tasting blueberry muffin, which is as it should be. I've made streusel toppings for baked goods for years, and I'm not sure why this happened with this recipe, as the butter was incorporated into the other ingredients as small crumbs, not big lumps. I'd give this a half-star, if I could.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "ABBIE3",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1132208/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-09T16:13:13.47Z",
                "reviewBody": "This is the prefect staple muffin recipe.  You can alter it, depending on what you've got on hand.  Here's a few I've done recently:\nApple spice:  Omit: blueberries, Add: 1/2-1 tsp. cinnamon and 1/2 tsp. nutmeg to dry ingredients.  Fold in 1 cup (about 2) peeled and shredded apples.\nCranberry: Omit: blueberries, Add: Fold in: 1 cup chopped cranberries, 2/3 cup chopped walnuts, and 1-2 Tbs. orange zest.\nCherry: Omit blueberries, Add: 3/4 cup dried cherries, soaked in boiling water for 5 minutes and drained, and 1/4 tsp. almond extract.\nRuhbarb: Omit: blueberries, add 1 cup chopped ruhbarb, 1/2 c. chopped pecans.  Add chopped toasted pecans to the topping, if you'd like.\nAnother hint try this with cylon cinnamon (regular is cassia)... very tasty.  Anyway, I've thrown away most other muffin recipes...  If you want any kind of fruit muffin, this IS the recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "applegrass",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1943134/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "To Die For Blueberry Muffins",
            "description": "See how to make a big bakery-style blueberry muffin!",
            "uploadDate": "2012-11-08T00:26:51.282Z",
            "duration": "PT3M39.928S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fa506b088-07ef-490e-8c15-f4d4fac9a307%2F2fc27386-f524-418e-9468-6dfce6478ac0%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1954487121001"
        }
    }
]