[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17203/desserts/specialty-desserts/",
                    "name": "Specialty Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15014/desserts/specialty-desserts/liqueur-desserts/",
                    "name": "Liqueur Dessert Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15013/desserts/specialty-desserts/liqueur-desserts/rum/",
                    "name": "Rum",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7916/moms-rum-cake/",
        "name": "Mom's Rum Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F281049.jpg",
            "width": 3008,
            "height": 2000
        },
        "datePublished": "1998-08-05T19:14:49.000Z",
        "description": "I got this from my mom.  When she makes it, we all fight over it.  It's delicious and easy to make.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 -10 inch tube pan",
        "recipeIngredient": [
            "1 (18.25 ounce) package yellow cake mix",
            "1 (3.5 ounce) package instant vanilla pudding mix",
            "4 eggs",
            "½ cup water",
            "½ cup vegetable oil",
            "½ cup rum",
            "½ cup chopped pecans",
            "3 tablespoons butter",
            "¼ cup water",
            "1 cup white sugar",
            "½ cup rum"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour one 10 inch tube pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine cake mix and pudding mix.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In another bowl beat eggs, water, oil and rum until frothy.  Add cake mix/pudding mixture  and beat until well mixed. Spread pecans evenly over the bottom of the prepared pan and pour batter over pecans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake cake at 325 degrees F (165 degrees C) for 60 minutes or until a toothpick comes out dry when inserted in the center. Allow to cool in pan for 5 minutes and remove from pan.  Place in serving dish immediately, right side up. (Pecans should be on the bottom)\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Glaze: During the last 15 to 20 minutes of baking time, combine butter or margarine, water and sugar in a sauce pan and bring to boil over high heat.  Reduce heat to medium and boil rapidly until it's very thick and syrupy stirring very frequently. The syrup must be reduced quite a bit and very thick otherwise it will make the cake mushy.  Remove from heat and add rum. While cake is still hot, poke holes all over top of cake with a toothpick and spoon glaze over top of cake.  Allow cake to sit at room temperature for one day then refrigerate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Specialty Dessert Recipes",
            "Liqueur Dessert Recipes",
            "Rum"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Laura"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7269076305220885,
            "ratingCount": 249,
            "itemReviewed": "Mom's Rum Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "415.9 calories",
            "carbohydrateContent": "50.3 g",
            "cholesterolContent": "60.4 mg",
            "fatContent": "18.9 g",
            "fiberContent": "0.8 g",
            "proteinContent": "3.8 g",
            "saturatedFatContent": "3.9 g",
            "servingSize": null,
            "sodiumContent": "381.2 mg",
            "sugarContent": "35.8 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-12-30T14:33:45.107Z",
                "reviewBody": "Instead of poking holes in the cake, I poured the glaze into the Bundt pan and merely reinserted the cake into the pan allowing it to absorb all of the glaze. Took about an hour to do so.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JDVMD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595916/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-17T15:14:47.58Z",
                "reviewBody": "I have to say I have been using this recipe for two years and have gained some noteriety for it. Whenever there is a bake sale or picnic I am asked to bring the rum cake. In fact it fetched $130 at a cake auction ! The glaze is the trickiest part but just keep sttirring and it will thicken. The nuts at the bottom of the cake become soaked with the glaze and many people have told me that is their favorite part. If you like rum- you will LOVE this cake ! YOu can always cut back on the rum in the glaze a bit if you don't like a real strong rum taste. Most of the rum cooks off though, so don't worry about getting drunk by eating this cak.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUNDEVILS1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/655525/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-28T15:02:40.077Z",
                "reviewBody": "This recipe is the best after trying several others. I took not of others suggestions and left the cake in the pan to pour the glaze over and let it soak into the cake. I also used fewer pecans than called for and added about a 1/4 cup brown sugar in the bottom of the pan before pouring the batter in. Finally, do not let the glaze cook too long. It will burn and/or turn to sticky candy. 5 minutes is sufficient on med/high heat! You can not beat this recipe!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "1TRACYJ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1335601/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-11T18:14:59.387Z",
                "reviewBody": "I have been making almost the same exact recipe for years.  It was given to me by my grandmother.  The secret to this cake is the type of rum you use and the glaze.  I only use Bacardi Anos rum.  It gives the cake a much richer flavor.  You should start cooking the glaze about 10 minutes before the cake is done.  I combine 1 cup sugar, 1 stick of real butter, 1/4 cup rum & 1/4 cup water.  Cook it for exactly 3 minutes.  Pull the cake out of the oven, and pour the warm glaze right over the cake while it's still in the bundt pan.  Make sure the glaze gets down in the middle of the cake near the hole.  Use a knife if you have to loosen the cake up a bit in that area.  Let the cake sit 30 minutes so the glaze makes it's way down.  At 30 minutes flip it over on the plate.  You will see that the glaze has covered the top and been aborbed.  Once the cake sits awhile, the glaze will become slightly crunchy.  This cake is suppose to be VERY dense and moist and I have never ONCE had anyone say it tastes like it comes from a box.  I only use Dunkin Hines Butter Recipe yellow cake mix.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "designermillion",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4299973/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-12-21T19:08:03.447Z",
                "reviewBody": "This recipe was \"the bomb\"(meaning great). I followed it exactly to the \"tee\" and it came out perfect. It looks like a lot of people had trouble with the glaze however it will come out great but you must dissolve the water and sugar first then add the butter. I split the sugar half brown half regular and added a teaspoon of vanilla. This cake had a lot of compliments...whew lord I have a dinner date tonight and I am baking one to take along. I am sure that I will get my man.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cutest1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3403590/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-10-12T20:55:33.417Z",
                "reviewBody": "Thanks Laura for sharing your Mom's very tasty rum cake!  I mistakenly added the rum glaze to the bottom of the cake instead of the top.  When I turned the cake upright onto a platter, I realized my mistake. I felt I should redeem myself by making more glaze for the top of the cake or no one would be able to taste the rum.  Well, obviously doubling the glaze is not necessarily a bad thing, because I had more compliments on that cake than any other I've ever made!  Several friends asked if they could take a slice home.  I refrigerated my leftover slice and had it the next morning with my coffee.  YUM!  I liked it even better when it was cold. Yes, I'll be making this one again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nancy Towne McDonald",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2286045/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-26T13:44:19.42Z",
                "reviewBody": "I used the glaze recipe from this one as I had already made a yellow cake from scratch. YUM was this wonderful!!! I reduced the amount of glaze that I allowed to absorb into the cake and with the glaze I reserved I spooned onto individual servings of the cake. It was fantastic and I will definitely be making this again:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mumtaz Wangnoo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/677328/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-10T04:26:43.763Z",
                "reviewBody": "This is such a wonderful Rum Cake! Seriously it rose 50% more than others that I've tried. I took the advice of another reader and poured the glaze into the tube pan and returned the semi-cooled cake to that same pan. What a great method and all of that delicious rum glaze was absorbed by the cake. FANTASTIC!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristen Foery",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1317258/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-17T21:01:38.48Z",
                "reviewBody": "I took this to an office party and it went so fast. I used 160 proof spiced rum. Created holiday spirit for sure.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lisa Perez",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/957653/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-16T18:12:37.287Z",
                "reviewBody": "I bought 1.5 oz pudding mixes because I didn't have this recipe on me to know what size so I just bought a bunch of the small ones. So I used two small packages of pudding (3 oz total) and even that was WAY too much. The batter is So thick! I was making a bunch of mini Rum Cakes so I wasn't planning on turning them upside down. Now I have to because the batter was so thick that the tops are ugly. No word on the taste yet. I'm sure they'll taste fine. But presentation was key for me this time because I was planning on giving them to co-workers as gifts for Christmas. LESS PUDDING! I'd make more with less pudding but \"The Rum's Gone!\" Planning on maybe cutting off the tops and turning them upside down? But I don't have pretty paper plates to give them out on... I'll figure something out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Rachael Dixon Reczenski",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8368787/"
                }
            }
        ]
    }
]