[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6864/monkey-bread-ii/",
        "name": "Monkey Bread II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1111472.jpg",
            "width": 1685,
            "height": 1697
        },
        "datePublished": "1998-08-05T19:34:40.000Z",
        "description": "Here is a recipe for a bread machine, though it can easily be done in the conventional, muscle building way. You use the dough only setting and do the rest by hand.  For machines that do 1 1/2 - 2 pound capacity.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT3H20M",
        "recipeYield": "1 bundt pan",
        "recipeIngredient": [
            "2 ½ teaspoons active dry yeast",
            "3 cups all-purpose flour",
            "1 teaspoon ground cinnamon",
            "1 teaspoon salt",
            "¼ cup white sugar",
            "2 tablespoons margarine, softened",
            "1 cup water",
            "1 cup margarine",
            "1 cup packed brown sugar",
            "1 cup raisins"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Remove baking pan from machine. Place yeast, flour, ground cinnamon, salt, white sugar, 2 tablespoons butter and water in the order that is recommended for the bread maker. Make sure that no liquid comes in contact with the yeast.  Select dough cycle and press start.\n"
            },
            {
                "@type": "HowToStep",
                "text": "When dough is complete, place dough on floured surface and knead 10 to 12 times.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium saucepan on low heat, melt one cup of butter, stir in brown sugar and raisins ( 1/4 cup of chopped nuts is good too!). Stir until smooth.  Remove from heat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cut dough in one inch chunks. Drop one chunk at a time into the butter sugar mixture. Thoroughly coat dough pieces, then layer them loosely in a greased Bundt or tube pan, staggering layers so you're plopping each dough chunk over a space between two below. Let rise in a warm, draft-free spot until dough is just over the top of the pan, 15 to 20 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in a preheated 375 degree F (190 degree C) oven for 20 to 25 minutes or till golden brown. Remove from oven, place a plate face down in top of the pan and, using oven mitts to hold plate on pan, turn over both until bread slides out onto plate.   Serve warm...and enjoy.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Darren, Debbie and Joshua"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.5633333333333335,
            "ratingCount": 300,
            "itemReviewed": "Monkey Bread II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "389.3 calories",
            "carbohydrateContent": "56.2 g",
            "cholesterolContent": null,
            "fatContent": "17.3 g",
            "fiberContent": "1.6 g",
            "proteinContent": "4.1 g",
            "saturatedFatContent": "3 g",
            "servingSize": null,
            "sodiumContent": "402.9 mg",
            "sugarContent": "29.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-07T20:26:50.973Z",
                "reviewBody": "I brought this to a friend's birthday, and everyone loved it!  This is a wonderful recipe, but here are some suggestions for those of you who don't have a bread machine (like me) and would still like to make it.  First let the yeast proof in the water (make sure the water is warm, not hot or room temperature) and two tablespoons of the white sugar for about five minutes.  Meanwhile mix together all of the dry ingredients.  Stir it all together and let it rise until about double in size (took me about 45 min) and punch it down.  You can then follow the recipe as usual, beginning with step 2.  Also, I had lots of the brown sugar sauce left over, so I would suggest cutting it down if you don't want to throw it all away.  Will definitely make again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "MELODYLEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/607112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-18T17:18:09.437Z",
                "reviewBody": "This dish was outstanding.  After forming the balls, (I made them about the size of very large grapes), I dipped them in 1/2 lb. melted butter, then rolled them in finely chopped walnuts and then in dark brown sugar, then stacked them in a bundt pan.  I then sprinkled the remaining sugar and nuts on top, and poured the rest of the butter over all.  This seemed to coat each one better and made each piece come off the whole cake as one individual morsel.  My family of 4 polished it off in about 6 hours of nibbling.  This would be great to take to a potluck.\r\nAuntie T from Cleveland",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUNTIET",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/602570/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-31T23:03:20.81Z",
                "reviewBody": "Honestly, I never knew what \"Monkey Bread\" was.  But now that my curiosity was piqued, I decided to look at several recipes on this site but over all, they all use store bought refrigerator biscuits which doesn't appeal to me in the least. I almost gave up, then I found this made from scratch recipe and I'm glad I tried it.  It's always a good thing to read the reviews and adapt the recipe to your liking;- however, I made very few changes. For the record, I added a dash of grated fresh nutmeg to the dough, 1 cup of walnuts, and 1/2 teaspoon of vanilla extract to the butter/sugar mixture AFTER removing it from the stove. One important tip when inverting the pan onto a plate is to be sure to place a cookie sheet under the pan to catch all the gooey sugar mixture or you'll have yourself quite a mess to clean up. Then because I avoided a kitchen disaster, I simply spooned the reserve sugar syrup that dripped onto the cookie sheet over the baked bread. Using my bread machine was a tremendous help and timesaver, too. Next time I might try using apple cider or juice instead of the water in the dough. This is divine with a cup of black tea or a cappucino. Wow!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mr. Marco Salmon",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/292433/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-10-02T21:17:09.42Z",
                "reviewBody": "OMG perfection.  I did do one change. Instead of dipping the balls of dough into the butter and rolling in sugar I melted the one cup of margarine, 1 cup br. sugar and 1 tsp of cinnamon in a saucepan over medium heat until all the sugar was dissolved.  I pour approx 1/3 c into the bottom of my greased bundt pan, added a layer of balls, poured another 1/3 c of sauce, rest of balls, and poured the remaining sauce over everything making sure the top layer of dough balls were coated.  covered with plastic wrap and let rise until doubled.  after baking for 25 mins and resting for 5, inverted onto plate.  used a spatula to make sure every square inch of the bread has sauce on it.  This way was so much easier and less messy!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NET10",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/554470/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:07:47.873Z",
                "reviewBody": "This is an excellent recipe!!  My family LOVES it!  I add chopped up pieces of apple sometimes or chopped pieces of pineapple in between the layers of the raw dough.  Then let it rise.  Gives it a different flavor!!  The pineapple gives it an Upside Down Pineapple Cake flavor!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susy K.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/103686/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-23T16:37:29.423Z",
                "reviewBody": "I took this out of the oven at 9:00.  By 9:17 it was gone!  I made the dough and put it all together the night before, then refrigerated it overnight, taking it out of the fridge about an hour before baking the next morning.  This  worked great  and I didn't have to get up so early to have a yummy, fun breakfast for my husband and kids Thanksgiving morning. I only used 1/2 the butter/brown sugar syrup and everyone agreed it was still plenty sticky.   Great recipe, I will certainly use it again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "kari",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1784154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:07:49.81Z",
                "reviewBody": "I had to grab an apron when dipping them into the butter/sugar mixture because that's pretty darn messy. I made the bubbles each a little too big but my mom took one bite and told me that this was the best thing I'd ever made - far beyond her usual \"less sugar. More fat. Could've cooked it longer..\" DELICIOUS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HALEYMASTERSON",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/172369/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-07T21:38:56.193Z",
                "reviewBody": "I used my Kitchen Aid mixer for the dough part of this recipe. Instead of all water I used part milk and I warmed it to the proper temperature so I could proof my yeast as I do not have a bread machine. I proofed the yeast with the warm milk/water and sugar in my mixer bowl for ten minutes then added the melted butter (I used butter instead of margerine) and the dry ingredients leaving the raisins for last. This did need a little more flour to get it to form into a ball and jump on the hook. I kneaded the dough with the dough hook for about five minutes then set it to rise in a greased bowl on a warm heating pad. After it doubled I made the balls and dipped them in butter (again I used butter instead of margerine) and sugar. (I added cinnamon and nutmeg to the brown sugar so they'd have just a little more flavor.) I made these into Monkey Bread Muffins (instead of one big monkey bread loaf) by placing three balls into every greased muffin tin like I would Cloverleaf Rolls. Once they were all done I set it to rise on the heating pad again until they doubled. 375 for 14 minutes made for perfect Monkey Bread Rolls. This is a great weekend breakfast recipe. I plan on making a thin vanilla glaze to drizzle over the top in the morning. EDITED: These were inhaled. My boys loved them.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:07:48.217Z",
                "reviewBody": "WE ALL LOVED THIS!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TONI OWENS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/219283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-20T05:19:08.807Z",
                "reviewBody": "pretty good. i made mine w/pecans and golden raisins. beware:the sugary syrup and raisins will go over the side of the pan! use a cookie sheet underneath!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "scrange",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1902883/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Monkey Bread II",
            "description": "See how to use your bread machine to make sweet monkey bread.",
            "uploadDate": "2013-05-13T23:24:45.685Z",
            "duration": "PT4M9.984S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F42a36213-89e0-4334-b96b-244fb780e941%2F55655651-a058-4a68-90bf-f19a2a9571e1%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2379440932001"
        }
    }
]