[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17140/desserts/fruit-desserts/",
                    "name": "Fruit Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17525/desserts/fruit-desserts/strawberry-desserts/",
                    "name": "Strawberry Dessert Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7926/strawberry-cake-ii/",
        "name": "Strawberry Cake II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3962978.jpg",
            "width": 2668,
            "height": 2032
        },
        "datePublished": "1998-08-08T11:04:22.000Z",
        "description": "A beautiful cake for the strawberry lover. Easy to make with packaged gelatin and white cake mix. Fresh strawberries can be used when they are in season.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H30M",
        "recipeYield": "1 - 3 layer 9 inch cake",
        "recipeIngredient": [
            "1 (3 ounce) package strawberry flavored Jell-O®",
            "½ cup cold water",
            "1 (18.25 ounce) package white cake mix",
            "4 eggs",
            "1 cup vegetable oil",
            "3 tablespoons all-purpose flour",
            "1 (10 ounce) package frozen strawberries, thawed",
            "6 tablespoons butter",
            "2 cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour three 9 inch round cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, dissolve the gelatin in cold water; stir in the cake mix, eggs, vegetable oil, flour and 1/2 of the strawberries.  Beat for 5 minutes on the medium speed of an electric mixer.  Divide the batter evenly between the prepared cake pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 30 to 35 minutes in the preheated oven, or until the layers spring back when lightly pressed in the center.  Cool cakes in the pans on wire racks.\n"
            },
            {
                "@type": "HowToStep",
                "text": "To Make Frosting:  Cream the butter, sugar and the remaining half of the strawberries in a medium bowl until light and fluffy, adding additional confectioners' sugar if needed for a spreadable consistency.  Spread the frosting between layers and over the top and sides of cake.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Fruit Desserts",
            "Strawberry Dessert Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Judalee"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.49079754601227,
            "ratingCount": 326,
            "itemReviewed": "Strawberry Cake II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "549 calories",
            "carbohydrateContent": "65.8 g",
            "cholesterolContent": "85.9 mg",
            "fatContent": "30.6 g",
            "fiberContent": "0.9 g",
            "proteinContent": "5 g",
            "saturatedFatContent": "7.3 g",
            "servingSize": null,
            "sodiumContent": "373.4 mg",
            "sugarContent": "53.4 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-10-23T18:52:48.42Z",
                "reviewBody": "This cake was so great it deserves 6 stars!  Judging from what other reviewers said, I drained well and pureed the (unsweetened) strawberries.  I added 1/2 cup of the puree to the cake batter and ONLY 2 TBSP of the puree to the icing, which comes out to a PERFECT spreading consistency.  I made this in a 9x13 baking dish and the icing was the perfect amount to cover the top nicely.  This is an absolutely great recipe, with the above modifications!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RAMAJOHN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/598852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-30T19:57:30.013Z",
                "reviewBody": "I didn't think I would be a fan of a fruit-flavored cake, but I was wrong!  This cake is truly wonderful.  I've made it twice now--once for an informal wedding shower and once for family, and everyone raved about it both times.  Based on others suggestions, I modified the recipe.  I pureed the package of strawberries, and for the cake I made for my family, I put the puree through a mesh strainer to remove the seeds for my picky husband.  After tasting the cake with and without seeds, without is really better and worth the effort.  I baked the cake in a 13x9 pan for 35 minutes and it came out perfect. I determined that due to the \"runny\" nature of the icing, a 3-layer cake might be tricky.  The icing was a little sweet for my taste, so I put in 8oz. of cream cheese, and 1 tsp. mexican vanilla to tone down the sweet and enhance the flavor.  However, to thicken it up a bit, I did end up adding another cup of powdered sugar.  Also, I only used 1/3c. of the strawberry puree in the icing, and put the other 2/3c. in the cake batter.  Because of the fruit, cream cheese, and butter in this cake, I store it in the refrigerator.  It stays nice and moist for as many days as you can keep it around--which isn't long at my house.  This recipe is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ZACHS_MOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/645319/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-16T07:49:49.06Z",
                "reviewBody": "I've made this recipe twice and both times used fresh strawberries. The first time I made it I used the icing recipe listed. It was horrible and required a lot of modifications (should have listened to the other reviewers). This time I used the cream cheese icing from this site and it worked perfectly. I made three 9\" layers; pureed the strawberries and strained it to remove the seeds and added it to the batter. I added a bit of the puree to a small portion of the cream cheese icing to test but decided I preferred the icing without it. I added sliced strawberries with the icing in between the layers and I garnished with chocolate covered whole strawberries. Stunning presentation and amazing taste to boot. This recipe is a keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BBHOLT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/513534/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-23T07:46:49Z",
                "reviewBody": "My grandmother and I do a lot of baking...cakes cookies pies..etc. We've noticed that most layer cakes can be made in a 9x13 inch pan without compromising the taste. Of course layered cakes are much more elegant looking than others but with this particular recipe I prefer it in a rectangular pan. We've prepared this cake several times and have always used frozen strawberries. And everyone who tries this really enjoyes it. I'm a die-hard chocolate lover but actually prefer this cake!! Thanks Judalee.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOSIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/15350275/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-05T13:35:53.123Z",
                "reviewBody": "Fun to make and to try but this doesn't rate in the \"Recipe Hall of Fame.\" The cake itself is moist and flavorful but I couldn't quite get past the artificial taste and color. Also given the reviews about the frosting being a \"sloppy mess \" I took other reviewers' suggestions and used \"Cool Whipped Frosting \" substituting strawberry extract for the vanilla and adding 1/3 cup of strawberry puree. I made this in two layers and put a layer of fresh sliced strawberries over the filling in between the layers. I decorated it with just a few fresh strawberries with the stems. I could see this \"pretty in pink\" cake as a real crowd pleaser for a little girl's birthday party and wish I had come across this when my daughter was younger. All around not much payoff or reward for the effort. To me it just screams \"fake.\"",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-15T01:19:30.12Z",
                "reviewBody": "This is an awesome cake!!! I was nervous about the frosting but after discussing it with my mom she gave me a few hints. I made the frosting like the reviewer Diana suggested \"My frosting is 1 stick of butter with 4 cups of powdered sugar with a little vanilla.\" My mom's hints to help cut the sweetness is to add a tad bit of salt or lemon juice. I ended up using about a tablespoon of concentrated lemon juice to the frosting and it turned out GREAT! Since I used fresh strawberries the cake was perfect and the icing was sweetened to my taste. The frosting made too much since I used a 9x13 pan but would be plenty for a multi-layer cake. Perfection!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "handbanana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2348670/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-29T04:16:10.873Z",
                "reviewBody": "This cake is to die for!!! It gets 10 stars!  I made this for my boss for her birthday and was so good I have to make another one this weekend.  I did make a couple adjustments.  I used fresh strawberries and chopped them in a food processor before adding to the batter.  I made a 2 layer 9x13 cake instead of round.  For filling I used the filling from the Strawberry and Cream Cake on this page (1 1/2 cups heavy cream, 2 T sugar, 1/2 tsp vanilla, and 1 1/2 cup sliced strawberries) and used homemade cream cheese frosting to frost the top.   It was absolutely amazing.  People at work are still raving!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "HISTORYGIRL04",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/973112/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-07-10T21:46:54.717Z",
                "reviewBody": "I have been making this cake for years. My frosting is 1 stick of butter with 4 cups of powdered sugar with a little vanilla. I let the cake cool only for 5 or 10 minutes then pour the frosting on. Makes for a very moist cake!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diana",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1974290/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-22T16:51:44.513Z",
                "reviewBody": "I used this cake recipe to make an Elmo cake for my daughter's birthday and it was a total hit! I took the other reviewer's advice and pureed the strawberries before putting them in. I used about 3/4 of the strawberries that were called for and the cake turned out perfectly!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly Wells",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1624097/"
                }
            }
        ]
    }
]