[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/205/meat-and-poultry/pork/",
                    "name": "Pork",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17021/meat-and-poultry/pork/ground/",
                    "name": "Ground Pork Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12343/meat-pie-tourtiere/",
        "name": "Meat Pie (Tourtiere)",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F54867.jpg",
            "width": 3488,
            "height": 2616
        },
        "datePublished": "1998-08-08T15:46:18.000Z",
        "description": "French Canadian Tourtiere. Contains pork, potatoes, onions and spices.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch deep dish pie",
        "recipeIngredient": [
            "1 ½ pounds ground pork",
            "1 large baking potato",
            "1 large onion, minced",
            "½ teaspoon salt",
            "½ teaspoon ground black pepper",
            "½ teaspoon ground cinnamon",
            "¼ teaspoon ground cloves",
            "1 dash ground allspice",
            "½ cup water",
            "1 recipe pastry for a 9 inch double crust deep dish pie",
            "1 egg",
            "¼ teaspoon paprika"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Bake the potato until done, 30 - 45 minutes in a preheated 400 degrees F (205 degrees C) oven.  Peel and mash the potato.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the potato, ground pork, onion, spices and water in a large frying pan and simmer until very thick, for about one hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Meanwhile, prepare your pastry.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Line a deep-dish pie plate with pastry.  Spoon in filling, spreading evenly.  Cover with top crust.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Brush with beaten egg and sprinkle with paprika, if desired.  Cut steam vent.  Bake for 50 minutes at 350 degrees F (175 degrees C).  If edges brown too fast, cover with a strip of foil.  Serve warm.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Pork",
            "Ground Pork Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Maggie Rogers"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.592727272727273,
            "ratingCount": 275,
            "itemReviewed": "Meat Pie (Tourtiere)",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "485.4 calories",
            "carbohydrateContent": "30.5 g",
            "cholesterolContent": "84.5 mg",
            "fatContent": "32 g",
            "fiberContent": "1.7 g",
            "proteinContent": "17.9 g",
            "saturatedFatContent": "8.9 g",
            "servingSize": null,
            "sodiumContent": "565 mg",
            "sugarContent": "2.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2010-11-22T04:01:28.82Z",
                "reviewBody": "I am french canadian and meat pie has been a family tradition for years, made by my Memere's, but is a long lost art as we have americanized our traditions. I made it this thanksgiving with the help of my Aunt and she says leave out the cinnamon but use more allspice in it's place, do not add water, and add the potato after you cook the meat, little by little until you feel it is perfect for you. I did 2 pies, one this one way and one her way, and she was right. But both were very tasty and did not last the night. Will definetly be making again for Christmas Eve. Thanks!\n\nUPDATE: TO THE REVIEW WHO'S PIE HAD CHUNKS OF POTATO, SAVE ONE POTATO FOR DICIING BUT USE THE REMAINING POTATOES FOR MASHING INTO THE MEAT. THE POTATOS IS THE TRICK FOR KEEPING THE MEAT FROM BEING CRUMBLY..UPDATE #2, USE HALF PORK, HALF GROUND BEEF. YUMMY!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LYNMARIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/443673/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-15T19:03:47.36Z",
                "reviewBody": "This is an excellent tourtiere recipe.  I have been making tourtieres for 46 years and this is great.  I have always added some garlic and I don't think the egg and paprika are necessary because the fat in the pork makes the crust brown.  I make these pies in batches of 3 or more.  Wrap well and freeze.  When needed unwrap and bake unfrozen at 400 F for 30 minutes.  My mistake I reheat it from the frozen state ---so it is very handy for a quick meal.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRICIA E.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/861443/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-02T19:26:36.13Z",
                "reviewBody": "I cooked the potato in the microwave to save time. I also used Pillsbury pie crusts. I cooked the pork, then added the other ingredients until well mixed. I didn't simmer it for 1 hour and it turned out great. I would make this again. My husband and 12 year old son loved it. Great flavor.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DENISE BIENCOURT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/496450/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-04T14:40:01.62Z",
                "reviewBody": "Fantastic!  Tasted like someting right out of the 18th century Scottish Highlands! I made this last night, taking into consideration some of the suggestions from other reviewers.  I made a few modifications.  I used 1 pound of ground pork and 1 pound of very lean ground beef and did not drain it.  I used instant spuds (Idahoan) instead of a baking potato but making them a coarser consistancy like the inside of a baked potato and I used some of the meat \"juices\" in place of the margarine in the spud recipe.  I used a medium onion and one whole shallot minced.  I used half the amount of cinnamon but doubled the allspice. I reduced the 1/2 cup of water to a 1/4 cup water and added 1/4 cup red wine to it.  Finally I used refridgerated pie crusts.  I made the instant spuds and added them to the simmering meat mixture during the last 10 minutes of simmering.  This thickened it up nicely.  While it was baking I had 5 hungry guys from 48 to 16 years old asking when it would be ready.  They polished off the entire thing but not before I got my piece out of it.  This pie made the most delicious crust I've ever had.  Next time I'm making two pies.  The flavor was just amazing and one son thought it tasted like something we would have for Christmas, so I'll keep that in mind. This recipe is a keeper!!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Karen Martell Bishop",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1371349/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-08T02:24:35.577Z",
                "reviewBody": "This recipe is the exact traditionnal French Canadian tourtière that I've grown up to eat Christmas after Christmas. My grandmother's tourtière tasted exactly like this except that she never used potatoes starch or bread crumbs in her tourtière(which she found diminished the taste of the meat and the spices). She simply wasn't puting much of the broth in the pie to begin with. The result was a very tasty tourtière that wasn't runny at all. As for the suggestion of adding other spices and herbs such as ginger and savoury well that would perhaps create a different meat pie with a different taste but that certainly would not be a traditionnal French Canadian Tourtière anymore.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tyggrette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/984965/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-25T00:12:15.007Z",
                "reviewBody": "This is the best recipe for tourtiere that I have encountered. It brings back memories of the post Midnight Mass meal and Christmas morning breakfast that my momma would create. (Try a thin slice of tourtiere with 2 eggs of your choice. Delicious.) My only problem is the use of cinnamon. In my mind this spice should be reserved for moles or desserts. A suggestion: Use cooked potatoes cubed 1/4 inch (rather than mash) and saute with the onion and pork until all ingredients are well browned.(This is my own twist). It provides a much nicer texture and flavor. Save and use the fat in the recipe sparingly (that is where the flavor is and the final product won't feel dried out). I give you 4 because of your use of cinnamon, otherwise it wiiuld be 5.\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GERRYBERUBE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1036095/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-13T21:47:15.14Z",
                "reviewBody": "Perfect!! I too used 1/2 pork & 1/2 hamburg. Hubby said it tasted just like the pies his grandmother used make. (He even called his mother to tell her!) Thanks for the post!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KA4228",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1460504/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-14T18:54:09.983Z",
                "reviewBody": "I love this recipe! I have grown up on meat pie during Christmas (baked 2 different ways by each of my Memere's) but this is one of the closest recipes I've had to either of them. I do have a couple of recommendations to people who are doing this for the first time. Peal /boil/mash your potato separately and keep to the side. Also, sauteing the onion a little bit before you add the meat helps. I only use about 1/4C of water and it is usually more than enough. Once the water has boiled off, I add the potato and the spices (I use only 1/2tsp cinnamon and 1/2tsp Clove).   Like others, I leave out the egg and paprika, but that is because that's how my grandmothers did it.   Merry Christmas!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea Mudgett",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/5481742/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-07T18:50:54.44Z",
                "reviewBody": "I love making this! My Aunt makes it every year for our traditional Christmas meal. I can't imagine Christmas any other way. I'll also make the meat filling as another form of stuffing for Thanksgiving. We usually make the recipe with half pork and half beef. And I know this sounds crazy but if you don't want to make the potatos to save time I use instant to get the consistancy that I need for the filling. No one ever knows the difference.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "pumpkin pie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2117726/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-19T17:14:45.42Z",
                "reviewBody": "Perhaps this is an acquired taste. We didn't care for it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JED901",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1144644/"
                }
            }
        ]
    }
]