[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6880/fry-bread-i/",
        "name": "Fry Bread I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F698201.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-08-21T21:33:03.000Z",
        "description": "A traditional North American treat.  Serve with jam or honey.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H30M",
        "recipeYield": "1 dozen fry breads",
        "recipeIngredient": [
            "4 cups all-purpose flour",
            "½ teaspoon salt",
            "1 tablespoon baking powder",
            "1 ½ cups warm water (110 degrees F/45 degrees C)",
            "4 cups shortening for frying"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine flour, salt, and baking powder. Stir in 1 1/2 cups lukewarm water.  Knead until soft but not sticky.  Shape dough into balls about 3 inches in diameter.  Flatten into patties 1/2 inch thick, and make a small hole in the center of each patty.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Fry one at a time in 1 inch of hot shortening, turning to brown on both sides.  Drain on paper towels.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Rita"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.381188118811881,
            "ratingCount": 202,
            "itemReviewed": "Fry Bread I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "217.1 calories",
            "carbohydrateContent": "32.1 g",
            "cholesterolContent": null,
            "fatContent": "7.7 g",
            "fiberContent": "1.1 g",
            "proteinContent": "4.3 g",
            "saturatedFatContent": "1 g",
            "servingSize": null,
            "sodiumContent": "219.6 mg",
            "sugarContent": "0.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2005-01-15T04:35:48.687Z",
                "reviewBody": "I am a Native American and this is the closest I have come to finding a recipe that tastes like my grandmother's recipe! Be careful you don't knead it too much tho, as too much kneading will make it tough!! We now use this when we crave a taste of the famous 'pow-wow' hamburgers, also use it as a base for 'Indian tacos' topping with seasoned hamburger, and other taco fillings, and so much more! Thanx Rita, it brought a taste of 'home' to me.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Chars3girls",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/794805/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-25T06:17:40.31Z",
                "reviewBody": "My entire family is Native American from the West Coast/and Alaska and this recipe is very close to how we make it.  You know good FRYBREAD, when it tastes good without anything on it yet!  Also, for those that come out with tough dough or crackers, you've kneaded and worked with it too long or added too much flour in.  As for cooking FRYBREAD; I always try and use my old black cooking skillet, it keeps the temperature of the oil or shortening more consistent.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KLAMATH1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/959173/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-16T00:32:11.263Z",
                "reviewBody": "I am a young native american and make fry bread the way my grandmother taught me, with out mearsuring the ingredience. I decided to look for a recipe close to what i use, and I seen and liked this one. I made the bread according to this recipe and enjoyed the results. I only suggest that the salt be upped to 1 tsp. I prefer a little more salt. Every delicious!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lene",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2316606/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-09-30T16:38:05.547Z",
                "reviewBody": "I usually make my bread without a recipe, because I have made it for since I was a small child, this is the closest recipe that I have found, I will just adapt it to the way I make it, if i am making fry bread for Indian Tacos i do not use sugar, if I am just making it to make to have with butter and jam I use sugar, and sometimes yeast to make it really fluffy, just remember not to over knead or your kids will have Native footballs ha ha,I usually let my dough rest while my oil or grease is getting hot,just remember fry bread is distinctive food and  as native cook and  live in Washington, from Montana,  fry bread is a  food that was made from commodities that were given to us Native's by the US government, we did not have all the extra stuff people are using now, depending on where you live and are from U.S. or Canada you have fry bread or Bannock, Bannock from Canada is made with bacon grease usually, and U.S. made is usually Flour, Salt, Baking Powder, there are some changes with different tribes,some use, powdered milk, maybe yeast,sugar and sometimes baking soda, we didn't have ice water, and kosher salt etc.. , Fry Bread is Fry Bread totally native style, and yes you can use chili con carne as a topper to make tacos, split it and make Indian Burgers, roll the dough around a hot dog make Indian Dogs, or you can top it with pizza sauce and your favorite cheese and pizza toppings you have a Indian pizza, fry bread is adaptable as the stuff used to make it, have fun and en",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nativecook",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2150057/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-03-01T20:39:22.767Z",
                "reviewBody": "I am Native and I use this recipe. I add a little more salt, about 3 table spoons of sugar and about 3/4 tablespoon of yeast. I never measure...really, but I get 2-3 batches of frybread out of a package of yeast.  The secret to good fry bread is in the mixing. The only way I have ever eaten good frybread was when my grandmothers or myself pushed all the dry ingredients to the side of the bowl, and poured the water in the middle. Then using your spoon, we just go around the bowl and scrape more flour into the water until all is mixed. Then as soon as it is mixed totally, don't mix it anymore! :) We take pieces out of the bowl and have a little flour on the counter and set it on there to dust it and make it not stick to your fingers. Then just work around the frybread carefully making your circle shape. I've never rolled out my fread, made them into balls, or flattened them into patties. I think the secret is in the hand prep...shaping each individual one with care to not rip it. Good recipe. Thats all you need for frybread! We just like ours all poofy! Don't forget when you make the first one, as soon as it is cool, give everyone around you a bite of the first one. My kids just hover waiting for a piece of the first one. Then, put paper towels (or newspaper! LOL!) into the bottom of a paper bag, and drop your frybread in there when your done. Thats what we have always done in our extended family! :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "larinna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2429405/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-07-08T21:13:08.89Z",
                "reviewBody": "I cut this recipe in half to get 6 fry breads. I did add just a little more salt than what was called for. I sprinkled a little flour over the counter before patting my bread balls out to keep them from sticking. They flattened really well I didn't need a rolling pin. I actually fried these in my cast iron skillet. These turned out absolutely perfect. I grew up eating fry bread as a child--this recipe totally took me back. The kids loved these they fought over the leftover fry bread. NO LEFTOVERS. This is pure comfort food.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/doublewideskilletsinglewidebudget/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-05T19:39:36.67Z",
                "reviewBody": "This is as close as you can get to authentic fry bread unless you learn how to make it from a native american.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BEGASHII",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/389469/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-02-27T05:24:39.733Z",
                "reviewBody": "My husband is Ottawa/Chippewa Indian and I have been with him for 34 years and he has always made our Indian Bread and everyone just loves it. He even makes it better than all his sisters do and most restaurants that serve it out west. This recipe uses the same ingredients, but only one thing he does is instead of making the dough into balls he makes the dough sticky and takes spoonfuls and pats it into flour (so its not sticking on the counter or cutting board) top and bottom then pokes small holes all over it with a fork, then puts it in the hot oil, then poke a hole in the center. It comes out light and fluffy. Also put salt into the hot oil so it doesn't smoke as much because of the flour. Tastes good with Bean,Potato,& Hominy Soups. Delicious. He makes this when we are short on food, very filling and delicious.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Kelly B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8893439/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-19T01:41:10.267Z",
                "reviewBody": "Tasty little things! I've added honey and sugar to the batter for a sweeter version & I've tried them with other spices mixed in the batter for more of a flavor to go with dinner (thyme sage and lemon peel even powdered romano and asiago cheese). Good any way you can make it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "jody1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1666812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:45:17.873Z",
                "reviewBody": "We had to add extra water to it and it was really thick after cooking. Not as sweet as I am used to.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "1KITSUNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/578260/"
                }
            }
        ]
    }
]