[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/359/bread/quick-bread/fruit-bread/",
                    "name": "Fruit Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6913/cranberry-orange-loaf/",
        "name": "Cranberry Orange Loaf",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F23782.jpg",
            "width": 3872,
            "height": 2592
        },
        "datePublished": "1998-08-31T19:46:19.000Z",
        "description": "This is an excellent flavor to choose from. Orange and cranberry flavors will be sure to put you in the holiday spirit. It tastes even better the next day.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H25M",
        "recipeYield": "1 - 9x5 inch loaf",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "1 ½ teaspoons baking powder",
            "½ teaspoon baking soda",
            "½ teaspoon salt",
            "1 tablespoon grated orange zest",
            "1 ½ cups fresh cranberries",
            "½ cup pecans, coarsely chopped",
            "¼ cup margarine, softened",
            "1 cup white sugar",
            "1 egg",
            "¾ cup orange juice"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x5 inch loaf pan. Whisk together flour, baking powder, baking soda, and salt. Stir in orange zest, cranberries, and pecans. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream together margarine, sugar, and egg until smooth. Stir in orange juice. Beat in flour mixture until just moistened. Pour into prepared pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour in the preheated oven, or until the bread springs back when lightly touched. Let stand 10 minutes, then turn out onto a wire rack to cool. Wrap in plastic when completely cool.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Fruit Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Carol"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.679874869655891,
            "ratingCount": 959,
            "itemReviewed": "Cranberry Orange Loaf",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "224.3 calories",
            "carbohydrateContent": "36.6 g",
            "cholesterolContent": "15.5 mg",
            "fatContent": "7.7 g",
            "fiberContent": "1.6 g",
            "proteinContent": "3.3 g",
            "saturatedFatContent": "1.1 g",
            "servingSize": null,
            "sodiumContent": "260.7 mg",
            "sugarContent": "18.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-07-21T13:06:38.5Z",
                "reviewBody": "This is a delicious recipe--I poured about a 1/2 cup glaze of orange juice, powdered sugar, & vanilla over the loaf while it was still in the pan--just adds another layer of flavor to an already great mix of tart & sweet. Thanks Carol!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GRANNYLOOHOO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/953764/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-18T23:32:55.563Z",
                "reviewBody": "Oh My God!  This is a beautiful bread, both in taste and aesthetic.  I followed the suggestion of another reviewer and mixed up a simple glaze of orange juice, vanilla and confectioners sugar, drizzling it over the top while the loaf is still hot.  Gives it a gorgeous shine, and an initial sweet taste with the after tart of the cranberry.  If you're looking for a nice large loaf, for breakfast or afternoon tea...THIS IS THE ONE YOU'RE LOOKING FOR!  I will never use any recipe but this from now on...not even Nana's!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nala’s Mama",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/nalasmama/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T21:22:12.403Z",
                "reviewBody": "Wow! I think I have ended my search for a cranberry bread recipe.  This bread is just perfect, moist, relatively lowfat, and has lots of cranberries.  I found that the recipe makes a large loaf that took a longer time to bake than specified.  So, the next time I made it, I just doubled the batch and made 3 loaves and they baked perfectly.  Also, a double batch uses exactly one bag of fresh/frozen cranberries.  Another thing I did to improve the recipe was to drizzle the top with a powdered sugar icing (milk, vanilla, powdered sugar.)  This icing hardened nicely, and the result was superb!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JULIEKINCAID",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/505695/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-23T22:26:50.077Z",
                "reviewBody": "This is an awesome recipe.  I cut my cranberries in half, did a double batch, & baked it in 3 loaf pans, as suggested by one of the reviewers, since my oven seems to be a little slow.  My 3 loaves were done in 55 minutes.  The flavor while still warm is amazing & it is still great after it cools.  It is a rich, well-balanced flavor.  It slices well after it cools completely.  This recipe is a keeper, & when I do it again I will try using 3 8\"x4\" loaf pans. I found the texture to be nice & my bread turned out nicely moist. Thank you to Carol & to the reviewers who had such good suggestions. P.S.  I tried the smaller loaf pans & the loaves came out taller, which I wanted.  They baked in 50 minutes.  The smaller size is easier to wrap in standard width plastic wrap, too.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Susan Stone",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/744467/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-12T14:46:04.513Z",
                "reviewBody": "This recipe is outstanding!  I used 5.75\" X 3.25\" pans (for gifts).  The recipe made 3 gift loaves and they were a HUGE hit!  I chopped the frozen cranberries in a food processor -- they mixed with the orange juice to make the bread a beautiful peachy color.  Even with the smaller pans, they took about an hour to bake.  YUM!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JBABYAK",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/487870/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-16T17:08:59.66Z",
                "reviewBody": "This really is an excellent recipe!  It should be illegal its so good!  The reason I gave it 4 stars and not 5 is because it seemed to need a bit more polishing for my tastes.  First, I rough chopped the cranberries because I know that biting into a whole cranberry can be offputting if you're not expecting that bitterness.  Second, I substituted melted butter, not margarine and lastly I added another egg, a touch of vanilla and left out the nuts.  Rather than \"beating in\" the flour, I just gave it a nice stir with a spatula until the flour was \"just\" combined.  Otherwise, your cranberries can break and run.  This bread was really taken up to the final notch with a glaze of powdered sugar, orange juice, orange zest and a touch of vanilla.. I drizzled it on the loaves when it was mildly warm.  So nice and festive and perfect for small gifts in decorative mini loaf pans... thanks so much for sharing.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "LemonLush",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/bellesaz/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-14T22:24:52.743Z",
                "reviewBody": "I’ve been making this type of bread every year for the holidays and it is always a hit! I soaked the fresh cranberries in fresh orange juice and added lots of grated orange zest. When mixed the batter is thick, wet and fits right into the greased and floured 9x5 loaf pan. It baked up nicely in one hour and formed a brown colored top. The orange and cranberry scent was very aromatic throughout my house this morning. While I let the bread cool I made a glaze of ½ cup of powdered sugar mixed with just a little orange juice and orange zest to drizzle over the bread. The fresh orange juice and zest really emphasizes the fruity quality of this cranberry nut bread just as the submitter stated. The red juicy cranberries were peeking out everywhere in the bread. When sliced it is appealing to look at the cranberries imbedded in the bread as the contrasting colors of red and orange make a pretty bread. The combination of both sweet and tart is balanced in flavor but, nothing overpowering and the orange flavors really pop in the bread –so fresh tasting. The nutty pecans added a nice texture to the bread as well. The glaze just added another sweet layer of flavor. I found the ingredients, directions and baking time spot on. A beautiful delicious bread- perfect for the holidays and to give as gifts!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "OkinawanPrincess",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1037986/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T21:20:13.043Z",
                "reviewBody": "I was a little worried when I tasted the cranberries (I'd never had \"raw\" cranberries before, and were they bitter!), but it came out fabulous. Stealthily addictive: you keep coming back for one more piece or morsel without realizing it. It smelled fantastic cooking, and is a great combination use of in-season winter fruits - cranberries & oranges!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BAKING FURY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/710326/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-03-02T02:44:56.06Z",
                "reviewBody": "This is my absolute favorite quickbread recipe.  the flavor is so bold, tangy-tart-sweet, and the texture is wonderful.  But of course, I make changes, :P. First, I don't use fresh cranberries, I used sweetened and dried.  One whole 6 oz package provides approx 1 1/2 cups of cranberries.  this way they are sweeter and distribute more evenly through the bread (since there are more, smaller berries).  I soak the berries in 1 cup of boiling orange juice before adding both to the batter.  This makes the cranberries plumper and they don't suck moisture out of the batter.  the orange juice also absorbs some of the cranberry flavor and color.  I also add about a tsp of vanilla to the wet ingredients. I also add spices to the dry ingredients.  A lot of cinnamon, just enough nutmeg to smell, and some ginger. All combined, this makes a very rich, moist and irresistable quickbread. Also, to make 6 giant muffins, bake for 30 minutes, or bake for 20 minutes in a regular sized muffin tin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "bethanylanell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1902713/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:26:23.437Z",
                "reviewBody": "When I made this bread I thought the dough was a bit too stiff - more like biscotti than a quick bread but I thought that perhaps the fresh cranberries would weep a bit during the cooking process and that the recipe accomodated for that. Turns out that I was right it would have made great biscotti! I think I may leave out the cranberries and use it that way instead - then it will be great! The orange flavor was really nice and the texture is very coarse - perfect for biscotti but not great for a fruit bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "PIXIE_BIT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/730523/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Cranberry Orange Loaf ",
            "description": "The lovely flavor combination of cranberry and orange is perfect for the holidays!",
            "uploadDate": "2019-11-22T19:44:41.654Z",
            "duration": "PT3M2.912S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Feb1dd5c2-92b3-491a-8429-9e2d40591f3b%2F19eaa941-7342-4877-8784-e1f9767277e2%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=6107661447001"
        }
    }
]