[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/339/bread/yeast-bread/",
                    "name": "Yeast Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17575/bread/yeast-bread/english-muffins/",
                    "name": "English Muffin Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6947/english-muffins/",
        "name": "English Muffins",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F865284.jpg",
            "width": 4608,
            "height": 3072
        },
        "datePublished": "1998-09-09T22:10:10.000Z",
        "description": "I've used this delicious recipe for about 29 years. They are very good... much better than any store-bought English Muffins I've ever had.",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H20M",
        "totalTime": "P0DT2H15M",
        "recipeYield": "18 muffins (approximately)",
        "recipeIngredient": [
            "1 cup milk",
            "2 tablespoons white sugar",
            "1 (.25 ounce) package active dry yeast",
            "1 cup warm water (110 degrees F/45 degrees C)",
            "¼ cup melted shortening",
            "6 cups all-purpose flour",
            "1 teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in the sugar, stirring until dissolved. Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, combine the milk, yeast mixture, shortening and 3 cups flour. Beat until smooth. Add salt and rest of flour, or enough to make a soft dough. Knead. Place in greased bowl, cover, and let rise.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Punch down. Roll out to about 1/2 inch thick. Cut rounds with biscuit cutter, drinking glass, or empty tuna can. Sprinkle waxed paper with cornmeal and set the rounds on this to rise. Dust tops of muffins with cornmeal also. Cover and let rise 1/2 hour.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Heat greased griddle. Cook muffins on griddle about 10 minutes on each side on medium heat. Keep baked muffins in a warm oven until all have been cooked. Allow to cool and place in plastic bags for storage. To use, split and toast. Great with orange butter, or cream cheese and jam.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Yeast Bread Recipes",
            "English Muffin Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "LindaPinda"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.460188933873145,
            "ratingCount": 741,
            "itemReviewed": "English Muffins",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "190.1 calories",
            "carbohydrateContent": "34 g",
            "cholesterolContent": "1.1 mg",
            "fatContent": "3.5 g",
            "fiberContent": "1.2 g",
            "proteinContent": "4.9 g",
            "saturatedFatContent": "0.9 g",
            "servingSize": null,
            "sodiumContent": "136.2 mg",
            "sugarContent": "2.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2007-10-18T22:21:06.473Z",
                "reviewBody": "Wonderful recipe! I will never buy them from the store again! The English muffins are lovely when toasted; light and crisp. Mine were full of nooks and crannies! They are perfect with honey butter.\nIn order to make sure you English muffins \"work out\" and aren't too dense, try these tips:\nUse bread flour instead of all-purpose. It has a higher gluten content which will aid in the rising of the dough.\n\nWhen you \"scald\" the milk, don't let it boil! Just heat the milk to about 185F.\n\nWhen activating your yeast (warm water and yeast part of recipe) follow this guideline: use water that is between 100F-115F for dry active yeast, and 120F-130F for instant active or rapid rise yeast. This isn't a necessary step in the recipe, but it will let you know if your yeast is \"active\". I add a pinch of flour and sugar when I do this step to \"feed\" the yeast. It will froth like mad!\n\nLike a previous poster noted, don't play with the dough too much after the first rise, it will lessen the amount of air in the dough. Handle it carefully!\n\nLast tip, after the second rise they will puff up. Carefully, transfer them to the greased skillet, using a spatula, and they will stay puffed up. The muffins will only \"deflate\" once you turn them over.\nHope this helps someone!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "happymommyx4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1632397/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-04-23T19:52:16.473Z",
                "reviewBody": "Born & raised in Canada we ate English Muffins on a regular basis. To those who found that there were no nooks & crannies in their muffins try this: Poke your muffin around the edge (where it would normally be cut) with a fork, continue around the muffin then spread/pull it apart with your fingers...you will find there are nooks & crannies within. Canadian English Muffins are never precut like the American version.  Also, remember that these are homemade & dont contain the chemical stabilizers that the store bought muffins contain....with that comes a different taste & texture. If you are comparing them to store bought...its equivalent to comparing store bought bread to real homemade bread...no comparison. If you are an inexperienced baker its hard to judge how  much flour is enough....what exactly a 'soft dough' means etc. but you will learn with experience. Keep on baking & hone your skills. The world needs REAL bakers. It is fast becoming a lost art form. \n\nI used bread flour, slightly more yeast & allowed the cut muffins to rise 40 mins. as per previous bakers suggestions. I loved these  muffins ! No, not store bought tasting....but better. Linda has been making these for 29 because to her & her family they are the best. I would agree with Linda. I thank you Linda for the outstanding recipe. Happy Baking to all !!! Cheers ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Canuckfromthenorth",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2247858/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-07-11T02:57:45.887Z",
                "reviewBody": "Hands down, one of the best recipes I've gotten off the web! I had to cook them over low heat, I guess my stovetop has a higher flame than some. For those who were having trouble with the nooks and crannys: knead the dough as little as possible after you punch it down and roll it out. This will decrease the number of broken air pockets. After the first rise, the yeast does not create new pockets, it only enhances the ones that were initially formed. The more you work with the dough after the first rise, the fewer pockets of air you will have. Secondly, let the muffins REALLY rise after you've cut them and are waiting to pan bake them. They may still not be exactly like the ones in the store, but then again, those are commercial muffins and are actually not traditional English muffins.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LORIKAE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1433571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-19T17:05:49.31Z",
                "reviewBody": "I loved these muffins! They were easy to make, had a light texture, and had enough nooks and crannies to suit me! Thanks, everyone for all your tips.  Here's my combination of tips: I added a pinch of sugar to feed the yeast. I used 3 cups whole wheat and 2 cups unbleached white flour. After the first rising, I formed the dough into a log and cut 18 slices, dredged them in corn meal then placed on a sprayed cookie sheet. I pre-heated my oven to 100 degrees, turned it off and set the trays in there for 30 minutes. They rose beautifully! And here's the best time saving tip of all: I removed the trays, heated the oven to 375 degrees and baked the muffins on the same trays for 5 minutes on one side, then flipped and baked them another 5 minutes.  They turned out perfect!   Watch out though, the 18 slices made pretty big muffins.  Mine were about 4.5 inches across, compared to 3 inches for store bought ones.  If you want them small, make your log longer and cut into 24 pieces. I might do that next time. Remember to split your muffins open with a large fork!  And here's a MUST DO: have one hot out of the oven with butter and a little cheese. Heaven!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Denise M",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3740990/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-05-25T00:18:24Z",
                "reviewBody": "Ok, these are definitely NOT English Muffins.  They are buns.  Yeast raised buns.  And, it's a decent recipe for buns.  Cooking buns on a pan is unusual, but makes for a nice crust.  English muffins are very different -- they are a bit chewey, and they have a coarser crumb with lots of big holes that leave all the bumps and ridges that make them very crispy when toasted.  To acheive this, the dough is usually very soft like a batter, and it contains both yeast and -- added near the end of the raising -- some baking soda.  They also contain eggs or egg whites to help make them chewy.    Sorry, but this is simply misnamed/categorized.  I made this though.  It produces nice buns for hamburgers, etc., and they toast like white bread.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Tamra",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4900683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T22:12:18.377Z",
                "reviewBody": "Great recipe - but don't expect these to be anything like the more famous \"store bought\" kind. These are definitely a bit more \"dense\". I used butter-flavored shortening and instead of the griddle, I did mine in the oven. I lined a tray with parchment paper and baked them at 375 for 8 minutes, flipped them and let them go for another 8 minutes.  They were really good toasted with butter and jelly.  Next time I might throw some cinnamon and raisins or some dried cranberries and orange zest into the batter for a little something different.......",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jillian",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jillian/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-08T15:37:22.967Z",
                "reviewBody": "My english muffins came out great except the interior texture of the muffin was more the consistancy of a bagel rather than an english muffin. The inside was more dense and did not have the \"holes\" an english muffin has. The flavor was very good though. Due to having to take my daughter somewhere I cooked part of the muffins after a 30 minute final rise and the rest of them after an hour rise and the ones which were allowed to rise longer were nicer and bigger. Delicious toasted and topped with cream cheese!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GODSGRRL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/517102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-08-08T15:32:36.81Z",
                "reviewBody": "My husband and I were very impressed with this recipe!  I did have to alter the cooking of the dough: low heat for about 8 min. on each side, and frequently turning them to brown evenly. Delicious!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARA ABIGAIL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/674569/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:07:59.45Z",
                "reviewBody": "I am still in the process of making this recipe. However I do have a question. The recipe states to add the sugar to the shortening and milk. It also says to add the sugar to the yeast and water mixer. I have added the sugar to the milk mixture for ease in dissolving the sugar. The dough has risen beautifully and the muffins are rising before cooking. It seems funny to 'bake' the muffins in the frying pan.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GBRIDENBECKER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/139816/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "English Muffins",
            "description": "Sweet, simple, or savory; no matter how you decide to use these English muffins, they're gonna be perfect!",
            "uploadDate": "2015-11-17T19:44:18.115Z",
            "duration": "PT1M59.519S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fc9e4e752-ebfe-40ce-8776-448ac83d45d2%2Feb979432-041e-479e-a7f5-fc88b97a0b07%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=4587938276001"
        }
    }
]