[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15840/desserts/crisps-and-crumbles/",
                    "name": "Crisps and Crumbles Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15931/desserts/crisps-and-crumbles/apple-crisps-and-crumbles/",
                    "name": "Apple Crisps and Crumbles Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12409/apple-crisp-ii/",
        "name": "Apple Crisp II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F08%2F02%2F277070-Apple-Crisp-II-Photo-by-Jennifer-Baker-2000.jpg",
            "width": 2000,
            "height": 1333
        },
        "datePublished": "1998-09-16T20:09:57.000Z",
        "description": "A simple dessert that's great served with ice cream.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H20M",
        "recipeYield": "1 9x13-inch pan",
        "recipeIngredient": [
            "10 cups all-purpose apples, peeled, cored and sliced",
            "1 cup white sugar",
            "1 tablespoon all-purpose flour",
            "1 teaspoon ground cinnamon",
            "½ cup water",
            "1 cup quick-cooking oats",
            "1 cup all-purpose flour",
            "1 cup packed brown sugar",
            "¼ teaspoon baking powder",
            "¼ teaspoon baking soda",
            "½ cup butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degree C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for about 45 minutes.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Crisps and Crumbles Recipes",
            "Apple Crisps and Crumbles Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Diane Kester"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.695456814777833,
            "ratingCount": 8012,
            "itemReviewed": "Apple Crisp II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "316 calories",
            "carbohydrateContent": "60.5 g",
            "cholesterolContent": "20.3 mg",
            "fatContent": "8.4 g",
            "fiberContent": "3.3 g",
            "proteinContent": "2.4 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "97.9 mg",
            "sugarContent": "44.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-13T01:19:13.14Z",
                "reviewBody": "Oh my gosh, this is delicious! I have never had such a delicious apple crisp!  I will never search for another recipe! I fixed this for my large, picky family for Thanksgiving.  There were no leftovers!:-) Here's what I changed. I made 2 batches. In one, I added 1/4 cup of water rather than 1/2 cup. That was perfect. In the other batch I didn't add any water at all, and it was a little drier than I like.  So cut the water in half.  Also, I tossed the apples in the cinnamon and sugar mixture, and I added some nutmeg to that mixture.  I think that's what made the apples soooo perfect. Lastly, I doubled the crust recipe and put a layer on top and on bottom.  Yum!!!  I used 6 large Granny Smith's.  I won't change a THING about this recipe next time I fix it, which if my family has anything to say about it, will be tomorrow!:-) \n11-13-06 I made this again for like the 5th time. It's still good, but I think next time I will try to cut the butter into the crust rather than melt it. My crust is never \"crumbly\" like I like on a crisp recipe.  Still a 5-star no doubt!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Allyson Hester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/248396/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-09T18:20:36.037Z",
                "reviewBody": "Excellent recipe and a hallmark of a superb chef, but as usual I had to futz with it. Leave out the water, add 1/4 teaspoon of Nutmeg to the apples, double the crust recipe, add 1 1/2 c. chopped pecans to the crust, and it comes out perfect. Remember to use baking apples (preferably granny smiths) for this, as red delicious will be more sweet and therefore need less sugar. Good vanilla ice cream provides all the moisture you would be missing from the water, and a food processor does wonders for taking the work out of slicing the apples. Now just to find a good butter rum sauce recipe :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KATTELYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/698761/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-24T12:15:46.02Z",
                "reviewBody": "There's a reason why this recipe has nearly 300 reviews - it's THAT GOOD.  THIS is now my standard Apple Crisp recipe. I made mine in a 9 x 13 pan and doubled the topping as another reviewer suggested to cover. Perfect. I mixed my apples up with the flour/cinnamon mixture - this draws out the juices and eliminates the need for the extra water. I did not add the water to the apples.  My only mistake was I sliced my apples too thin and because they were too ripe some of it came out more like applesauce, but that was my own error.  Everyone loved it! I know you are considering other Apple Crisp recipes here but MAKE THIS ONE!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Singlemanwhocooks",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/806233/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-07T02:10:20.39Z",
                "reviewBody": "Excellent recipie.  It is important to follow the steps and not deviate from them (i.e. don't mix up All the ingredients at once and throw it over the apples as you may be able to get away with in other crisp recipes)\r\nThe recipie was great. the water factor wasn't a factor for me. it turned out to be a very nice thick juice that accented the dish nicely.\r\nA word of caution when using this or any apple crisp recipie.  THE TYPE OF APPLES DO MATTER. I made this twice. Once with Red Delicious apples. these apples are not the greatest to use as they are often soft and bland. the recipe was great but the apples lacked.  I then used Granny Smith green sour apples.  This made All the difference! Do not be afraid to use sour apples. Keep in mind you are using two cups of sugar in this recipie and it will be quite sweet.  It simply comes down to the need for a hard and sour or at the very least sharp tasting apple to counter the sugar and even the flavor out. It will taste much better. Do not use soft or bland tasting apples, and do not overcook as the apples will turn mushy if you overcook.  If you fear overcooking then cut your apple thicker.  If you like the very thin slices of apple then you need to you a very hard, fresh, tart apple.  I do not suggest using Red Delicious apples. I also addeed a pinch of nutmeg.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "PATRICK327",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1007214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-05T00:37:04.55Z",
                "reviewBody": "I submitted this recipe several years ago, before I was a registerd member.  It was included in the first cookbook that All Recipes published, and I was so proud.  I like to come back every now and then to read some reviews.  I recommend Granny Smith apples; it won't be too sweet or watery.  Thanks to all you cooks for your ratings and reviews!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Diane Kester",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4023419/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-12T14:41:18.21Z",
                "reviewBody": "Tasted wonderful.  I followed the directions exactly this time, but in the future I will make the following changes: cut the amount of water in half, double the topping and add 1/4 teaspoon of nutmeg.  You may need to increase the cooking time as mine was not done in 45 minutes.  Great recipe though!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "RogueOnion8",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/185024/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-10-25T23:56:32.467Z",
                "reviewBody": "One important note: skip the water! I didn't use any at all and it was perfect.\r\nI made a smaller version using a square 8x8 pan. I halved the sugar mixture for the apples but used the full measurements for the topping. If you are using the original 9x13 size, make sure you double the topping otherwise it wouldn't be enough.\r\nThis is the best apple crisp I have ever tasted and so easy to make!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JAKEJESSESMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/900683/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-08T18:10:17.267Z",
                "reviewBody": "This recipe is nearly the exact recipe I've been using for years, so I had to add my review to the pile.  It is my favorite way to get rid of an apple surplus (I ususally use about 7 good sized apples of mixed variety, minus what I snack on while I make it).  The only things I do differently are:\n \n1) I use 1/2 brown sugar and 1/2 white for the apple mixture. \n2)I add fresh ground nutmeg, vanilla extract, and often raisins. \n3)I omit the h20 and \n4)I always add a heaping spoonful of gourmet butterscotch caramel ice cream topping to the apple mix-TRUST ME on this one!  \n\nIn the begining, I had a hard time with my crumble mix being 'crumbly' until I figured out to lightly press it down into the bowl, chill it for at least 30m and then break it up with a fork.  Letting the butter in the mix re-harden really makes a BIG difference in the final crumble factor.  Also, you must use real butter, margarine won't have the same effect for this recipe.  I'll often assemble this earlier in the day and leave it in the frige, then just before dinner, break up the crumble, top and bake while we eat.  I always serve with vanilla bean ice cream and have ALWAYS gotten rave reviews with this one.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Starlet",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3055025/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-28T00:25:02.32Z",
                "reviewBody": "First I made with(10)fresh peaches. Was WAY too sweet for our taste. Second time, I used semi- tart apples with only 1/4 of the white sugar. We still COULDN'T eat without a giant glass of milk, or the suggested ice cream. All I could taste was the \"sweet\";not much of the fresh fruit flavor or the wonderful cinnamon.The topping was about a 1/4 inch thick in a 9/13 dish. Also, way too sweet for us. I will omit all, but a sprinkling, of the white sugar, add HALF of the brown sugar, next time. If you like it 'BIG TIME' SWEET, this recipe AS IS, is for you! If you like the fresh fruit taste more, omit most of the white sugar and half the brown. Also, you can get away with half the butter if you \"cut\" it in evenly with a pastry cutter or a fork. It still comes out crispy and not too dry and is healthier.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "somethingdifferentagain?!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/342976/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Apple Crisp II",
            "description": "This satisfying warm dessert goes perfectly with vanilla ice cream.",
            "uploadDate": "2021-11-03T14:21:42.577Z",
            "duration": "PT3M12.484S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F3932f3bc-6b1b-4cce-a1fa-75879e9e1758%2F9c3ffcc0-cd62-4aa4-b2aa-9d25277a20eb%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1959451683001"
        }
    }
]