[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/379/desserts/cakes/holiday-cakes/",
                    "name": "Holiday Cake Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8014/simple-n-delicious-chocolate-cake/",
        "name": "Simple 'N' Delicious Chocolate Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1036327.jpg",
            "width": 2515,
            "height": 2205
        },
        "datePublished": "1998-09-22T01:09:49.000Z",
        "description": "A very simple to make chocolate cake that I developed while trying to combine my chocolate and coffee cravings. It tastes so good no one will believe how easy it was! (It can be frosted with chocolate or coffee icing but I like it plain.)",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 8-inch pan",
        "recipeIngredient": [
            "1 cup white sugar",
            "1.063 cups all-purpose flour",
            "½ cup unsweetened cocoa powder",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "½ cup butter",
            "1 egg",
            "1 teaspoon vanilla extract",
            "1 cup cold, strong, brewed coffee"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch pan (see Editor's Note). Sift together flour, cocoa, baking soda and salt. Set aside.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream butter and sugar until light and fluffy. Add egg and vanilla and beat well. Add flour mixture, alternating with coffee. Beat until just incorporated.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 350 degrees F (175 degrees C) for 35 to 45 minutes, or until a toothpick inserted into the cake comes out clean. Allow to cool before frosting.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Holiday Cake Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "J. Miller"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.675324675324675,
            "ratingCount": 231,
            "itemReviewed": "Simple 'N' Delicious Chocolate Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "282 calories",
            "carbohydrateContent": "40.7 g",
            "cholesterolContent": "53.8 mg",
            "fatContent": "13 g",
            "fiberContent": "2.2 g",
            "proteinContent": "3.7 g",
            "saturatedFatContent": "7.9 g",
            "servingSize": null,
            "sodiumContent": "540.6 mg",
            "sugarContent": "25.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2011-08-18T11:53:29.523Z",
                "reviewBody": "I made these into 12 cupcakes today while three guys installed a new air conditioner. I left three on one plate and left the other nine on a platter. I told them to each help themselves to \"a\" cupcake. I went about my business and they with theirs. Next thing I know I see two of three guys with frosting moustaches and the plate with nine cupcakes gone! They said thank you several times proclaimed the cupcakes amazing and told me I was \"a good woman.\" Once they left I tried one myself--yep they're good. REALLY good. When making the batter I used the coffee hot. I read somewhere that hot coffee or boiling water has some kind of reaction with the cocoa that makes it bloom and bring out the depth of its flavor. I frosted these dark moist and chocolatey cupcakes with my own vanilla buttercream frosting. There are now two left for Hubs when he gets home!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T04:04:01.077Z",
                "reviewBody": "Perfect! I made no changes. I too hesitated because I don't drink or like coffee, so I was worried that the cake would taste like coffee - it didn't! Instead, it gave it a unique flavor not  achievable with either water or milk.\n\nThe texture was wonderful. Here's a hint for novices: this texture is only achieved if your butter/sugar mixture does NOT separate when you add the egg. So scramble the egg briefly and add it to the mixture a little at a time). Instead of icing, I put (Stonyfield) yogurt on it (full fat and plain as I like it) while my husband ate his cake with vanilla ice cream. A keeper! Thank you. BTW this cake is just as delicious plain or with some walnuts in it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "r-marie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/615631/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-09-05T02:42:39.803Z",
                "reviewBody": "I've made this cake twice in the last week: once for my future in-laws and once for my family. It was SO easy and absolutely delicious. I don't drink coffee so I was a little worried it would taste like coffee, but it didn't. This cake was moist, not too rich and with a nice crumb. I served it with vanilla frozen yogurt and berries. ONE THING: I found that it was done perfectly after 30 minutes...everyone's oven is different so  I always recommend checking early instead of too late!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Andrea",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2465199/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-09-22T15:14:15.467Z",
                "reviewBody": "LOVE IT!  Even my husband liked it and he's not a big chocolate fan.  This literally takes me 10 minutes to throw together once I have all my ingredients ready.  I get 16 cupcakes out of this recipe and bake them for 20 min or doubled, I bake it 50 minutes in a bundt pan or 40 minutes in a 9X13. My only change is using piping hot coffee instead of cold.  This cake isn't very sweet but it's ... just perfect.  If you have a big sweet tooth you might want to ice it with a fairly sweet icing.  Creamy Chocolate Frosting from this site is a great topper!  The cake is delicious plain or frosted and has a wonderfully moist texture that isn't wet or fudgy.  Don't worry if you're not a coffee drinker because it doesn't leave even the slightest hint of coffee flavor but it definitely enhances the chocolate so don't skip it!  It freezes well and was very easy to work with when making my son's robot cake for his birthday.  Absolutely fantastic and even better the second day!  Thank you!  This is what chocolate cake should taste like!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "6MOUTHS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1068412/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:51:55.043Z",
                "reviewBody": "Due to the coffee that's added, this cake is quite moist; however, it is not a sweet cake and though I planned just to sprinkle some powdered sugar on top, I found that this was not enough, so I had to make some chocolate frosting to go on top.  Whipped cream would also make a good topping.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "MARY ANN S.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/245524/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-04T11:12:49.403Z",
                "reviewBody": "I have made this for my friends probably 6-8 times - for birthdays, for dinner parties, for a girls' night in. Each time it gets rave reviews. I just pour 200 grams (~7 oz) of melted plain chocolate over it, and it gets comments like \"the most amazing chocolate cake ever\".\n\nI've also experimented - I've added freshly squeezed orange juice, and garnished with orange slices - that was a hit.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Emily",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2613472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-04-18T01:30:10.917Z",
                "reviewBody": "always good very easy to make!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sandra Campbell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/623232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-01-13T00:09:26.63Z",
                "reviewBody": "This cake was very easy to make but in the end my batter tasted very very strongly of coffee. So I added 1/2 cup of sugar doubled the amount of vanilla and added about 3 or 4 dashes of Coffeemate. Yes Coffeemate (the vanilla caramel flavor). It tasted great in the end and I was very very happy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "littlecook93",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2647270/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-01-28T18:29:22.947Z",
                "reviewBody": "I decided to make this recipe because I brewed a big pot of coffee for someone, but had a lot left over. I don't like coffee, so I wasn't about to drink it. You can't taste the coffee in the finished product - it just enhances the chocolate flavor. We have a divine family recipe for chocolate cake, and the secret ingredient is coffee. Just try it!\n\nIf you're making cupcakes, don't put too much batter in each cup. The top flattens out over the pan if they rise above the top of the cup once you take them out of the oven. This makes it very hard to remove the cupcakes from the pan with the top intact. A cookie scooper (2 Tbsp, I believe) was the perfect amount of batter for mini cupcakes. The mini cupcakes baked in 10 minutes and this recipe yielded 42 minis.\n\nI used 2/3 cup of strong brewed coffee and 1/3 cup of french vanilla and hazelnut flavored Kahlua (coffee liqueur). It still amounts to one cup of liquid, but with a little extra kick!\n\nI frosted these with the Coffee Butter Frosting from this site. Again, trying to use that leftover coffee...\n\nThis cake was indeed simple and delicious! Thank you J. Miller!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Caroline",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/caroline/"
                }
            }
        ]
    }
]