[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/78/breakfast-and-brunch/",
                    "name": "Breakfast and Brunch",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1304/breakfast-and-brunch/breakfast-bread/",
                    "name": "Breakfast Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/6964/persimmon-bread-ii/",
        "name": "Persimmon Bread II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1852566.jpg",
            "width": 2448,
            "height": 2448
        },
        "datePublished": "1998-09-24T17:35:02.000Z",
        "description": "Excellent for Christmas gifts, as persimmons are only available for a brief time. Moist spice cake type bread. This is the top seller at our company bake sale at Christmas!",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT1H0M",
        "totalTime": "P0DT1H10M",
        "recipeYield": "3 - 6x3 inch loaves",
        "recipeIngredient": [
            "1 cup persimmon pulp",
            "2 teaspoons baking soda",
            "3 cups white sugar",
            "1 cup vegetable oil",
            "4 eggs",
            "1 ½ teaspoons ground cinnamon",
            "½ teaspoon ground nutmeg",
            "1 ½ teaspoons salt",
            "⅔ cup water",
            "3 cups all-purpose flour",
            "1 cup chopped walnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 350 degrees F (175 degrees C). Grease three 6x3 inch loaf pans.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, stir together the persimmon pulp and baking soda. Let stand 5 minutes to thicken the pulp.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine sugar, oil, eggs, cinnamon, nutmeg, and salt. Blend until smooth. Mix in persimmon pulp and water alternately with flour. Fold in nuts. Divide batter into the prepared pans, filling each pan 2/3 full.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 1 hour in the preheated oven, or until a toothpick inserted comes out clean. Cool in pan for 10 minutes before removing to a wire rack to cool completely.\n"
            }
        ],
        "recipeCategory": [
            "Breakfast and Brunch",
            "Breakfast Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Nancy Scott"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.547058823529412,
            "ratingCount": 170,
            "itemReviewed": "Persimmon Bread II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "291.6 calories",
            "carbohydrateContent": "41.1 g",
            "cholesterolContent": "31 mg",
            "fatContent": "13.4 g",
            "fiberContent": "1 g",
            "proteinContent": "3.5 g",
            "saturatedFatContent": "1.8 g",
            "servingSize": null,
            "sodiumContent": "262.4 mg",
            "sugarContent": "25.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2014-11-17T18:48:07.45Z",
                "reviewBody": "I have never had persimmons until a friend who had a tree brought me some.  I had no idea what to do with it.  I froze the pulp so I could investigate on what to do with this strange orange stuff!  This bread is fantastic!  It is super moist and tasty.  The spices are just right.  Only had one problem and that was getting out out of the bread loaf pans.  Doesn't matter if it's glass or metal pan.  I will try greasing them better next time and maybe even add a touch of flour to the bottom of the pan.  Regardless of a few pock marks on the bottom of my loaves, it is DELICIOUS!  ADDENDUM:  I solved the sticking on bottom of pan problem with parchment paper!  It worked great and I use it in glass, metal, or even the throw away foil pans.  I bring it up on the sides a touch, too.  The bread still browns nicely!  (If you use the fuyu persimmons, the stickiness is not a problem - I learned that this year 2014.)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LCLANCY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/593857/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-30T01:21:43.21Z",
                "reviewBody": "Hands down, best spice bread for the holidays. My husband and my father-in-law are not sweettooths and both do not like persimmon. However, my husband swears this is the only dessert bread he will eat and the first time I made this for my father-in-law, he kept pushing persimmons from his tree on me. My mother-in-law said she could eat a whole loaf on her own, and every time I've brought this bread over for a holiday gathering, it disappears.\nWith that said, here are a few cooking suggestions: instead of 3 cups white sugar I add 2.5 cups of brown sugar and instead of regular oil I add olive oil (healthier and brings out the spice). I love spices in my bread (everyone is different) so I add more nutmeg and cinnamon to taste. I also add ground cloves (I dont' know how much, I eye it and add to taste). Alternatively, you can add pumpkin spice. For a moister bread, add a bit more persimmon pulp. To prevent bread from sticking, I find it best to purchase those disposable aluminum foil pans and spray those with PAM cooking spray. I NEVER get sticking and this also prevents overcooking of the \"crust.\" Additionally, there's no pan clean up required. This recipe is extremely easy to make and is incredibly forgiving (can make a few subsitutions or mistakes and it still turns out decent).",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cakedice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2185760/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-01T21:41:44.39Z",
                "reviewBody": "After losing an older family recipie I came here to hunt for a close variation. This recipie is even better enjoyed by family and co-workers and is a definite hit with my year-old nephew. The bread is moist delicious and keeps for three or four days so it makes a wonderful gift idea. I have not tried freezing the bread so I can't say the flavor will change after defrosting. Another note- with only one bread pan I baked the remainder of the batter in a springform cake pan with cooking parchment on the bottom. The bread came out wonderfully and has the potential for all sorts of presentation ideas such as a multi-layered holiday cake or a component in a trifle.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SHIRATORI",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/218765/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-18T21:26:32.387Z",
                "reviewBody": "This is a good recipe and like all good recipes takes personalization well. As advised from other reviews I used 21/2cups of brown sugar (3 cups of white seemed like too much).I add 1/2tsp of ground cloves and 1/4tsp of ground ginger. I also added an extra 1/2 cup of persimmon and left out the water. Used 6 small loaf pans sprayed with Pam w/Flour and they came out great. A friend thought butterscotch chips in it would be good I was thinking cranberries.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CSBOSS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1173011/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-02-06T01:01:37.797Z",
                "reviewBody": "This bread is great! Iàm in Italy right now and persimmons (cachi or kaki) are in season right now and they are the best things EVER so I thought I would see what I could make with them! I found this recipe and have made it several times now. The only thing I change is the amount of sugar. 3 cups seemed like WAY too much cuz persimmons are so sweet to begin with! (You have to wait until they are almost rotten to eat them...that's when they are so sweet and juicy and delicious! yum!). Iàm guessing all the sugar was for if you use persimmons when they are not yet ripe...then I think they are quite bitter. But trust me...wait until they are cracking and ready to fall out of their skin. They are SO GOOD!!!! Thanks! (PS. I made this in a ciambellone pan...maybe the same as a bundt cake pan? instead of the smaller loaf pans. Great!)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SnooziQ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/865214/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-17T19:28:56.34Z",
                "reviewBody": "THe taste is good very similar to pumpkin bread. The problem is that its very stick and difficult to remove from pan. I'm thinking to try without adding additional water as the persimmons already have a high enough content.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "SROLLAS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/471420/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-22T21:40:27.27Z",
                "reviewBody": "Made this recipe many times. Tweak the ingredients - reduced sugar to 2 C brn sugar increase persimmon to 1 1/2 cup & eliminated the water added spices suggested by other reviewers i.e. 1/4 tsp allspice 1/4 tsp ginger (if I had these) & 1/2 cloves. Kept moist for several days. Not to sweet or mushy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sammye R",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4181834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T00:44:07.873Z",
                "reviewBody": "Everyone loves it just as long as you don't admit persimmons are in it. I wish it used more persimmons so I could use up our harvest quicker!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "POORARTISTS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/511391/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-14T00:44:10.53Z",
                "reviewBody": "This bread is so moist and flavorful! My husband and I can't stop eating it. I baked some of the batter in mini muffin tins and it worked great - easy to pop in your mouth!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Tammy",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/370227/"
                }
            }
        ]
    }
]