[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/691/meat-and-poultry/turkey/whole/",
                    "name": "Whole Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13464/homestyle-turkey-the-michigander-way/",
        "name": "Homestyle Turkey, the Michigander Way",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F10%2F12%2F4536913-homestyle-turkey-the-michigander-way-photo-by-bd.weld_-2000.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "1998-10-16T01:08:02.000Z",
        "description": "A simple, down to basics recipe when it comes to the good old tom turkey.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT5H0M",
        "totalTime": "P0DT5H10M",
        "recipeYield": "1 (12 pound) turkey",
        "recipeIngredient": [
            "1 (12 pound) whole turkey",
            "6 tablespoons butter, divided",
            "4 cups warm water",
            "3 tablespoons chicken bouillon",
            "2 tablespoons dried parsley",
            "2 tablespoons dried minced onion",
            "2 tablespoons seasoning salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C). Rinse and wash turkey. Discard the giblets, or add to pan if they are anyone's favorites.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place turkey in a Dutch oven or roasting pan. Separate the skin over the breast to make little pockets. Put 3 tablespoons of the butter on both sides between the skin and breast meat. This makes for very juicy breast meat.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, combine the water with the bouillon. Sprinkle in the parsley and minced onion. Pour over the top of the turkey. Sprinkle seasoning salt over the turkey.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cover with foil, and bake in the preheated oven 3 1/2 to 4 hours, until the internal temperature of the turkey reaches 180 degrees F (80 degrees C). For the last 45 minutes or so, remove the foil so the turkey will brown nicely.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Whole Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Robin C."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.82001614205004,
            "ratingCount": 2478,
            "itemReviewed": "Homestyle Turkey, the Michigander Way",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "545.2 calories",
            "carbohydrateContent": "0.9 g",
            "cholesterolContent": "209.8 mg",
            "fatContent": "27.9 g",
            "fiberContent": "0.1 g",
            "proteinContent": "68.1 g",
            "saturatedFatContent": "9.6 g",
            "servingSize": null,
            "sodiumContent": "560 mg",
            "sugarContent": "0.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-11-12T02:33:31.92Z",
                "reviewBody": "This was the best turkey I have ever made or eaten. I could not believe how moist and tender the breast was! My thanksgiving was made perfect with this delicious bird. Everyone asked how I did it, even my elderly aunt, who is the best cook ever, raved about it. I used about a stick and a half of butter under the skin. I buttered that bird good. I also rubbed the outside of the bird with butter before pouring the boullion mixture and before the seasoned salt. It was such a beautiful golden brown. I was so busy that day that I only got it basted a couple of times during cooking, but it couldn't have been any better or jucier. This was a 21 pound bird, and I cooked it for 1 hour at 375 degrees then reduced to 350 degrees for 5 more hours to reach 180 degrees. Perfect!!! Thanks a million Robin!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BMDSINGLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/36985/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-15T00:57:52.863Z",
                "reviewBody": "This is a wonderful recipe for beginners as well as the experienced cook.  I put this bird in the oven, went to the movies, came back to a moist succulent turkey. It's that easy. I put butter under the skin of the legs too (in total I use 1 cube for the entire bird). I also add black pepper to the seasoning. Every bite is moist!!  You can't go wrong!! Lots of wonderful pan juiced to make gravy with. Superfine flour called \"Wondera\" by Gold Medal is a must for new cooks. Your gravy will be lump free. Taste your gravy after you have thickened it to see if you need to add anymore salt and pepper. If too salty, just dilute with water and a little more flour...until it tastes good. Easy gravy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JANINE PERKINS",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/671975/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-19T21:33:47.907Z",
                "reviewBody": "We had an early Thanksgiving feast this year with family and at the last minute, my sister, who was supposed to bring the turkey, went to the hospital and I told her not to worry about a thing.  I have never cooked a turkey before and had no idea what I was doing!  I looked up \"turkey\" on this site and found this recipe.  I read some reviews and decided this was it.  I had a 23 pound turkey so I doubled the recipe and threw it in the roaster while it was still a bit frozen.  This was at 9:00pm the night before the feast.  Then I forgot about it, didn't even have time to baste it at all the next day.  We didn't wind up eating until after 1:00.  About 10 minutes before we ate, I took the tin foil off and prayed it was good.  Not only was it good, it was juicy and fell off the bone!!!  \nI think I should also say that when I read the recipe, I thought you had to cut the skin to get the butter on the meat itself, but my husband pointed out that the recipe did not say to \"cut\" the skin.  He got under the skin and pulled it from the meat really easily and I think that's what you're supposed to do.  I didn't know that, since this was my very first turkey.  My family requested that I \"volunteer\" to do the turkey from now on.  Thanks so much for posting this recipe!  Now I know how to cook a moist, delicious turkey!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Val",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2499129/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-03-27T08:44:56.077Z",
                "reviewBody": "This recipe turned out great!  I added 1 tsp. garlic powder to the water along with the bouillon, parsley and onion.  Put fresh rosemary under the breast skin with the butter.  Also placed a quartered lemon and quartered onion inside the cavity.  Used a 12 lb. bird as recommended and it was done in 3 hours.  Allowed it to rest 20 minutes before carving.  Be sure to spray the foil with cookong spray.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "NCHATIN1",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1386289/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-23T19:36:46.37Z",
                "reviewBody": "My Thanksgiving turkey was the BEST turkey I have ever tasted, and the family RAVED over it.  Before you place the butter under the skin, do this... take an entire stick of butter (or more depending on the size of your bird) and place it in a food processor or blender.  Blend in a handful of fresh rosemary, sage, and thyme.  Spread this mixture beneath the skin of the ENTIRE turkey.  If any butter is remaining, spread it over the top of the turkey.  Be liberal in your buttering of the turkey... it's worth it, and it's the holidays!! DO NOT add the parsley to the mixture you pour over the turkey... it makes a clumpy, ugly mess. Otherwise, this recipe is fantastic. It will make the juiciest, tastiest turkey ever, and the gravy you will make with the drippings will be like nothing you have ever tasted.  I also used the \"Out of This World Turkey Brine\" found on this site one day before roasting.  Then I used the \"Cranberry, Sausage, and Apple Stuffing\". Amazing.  I will cook every turkey this way from now on.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "VBHOKIE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/841865/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-26T02:16:43.31Z",
                "reviewBody": "If you customize this recipe for a larger turkey....DO NOT INCREASE THE SALT TO THE RECOMMENDED PORTION. Season it as you would to your personal taste.  I made this mistake and my gravy was sooooo salty. Big mistake!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "GORNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/829509/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T12:57:02.53Z",
                "reviewBody": "I had never cooked a turkey before, and decided to try this recipe when I made Thanksgiving dinner for 28 people!  EVERYONE loved it, and some even said it was the best they'd ever had!  I've used it every year since.  Using a cooking bag really helps to seal in the flavor, making the meat very moist.  I also like to make a butter mixture with garlic salt, and use that to make the breast meat juicy and flavorful.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CARISSA650",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/729940/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-12T12:54:25.03Z",
                "reviewBody": "I cannot believe I forgot to rate this.  I made this for Thanksgiving.  My second time ever making turkey.  THIS is BY FAR The BEST turkey I have ever had.  All anyone could say is how great it was. It actually was not dry and had flavor.  I put a little more butter than it called for under the skin and rubbed butter over the top.  And basted as prescribed.  AWESOME the ONLY turkey recipe we will ever use.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DYLNIC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/587472/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-19T17:23:49.53Z",
                "reviewBody": "I don't eat turkey, but coooked this for the big family Thanksgiving dinner.  Everyone loved this, even my mainly vegetarian niece who tried a little bit.  My sister said the meat was so tender it melted in her mouth and hubby was able to use the cooking liquid to make a killer gravy!  Instead of dried minced onion, I threw in some freshly minced shallots and garlic then stuffed it with the Awesome Sausage, Apple and Cranberry stuffing.  What a perfect pair!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SIERRAMUM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/207548/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-08-19T23:16:52.733Z",
                "reviewBody": "The turkey in this recipe definitely comes out moist with good flavour. However I like a nice rich gravy and all the chicken stock watered it down too much. I had to doctor the gravy with seasonings and browning sauce. Next time I might try less stock and add it a little at a time to allow the juice in the bottom of the pan time to brown.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "ruthanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1801604/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Homestyle Turkey the Michigander Way",
            "description": "Even beginning cooks can make perfect turkey every time. We’ll show you how!",
            "uploadDate": "2013-08-01T15:45:09.881Z",
            "duration": "PT2M32.069S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fd1b52561-bd9a-4a3f-a3ba-ab653d00bbe2%2F5cf05fca-d386-49d2-ac84-4c71fc8438dd%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2579232878001"
        }
    }
]