[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15142/desserts/pies/no-bake-pies/",
                    "name": "No-Bake Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12448/french-silk-chocolate-pie-i/",
        "name": "French Silk Chocolate Pie I",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F11%2F04%2Fimage-454.jpg",
            "width": 1280,
            "height": 720
        },
        "datePublished": "1998-10-19T06:08:45.000Z",
        "description": "This pie is delicious. I have been making it for over 25 years. Garnish each slice with whipped topping and chopped walnuts if you like.",
        "prepTime": "P0DT0H20M",
        "cookTime": null,
        "totalTime": "P0DT2H20M",
        "recipeYield": "1 8-inch pie",
        "recipeIngredient": [
            "½ cup butter, room temperature",
            "¾ cup white sugar",
            "2 (1 ounce) squares unsweetened baking chocolate, melted and cooled",
            "1 teaspoon vanilla extract",
            "2 eggs",
            "1 prepared 8 inch pastry shell, baked and cooled"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cream butter in a mixing bowl. Gradually beat in the sugar with an electric mixer until light colored and well blended. Stir in the thoroughly cooled chocolate, and vanilla extract. Add the eggs, one at a time, beating 5 minutes on medium speed after each addition. Spoon the chocolate filling into a cooled, baked pie shell.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Refrigerate at least 2 hours before serving.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "No-Bake Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Ruth"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.3638025594149905,
            "ratingCount": 547,
            "itemReviewed": "French Silk Chocolate Pie I",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "293.7 calories",
            "carbohydrateContent": "27.3 g",
            "cholesterolContent": "77 mg",
            "fatContent": "20.6 g",
            "fiberContent": "1.3 g",
            "proteinContent": "3.2 g",
            "saturatedFatContent": "10.6 g",
            "servingSize": null,
            "sodiumContent": "182.7 mg",
            "sugarContent": "19 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-02-13T23:23:13.747Z",
                "reviewBody": "The first recipe for French silk pie is incomplete, that is why there is not enough filling for a full pie. After you cream the ingredients listed you are supposed to whip the whites of the two eggs used into a merange type consistancy using 1/4 c sugar to help form stiff peaks.  Then you are supposed to add the chocolate mixture to the egg white mixture which will give you plenty of filling for your pie with a taste that is heavenly and is so light and fluffy. The way French silk pie is supposed to be. This is a great recipe that is fast and easy to prepare and is a crowd pleaser every time. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Barb",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2807348/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-03-22T20:33:49.953Z",
                "reviewBody": "The trick to getting a silky, not soupy and grainy filling is to beat it on HIGH speed for at least 3 minutes per egg WITH THE WISK ATTACHMENT, NOT THE PADDLE IF YOU USE A STAND MIXER!!! I used the paddle first for the butter etc. and then switched to the wisk.  Beating for any length of time on a lower speed won't work. I used 4 Tablespoons of cocoa powder instead of going through the trouble of melting and cooling chocolate.  Also only used 1/2 cup sugar.  I also added 1/4 cup malt powder to the butter mixture before adding the eggs for a French silk malted pie.  Superb!!!!  Double the recipe and the alterations above for a standard premade oreo crust. Thanks for recipe. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gloria Rice",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/779899/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-24T20:30:23.53Z",
                "reviewBody": "1 inch of filling does not a pie make! I gave the recipe 3 stars. The taste and texture are incredible BUT there isn't enough filling for a standard 9 inch pie shell. The filling needs to be doubled everything else is perfect ingredients method and results are to die for but the pie looked cheap because the shell wasn't full enough. After it has set overnight garnish with whipped whipping cream sweetening it is not necessary with this pie and chocolate curls",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "melis",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-01-03T15:50:12.593Z",
                "reviewBody": " Yes, this pie is \"thin\" on the filling as one reviewer commented, but because it is dense and very rich, and I always top this with sweetened whipped cream and garnish with chocolate curls which builds it up. Serve in small portions. It is delicious! ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-03-16T22:08:48.58Z",
                "reviewBody": "\"Mom next Wednesday is pi day and we have to make a pie for math class!\" my daughter told me last week. \"My teacher's favorite pie is French Silk and I told him we would make one.\" I sadly told her I had never made one before but we could look up a recipe and try it over the weekend. This recipe for French Silk Chocolate Pie looked like a winner! I noticed the recommendations to double the filling picked up the ingredients and we began baking. This was my daughter's first experience at rolling pie dough and at holding the mixer for the full five minutes after each egg. Our two trial pies on the weekend turned out delicious! I took one to share with my fellow teachers and froze a piece for my son in college. Then on Tuesday night we began to make the pie for pi day at school. In the middle of the preparations (while waiting for the chocolate to cool) I realized I had only one teaspoon of vanilla not two! What to do? I looked through my cabinets and found almond extract. I thought with the chocolate it probably wouldn't even be tasted. The pie was made and in the refrigerator ready for the final whipped cream topping in the morning. I licked off a little filling from my spatula and just rolled my eyes. That little bit of almond extract was wonderful in that filling! I wished I had made the first two that way! Well the pie was a hit at school; everyone loved it and the pie pan came home empty.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mom",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2317380/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-09-17T18:29:04.28Z",
                "reviewBody": "OMG this thing was awesome and OH SO EASY!  If you REALLY do what the recipe says you will have no problems at all.  It was so light, so fluffy and sooooo amazingly simple.  I will never by a pie in a box again.  (Not that I ever did, but if I know someone is about to I'll bring this myself since in my husband's family this is the pie of choice.)  First thing - melt the butter a bit.  It is important that the butter is room temperature, i.e. very soft.  Mine was quite soft and so when I whipped it, it whipped up quickly and easily.  I added the sugar very slowly and you could see the mixture turning white as the recipe said you wanted it to.  If it doesn't turn white you haven't whipped it enough!  Finally, add the eggs one by one.  As each egg was added, it did appear to thicken a bit.  But as the recommended five minutes elapsed it returned to fluffy and then got even fluffier.  Added the next egg and it was the same thing again with an even fluffier result in the end.  Only place I deviated was using a chocolate cookie crumb pie crust.  Added a layer of fresh whipped cream just before serving and we were all absolutely thrilled with this pie!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Lori",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2394066/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-30T21:20:15.2Z",
                "reviewBody": "I made this for Christmas dinner and it went over really well.  The key is to beat each egg for the full five minutes.  I started to worry that it would still be gritty, but after beating each egg the full five minutes it wasn't at all.  No leftovers at all!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "cardensaraid",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1050931/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-11-09T01:32:45.34Z",
                "reviewBody": "AWESOME!! I made this for a church function. By far the youngest lady, my pie had the most compliments. I made my own choc. cookie crust and topped with whipped cream. Next time I'll leave the whipped cream off--it confused the taste. The pie was WAY GOOD without it! I creamed ingred. for a very long time to achieve a very silky, no grit, texture. I also made it kid- and elder-friendly by using pasteurized Egg Beaters egg whites. A cowhand said that it was a little piece of heaven!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "LUVINSPOONFUL",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/623154/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-02-11T15:47:46.827Z",
                "reviewBody": "Going only on flavor this recipe is a five star pie. But flavor isn't everything. The proportions on this recipe are way off the mark. I doubled the recipe and still came up short. You would want 2.5 times these amounts to fill a 9 inch pie crust. Also I modified the recipe for sanitary reasons. After adding the raw eggs I slowly brought the batter to a boil over medium heat stirring it regularly. After removing it from the heat I mixed it again at medium speed. This modification gave me peace of mind that I'm not giving anyone food poisoning. The pie set well and had a perfect consistency... in the fridge. After being out for a few minutes it became tasty chocolate soup in a pie shell. I know some of this is the trade-off for cooking the egg whites but I seriously doubt the raw egg pie would last two hours on the buffet table either. This pie needs to be kept cold.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Sarah",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2618420/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "French Silk Chocolate Pie I",
            "description": "See how to make an amazingly simple, silky chocolate pie.",
            "uploadDate": "2012-10-08T19:19:26.650Z",
            "duration": "PT2M35.947S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Faec96675-eec1-441f-959e-acc019105545%2F7596c905-8ca8-41b4-a4e3-aba9def3ef45%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1886387697001"
        }
    }
]