[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/92/meat-and-poultry/",
                    "name": "Meat and Poultry",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/206/meat-and-poultry/turkey/",
                    "name": "Turkey",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/691/meat-and-poultry/turkey/whole/",
                    "name": "Whole Turkey Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13675/maple-roast-turkey/",
        "name": "Maple Roast Turkey",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4209891.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1998-11-08T23:53:39.000Z",
        "description": "This is the perfect turkey. The maple adds a sweet flavor that is just divine. A family favorite! Substitute 2 teaspoons dried marjoram if fresh marjoram is not available.",
        "prepTime": "P0DT1H0M",
        "cookTime": "P0DT3H30M",
        "totalTime": "P0DT6H30M",
        "recipeYield": "12 servings",
        "recipeIngredient": [
            "2 cups apple cider",
            "⅓ cup real maple syrup",
            "2 ½ tablespoons chopped fresh thyme",
            "2 tablespoons chopped fresh marjoram",
            "1 ½ teaspoons grated lemon zest",
            "¾ cup butter, softened",
            "salt and pepper to taste",
            "1 (12 pound) whole turkey, neck and giblets reserved",
            "2 cups chopped onion",
            "1 ½ cups chopped celery",
            "1 ½ cups chopped carrots",
            "3 cups chicken broth",
            "¼ cup all-purpose flour",
            "1 bay leaf",
            "½ cup apple brandy"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Combine apple cider and maple syrup in a saucepan, and bring to a boil over medium-high heat. Continue cooking until reduced to 1/2 cup, then remove pan from heat. Stir in 1 tablespoon thyme, 1 tablespoon marjoram, and lemon zest. Stir in butter until melted, and season with salt and pepper. Cover, and refrigerate until cold.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 375 degrees F (190 degrees C). Place rack in lower third of oven.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Place turkey on a rack set in a  roasting pan. Reserve 1/4 cup maple butter for gravy, and rub the remaining maple butter under the skin of the breast and over the outside of turkey. Arrange onion, celery, carrots turkey neck and giblets around the turkey. Sprinkle 1 tablespoon thyme and 1 tablespoon marjoram over vegetables. Pour 2 cups broth into pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Roast turkey for 30 minutes in the preheated oven. Reduce oven temperature to 350 degrees F (175 degrees C). Cover entire turkey loosely with foil. Continue roasting for about 2 1/2 hours, or until a meat thermometer inserted into thickest part of thigh registers 180 degrees F (85 degrees C). Transfer turkey to platter, and let stand 30 minutes.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Strain the pan juices into a large measuring cup, and then remove any excess fat.  Add enough chicken broth to pan juices to measure 3 cups. Transfer liquid to a saucepan, and bring to boil. In a small bowl, mix 1/4 cup maple butter and 1/3 cup flour until smooth. Whisk flour and butter mixture into broth mixture. Stir in remaining thyme and the bay leaf. Boil until reduced to sauce consistency, stirring occasionally, about 10 minutes. Mix in apple brandy, if desired. Season with salt and pepper to taste.\n"
            }
        ],
        "recipeCategory": [
            "Meat and Poultry",
            "Turkey",
            "Whole Turkey Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Christine L."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.684931506849315,
            "ratingCount": 146,
            "itemReviewed": "Maple Roast Turkey",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "871.6 calories",
            "carbohydrateContent": "21.2 g",
            "cholesterolContent": "295 mg",
            "fatContent": "43.1 g",
            "fiberContent": "1.3 g",
            "proteinContent": "91.6 g",
            "saturatedFatContent": "16.5 g",
            "servingSize": null,
            "sodiumContent": "330.9 mg",
            "sugarContent": "15.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-17T17:58:20.437Z",
                "reviewBody": "I used this recipe this year for my first Thanksgiving dinner ever.  As you can imagine, I was pretty nervous!  The turkey turned out wonderfully.  I do have a few pointers for any novices out there like me - definitely make the Maple herb butter the night before to make the next day that much easier, \"marjoram\" is a plant and I went to the grocery store and found it in the spices and used that (it worked great).  Also, when you first place the turkey in the oven on 375 for 30 minutes, make sure to keep an eye on it.  The baste cooked very quickly on top of the skin and burnt, I just wasn't paying attention.  It didn't matter at all since you cut the skin off before you serve it anyway, but if you are concerned about presentation then keep an eye on it.  I do HIGHLY recommend using the gravy recipe included, the flavor was incredible and tastes great on the leftover sandwiches as a spread!!  The entire process was pretty simple and easy to follow, and the end result was that I may be doing Thanksgiving for everyone for the rest of my life!!!\r\nThanks so much, Lipo!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BOBERTO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725165/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-25T18:23:29.857Z",
                "reviewBody": "We made this yesterday and received a lot of compliments. It was fairly simple to prepare and the house smelled wonderful. The butter took longer to make than I estimated; I'm glad we made it in advance as suggested. I prepared half the gravy with the brandy and half without... everyone preferred the gravy without the brandy. The brandy was the most expensive part of the meal ($29.00 for a pint) and the most difficult ingredient to locate. If we make this again, we will not use the brandy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "BONSTEAD",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1295372/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-01-02T22:08:36.173Z",
                "reviewBody": "Great tasting and juicy turkey.  This is the best turkey I've ever made.  I will definitely make this again next year.  Next time I will boil the cider vinegar and maple mixture longer.  I don't think I reduced the mixture as it was intended because when it cooled, there was liquid beneath the butter. This made it too tangy to use for the gravy, but that did not affect the flavor of the turkey itself.  This was such a good recipe, I couldn't even mess it up! *Actually, I did mess it up!! I mistakenly used apple cider vineger instead of apple cider and it still turned out great.  I was wondering why the gravy was so tangy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mae Jane DeGuzman",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/514643/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-11-25T06:29:01.967Z",
                "reviewBody": "I am roasting with this recipe as I type this the bird just went in the oven. One note: The two cups of broth are not listed in the ingredient list. It jumped up and bit me in the butt when I reached that part of the process! I luckily had a can in the pantry. Now we sit and baste and wait!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DAVID516",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/211880/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-19T05:41:06.45Z",
                "reviewBody": "This is the one recipe I always come back to no matter what else I find.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BARBARA_LUSHER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/690230/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-11-30T17:56:43.717Z",
                "reviewBody": "I made this turkey for Thansgiving - it wasn't very good! I followed the directions - I even marinated the turkey overnight. The meat was FLAVORLESS!! The skin browns extremely fast and was also pretty flavorless. The only saving grace were the vegetables which absorbed most of the maple & herb - and tasted great. I've found that you need to put SOMETHING inside the turkey for the meat to have ANY sort of flavor. Perhaps if you stuff the turkey with carrots celery and onion in addition to having it on the side - there would be more flavor. I won't be making this turkey again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "DKNJ30",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1149228/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-04-27T14:16:33.437Z",
                "reviewBody": "I scaled this recipe down for a brined turkey breast and made the maple butter as directed using all of the mixture at once. Basted often and after 1.5 hours at 350 the turkey was perfect. I didn't make the gravy as stated; instead I took the easy route and just added the pan juices to a dry gravy mix. By doing so the gravy wasn't too sweet but a hint of maple could be detected and the fresh thyme was a nice change from the more traditional sage -- very good over mashed potatoes. Since this was a successful test run I'll try this method on a larger gobble next time. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicolette",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1533638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-15T19:00:22.653Z",
                "reviewBody": "This was a hit at our Thanksgiving dinner! The gravy that is made from the Maple Butter is wonderful and the turkey was not dry at all. Was very moist and delicious. I used the Oven Bag as suggested by one reviewer but still had to cover the turkey with foil after about 2 hours of cooking. The vegetables went into my turkey soup the next day. I will definitely be making this again. Thanks Christine for sharing this wonderful recipe with everyone!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MINASMOM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1156834/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-27T04:06:00.17Z",
                "reviewBody": "It is now Thanksgiving 2014 and I am still making this recipe. I make it every year. I have it down now to where I make the butter on the weekend and dress the Turkey on Monday night and let it marinate. DELICIOUS!!! Everyone loves it!! I made this recipe for the first time in 2001. It was delicious then and requested every year since!! This turkey is always a hit and leftovers make fabulous turkey soup..very flavorful! I usually vary the herbs a bit(fresh sage tarragon oregano parsley thyme and a little cilantro).One of the things I love is that while the reduction is reducing I can prep the other foods on the menu. I usually make it accompanied by Green beans with crimini mushrooms and shallots recipe I got from food and wine Thanksgiving 2001 and cranberry sauce. This year I tried Killer Cranberry sauce I found on A/R. What a meal!!! Also...McCormick and Schmick's deep dish apple pie recipe is amazing!!! Happy Eating!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ANNLAGO",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/541975/"
                }
            }
        ]
    }
]