[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/367/desserts/pies/",
                    "name": "Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/808/desserts/pies/fruit-pies/",
                    "name": "Fruit Pies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/12954/desserts/pies/fruit-pies/strawberry-pie/",
                    "name": "Strawberry Pie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/12468/old-fashioned-strawberry-pie/",
        "name": "Old Fashioned Strawberry Pie",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5206296.jpg",
            "width": 3648,
            "height": 2736
        },
        "datePublished": "1998-11-16T02:45:58.000Z",
        "description": "This is a two crust strawberry pie that has a thick juice.  Any fresh berries can be substituted.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 inch pie",
        "recipeIngredient": [
            "2 (9 inch)  unbaked pie crusts",
            "1 ¼ cups white sugar",
            "⅓ cup all-purpose flour",
            "½ teaspoon ground cinnamon",
            "4 cups fresh strawberries",
            "2 tablespoons butter"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).  Place one crust in a nine inch pie pan.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Mix together sugar, flour, and cinnamon.  Mix lightly through the berries.  Pour filling into pastry lined pan, and dot fruit with butter or margarine.  Cover with top crust, and cut slits in the top.  Seal and flute the edges.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 35 to 45 minutes, or until the crust is slightly browned.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Pies",
            "Fruit Pies",
            "Strawberry Pie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Cindy  B."
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.317073170731708,
            "ratingCount": 287,
            "itemReviewed": "Old Fashioned Strawberry Pie",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "412.1 calories",
            "carbohydrateContent": "62.7 g",
            "cholesterolContent": "7.6 mg",
            "fatContent": "17.3 g",
            "fiberContent": "2.2 g",
            "proteinContent": "3 g",
            "saturatedFatContent": "4 g",
            "servingSize": null,
            "sodiumContent": "300.7 mg",
            "sugarContent": "35 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-06-15T16:38:47.29Z",
                "reviewBody": "There are so many reviews on this pie, and unfortunately there ae a few that are not praises.  This pie, as with anything that a good cook knows, must have a little personal tweek if you are that kind of a cook, but I have been not only professionally trained, but I am a very good cook and I will tell you this basic recipe is unbelievably good and shockingly easy and above all it will bring you praise.  I followed the recipe--I was busy and lazy, but it still brought me rave reviews.  Sweetness is personal.....think about your berries and taste them, then decide.  Think about other pies you have made and what thickener do you like the best.  If it is tapioca, use it in the proportions you are used too, if it is flour use the flour, but if you want to make sure a pie is thick then add a tad more.  If you make the pie and you had problems then you must realize it may not be the recipes fault, but your own for now thinking things out.\n\nThis pie is excellent as it stands....the taste is sweet, it is not too thick of a mixture around the berries when finished and couple those things with a very good crust and people will shout praise.  Try the milk on the crust route sprinkled with sugar and it will put the Sunday clothes on the pie.....thicken with tapioca if you want a clearer thicker, more stable pie.......and if you want that great taste and sight is secondary to taste then you are find to head on and serve your family the pie as it is written.\n\nRemember there are few simple p",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Frank",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2125883/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-25T22:59:17.17Z",
                "reviewBody": "This pie turned out beautiful! I used frozen strawberries instead of fresh and also added 3 tablespoons of cornstarch to thicken the recipe. I cut the sugar down to 3/4 cup as some recommended; i'd actually prefer it a bit sweeter cuz my berries turned out to be tart. For sweet fresh berries 3/4 cup of sugar is probably fine tho. I brushed the top crust with half&half and sprinkled it with sugar so it turned a shiny golden brown. This is a very good pie... i would make it again!:D",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WarringEagle",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-05-07T00:43:42.613Z",
                "reviewBody": "Turning out a perfect fruit pie is always a gamble. Measurements in a recipe can never be precise as there are just too many variables, like juiciness or sweetness of the berries, or an individual's preference for either. Having said that, I can only speak of what worked for me. I like a thicker pie, so I used 2 qts. of strawberries, which measured out to 5-1/2 c. sliced. I mixed up 1/3 c. flour, 1 T. cornstarch, a little better than 1 c. sugar and a mere 1/4 tsp. cinnamon (didn't want the cinnamon flavor to distract). I let this sit for 15 minutes before turning out into the pie shell so the berries could release their juices. I baked the pie at 375 degrees for 25 minutes, then covered the edges of the crust with aluminum foil and baked for another 25 minutes, until the crust was golden and the juices were bubbling and thick. It wasn't until the pie was in the oven that I realized I forgot to dot the berries with butter, even though I had it sitting right out in front of me! But you know what? It wasn't even missed! This pie was so good I can't imagine how it could have been better had I remembered the butter. For those who experienced a too juicy pie, I'm thinking that either the pie wasn't baked long enough for the flour and/or cornstarch to do its work, or they cut into the pie before it was thoroughly cooled. ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-12T22:12:00.713Z",
                "reviewBody": "Total deliciousness.  I took the best comments from other reviewers and tweaked it this way: only one cup sugar (I tasted the strawberries first!  critical step!), and I left out the cinnamon entirely, and added almost half a cup flour, not just 1/3.  With the sugar and flour tossed around the fresh strawberries, it made the most delicious sauce inside, and just the right texture!  Another tip: to make sure the inside was totally done, I did what my mom taught me to do with apple pie.  High heat, as the recipe says, for 1/2 hour, then turned it down to 350 for another 20 minutes.  It really cooks the fruit down nicely, the top crust is browned but not burned, and the bottom crust is fully cooked and flaky!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2073440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-06-20T12:34:36.75Z",
                "reviewBody": "I was impressed with this pie. Reduced the sugar to 1 cup and added 1/4 cup cornstarch to thicken the juices up. I'd add less cinnamon-a little overpowering. Overall, very good!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Jenn",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1591440/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-29T23:52:25.48Z",
                "reviewBody": "After reading the reviews I was expecting a TERREFIC pie. Boy was I disappointed. It was runny. I stopped baking at 35 minutes when the top was beautiful and golden brown--and there were some bubbles coming out the vents. But the juice didn't thicken--it was runny and floury. Also plan to eat this pie all in one day because the next day the strawberries were pale and mushy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "LOUISE CANADA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/395849/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-04-06T12:28:21.303Z",
                "reviewBody": "I wish I could give this recipe 5 stars but the juice was indeed juicy. It did thicken up after sitting overnight but it's still quite runny. I should have followed other reviewers' advice and added a couple tablspoons cornstarch. The reason I would love to give it 5 stars is the flavor--yum yum yummy!! It was delicious!! This will be my strawberry pie recipe but I'm going to add cornstarch (and maybe extra flour) from now on. Thanks!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "pennywham",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/896033/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-04-16T20:01:54.39Z",
                "reviewBody": "I made this recipe for company and had never tried it before so I was a little worried but it came out absolutely wonderful. Changes I made:added a bit more cinnamon only 3/4 cup sugar and 2 tblsps of tapioca for thickening (which is in addition to the flour). Everyone asked for the recipe so it was definitely a hit. PERFECT",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gail Trocki Huntington",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1327403/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-21T01:39:56.033Z",
                "reviewBody": "I agree that you need to modify this recipe to make it work but with some changes it is a delicious pie. Per several suggestions here I decreased the cinnamon to 1/4 teaspoon and added 1/4 C cornstarch. Also depending on the sweetness of the strawberries you might want to decrease the sugar to 3/4 or 1 C.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Laura M.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2470067/"
                }
            }
        ]
    }
]