[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/81/side-dish/",
                    "name": "Side Dish",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17290/side-dish/stuffing-and-dressing/",
                    "name": "Stuffing and Dressing Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/16173/side-dish/stuffing-and-dressing/sausage-stuffing-and-dressing/",
                    "name": "Sausage Stuffing and Dressing Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/13651/awesome-sausage-apple-and-cranberry-stuffing/",
        "name": "Awesome Sausage, Apple and Cranberry Stuffing",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F764614.jpg",
            "width": 5616,
            "height": 3744
        },
        "datePublished": "1998-11-18T21:32:38.000Z",
        "description": "This Thanksgiving stuffing is fantastic! It is very flavorful and fresh-tasting. This recipe will stuff a 10-pound turkey (which serves six) plus extra. I replaced the usual pork sausage with much healthier turkey sausage. Other dried fruits may also be used in place of cranberries.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H25M",
        "totalTime": "P0DT1H40M",
        "recipeYield": "10 servings",
        "recipeIngredient": [
            "1 ½ cups cubed whole wheat bread",
            "3 ¾ cups cubed white bread",
            "1 pound ground turkey sausage",
            "1 cup chopped onion",
            "¾ cup chopped celery",
            "2 ½ teaspoons dried sage",
            "1 ½ teaspoons dried rosemary",
            "½ teaspoon dried thyme",
            "1 Golden Delicious apple, cored and chopped",
            "¾ cup dried cranberries",
            "⅓ cup minced fresh parsley",
            "1 cooked turkey liver, finely chopped",
            "¾ cup turkey stock",
            "4 tablespoons unsalted butter, melted"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degree F (175 degree C). Spread the white and whole wheat bread cubes in a single layer on a large baking sheet. Bake for 5 to 7 minutes in the preheated oven, or until evenly toasted. Transfer toasted bread cubes to a large bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large skillet, cook the sausage and onions over medium heat, stirring and breaking up the lumps until evenly browned. Add the celery, sage, rosemary, and thyme; cook, stirring, for 2 minutes to blend flavors.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour sausage mixture over bread in bowl. Mix in chopped apple, dried cranberries, parsley, and liver. Drizzle with turkey stock and melted butter, and mix lightly.  Allow stuffing to cool completely before loosely stuffing a turkey.\n"
            }
        ],
        "recipeCategory": [
            "Side Dish",
            "Stuffing and Dressing Recipes",
            "Sausage Stuffing and Dressing Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Stacy M. Polcyn"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.771908017402113,
            "ratingCount": 3218,
            "itemReviewed": "Awesome Sausage, Apple and Cranberry Stuffing",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "235.5 calories",
            "carbohydrateContent": "21.7 g",
            "cholesterolContent": "80.2 mg",
            "fatContent": "11.6 g",
            "fiberContent": "2.1 g",
            "proteinContent": "12.5 g",
            "saturatedFatContent": "5 g",
            "servingSize": null,
            "sodiumContent": "547.5 mg",
            "sugarContent": "8.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-21T20:04:06.733Z",
                "reviewBody": "I've been making this recipe for a few years now, and since I started, it's demanded of me at every family get together. Like “Mommy of Four” I keep the dressing outside the turkey, and so compensate with extra broth.  Make sure to spray your pan and keep it covered with foil! I’ve found that stirring it after it’s baked for 30 minutes or so, helps it bake more evenly. The only other changes I make are to throw in a little chardonnay for flavor and to add an egg for a little extra hold. I've also found that sage pork sausage is much more flavorful (make sure to drain it after cooking however). I have a habit of not measuring, so more cranberries and herbs always find their way in. And I cannot emphasize the difference FRESH herbs make. Experiment with different kinds of bread as well! Sourdough and potato bread have yielded delicious results.  I've had a few flavor variations, but every result was just as tasty as the last. This is my favorite recipe from this site.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "StephanieM",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/778930/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-20T15:19:18.64Z",
                "reviewBody": "I love this recipe and have made it for a couple of years now.  I use cubed day-old Italian Ciabatta bread and omit the giblets (I use the giblets to flavor my basting liquids for my gravy) and it is simply wonderful. I prepare this stuffing one day in advance w/o baking it (although fully cook the sausage, of course).  Since I stuff my bird with other things (like onion, garlic, rosemary, lemon and orange), I make this the night before, very lightly grease a casserole dish, drizzle a very small amount of butter (just a bit) on the top to keep it moist and RESERVE ALL THE LIQUIDS UNTIL READY TO BAKE, pop it in the fridge overnight.  The next day, add the liquids (broth and melted butter) - I usually add more broth since I will not be baking it in my turkey, it will need more broth (use your judgment depending on how much you are making), bring it to room temperature and then heat it through for about 35-45 minutes, ovens vary, so just make sure it is hot when ready to serve. It's a wonderfully delicious stuffing and the only one I will ever make. Thank you for sharing!   ",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Ciao Bella",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/657089/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-18T22:27:51.377Z",
                "reviewBody": "I've used this several times for Thanksgiving (this is our Thanksgiving Only Stuffing) & everyone LOVES it. Follow this recipe to the T & use fresh herbs (remember to double them) for a really delicious flavoring.  **I was just making my Thanksgiving list & thought I'd give some updated suggestions since I've been making this for 6 yrs. now.  1. I always use fresh herbs, the presentation, taste & aroma is wonderful! 2. I've tried different apples & have found that the granny smiths are the best, along with fuji & braeburn. 3. I can't always find turkey sausage links so one year I started using Turkey Kielbasa (I just chopped it up really fine with my food chopper) ~ outstanding! 4. I've made this w/ different types of bread. I really like the sourdough bread personally. I've found that somewhat stale baguettes are MUCH easier to work with, cause you can slice them up pretty easy w/o crust flying everywhere or w/o having to smoosh your sliced bread too much. (I usually cut the bread a few days before to let it get hard.)  5. I never stuff this in the turkey, I usually make it separately in a tray. I continuously check it because the turkey stock has dried out on me once before, which made for a nasty burnt stuffing. And one last thing, this isn't your typical mushy-glop that most people are used to, so if you don't think you'll like a dryer type of stuffing, then I'd suggest using LOTS of stock.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mommy of Five",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/704628/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-10T15:36:46.69Z",
                "reviewBody": "Awesome! I wanted to use fresh herbs as others suggested, but didn't know how much to use, so I looked it up. 2 1/2 tsp. dried sage = 5 tsp. fresh, 1 1/2 tsp. dried rosemary = 1 1/2 Tbl. fresh, and 1/2 tsp. dried thyme = 1 sprig fresh.  Perfect amounts!  I reversed the amount of whole wheat cubes and white cubes (i.e., used 1 1/2 cups white and 3 3/4 cups wheat) to make it more hearty & healthy. I used chicken broth instead of turkey stock, and left off the turkey liver (just a personal preference).  My butcher made me some turkey sausage by taking ground turkey and adding 'breakfast sausage' spices (loved it!). As others suggested, I added an egg and an extra 1 cup stock - definitely needed both those additions! I baked in 13x9x2 pan COVERED in foil for 40 minutes on 350, then 15 minutes UNCOVERED (instead of stuffing the turkey).  Perfect!  The next time I made this, I made my own seasoned turkey sausage: 1 pkg ground turkey + 1 tsp. ground sage + 1 tsp. salt + 1/2 tsp. black pepper + 1/8 tsp. marjoram + pinch of cloves - turned out fantastic!  Thanks so much for the recipe - this one's a definite keeper!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KRANEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/296701/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-13T13:39:53.887Z",
                "reviewBody": "I have to admit, I was very skeptical about this one.  It didn't seem as easy as many said and the combo of fruit and meat seemed too intense to paired with turkey. But, I tried it because of rave reviews.  \n\nI tried it and I add to the praise.  I will never make another stuffing again.\n\nEven if you don't cook often, this IS NOT HARD!  Make sure, as in all recipes, you have all your ingredients ready ahead of time. It's easy and the end product is sooo goood.  You'll be the hit of the meal!\n\nI took the advice of other reviewers, you should too to maximize this EXCELLENT stuffing!!  I'm sure if you followed the original, it would be great, too.\n\n1.  I used fresh herbs, double the amount if using fresh.\n\n2.  I used a combination of prepared stuffing bread. I liked the combination of cornbread, white, and wheat.   I added about a 1 1/2 cups more.\n\n3.  I couldn't find the Jimmy Dean's Sage Sausage as others suggested.  I will continue to look as I think it will enhance the flavors well.  Instead, I used regular flavor Jimmy Dean's pork sausage.  DO NOT SKIP THE SAUSAGE (unless you don't eat meat--in that case use a faux meat product and toss in some butter).  I thought the sausage might be too much, it was AWESOME in the recipe. It wasn't overwhelming at all! It made the recipe.\n\n4.  I substitued craisains for the cranberries.  I think I'll try a mixture of golden raisins and dried cranberries. The craisins though. I think I'd like the tartness of the cranberry to play off the sw",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vanityings",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2603441/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2015-11-29T14:48:59.187Z",
                "reviewBody": "This is a wonderful dressing.  I used pork sausage and substituted bought unseasoned cornbread dressing for the bread and used sweetened cranberries (craisins)and left out the liver.  I added the same spices and used more turkey stock.  It still came out a bit dry so next time I will use even more stock.  However, the taste and smell was fantastic.  This was my first time making dressing and boy did it turn out wonderful.  Instead of stuffing the turkey, I popped it in the oven at 350 for 1 hour and the color was fantastic.  Will definately make again.\n**Update 2015\nI've made this for years now on Thanksgving. Thought I would post what I do that my family absolutely loves and it makes a nice moist dressing. I use one bag (14 oz) of bought seasoned bread crumbs, one pound sage sausage, and all the same spices and ingredients as called for. I also have found that 3 cups of stock (whether turkey or chicken) makes the dressing just the way I like it. My husband requests this every single year.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "UTOPIA122",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/383138/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-11-16T16:57:08.247Z",
                "reviewBody": "This is the first review I've ever done.  This stuffing is absolutely DELICIOUS!!!!! You won't be sorry!  Prior to making it I read a lot of the reviews and created my own step by step recipe and trust me you will not go wrong if you follow this. Always use FRESH HERBS!  Since I am anal, here it is step by step: Ingredients: FRESH HERBS-5 teaspoons of sage, 1 1/2 tablespoons of rosemary, 1 sprig of thyme, 2 1/3 cups of parsley, 1 box of Jiffy Mix Cornbread, 5 1/4 cups of white & wheat bread (I just buy a bag of Pepperidge Farm Country Cube Stuffing), 1 lb. of Jimmy Dean Sage Pork Sausage, 1 cup chopped onion, 1 Egg (Beaten), 3/4 cup chopped celery, 1 Granny Smith or Golden Delicious apple (cored & chopped), 1 cup of Craisins (or more if you want), 4 tablespoons UNSALTED Butter, and 2 3/4 cups of Chicken broth or Turkey Stock. Directions: 1)Bake cornbread mix. 2)Chop/mince herbs.  3)In large skillet cook sausage over medium heat then DRAIN. 4)Add onions, celery, sage, rosemary, thyme, & parsley, cook & stir for 2 mins to blend flavors. 5)In bowl crumble cornbread (I use most of it) & add stuffing. Pour sausage mixture over it and mix in apples, craisins, & beaten egg. 6)Spray 9x13 pan and put stuffing in it, ightly drizzle w/butter, DO NOT ADD STOCK/BROTH, cover and refrigerate overnight.  7)The next day add stock/broth and butter, mix, cover and bake at 350 for 40 mins, uncover, stir, & bake for another 15 min.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "njk0407",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/12400418/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-13T12:37:32.543Z",
                "reviewBody": "This was my first attempt at homemade stuffing. Wow! Couldn't get any better. Everyone loved it. I did add more chicken stock since I didn't stuff it in the turkey. I put it in the oven on 350 deg. for 40 min then uncovered for 15 mins for perfection. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "nursejc",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1948717/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-16T19:42:32.733Z",
                "reviewBody": "I begin to crave this when Fall begins!  To make it easier, I use bagged dry cornbread stuffing, boxed or canned chicken stock, and add pecans into the mix.  I do not use the liver and it is fantastic! My all-time favorite stuffing recipe!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Jennifer Baker",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/jrbaker/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-11-24T17:36:31.407Z",
                "reviewBody": "Wow this is the first time i've given a poor review. With all the rave reviews I figured it would be a hit. I did a trial run 2 days prior due to I was going to make it for Thanksgiving. BOY am i sure glad i did. I followed the recipe almost to a T and something was off. Definitely way too much meat. Not enough bread. My mom and granddad who were two of my taste testing guinea pigs (and my granddad who'll eat just about anything..if he's hungry) both disliked it. My mom stated it wasnt too bad but could be eaten as a meal in itself with as much meat as there was in it. My grandad said the usual when he doesnt care for a dish but doesnt want to hurt the cooks feelings \"Its alright\". Maybe it is the fact that my family is so used to our traditional southern cornbread dressing but NO ONE liked it. I think i'm sticking with my family tested and approved recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "Jill C ",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/79shale97/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Awesome Sausage, Apple, and Cranberry Stuffing",
            "description": "This stuffing blends sausage, turkey liver, and fresh and dried fruit and vegetables.",
            "uploadDate": "2012-06-25T18:51:59.169Z",
            "duration": "PT6M30.265S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2Fb97c370f-ee87-486c-b1b3-89b4be1999fe%2Ff8a65df3-dd28-478c-9e4c-a3b910614613%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1706558825001"
        }
    }
]