[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/359/bread/quick-bread/fruit-bread/",
                    "name": "Fruit Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/343/bread/quick-bread/fruit-bread/banana-bread/",
                    "name": "Banana Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 7,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/17653/bread/quick-bread/fruit-bread/banana-bread/banana-nut-bread/",
                    "name": "Banana Nut Bread Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7024/banana-nut-bread-baked-in-a-jar/",
        "name": "Banana Nut Bread Baked in a Jar",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5110.jpg",
            "width": 2272,
            "height": 1504
        },
        "datePublished": "1998-12-02T18:08:15.000Z",
        "description": "This makes a great gift for friends and neighbors. Also great for Christmas Bazaar item. Decorate with pretty label and a circle of Christmas fabric under the jar ring. Using the same basic recipe you can substitute different fruits and vegetables to make other varieties.",
        "prepTime": "P0DT0H10M",
        "cookTime": "P0DT0H45M",
        "totalTime": "P0DT1H5M",
        "recipeYield": "8 (1 pint) jars",
        "recipeIngredient": [
            "⅔ cup shortening",
            "2 ⅔ cups white sugar",
            "4 eggs",
            "2 cups mashed bananas",
            "⅔ cup water",
            "3 ⅓ cups all-purpose flour",
            "½ teaspoon baking powder",
            "2 teaspoons baking soda",
            "1 ½ teaspoons salt",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground cloves",
            "⅔ cup chopped pecans"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 325 degrees F (165 degrees C). Grease insides of  8 (1 pint) straight sided, wide mouth canning jars.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, cream shortening and sugar until light and fluffy. Beat in eggs, bananas, and water. Sift together flour, baking powder, soda, salt, cinnamon, and cloves. Add to banana mixture. Stir in nuts.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Pour mixture into greased  WIDE MOUTH pint jars, filling 1/2 full of batter. Do NOT put lids on jars for baking. Be careful to keep the rims clean, wiping off any batter that gets on the rims.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake at 325 degrees F (165 degrees C) for 45 minutes. Meanwhile, sterilize the lids and rings in boiling water.\n"
            },
            {
                "@type": "HowToStep",
                "text": "As soon as cake is done, remove from oven one at a time, wipe rims of jars and put on lid and ring. Jars will seal as cakes cool. Place the jars on the counter and listen for them to \"ping\" as they seal. If you miss the \"ping\", wait until they are completely cool and press on the top of the lid. If it doesn't move at all, it's sealed.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Jars should be eaten immediately or kept sealed in refrigerator for up to a week.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Fruit Bread Recipes",
            "Banana Bread",
            "Banana Nut Bread Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Linda Jean"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.7709090909090905,
            "ratingCount": 275,
            "itemReviewed": "Banana Nut Bread Baked in a Jar",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "237.7 calories",
            "carbohydrateContent": "40.3 g",
            "cholesterolContent": "0 mg",
            "fatContent": "8.1 g",
            "fiberContent": "1.3 g",
            "proteinContent": "2.3 g",
            "saturatedFatContent": "1.7 g",
            "servingSize": null,
            "sodiumContent": "237.6 mg",
            "sugarContent": "24.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-18T23:43:13.427Z",
                "reviewBody": "Using this for teacher gifts.  Was planning on using my favorite recipe from the Fanny Farmer Baking Book for the bread, but noticed that the ingredients were almost identical so I used this one instead.  I omitted the cloves (don't like them much) and after reading from another reviewer that the bread had tasted a little too spicy.  Cut back a little on the cinnamon too.  I also used cooking spray to grease the inside of the jars.  After filling half-full I placed the jars directly on the rack (as another person suggested).  They came out perfect and the recipe is delicious!  If when taking them out of the oven you noticed that they've popped out of the jar a little you can carefully (with gloves of course) press the top of the bread down gently so that the sides are away from the seal.  I made sure that the rim was clean and even with them being quite full they all sealed perfectly.  Found the pint-size wide mouth jars by where I live for only 5.99 for a dozen at Big Lots.  Plan on decorating them with 7\" round pieces of material with ribbons and will print out gift tags to attach with a note to heat for less than 30 seconds in the microwave so they will slide right out and be ready for slicing.  Will definitely make them again, plan on buying more mason jars and storing them for holiday baking!  Hope this review helps...all the others did for me as well!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "ITSLAURAF623",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/844508/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-19T04:26:13.89Z",
                "reviewBody": "I've made these 5 times!  Very moist but the real key is to NOT bake them on a baking sheet.  Carefully put the jars directly on the oven rack for more even baking.  Baking on the sheet causes the middle to be not cooked with the top being too cooked!  I got so many compliments from everyone I gave these as a gift to!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSANEST",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/583361/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T21:56:03.247Z",
                "reviewBody": "I just made these with 8 ounce Jelly jars and they turned out perfect filling with 1/2 cup of batter. I will put these jars in inexpensive mugs with a packet of hot cocoa mix. wrap with cellophane and ribbon for a cute little gift. Thanks for the recipe and gift idea!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gwen Langham Howell",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/725394/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-25T23:51:16.497Z",
                "reviewBody": "Fantastic!! This was my first time making banana bread and it turned out wonderful. My husband, who is a banana bread conniseur, said it was the best he's ever had. I found the jars at Wal-Mart, since I know a few of you were having trouble finding them. I also reduced the cloves from 1 1/2 tsp to 1 tsp. Like another reviewer, I scaled the recipe to make 12 jars. As an experiment, I cooked 6 jars at a time, the first time with a cookie sheet, the second time without. The bread cooked with the cookie sheet turned out just fine, however, the ones cooked without the sheet look more golden brown on the outside (the others were darker). Also, HELPFUL HINT!!, I figured out a super easy way to get the batter into the jars: pour the batter into a heavy gallon freezer bag and cut a small hole in the corner of the bag. This way, you can pipe the batter right into the jars. No mess! Thanks, this recipe is great. Can't wait for gift-giving this year! Next time I'll try pumpkin.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "WHITEYBEAR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/911776/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-10-18T23:52:09.467Z",
                "reviewBody": "Very, very impressed with this method. Used the recipe \"pumpkin bread\" from this website and made two jars as an experiment and two loaves with the batter. In heaven from eating some still warm slides after dinner! It was very easy to pipe batter into the jar with a gallon size bag with a hole cut in the corner. I used 1 cup of batter in each jar and it cooked perfectly up to the top without going over in about 45 minutes. After about 10 minutes being sealed I heard the \"ping/pop\" noise that it's supposed to make. Haven't tried getting it out of the jars yet, but it doesn't look like it'll be a problem. What a fun idea, thank you! I will definitely make the banana bread and give these out for the holidays.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Anne Conover",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1562507/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T21:58:47.013Z",
                "reviewBody": "This bread was very good. I will be taking it to a party in a couple of days but I had to try one for myself first. One problem that I encountered was that not all of them cooked all the way due to where they were situated in the oven. Next time I'll make certain to rotate them at the half way point. Aside from that they were very good and easy to make!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MSJAMILLE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/624083/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T21:53:30.263Z",
                "reviewBody": "You can make this with 2 cups of any fruit that you like. Just be sure not to exceed 2 cups of fruit if you plan to make it in the jars. I have always made it with pumpkin puree. I double the cinnamon when I use pumpkin. I've also used applesauce, but the pumpkin is my favorite. I make this every year for gifts. I originally made it in the jars, but when it got to where I was making 24-36 each year, it was too time consuming. So now I make it in mini-loaf pans and wrap them in colored Saran wrap. Everyone looks forward to receiving them each year!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "CYNDI!",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247455/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-02-22T15:29:23Z",
                "reviewBody": "I made this recipe and it was FANTASTIC! I got rave reviews by all who tasted it and was asked several times to make more. I greased the insides of the jars with shortening,filled them half way up and they baked right to the top perfectly. The only change I made was that I used cinnamon pecans. The bread slides right out of the jar when cooled. Oh so easy, oh so good. Will be baking more of these again soon. Oh, and I have read about baking in jars. Some places claim you can keep them as long as normal jarred items (like months and years!). This is incorrect. You must eat just as  Linda states, within a week. Fun gift and presentation. Thanks for sharing Linda!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JOLARA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/782961/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-26T21:57:00.95Z",
                "reviewBody": "The only change I made is I only used 1/4 teaspoon of cloves because I am not a big fan of cloves. Yummy! My husband and I ate a whole jar of bread in one day! This is a WONDERFUL recipe for banana bread! I have made two batches so far to give away as gifts. I cut a 7 inch circle with pinking shears out of a fabric with Christmas designs. I unscrewed the jar ring (after completely sealed and cooled) and laid it on the lid and screwed the ring back on. A ribbon or raffia bow tied around the ring with a gift tag is all it needs to complete the presentation of the gift.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Adopt-K9",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/575387/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-12T01:25:36.467Z",
                "reviewBody": "I was impressed by all the wonderful reviews of this recipe. It did taste good but none of the jars sealed. I tried it twice! I followed the recipe exactly so I'm not sure what I did wrong. Since we can't use it as gifts I guess we'll have to eat all the jars ourselves!:)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "JENMCGOVERN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/753093/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "Banana Nut Bread Baked in a Jar",
            "description": "See how to bake banana bread in a canning jar.",
            "uploadDate": "2013-05-15T23:27:35.435Z",
            "duration": "PT4M34.608S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F01bd35e0-1c4d-4c1a-bd4e-29a06807929d%2F9e0ddc3d-10a0-425c-94f3-4d8fd342110b%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=2385004317001"
        }
    }
]