[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/86/world-cuisine/",
                    "name": "World Cuisine",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/231/world-cuisine/european/",
                    "name": "European",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/723/world-cuisine/european/italian/",
                    "name": "Italian",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11525/cinnamon-hazelnut-biscotti/",
        "name": "Cinnamon Hazelnut Biscotti",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F114892.jpg",
            "width": 1366,
            "height": 2048
        },
        "datePublished": "1998-12-08T18:01:52.000Z",
        "description": "These are delicious with coffee and they smell wonderful!",
        "prepTime": "P0DT0H25M",
        "cookTime": "P0DT0H40M",
        "totalTime": "P0DT1H35M",
        "recipeYield": "30 cookies",
        "recipeIngredient": [
            "¾ cup butter",
            "1 cup white sugar",
            "2 eggs",
            "1 ½ teaspoons vanilla extract",
            "2 ½ cups all-purpose flour",
            "1 teaspoon ground cinnamon",
            "¾ teaspoon baking powder",
            "½ teaspoon salt",
            "1 cup hazelnuts"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F(175 degrees C). Grease a cookie sheet or line with parchment paper.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a medium bowl, cream together butter and sugar until light and fluffy. Beat in  eggs and vanilla. Sift together the flour, cinnamon, baking powder, and salt; mix into the egg mixture. Stir in the hazelnuts. Shape dough into two equal logs approximately 12 inches long.  Place logs on baking sheet, and flatten out to about 1/2 inch thickness.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for about 30 minutes in preheated oven, or until edges are golden and the center is firm. Remove from oven to cool on the pans. When loaves are cool enough to handle, use a serrated knife to slice the loaves diagonally into 1/2 inch thick slices. Return the slices to the baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for an additional 10 minutes, turning over once. Cool completely, and store in an airtight container at room temperature.\n"
            }
        ],
        "recipeCategory": [
            "World Cuisine",
            "European",
            "Italian"
        ],
        "recipeCuisine": [
            "European",
            "Italian"
        ],
        "author": [
            {
                "@type": "Person",
                "name": "Kris"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6976744186046515,
            "ratingCount": 430,
            "itemReviewed": "Cinnamon Hazelnut Biscotti",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "138.3 calories",
            "carbohydrateContent": "15.5 g",
            "cholesterolContent": "24.6 mg",
            "fatContent": "7.8 g",
            "fiberContent": "0.8 g",
            "proteinContent": "2.2 g",
            "saturatedFatContent": "3.2 g",
            "servingSize": null,
            "sodiumContent": "88.5 mg",
            "sugarContent": "6.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-03-02T16:19:17.013Z",
                "reviewBody": "The skin of the hazelnut is quite bitter. To remove it easily, in a large saucepan, bring 3 cups of water to a boil. Add 4 tablespoons of baking soda and 1 cup of hazelnuts and boil nuts for about 3 minutes. Test a nut under cool running water. If the skin doesn't slip off easily, boil nuts another minute or two. After peeling, nuts should be crisped and lightly browned in a 350 degree oven for about 20 minutes.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "damselfish",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1795107/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-01-21T12:44:51.967Z",
                "reviewBody": "This is the BEST recipe.  Everyone I made this for has raved about it.  We dunk the pieces in hot cocoa.  They are better drizzled with WHITE chocolate (it complements the cinnamon), and I coarsley chop the hazelnuts before mixing them in.  Otherwise, I follow the recipe exactly.  I didn't have any trouble with the dough nor did it spread when baking.  It is important to cream the butter and sugar until the mixture is very fluffy.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MISSKDICE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/589929/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-11T04:16:54.027Z",
                "reviewBody": "I've tried many different biscotti recipes, but this one is my favorite. I like to experiment with different fillings.. once I added 3/4c chopped dried cranberries and 1/3c almonds and substituted vanilla extract for almond extract and drizzled with white chocolate cinnamon mix and it was DELICIOUS. Another favorite altercation is to add one chopped and frozen large candy bar (I use a local organic hazelnut milk chocolate bar... symphony bars work as well) and add crushed bits to mix before baking. They seem to melt instantly when dipped into hot coffee.\nAnother idea is 3/4c shredded coconut and 1/4c white chocolate bits. After they have cooled dip them into white chocolate and sprinkle with coconut ! Soooo very good and sooo easy to make.\nMy boyfriend hates crunchy biscotti, but absolutely loves this recipe.. And my mother loves hard crunchy biscotti and just raves about how good of a recipe this is. I brought a double batch of candy bar biscotti to work and they didn't even last 2 days before they were completely devoured by co-workers !!\nFor christmas, I am adding nutmeg, cinnamon, peppermint extract and crunched ghiradelli peppermint chocolates to the mix. Topping with white chocolate and peppermint sprinkles :)\nThis recipe is THE best and originality makes it even better !",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Arci",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2467565/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2014-11-05T14:10:02.89Z",
                "reviewBody": "LOVED-LOVED-LOVED'EM!! I did the 1/2 cup butter - extra cinnamon - shared the vanilla with almond extract and used almonds. I also baked them in my convection oven at 330 degrees for the same amount of time - took them out and cut them right away - not one broke - put them back in and baked them again for 10 mins. on each side - on the second side I shut the oven off after 10 minutes and just let them set there for about 15 or so minutes. They were very crisp like biscotti should be - very easy to handle during the dough stage and the taste was devine!! Used dark and white chocolate on some - and left some plain. First time I ever made biscotti - used to eat them frequently at a gourmet coffee/candy store that I managed ---these were better!! Thanks!! 11-5-14 Just finished making two batches of biscotti doing the usual almond with one batch while doing coconut/walnut with the other - I use coconut extract also. With white chocolate on top - their kinda hard to beat...unless your not a coconut fan. I have to admit - my husband and I like a biscotti at night for dessert - we may have it with a cup of chai or....nothing;)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Big \"M\"",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2231359/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-06-28T14:26:09.15Z",
                "reviewBody": "I love this recipe exactly as it appears here but I have to admit that I have used it as a base to make the biscotti into other flavors. I add walnuts and either butterscotch bits or cinnamon bits and they get raves. I've read where some have problems with the biscotti crumbling when they cut them and I'll tell you how I over come that. I use a bench scrape to cut them when they are still hot not a knife. My scrape is teflon covered but I don't think that's why it works so well. Another hint is that I line the cookie sheet with the new foil that is non-stick. Finally a product that does what it promises. You can not go wrong with this recipie and I am greatful to have found it. It has made me a baking hero and I thank you very much!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Sue",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1509852/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-11-14T20:55:41.713Z",
                "reviewBody": "UPDATE: My giftee LOVED these!!! I can't BELIEVE how good these biscotti are! I made a batch to give as a Christmas gift... and ate a few myself - lol. I don't care for nuts at all (except almonds) so I added a little less than called for (1 c. seemed like too much so I used 3/4 c. instead) and that seemed to be the perfect amount (you could still taste the nuts but they didn't overpower every bite). I doubled the amount of cinnamon to 2 tsp. and subbed 1/2 tsp. of almond extract b/c I didn't have enough vanilla on hand (used all of the 1 tsp. that I had plus the almond extract) and the biscotti tasted just fine. After the cookies cooled I melted a dark chocolate Ghirardelli bar with a bit of shortening (over a double boiler) and dipped one side of the biscotti in the mixture and then refrigerated on a wax paper-lined cookie sheet to set. I don't drink coffee but I can imagine how wonderful these would taste with a cup of brew (one of my Christmas gifts was a bag of biscotti and a bag of Christmas blend coffee all tied up with a bow and a cute Christmas plate). I'll have to ask the giftee how it was:) I'll definitely make these again next year... but for myself!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Michelle Roth-Kiva",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1032812/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-12-24T01:23:42.467Z",
                "reviewBody": "This is an excellent recipe! My first try at biscotti and it came out very well. I used many of the suggestions from other reviews: toasted the nuts (used pecans) and chopped them finer double cinnamon and used almond extract for half of the vanilla. Also recommend waiting until logs cool completely before slicing. I also highly recommend using Pampered Chef stoneware if at all possible. I won't bake without it!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SKSTRSN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1299648/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-16T16:19:41.187Z",
                "reviewBody": "I've made five of the biscotti recipes from this site and this is the best especially when you spread dark chocolate on the bottoms. I must admit though that I am a true fan of the combination of cinnamon hazelnuts and chocolate. They are so easy to make and go very fast in my home. Thanks for sharing your recipe Kris!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KIMBEE1556",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/739935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-01-30T01:47:09.48Z",
                "reviewBody": "Excellent recipe! Found that the cookies cut much better with a sharp butcher's knife. The nuts kept sticking to my serated knives (and I tried several) which caused the cookie to break. The sharp butcher's knife cut them easily and cleanly making a much nicer looking cookie. Taste is great Too!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Bob Miller",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/681055/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-11-20T00:51:39.753Z",
                "reviewBody": "I tried these in a biscotti pan and I tried them in a sheet pan like the recipe calls for. Either way they were not very good. Too crumbly too sweet too many hazelnuts. Not really what you think of as a \"biscotti\"...more like dried cake. Also the dough flattened out way too much when baking. I will not try this recipe again. I found a nice pistachio/cranberry biscotti recipe from another site which I've already made several times. I will stick with that recipe...they are delicious!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 1
                },
                "author": {
                    "@type": "Person",
                    "name": "scsiguru",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/8130672/"
                }
            }
        ]
    }
]