[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/77/drinks/",
                    "name": "Drink Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1199/drinks/hot-chocolate/",
                    "name": "Hot Chocolate Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/9335/hot-cocoa-mix/",
        "name": "Hot Cocoa Mix",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1801522.jpg",
            "width": 3648,
            "height": 4864
        },
        "datePublished": "1998-12-11T01:08:02.000Z",
        "description": "I make this at the beginning of the cold weather, and have it ready all winter. Vary the flavor of your mix by trying flavored nondairy creamer; I like the cinnamon.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "15 cups, or about 45 servings",
        "recipeIngredient": [
            "10 cups dry milk powder",
            "4 ¾ cups sifted confectioners' sugar",
            "1 ¾ cups unsweetened cocoa powder",
            "1 ¾ cups powdered non-dairy creamer"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "In a large mixing bowl, combine milk powder, confectioner's sugar, cocoa powder, and creamer.  Stir till thoroughly combined.  Store cocoa mixture in an airtight container.  Makes about 15 cups mix, or enough for about 45 servings.\n"
            },
            {
                "@type": "HowToStep",
                "text": "For 1 serving, place 1/3 cup cocoa mixture in a coffee cup or mug, and add 3/4 cup boiling water.  Stir to dissolve.  Top with dollop of whipped cream or a few marshmallows, if desired.\n"
            }
        ],
        "recipeCategory": [
            "Drink Recipes",
            "Hot Chocolate Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Earla Taylor"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.244224422442244,
            "ratingCount": 303,
            "itemReviewed": "Hot Cocoa Mix",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "175.4 calories",
            "carbohydrateContent": "30.9 g",
            "cholesterolContent": "5.3 mg",
            "fatContent": "2 g",
            "fiberContent": "1 g",
            "proteinContent": "10.4 g",
            "saturatedFatContent": "1.6 g",
            "servingSize": null,
            "sodiumContent": "150.1 mg",
            "sugarContent": "28.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-11-20T21:32:17.18Z",
                "reviewBody": "I have to say this recipe as it stands is not good.  It's very watery and not nearly sweet enough as I've noticed most reviewers comment on.  Sorry Earla.\n\nThat being said, I think I managed to perfect it.  I made it in a half batch with the following measures:\n1-1/2 C Hershey's Cocoa Powder\n3 C Powdered Sugar\n5 C Powdered Milk\n1 C Powdered Creamer (I find Borden's is the best)\n\nTo make some fab modifications that will really knock their socks off, try adding 2 tsp ground cinnamon to the mix for Mexican Hot Chocolate.\n\nOr for a more festive variety, reduce the sugar by 1/2 cup, then powder 12 candy canes in the blender and add into the mix for a nice Candy Cane Cocoa!  My husband loves this one so much, I can't seem to get any out for gifts!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "Jo",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2170897/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-21T17:15:52.467Z",
                "reviewBody": "Just a note...this is a super recipe, but you will want to stick with the powdered sugar, only because it helps to make it thick and rich, and unless you use superfine sugar, white sugar will most likely end up at the bottom of the container  because it's heavier than all the other ingredients.\nI added a bit more cocoa powder, and also added a jar of amaretto creamer to a batch, it was amazing!!  For a batch for the kids I added about a cup and a half more powdered sugar, and on another batch I added cinnamon sticks inside the containers I sent.  I have never had so many raves...this is a keeper, and one to definetly experiment with!!  :)\n\n*Extra added Note*  I just made a new batch omitting one cup of the milk for 2 small containers of cinnamon creamer, and using 1 cup of nestles quick along with the cocoa (ok, so christmas is depleting my pantry a bit!) :) But it was so incredibly good that I decided to keep the whole batch for our family and go to the store to make a new one!!  One Last note, added in 2009, while making the cocoa last year, I found that making it all in a big kitchen trash bag made this SO much easier to mix...really, try it, you'll love it!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "*ROBIN*",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/743559/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-11-03T06:35:18.233Z",
                "reviewBody": "I made 2 seperate batches of this mix with 2 different types of cocoa and they both came out very different. Surprisingly, Hershey's cocoa yielded a richer, more chocolatey cocoa (which in turn required more sugar) than the more expensive cocoa. This could be a reason why different people had different results. I rated this 4 stars because of the adjustments I made (increased cocoa to 2 cups, and sugar to 6. Added 1 tsp salt. I also used nonfat dry milk so I increased the cremora by 1/2 cup for a richer taste.) I also followed the suggestion of sifting my ingredients and grinding the dry milk to fine powder. Thta helped reduce the \"mud\" in the bottom of your cup and made for a creamier texture. In my opinion this compares to the mixes you buy from the store but I like the control over what you put in it. I made one batch with hazelnut creamer and that came out really good - tasted like the Landolakes version. Thanks for a versatile recipe! **new note added 12/3** I made a mocha flavored batch by adding 10 TBS instant coffe ground up, extra cup of sugar and cremora each and 1/2 tsp dried vanilla powder and it was a big hit!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "hanna",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2115618/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-09-21T04:52:44.623Z",
                "reviewBody": "O.K, I read other reviews and tweeked this a little, first off I ran the powdered milk through the food processor to make it powdery fine. used two cups of cocoa and increased the powdered sugar to 6 cups. We ended up with a yummy, creamy cocoa without the funny powdered milk taste hat makes you want to add Nestlies Quick, or just use the store seuff in the first place.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joanie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2082669/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-26T18:49:18.483Z",
                "reviewBody": "I’ve made this recipe before following the listed recipe precisely and it is fine, but not the best. This time I substituted Hershey’s Special Dark cocoa powder for regular cocoa powder. The taste was much more rich and chocolatey. It reminded me of what you’d buy at an expensive coffee shop. The dark cocoa powder bumps the recipe up to 5 stars in my book!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MN-Maggie",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1597273/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T17:22:00.53Z",
                "reviewBody": "I altered this recipe slightly and I LOVE it! I use a large plastic punch bowl to mix in...you really need a BIG bowl and this works perfectly. I use 10 cups milk powder 6 cups powdered sugar 2 cups cocoa powder 1 3/4 cups \"Royale\" Cremora 2 envelopes of Stephens sipping cocoa mix and 1 bag of mini-marshmallows. It makes 8 pint jars. Because of the marshmallows you need to \"tap\" the jar to take out air pockets. I make a nice variation using 2 1/2 tsp. of Cinnamon with an extra 1/2 cup powdered sugar. I call it \"Gourmet Christmas Cocoa\". I decorate the top with fabric and raffia add a cute tag and sell these jars at Craft Fairs for 4.50 each. Actual cost works out to about 1.80 per jar but the jar itself is the most expensive. I use Penzeys Vietnamese Cinnamon and Penzeys Dutch Process Cocoa Powder. Thanks for a fabulous base recipe! I may try regular granulated sugar as most powdered sugars have cornstarch in them. Have a look at the confectioners sugar box next time you see one in the store. Thanks again...this is wonderful!:0)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DJKATHYA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/467288/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T20:25:33.95Z",
                "reviewBody": "Thanks so much for the Hot Cocoa recipe and everyone's ideas.  I also added more Hot Cocoa to make it more chocolately.   You really do need a BIG bowl to mix this all up in...I first tried to mix it between 2 large bowls but that didn't work so well because I thought I was done and then realized I still had to add all the Sugar! So what I did was use our large Stockpot and mix everything in there.  That worked Great!   \r\nA quick note on the Milk.  I purchased a box of the powdered milk that said it had TEN One Quart Envelopes in it.  I was thinking I would have plenty of powder.  What it actually means is that each envelope MAKES a Quart and each package actually had one cup of powered milk.  I was very lucky and had the exact amount needed.      ***Also as far as packaging this up,  what I did was buy some mugs from the dollar store, put enough for 2 cups in small bags (like another person already suggested) and then tied a candy cand and a nib of peppermint schnapps to it.  These make Great inexpensive gifts!\r\n\r\n",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "DEEDRAA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/212638/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T20:29:05.89Z",
                "reviewBody": "Very good cocoa recipe but needed more chocolate flavor for us. We added quite a bit more cocoa to the recipe. It was very good with that addition. Thanks!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "SUSSYA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644384/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-02T20:29:33.077Z",
                "reviewBody": "I made 2 batches of this for holiday gifts. I increased the powdered sugar in the second recipe and found the flavor to be much more pleasing. Yum!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ofenjen",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/ofenjen/"
                }
            }
        ]
    }
]