[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/156/bread/",
                    "name": "Bread",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/360/bread/quick-bread/",
                    "name": "Quick Bread Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/1998/bread/quick-bread/biscuits/",
                    "name": "Biscuits",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/7040/jps-big-daddy-biscuits/",
        "name": "J.P.'s Big Daddy Biscuits",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F4512167.jpg",
            "width": 2000,
            "height": 2000
        },
        "datePublished": "1998-12-11T20:23:08.000Z",
        "description": "This recipe will produce the biggest biscuits in the history of the world! Serve these gems with butter, preserves, honey, gravy or they can also be used as dinner rolls...you get the picture. The dough can also be prepared several hours, and up to a day ahead of time. If so, turn dough out onto aluminum foil that has been either floured, lightly buttered or lightly sprayed with cooking spray. Roll up foil until it is sealed, and refrigerate.  Don't be surprised if your biscuits rise even higher because the baking powder has had more time to act in the dough. You may have to make a few batches before you get desired results: desired results equals huge mongo biscuits.",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "6 grand sized biscuits",
        "recipeIngredient": [
            "2 cups all-purpose flour",
            "1 tablespoon baking powder",
            "1 teaspoon salt",
            "1 tablespoon white sugar",
            "⅓ cup shortening",
            "1 cup milk"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 425 degrees F (220 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a large bowl, whisk together the flour, baking powder, salt, and sugar. Cut in the shortening until the mixture resembles coarse meal. Gradually stir in milk until dough pulls away from the side of the bowl.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Turn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 13 to 15 minutes in the preheated oven, or until edges begin to brown.\n"
            }
        ],
        "recipeCategory": [
            "Bread",
            "Quick Bread Recipes",
            "Biscuits"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "John Pickett"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.6394027189659015,
            "ratingCount": 4487,
            "itemReviewed": "J.P.'s Big Daddy Biscuits",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "282 calories",
            "carbohydrateContent": "36.4 g",
            "cholesterolContent": "3.3 mg",
            "fatContent": "12.6 g",
            "fiberContent": "1.1 g",
            "proteinContent": "5.6 g",
            "saturatedFatContent": "3.4 g",
            "servingSize": null,
            "sodiumContent": "648.9 mg",
            "sugarContent": "4.1 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2003-12-24T05:35:55.61Z",
                "reviewBody": "ok, I come from a family of very picky biscuit lovers. I looked all summer for a soft big biscuit and have FOUND IT ! I don't see why people have had problems with these. They are great and i make them all the time. I do substitute butter or margarine for the shortning, better flavor. For those who didn't get the desired results -- Try these tips: 1.Don't overmix the dough once you add the milk and only pat together (no real \"kneading\" or they will be tough). 2.only add the amount of milk you need, some days i have to use it all and then others i have a little left in the cup. 3. make sure the shortning or butter is cold 4.can brush with melted butter before and/or after baking for added softness and flavor and 5. can place closer together if yours still aren't soft \r\nHope these help and thank you so much JP !!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "COOKIECLAIRE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/731242/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-05-11T20:15:22.42Z",
                "reviewBody": "Very good!  I make them with half whole wheat flour and half all purpose, and I use butter instead of shortening (I like to avoid trans fats).  This is the biscuit recipe I added to my permanent file.\r\n**If you're new to biscuits, remember - any time you make biscuits (or scones or anything else that uses baking powder or soda to rise) you want to gently mix the dough JUST until the ingredients are all mixed-- don't maul it or knead it.  The more you handle your dough the more the gluten develops and the tougher your biscuits (or pie crust, etc.) will be. :)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GBOLLER",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/780846/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-13T04:18:32.233Z",
                "reviewBody": "Excellent recipe !\r\nBeing a single guy -no shortening or milk in the fridge, I used butter and a cup of beer.\r\nGo ahead and laugh, but they came out great.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Don Read",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/569935/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-08T07:11:59.327Z",
                "reviewBody": "These biscuits had a great texture, rose beautifully and were so easy to make.  The only drawback was that they were bland and definitely had a slight baking powder taste. I made them a second time and substituted cultured buttermilk powder (4 TBS Saco brand) + 1 c. water in place of the milk; dropped the baking powder back to 2 tsp; and added 1/2 tsp baking soda.  Oh my goodness....perfection....so flavorful and soft and fluffy!  Absolutely the best I've ever made or eaten -- and I'm a southern girl who knows what a really great biscuit should be! :)  JP, your recipe is a winner -- thank you so much!  With the minor changes I mentioned, this will forever be my one and only biscuit recipe!  If anyone else wants to try the changes, you can use liquid buttermilk instead of the powder if you'd like, but the powder always seems to give me better results.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "DISCOBUNNY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/153632/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2013-02-25T20:23:35.503Z",
                "reviewBody": "Mandy14 - The instructions say to knead 14-14 TIMES, NOT 14-15 minutes! The object is to handle the dough as little as possible.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SELEA",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/827786/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-01-04T19:52:34.89Z",
                "reviewBody": "These are exceptionally good. Very similar to my mom's \"baking powder biscuits\", but these are moister then hers. I made the \"creamed chicken over biscuits\" recipe from this site to go with these. My 16 month old son loved it, he said mmmmm and clapped his hands. I cut out 6, and didn't get \"Grand Biscuit\" size as stated. I also only needed to use 3/4 c. milk instead of 1 c.. My mom says that the barometer affects how your biscuits turn out, (works the same with anything with yeast, such as bread) so, if it's raining or very humid, they won't rise as well. If it's hot and dry, they should rise beautifully. So I kind of go by that when I am adding the liquid and flour (amounts). After you've made enough biscuits, you can tell how their going to turn out by how the (uncooked) dough looks and feels. I was thinking about the post that said they turned out dry on the outside and moist inside, if they seem very hard, then I would think possibly, they were cooked at too high a temp. and/or were left in too long. Because my oven is very hot, I always turn it down by 25 degrees, and never assume that the time stated is going to be \"perfect\" for my oven, so I checked these after 10 minutes, and then watched them 2 to 3 minutes after. Anyway, you should enjioy these.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "BC Survivor",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/629596/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-08-17T21:06:46.637Z",
                "reviewBody": "This is a good basic biscuit recipe minus the sugar - adding sugar makes a biscuit a scone.  I've been making biscuits every AM for 30+ years and I've found that it's really the techniques that make a good biscuit.  Here's are my tried and true tips - 1)COLD, COLD, COLD ingredients and HOT, HOT, HOT oven (450 or 500) 2) After adding the milk, stir just until it mostly comes together.  DO NOT KNEAD!  Just turn the dough out and pat it into the thickness you desire.  Overworking makes a very tough biscuit 3) Use a sharp biscuit cutter and don't twist it as you cut.  This seals the edges and doesn't allow the biscuits to rise as much. Try to avoid using an improvised cutter as the edges may not be sharp enough. 4) I bake mine in a cast iron skillet with lots of melted butter.  I throw a couple of TBL of butter in the skillet and place in the oven while it's pre-heating just until melted (not browned).  I then place the biscuit top side done in the butter and flip it so the whole thing is covered. 5) Place biscuits so they're touching for high risers that are not browned on the sides, or slightly apart for less of a rise but browned sides.  12 min at 450 will yield a very tender, moist biscuit with the perfect little crunch on top and bottom.  Yummmm.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ralloyd",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/155209/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-09-10T23:46:06.043Z",
                "reviewBody": "Simple and tasty!\r\nOne tip though...don't knead the dough! Kneading this mixing with produce a tough textured biscuit. \r\nMix it just till it holds together...pat into a 1 1/2 inch thick circle...then cut out.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Nicola",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/236232/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-24T05:41:17.7Z",
                "reviewBody": "Thanks to J.P., I can finally make biscuits after 10 years of trying different recipes and mixes.  I would suggest for those people who want more flavor to use buttermilk instead of reg. milk.  I also used additional baking powder (about 1&1/2 tablespoons).  I also suggest baking them on the top rack of the oven if you are like me and your biscuits always brown on the bottoms and not the tops.  They really do rise more if you prepare the dough several hours ahead and refrigerate until time to make them.  I mixed up the dough the night before I planned to have them for breakfast.  They turned out almost identical to the biscuits at the ever popular fried chicken restaurant.  Fantastic, only I have to watch out or I will gain a ton of weight.  I could eat them for three meals a day plus snacks!  :o)",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "JYM1974",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/595052/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-04-15T01:23:00.500Z",
                "reviewBody": "These biscuits tasted OK, but they were very dense and doughy.  (Is that a word?)  The search for a great biscuit recipe continues.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "LSUCAT",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/666636/"
                }
            }
        ],
        "video": {
            "@context": "http://schema.org",
            "@type": "VideoObject",
            "name": "JP's Big Daddy Biscuits",
            "description": "See the trick to making huge fluffy biscuits.",
            "uploadDate": "2012-08-17T23:39:16.857Z",
            "duration": "PT3M2.724S",
            "thumbnailUrl": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F411f5bad-f12e-4ab6-a522-63e5853c7582%2Fb482b7b8-e432-4d47-a87a-0a64387fa487%2F160x90%2Fmatch%2Fimage.jpg",
            "publisher": {
                "@type": "Organization",
                "name": "Allrecipes",
                "url": "https://www.allrecipes.com",
                "logo": {
                    "@type": "ImageObject",
                    "url": "https://www.allrecipes.com/img/logo.png",
                    "width": 209,
                    "height": 60
                },
                "sameAs": [
                    "https://www.facebook.com/allrecipes",
                    "https://twitter.com/Allrecipes",
                    "https://www.pinterest.com/allrecipes/",
                    "https://www.instagram.com/allrecipes/"
                ]
            },
            "embedUrl": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1791504995001"
        }
    }
]