[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/14712/desserts/cookies/gingerbread-cookies/",
                    "name": "Gingerbread Cookie Recipes",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11165/gingerbread-boys/",
        "name": "Gingerbread Boys",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1088731.jpg",
            "width": 3264,
            "height": 2448
        },
        "datePublished": "1998-12-12T17:19:52.000Z",
        "description": "These are the best gingerbread men I've ever eaten.  They have a nice light flavor with a hint of orange.",
        "prepTime": "P0DT0H15M",
        "cookTime": "P0DT0H10M",
        "totalTime": "P0DT2H25M",
        "recipeYield": "5 dozen",
        "recipeIngredient": [
            "1 cup butter, softened",
            "1 ½ cups white sugar",
            "1 egg",
            "1 ½ tablespoons orange zest",
            "2 tablespoons dark corn syrup",
            "3 cups all-purpose flour",
            "2 teaspoons baking soda",
            "2 teaspoons ground cinnamon",
            "1 teaspoon ground ginger",
            "½ teaspoon ground cloves",
            "½ teaspoon salt"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Cream the butter and the sugar together. Add the egg and mix well. Mix in the orange peel and dark corn syrup. Add the flour, baking soda, cinnamon, ginger, ground cloves and salt, mixing until well combined. Chill dough for at least 2 hours, I like to chill overnight.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. On a lightly floured surface, roll dough out to 1/4 inch thick. Cut into desired shapes using cookie cutters. Place cookies 1 inch apart on the prepared cookie sheets.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake for 10 to 12 minutes in the preheated oven, until cookies are firm and lightly toasted on the edges.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies",
            "Gingerbread Cookie Recipes"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "JBS BOX"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.476415094339623,
            "ratingCount": 424,
            "itemReviewed": "Gingerbread Boys",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "72.8 calories",
            "carbohydrateContent": "10.4 g",
            "cholesterolContent": "11.2 mg",
            "fatContent": "3.2 g",
            "fiberContent": "0.2 g",
            "proteinContent": "0.8 g",
            "saturatedFatContent": "2 g",
            "servingSize": null,
            "sodiumContent": "85.5 mg",
            "sugarContent": "5.2 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2006-01-03T01:12:22.827Z",
                "reviewBody": "This is THE gingerbread recipe.  I substituted molasses like others said and it turned out great.  I worked with about a quarter of the dough at a time and rolled it out between two sheets of wax paper; some of the dough I rolled out three times and it was still just as good as the first.  This cookie was very forgiving and I will be making it every Christmas.  I have been looking for a good gingerbread recipe and I have found it!  One note: my mom didn't like the orange flavor (though the rest of us did).  If you want a very traditional recipe substitute molasses for the corn syrup and omit the orange zest.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Cathy R.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1482234/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-25T04:46:41.593Z",
                "reviewBody": "Pretty, and much lighter in color than my usual gingerbread recipe.  Very tasty, the orange flavor is surprisingly strong but pleasant.  Cookies were fairly easy to roll out, even without chilling.  (I always roll dough between two sheets of wax paper.  I hate scraping.)\nNOTE:  For the folks who are having problems with cookies spreading too much, you may be using eggs that are too large.  I bake constantly and I only use large--never extra large.  And with cut-out cookies, sometimes I discard just a little bit of the eggwhite, so that the dough is a little bit drier and easier to roll out.  Hope this helps, because this really is a terrific gingerbread recipe.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SUGARPLUMSCOOKIES",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1463149/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T00:35:35.507Z",
                "reviewBody": "Melt in your mouth good! I made some substitutions: molasses for dark corn syrup and lemon zest for orange, and I added a little more ginger.  I read previous reveiws re: the difficulty stirring in the flour so I cut the dry ingredients in with a pastry blender, kneaded it into a ball and it was a breeze.  The kids helped decorate and we shared with neighbours. These cookies will become a Christmas tradition.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MBERGEN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/664817/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-03T16:11:37.2Z",
                "reviewBody": "Really like the orange zest subtle and special! I found that if the dough was rolled to 1/4\" I got the aforementioned puffy and delightfully chewy gingerbread boys. We love cookies moist so hooray for that! Then I experimented and rolled the dough thinner to about 1/8\". These cutouts stayed more true to size and produced a crispy cookie suitable for hanging (remember to poke out a hole w/ a straw before baking). Other notes: paddle attachment on the Kitchen Aid had no problem mixing everything together. After only 6 hours chilling in a bowl covered tight with plastic wrap the dough was rather stiff coming out of the fridge but that was solved by breaking off chunks then kneading till pliable. My first time rolling dough between wax paper... how smart is that (thanks SUGARPLUMSCOOKIES)! The fourth reroll is good as the first! Our family doesn't care for icing but melted white chocolate pipes well for decorating! MMMmmmm... Enjoy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Joyful Heart",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/157097/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-05-08T07:18:55.23Z",
                "reviewBody": "These were great. I cut the sugar down to 1 cup of brown sugar. The cookies were plenty sweet so I will probably cut more out next time. I also subbed in molasses for corn syrup. Those of you with spreading cookie problems - make sure the dough is cold before you pop them in the oven. That means once you take the dough out of the fridge - work fast and get them in the oven pronto.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "rkdance",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1694031/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-09T22:35:56.437Z",
                "reviewBody": "I am not that fond of gingerbread cookies but my son insisted that we make some. I searched for a good recipe and thought this one sounded good so we tried it. It was wonderful!! I could have just eaten the dough. But...I did bake them up and every night my two kids decorate one to eat. However I prefer my cookies a little chewy so I baked them for only 8 minutes (for a 3\"x4\" man). Give it a try. You'll love the orange zest in them!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "SMOOCHEY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/750078/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-12-07T00:35:01.023Z",
                "reviewBody": "I thought I'd try something different this year since not everyone is crazy about gingerbread men and I feel compelled to make them each Christmas. This recipe was fantastic! The dough worked up as easy or easier than regular gingerbread they baked light and crispy/chewy had a beautiful color and a wonderfully light orange taste. Everyone who tried them loved them. I highly recommend them to anyone who marginally likes gingerbread men!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "TAMMY C.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/247158/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-25T13:08:26.767Z",
                "reviewBody": "While the taste of these cookies are execellent (really they taste great) I had to give the recipe 3 stars. I'm not sure how people can be complaining about this recipe needing less flour as it is completely unusable for cut-outs as is. I ended up adding atleast 1 c. extra flour to keep the cookies from spreading due to the break down of the fat in the recipe (like other reviewers have mentioned). I made enough dough to make a hundred gingerbread men only to find that they spread in the oven into a terrible greasy mess. I then had to add flour to each batch individually to make them usuable. After doing so the cookies baked beatifully and tasted great. I really hope that this recipe will be updated so that it's great taste wont be overshadowed by it's poor flour ratio. For those looking to still use this recipe for cut-out cookies continue to add flour(1 cup ) to the dough until it pulls away from the sides of the bowl and it can be handled without sticking to your hands.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "Elyse Alexander",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1288260/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-16T03:35:41.983Z",
                "reviewBody": "EXCELLENT gingerbread cookies! My whole family from 5 yr old to my teenager to my husband LOVED them! I did find chilling them for 2 hrs was NOT enough as the dough was too soft and they fell apart during transfer to cookie sheet. I also discovered through trial and error that 1/4 inch thick was the best thickness for keeping their shape before baking and still looking like gingerbread boys after baking. I think rolling them in wax paper is great but it took me a few times to get the hand of knowing the thickness of the dough while it was between the wax paper. I'm used to the old flour/rolling pin method and it was a little hard to judge thickness at first but I do like the wax paper much better. I found rolling it out THEN refridgerating made the cookie cutter process go much smoother. All in all I will HANG ON to this recipe to make again...and again...and again!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "vmoreno4",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1680328/"
                }
            }
        ]
    }
]