[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/362/desserts/cookies/",
                    "name": "Cookies",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/11171/snowballs-ii/",
        "name": "Snowballs II",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1077113.jpg",
            "width": 1500,
            "height": 1000
        },
        "datePublished": "1998-12-13T16:34:10.000Z",
        "description": "These are technically Mexican Wedding Cakes or Russian Teacakes, but my grandmother gave up on us calling them that years ago!",
        "prepTime": "P0DT0H30M",
        "cookTime": "P0DT0H15M",
        "totalTime": "P0DT0H45M",
        "recipeYield": "5 dozen",
        "recipeIngredient": [
            "1 cup butter",
            "½ cup confectioners' sugar",
            "¼ teaspoon salt",
            "1 teaspoon vanilla extract",
            "2 ¼ cups all-purpose flour",
            "1 cup chopped pecans",
            "⅓ cup confectioners' sugar for dusting, or as needed",
            "¼ cup finely crushed peppermint candy canes"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Preheat oven to 350 degrees F (175 degrees C).\n"
            },
            {
                "@type": "HowToStep",
                "text": "Cream the butter with 1/2 cup of the confectioners' sugar and the vanilla. Mix in the flour, pecans, and salt. Roll about 1 tablespoon or so of dough into balls and place on an ungreased cookie sheet.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Bake in preheated oven until bottoms are golden, about 15 minutes. Do not allow these cookies to get too brown: it's better to undercook them than to overcook them. While cookies are still hot, roll them in confectioners' sugar. Once they have cooled, roll them in confectioners' sugar once more.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cookies"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Lori Dehn"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.768551236749117,
            "ratingCount": 566,
            "itemReviewed": "Snowballs II",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "134.7 calories",
            "carbohydrateContent": "13 g",
            "cholesterolContent": "16.3 mg",
            "fatContent": "8.8 g",
            "fiberContent": "0.6 g",
            "proteinContent": "1.4 g",
            "saturatedFatContent": "4.1 g",
            "servingSize": null,
            "sodiumContent": "64 mg",
            "sugarContent": "4.7 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2004-11-27T18:32:42.733Z",
                "reviewBody": "I've been making these for years but had lost my recipe. This is identical to what I'm used to making....absolutely delicious! A few hints for bakers trying this the first time....use real butter, not margarine. Not only will the cookies  bake better but part of the wonderful flavor they have is how buttery they taste. The butter flavor does intensify a bit after a couple of days. Also, the easiest way I've found to coat each cookie with the powdered sugar is by using a covered plastic container. Pour powdered sugar in the container and add a few cookies at a time. Shake them gently to coat. They don't look too coated after the first time, but the second coating will give you the beautiful snowball look that these cookies are famous for.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Kristina",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/644810/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2008-05-05T04:59:44.637Z",
                "reviewBody": "This recipe is snowball perfection! Reviewers who don't follow this to the tee are missing out. I sell these in my shop and they fly out the door. Suggestions - Use cookie scoop #60 and bake until just golden, approx 11 - 12 minutes and immediately toss in generous amount of confectioners sugar.  Lift out by the bottom with fork, tap, and then place into 8AA cupcake liners.  Wonderful!!!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Mimi's Desserts",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2879373/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-12-22T00:24:58.517Z",
                "reviewBody": "I have made this cookie many ways.  I always come back to this variation as I think it is the nicest looking. I keep my cookies well chilled prior to baking. I also bake these at 325 degrees for 20 mins.  Now when making the balls for the cookies I incorporate the whole  familys help.  With Christmas such a busy time you can relax with these as they are simple ( balls a little time consuming) taste great and go over well.  Thanx for a nice recipe!  I almost always add 2 tablespoons of vanilla and a half of almond or rum flavoring.Sounds like alot of flavoring but taste yummy!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "MsCathieJeanne",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1302278/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2012-11-07T16:20:33.09Z",
                "reviewBody": "This recipe definitely needs more vanilla; I soak the nuts on vanilla a bit before adding them. I saw some comments about the cookies being hard or dry this might be because the butter is not at room temperature or not well creamed the butter needs to look like mayonnaise before adding the rest of the ingredients; if the butter is runny or semi melted the cookies turn out hard on the other hand if the butter is cold or firm the cookies crumble and turn out dry.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "Mrs.Humphreed",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/mreed/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2010-12-22T01:00:52.44Z",
                "reviewBody": "Note that these don't spread or rise so you can bake a bunch on the cooky sheet which makes the preparation time for these balls much less than the average cooky. This is such a classic it's hard to think anybody couldn't find them in a comprehensive cookbook. I've got some old books from the '50's and they have it too. The nuts I've found are best if ground almost to a powder; small chunks can make them crumble even as you roll them. You need not restrict yourself to almonds either; almonds are wonderful especially if you add about a tsp. of almond extract with or instead of the vanilla. Here's a tip: chill the dough before forming balls. It makes it a bunch easier. Also if the dough wants to stick to your hands keep them dampened with clean water when rolling the balls. Oh and don't forget the second dusting with confectioner's (10x) sugar.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Holly B.",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/3398395/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-09-03T01:40:14.513Z",
                "reviewBody": "My recipe for these cookies is very similar but after 40 years of using mine I am switching to this recipe. These were by far the best I have ever eaten. The buttery taste of real butter is so much better than the margarine I have been using. Thank you so much for this recipe. It's a keeper.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "AUNTIE JUNE",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/378283/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-12-19T07:10:40.043Z",
                "reviewBody": "PERFECT!! I wouldn't change a thing. This cookie just melts in your mouth and it is SO easy to make. A little messy with the confectioner's sugar candy cane powder but once you establish a system it's not as awkward. I felt it was easiest/cleanest to do it with tongs. I even made a batch with white whole wheat flour and it tasted wonderful; just added to the nutty buttery taste but made it just a tad healthier! =P I found smaller balls baked more like balls. If the ball was too large it would start to flatten slightly into a mound.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "w",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1744544/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-02-14T04:18:30.42Z",
                "reviewBody": "my mum made these wonderful cookies every Christmas when I was a child. We loved them!!!! I had lost the recipe and was THRILLED to find it here. It is perfect as is. I made them yesterday. I expected my 4 children might like them but I thought they would prefer other cookies because these are not that sweet. When I asked them tonight which cookie they like the best they all agreed. This is the BEST Christmas cookie mum has ever made (and I usually bake at least 20 different kinds!!!) Thank you thank you Thank you.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "Gillian DaPrincess DeConto",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/742536/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2005-12-19T09:23:04.017Z",
                "reviewBody": "This is a very festive cookie for Christmas. It's a great cookie for people who love nutty cookies or shortbreads. It's almost exactly the same as a Russian tea cake recipe from Betty Crocker's web site. The only variation is 3/4 cup finely chopped nuts instead of 1 cup chopped pecans. Also the baking instruction was 400 degrees for 10 to 12 minutes. Next time I will try 350 degrees for 15 minutes to see if the cookies turn out even better. Also I made another batch of dough using 3/4 cup toasted coconut instead of chopped nuts to put in the freezer for later use. I think that will yield delicious cookies for coconut fans.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "mmmdessert",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/306217/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2011-12-28T11:42:48.01Z",
                "reviewBody": "Easy to make hence 2 stars. Tasteless powdery & dry even tho I undercooked them. Sorry:(",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 2
                },
                "author": {
                    "@type": "Person",
                    "name": "lisa",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1730569/"
                }
            }
        ]
    }
]