[
    {
        "@context": "http://schema.org",
        "@type": "BreadcrumbList",
        "itemListElement": [
            {
                "@type": "ListItem",
                "position": 1,
                "item": {
                    "@id": "https://www.allrecipes.com/",
                    "name": "Home",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 2,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/",
                    "name": "Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 3,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/79/desserts/",
                    "name": "Desserts",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 4,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/276/desserts/cakes/",
                    "name": "Cakes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 5,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/386/desserts/cakes/cake-mix-cakes/",
                    "name": "Cake Mix Cake Recipes",
                    "image": null
                }
            },
            {
                "@type": "ListItem",
                "position": 6,
                "item": {
                    "@id": "https://www.allrecipes.com/recipes/15494/desserts/cakes/cake-mix-cakes/layer-cake/",
                    "name": "Layer Cake",
                    "image": null
                }
            }
        ]
    },
    {
        "@context": "http://schema.org",
        "@type": "Recipe",
        "mainEntityOfPage": "https://www.allrecipes.com/recipe/8091/ho-ho-cake/",
        "name": "Ho Ho Cake",
        "image": {
            "@type": "ImageObject",
            "url": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F353773.jpg",
            "width": 250,
            "height": 250
        },
        "datePublished": "1998-12-15T01:46:56.000Z",
        "description": "Inspired by the Hostess&reg; favorite, the Ho Ho Cake features layers of cake and cream filling topped with chocolate.",
        "prepTime": null,
        "cookTime": null,
        "totalTime": null,
        "recipeYield": "1 - 9 x 13 inch cake",
        "recipeIngredient": [
            "1 (9 ounce) package chocolate cake mix",
            "5 tablespoons all-purpose flour",
            "1 ¼ cups milk",
            "1 cup white sugar",
            "½ cup margarine",
            "1 cup shortening",
            "½ cup margarine",
            "1 teaspoon vanilla extract",
            "1 egg",
            "1 ½ teaspoons hot water",
            "3 (1 ounce) squares unsweetened chocolate, melted",
            "1 ¾ cups confectioners' sugar"
        ],
        "recipeInstructions": [
            {
                "@type": "HowToStep",
                "text": "Prepare and bake cake as directed on the package for a 9 x 13 inch pan.  Cool completely.\n"
            },
            {
                "@type": "HowToStep",
                "text": "Combine flour and milk in saucepan.  Cook, stirring constantly, until thick.  Cool completely.  Cream 1 cup sugar, 1/2 cup margarine, and shortening.  Add cooled milk mixture, and beat well.  Spread over cake. Refrigerate.\n"
            },
            {
                "@type": "HowToStep",
                "text": "In a small bowl, beat egg.  Stir in vanilla, melted chocolate, hot water, confectioner's sugar, and 1/2 cup margarine.  Pour over second layer.  Refrigerate.\n"
            }
        ],
        "recipeCategory": [
            "Desserts",
            "Cakes",
            "Cake Mix Cake Recipes",
            "Layer Cake"
        ],
        "recipeCuisine": [],
        "author": [
            {
                "@type": "Person",
                "name": "Olene Grieshop"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.194444444444445,
            "ratingCount": 108,
            "itemReviewed": "Ho Ho Cake",
            "bestRating": "5",
            "worstRating": "1"
        },
        "nutrition": {
            "@type": "NutritionInformation",
            "calories": "382.5 calories",
            "carbohydrateContent": "37 g",
            "cholesterolContent": "11.7 mg",
            "fatContent": "26.6 g",
            "fiberContent": "1.2 g",
            "proteinContent": "2.7 g",
            "saturatedFatContent": "6.9 g",
            "servingSize": null,
            "sodiumContent": "244.5 mg",
            "sugarContent": "28.9 g",
            "transFatContent": null,
            "unsaturatedFatContent": null
        },
        "review": [
            {
                "@type": "Review",
                "datePublished": "2008-07-18T23:20:44.157Z",
                "reviewBody": "Judging by the other 37 reviews it seems I'm the first to notice that there's an obvious misprint in the recipe which calls for a 9-oz. cake mix and luckily the other reviewers just happened to use what the recipe SHOULD call for which is a standard 18.5 oz. cake mix. I think this recipe would be disastrous if a 9 oz. cake mix was actually used. Having said that I was very pleased with this cake as were about 10 other people who completely polished it off. Where margarine was called for I substituted butter. I added a teaspoon of vanilla to the filling to give it a flavor boost however even with the vanilla the filling was still more fluffy and creamy than flavorful but it was perfect when considered as a whole with the finished cake. I made the cake in two 9\" layers with the filling thickly in between and it was definitely unique looking but baking this in three layers would probably have been easier to work with. Rather than the unsweetened chocolate in the glaze I used a fine quality bittersweet chocolate which I was pleased with. I whipped the ingredients rather than stirring them as I wanted a fluffy frosting rather than a glaze and it was enough to frost the entire cake. I finished it off with brown and white jimmies. A perfectly decadent dessert sensation!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "naples34102",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/naples34102/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-01-11T18:18:54.7Z",
                "reviewBody": "I have made this recipe for years (but with a scratch cake).  I also use the filling for almost every two layer cake I make.  The key to this type of filling is that YOU MUST WHIP IT FOR 10 - 12 MINUTES.  The longer you mix, the creamier it gets.  If your filling is grainy, you just haven't mixed it enough. \nAnother great tip about this cake is that it freezes well.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "IMJEN2",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/57499/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2003-07-27T17:57:32.17Z",
                "reviewBody": "I made this for work and everyone liked it.  For the person who said the filling tastes like Crisco, maybe they've never eaten real Ho-Hos before, because they taste like Crisco too. :-)  If you have difficulty spreading the chocolate over the white filling, you should take a couple of precautions.  First, make sure your milk and flour mixture is quite thick when you cook it.  It should be about the consistency of soft margarine.  Next, make sure you refrigerate the cake & filling layer for at least an hour prior to spreading the frosting.  Finally, gradually add the powdered sugar when making the chocolate frosting so that you don't make it too thick.  When you put the frosting on top of the white filling, drop it by the tablespoon all over the top of the cake.  (There should be enough frosting to almost cover the entire cake using this mechanism.)  This will simplify the spreading process and make spreading the frosting easy.  Overall, a nice chocolate cake recipe that I would definitely make again.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "CJOANC",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/375514/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2006-10-02T22:40:34.95Z",
                "reviewBody": "I have been making this for years now. A few things. First I too use a good quality canned frosting (no it isnt a glaze as one person stated ) warmed until spreadable. As another suggested chill the cake well & then drop spooonfuls of frosting all over the cake gently spread until covered. Follow the directions as stated for the filling dont skip the flour/milk part its strange but it DOES work. Use Crisco not the cheaper stuff in this recipe you get out what you put in. Finally... its a HoHo cake the filling tastes exactly like its namesake so if you dont like HoHos then dont bother. I personally have never had a crumb left over when I take this anywhere.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "KAIBRYN",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/669770/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2007-02-01T16:51:05.027Z",
                "reviewBody": "I made this recipe and EVERYONE loved it. I think that I gave out the recipes to 6 or 7 people that day. Just as previously commented you MUST cream the shortening margarine and sugar at least 10-12 minutes and do not leave out the flour and milk either. Once you spread it on the cake refrigerate it for about an hour then spread the icing. I did not make the icing from the recipe. To save time and dishes I used duncan hines classic chocolate icing. It was perfect. I will make again. Next time I might try to make it a layer cake. But this was wonderful as is.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "EDUGATOR",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/859303/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-12-28T20:55:29.133Z",
                "reviewBody": "I figured out the cream filling! Here's how I made this cake: I used Duncan Hines Devils Food cake mix baking it in a large cookie sheet. Cool and put in freezer for about 10 minutes. Cut in half put half on your cake plate. set other half aside. Filling: melt 1/2 the butter in sauce pan turn off heat add flour and use whisk to stir well turn heat back on low add milk slowly whisking constantly. When the consistancy of thick pudding take off heat and continue stirring. Let cool. Beat the rest of your butter with Crisco & sugar. Add cooled milk mixture. Beat it on med high. Add a touch of vanilla. Slow beaters down to low and whip until you feel it's fluffy enough. It's not going to fluff like a meringue just be light and creamy. Put cream filling on top of cake spreading evenly and level put in freezer for about 10 minutes. Put other half of cake on top....frost as desired.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "ladykbug",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/4361571/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2004-08-11T02:03:23.193Z",
                "reviewBody": "everyone loved it. i thought there were too many steps and time consuming to cool. i liked the suggestion of another member to use canned frosting that has been slightly melted in microwave. i am concerned about the raw egg in the chocolate topping of this recipe. anyone else bothered by that?",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 3
                },
                "author": {
                    "@type": "Person",
                    "name": "CATHERINE59",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/1157562/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2002-08-30T05:39:30.873Z",
                "reviewBody": "This is a fantastic cake! I used Duncan Hines Swiss cake mix and instead of using the recipe for icing I used Duncan Hines Milk Chocolate canned icing. Pop it in the micowave just long enough to melt it to spreading consistency (about 20-30 seconds) and pour and spread it over the filling. Don't get the icing HOT it will melt the filling. I didn't refrigerate it.",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 5
                },
                "author": {
                    "@type": "Person",
                    "name": "GAIL-KY",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/53292/"
                }
            },
            {
                "@type": "Review",
                "datePublished": "2009-06-23T20:22:22.153Z",
                "reviewBody": "I added two tsp of pure vanilla to the cream part and it was excellent. Great compliments!",
                "reviewRating": {
                    "@type": "Rating",
                    "worstRating": "1",
                    "bestRating": "5",
                    "ratingValue": 4
                },
                "author": {
                    "@type": "Person",
                    "name": "KateH",
                    "image": null,
                    "sameAs": "https://www.allrecipes.com/cook/2322349/"
                }
            }
        ]
    }
]